[
  {
    "text": "How Wise Are Crowds? Insights from Retail Orders and Stock Returns January 2012 Eric K. Kelley and Paul C. Tetlock* Abstract We analyze the role of retail investors in stock pricing using a database uniquely suited for this purpose. The data allow us to address selection bias concerns and to separately examine aggressive (market) and passive (limit) orders. Both aggressive and passive net buying positively predict firms’ monthly stock returns with no evidence of return reversal. Only aggressive orders correctly predict firm news, including earnings surprises, suggesting they convey novel cash flow information. Only passive net buying follows negative returns, consistent with traders providing liquidity and benefitting from the reversal of transitory price movements. These actions contribute to market efficiency. * University of Arizona and Columbia University. The authors thank the following people for their helpful comments: Brad Barber, Robert Battalio, Ekkehart Boehmer, Kent Daniel, Stefano DellaVigna, Simon Gervais, Campbell Harvey, Paul Irvine, Charles Jones, Tim Loughran, Terry Odean, Emiliano Pagnotta, Chris Parsons, Mitchell Petersen, Tano Santos, Nitish Sinha, Sheridan Titman, Scott Weisbenner, and an anonymous associate editor and referee, along with participants at the Miami Finance, NYU Five-Star, and WFA conferences, as well as colleagues at Alberta, AQR Capital, Arizona, Columbia, DePaul, Emory, LBS, LSE, Texas A&M, and USC. The authors also thank Arizona and Columbia, respectively, for research support, Travis Box for research assistance, and Dow Jones for access to their news archive. All results and interpretations are the authors’ and are not endorsed by the news or retail order data providers. Please send correspondence to paul.tetlock@columbia.edu. EEleleccttrroonnicic ccooppyy aavvaailialabblele aatt:: hhttttpps::////ssssrrnn..ccoomm//aabbssttrraacctt==11666688770066",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 85,
    "chunk_index": 0,
    "word_count": 264,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "Arizona and Columbia, respectively, for research support, Travis Box for research assistance, and Dow Jones for access to their news archive. All results and interpretations are the authors’ and are not endorsed by the news or retail order data providers. Please send correspondence to paul.tetlock@columbia.edu. EEleleccttrroonnicic ccooppyy aavvaailialabblele aatt:: hhttttpps::////ssssrrnn..ccoomm//aabbssttrraacctt==11666688770066",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 85,
    "chunk_index": 1,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "What is the role of self-directed retail traders in stock pricing? As managers of their own money, these investors are not subject to the agency problems, career concerns, or liquidity constraints that can hurt institutional managers’ performance (Lakonishok et al. (1991), Chevalier and Ellison (1999), and Coval and Stafford (2007)). Consequently, retail traders have clear incentives to trade on novel information gleaned from geographic proximity to firms, relationships with employees, or insights into customer tastes. In addition, using their personal wealth, they may provide liquidity to institutional investors whose trades can temporarily distort prices as in Grossman and Miller (1988).1 In stark contrast, novice retail traders with little investment knowledge and experience may trade on “noise” in the sense of Black (1986) and exert pressure on prices, pushing them away from fundamental values.2 In this paper, we test these informed trader, liquidity provider, and noise trader theories by analyzing the relationship between retail traders’ collective actions and market prices. Prior studies try to address these topics by asking whether net buying by retail investors predicts firms’ stock returns (Dorn, Huberman, and Sengmueller (DHS, 2008), Hvidkjaer (2008), Kaniel, Saar, and Titman (KST, 2008), Barber, Odean, and Zhu (BOZ, 2009), and Kaniel, Liu, Saar, and Titman (KLST, 2011)). Yet the impact of retail traders on stock pricing remains unsettled because existing studies arrive at conflicting conclusions. Severe data limitations may explain the lack of consensus. Prior studies rely on measures of retail trading that are based on either a single broker, orders selectively routed to a single exchange, or an indirect proxy. This could lead to biased inferences about the population of retail investors.3 This paper introduces a database that is uniquely well-suited for evaluating the competing theories. The data include over $2.6 trillion in executed trades, which is roughly one-third of all self-directed retail trading in the United States, coming from dozens of retail brokerages from 1 EEleleccttrroonnicic ccooppyy aavvaailialabblele aatt:: hhttttpps::////ssssrrnn..ccoomm//aabbssttrraacctt==11666688770066",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 85,
    "chunk_index": 2,
    "word_count": 321,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "investors.3 This paper introduces a database that is uniquely well-suited for evaluating the competing theories. The data include over $2.6 trillion in executed trades, which is roughly one-third of all self-directed retail trading in the United States, coming from dozens of retail brokerages from 1 EEleleccttrroonnicic ccooppyy aavvaailialabblele aatt:: hhttttpps::////ssssrrnn..ccoomm//aabbssttrraacctt==11666688770066",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 85,
    "chunk_index": 3,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "2003 to 2007. In contrast to previous studies, the data not only directly identify retail orders, but they also allow us to address concerns about biases in the sample of the retail population.4 Moreover, the data allow us to separately examine aggressive (market) and passive (limit) orders to trade, as well as the subset of passive orders resulting in trades. Traders’ choices of order types may provide insights into their underlying motives and influence the extent to which their trades move prices. Our analysis focuses on net share imbalance for each order type—measured as the difference between buys and sells divided by the sum of buys and sells—and its relationship with future stock returns. We combine our data on retail orders with comprehensive newswire data from Dow Jones (DJ) to test the informed trader hypothesis. We infer that traders have novel information about firms’ cash flows if retail imbalances correctly predict the linguistic tone of firm-specific news. The tone of news is a proxy for daily changes in firms’ fundamental values that includes information that is revealed between firms’ regular quarterly reporting dates. We also use a proxy for fundamentals based on firms’ quarterly earnings surprises, which are ten times less frequent than news. Our three main findings offer new insights into the role of retail investors in stock pricing. First, daily buy-sell imbalances from both retail market orders and retail limit orders positively predict the cross-section of stock returns at monthly horizons. This result actually becomes slightly stronger in stocks in which our data include a greater fraction of the population of retail traders, implying that biases in the sample of retail traders cannot explain these findings. Even at horizons up to one year, point estimates of return predictability are typically positive and never significantly negative, which is inconsistent with the noise trader hypothesis.5 Furthermore, we find only weak evidence that return predictability is greater in stocks with more 2 EEleleccttrroonnicic ccooppyy aavvaailialabblele aatt:: hhttttpps::////ssssrrnn..ccoomm//aabbssttrraacctt==11666688770066",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 85,
    "chunk_index": 4,
    "word_count": 326,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "these findings. Even at horizons up to one year, point estimates of return predictability are typically positive and never significantly negative, which is inconsistent with the noise trader hypothesis.5 Furthermore, we find only weak evidence that return predictability is greater in stocks with more 2 EEleleccttrroonnicic ccooppyy aavvaailialabblele aatt:: hhttttpps::////ssssrrnn..ccoomm//aabbssttrraacctt==11666688770066",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 85,
    "chunk_index": 5,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "persistent order imbalances, which may be subject to more price pressure, casting further doubt on the noise trader hypothesis. Second, only market order imbalances correctly predict news about firm cash flows, as measured by either the linguistic tone of DJ news stories or earnings surprises. These results hold at daily, weekly, monthly, and yearly horizons. The findings are consistent with retail market orders aggregating novel information about firms’ cash flows. Although the findings do not preclude the possibility that some retail traders using limit orders have information about firms’ cash flows, there is no evidence that the aggregate of limit order traders acts on such information. Third, limit order imbalances follow negative daily and intraday returns (i.e., they are contrarian), but market order imbalances do not. Furthermore, return predictability from limit orders is particularly strong in stocks that tend to experience large return reversals, where the compensation for providing liquidity may be higher according to models such as Grossman and Miller (1988). Return predictability from market orders is actually weaker in these stocks. These facts are consistent with only limit orders responding to liquidity shocks.6 Even though our tests offer no direct evidence linking limit order imbalances to information about firms’ cash flows, some limit order traders may be informed about future demand for the stock. Indeed, we find that submitted limit orders have a positive end-of-day price impact, which is a broad measure of informed trading used in the microstructure literature (see, e.g., Kaniel and Liu (2006) for similar evidence on the price impact of limit orders). One interpretation is that certain limit order traders recognize possibly long-lasting transitory price and order flow shocks as they are corrected in the absence of innovations to cash flows.7 Collectively, these findings contribute to the ongoing debate on whether retail trading conveys information about future stock prices. Our paper joins a budding literature including 3 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 85,
    "chunk_index": 6,
    "word_count": 318,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "long-lasting transitory price and order flow shocks as they are corrected in the absence of innovations to cash flows.7 Collectively, these findings contribute to the ongoing debate on whether retail trading conveys information about future stock prices. Our paper joins a budding literature including 3 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 85,
    "chunk_index": 7,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "KST, KSLT, and Griffin, Shu, and Topaloglu (2010) to paint these traders in a positive light. On the surface, this view is inconsistent with the large literature that has categorized retail investors as unsophisticated, behaviorally biased, and otherwise uniformed. However, such conclusions are largely drawn from retail investors’ poor portfolio performance after transaction costs, which is severely harmed by offsetting buy and sell trades. Offsetting trades effectively incur the bid- ask spread, even though they have little or no impact on stock prices—e.g., their price impacts exactly offset in the Kyle (1985) model. Because our primary focus is the role of retail investors in stock pricing, we focus on net retail buying imbalances and whether they predict future stock returns. It is quite plausible that the subset of offsetting trades could fully explain the portfolio underperformance of retail investors, despite our robust finding of positive return predictability coming from net retail imbalances.8 If so, this would also reconcile our findings with studies that report outperformance by other groups of investors, such as institutions.9 These points notwithstanding, we offer two additional channels for reconciling these recent findings on retail investors with prior work. First, the trading skill of retail clientele may vary across brokers; and prior findings could be based on particularly unskilled segments of the retail trading population. Second, through learning or attrition, the aggregate skill of retail traders may have changed over time. In Section 5, we provide evidence that both of these channels are plausible explanations. Our paper is also one of the first to show that retail traders’ choices of order type provide insights into their underlying motives. We find that retail market orders convey fundamental information and benefit as it is fully incorporated in prices, and retail limit orders primarily benefit from the gradual reversal of price pressure. Both actions contribute to market efficiency 4 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 85,
    "chunk_index": 8,
    "word_count": 314,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "type provide insights into their underlying motives. We find that retail market orders convey fundamental information and benefit as it is fully incorporated in prices, and retail limit orders primarily benefit from the gradual reversal of price pressure. Both actions contribute to market efficiency 4 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 85,
    "chunk_index": 9,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "but for different reasons. These results can inform market microstructure theories of order type, such as Kaniel and Liu (2006). Finally, our results contribute to a growing literature examining the tone of financial news. In our analysis, we combine the negativity measures used in Tetlock (2007), Tetlock, Saar- Tsechansky, and Macskassy (2008), and Loughran and McDonald (2010). The latter two studies show that increases in these negativity measures are associated with decreases in firms’ fundamental values, motivating news negativity as a proxy for changes in fundamentals.10 We conduct similar validation tests for our sample using earnings surprises in Section 3.B. An overview of the paper follows. Section 1 describes our data on retail orders and news stories. Section 2 presents the main cross-sectional regressions in which we use retail imbalances to predict returns. Section 3 tests whether imbalances predict news about firms’ cash flows, including the negativity of news stories and earnings surprises. Section 4 analyzes whether the liquidity provision hypothesis can account for return predictability from retail imbalances. Section 5 provides further tests of the noise trader hypothesis and tests of alternative hypotheses based on selection biases. We also discuss how our findings fit into the existing literature on retail investors. Section 6 concludes. I. Data on Retail Orders and News Stories Our proprietary trading data include all retail orders in nearly all common stocks listed on the NYSE, Nasdaq, and American Stock Exchange (AMEX) routed to two related over-the- counter market centers from February 26, 2003 through December 31, 2007. One market center primarily deals in NYSE and AMEX securities, while the other primarily deals in Nasdaq 5 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 85,
    "chunk_index": 10,
    "word_count": 275,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "stocks listed on the NYSE, Nasdaq, and American Stock Exchange (AMEX) routed to two related over-the- counter market centers from February 26, 2003 through December 31, 2007. One market center primarily deals in NYSE and AMEX securities, while the other primarily deals in Nasdaq 5 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 85,
    "chunk_index": 11,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "securities. Initially, these market centers only provided execution services for retail broker- dealers, but now they also attract some institutional order flow. Broker-dealers’ reports filed under the Securities and Exchange Commission’s Rule 11Ac1-6 (now Rule 606 under Regulation National Market Systems) reveal that most large retail brokers route orders to our market centers, including four of the top five online brokerages in 2005. In the quarter closest to 2005:Q1 where Rule 606 data are available for NYSE (Nasdaq) stocks, these four brokers route an average of 41% (35%) of their orders to our two market centers. Some of these brokers execute many orders internally, whereas other brokers do not internalize any orders. We explicitly address concerns about selective order routing in Section 5.B. Based on the Rule 606 data above, we estimate that our sample includes one-third of all self-directed retail trading in the United States. Rule 606 disclosures indicate that most brokers receive small payments for directing marketable orders—i.e., orders with instructions that enable them to execute immediately at current market prices—to our market centers. Such payments, between over-the-counter market makers and brokers who handle mostly retail order flow, are common.11 Based on these internalization and payment for order flow policies, one might infer that our market centers’ order flow is uninformed. For example, Battalio and Loughran (2008) argue that: “payment for order flow and internalization survive on the ability to avoid trading with those who know where the stock price is headed (i.e., informed traders). Purchasers and internalizers of order flow profit by executing presumably uninformed orders at quotes posted by market makers seeking to protect themselves against trading with better- informed parties.” (page 40) Our tests below empirically evaluate whether retail orders at our market centers are informed. The retail order data include a code that classifies the order submitter as an individual (retail trader) or an institution based on how orders are submitted and routed. During our sample, 6 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 85,
    "chunk_index": 12,
    "word_count": 328,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "tests below empirically evaluate whether retail orders at our market centers are informed. The retail order data include a code that classifies the order submitter as an individual (retail trader) or an institution based on how orders are submitted and routed. During our sample, 6 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 85,
    "chunk_index": 13,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "over 225 million retail orders are executed at our market centers in exchange-listed stocks, resulting in $2.60 trillion in volume.12 This aggregate dollar volume is a relatively small percentage (2.3%) of total listed (NYSE/AMEX/Nasdaq) volume, even though our market centers’ have an estimated one-third share of the retail market. The average trade size is $11,566, which is between the average size of buys ($11,205) and sells ($13,707) in the Barber and Odean (2000) database from a discount broker. Our average trade size is roughly 30% lower than the averages in Barber and Odean (2008) and Kaniel, Saar, and Titman (2008), possibly reflecting the difference between clientele at discount brokers and full-service brokers. Our main retail trading variable is daily order imbalance (Imb[0]), measured using shares bought minus shares sold divided by shares bought plus shares sold. The results are similar for alternative imbalance measures, such as those using numbers of orders and dollars ordered and those scaling by past volume or shares outstanding. Our share-weighted imbalance measure is a natural way to aggregate retail investors’ opinions about a particular stock. We separately analyze imbalances based on aggressive and passive order types. Aggressive orders convey traders’ desires for immediate execution—i.e., they are immediately marketable. These orders include pure market orders, which execute at the best currently available market price, and marketable limit orders, which are priced so that they can execute at the current quote. In contrast, passive orders are not immediately marketable—i.e., nonmarketable—and represent retail investors’ willingness to trade with another investor demanding immediate execution. These orders execute only if the retail investor does not cancel the order before another (aggressive) trader accepts the offer to trade. When computing imbalances, we classify all market orders as marketable. We determine whether a limit order is marketable using best bid and ask quotes at the exact time of order 7 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 85,
    "chunk_index": 14,
    "word_count": 313,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "does not cancel the order before another (aggressive) trader accepts the offer to trade. When computing imbalances, we classify all market orders as marketable. We determine whether a limit order is marketable using best bid and ask quotes at the exact time of order 7 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 85,
    "chunk_index": 15,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "submission, which are provided by our market centers. If the limit buy (sell) price is at least as high (low) as the current best ask (bid), the limit order is marketable.13 All orders that are not marketable are classified as nonmarketable orders, except that the sample excludes nonmarketable buy (sell) orders that are not within 25% of the best bid (ask) to eliminate economically unimportant quotes. Henceforth, we often refer to imbalances based on marketable orders and nonmarketable limit orders as Mkt and NmL imbalances, respectively. We also compute imbalances for the subset of nonmarketable limit orders that either fully or partially execute, which we refer to as XL. Analyzing both nonmarketable and executed limit orders provides a more complete picture of passive retail trading than considering either one in isolation. While the nonmarketable limit orders indicate retail traders’ intents at the time of order submission, they do not describe their trading outcomes because many of these orders never execute. Executed limit orders reflect retail investors’ actual passive trades that occur when other traders demand immediacy. The demand for immediacy could come from traders who have liquidity needs that are unrelated to firm value or from informed traders whose demand is related to the firm’s future prospects. Because non-retail traders can choose to trade with certain retail limit orders and avoid others, the execution of a limit order is an endogenous outcome that depends on the actions of non-retail traders, who may be informed. This endogeneity makes it difficult to interpret some of our tests that use imbalances in executed limit orders. In our sample, the number of retail market orders (178 million) exceeds the numbers of both nonmarketable (115 million) and executed limit orders (47 million). We conduct our main regression tests separately for each retail order type. We retain only stock-days with at least five orders of a particular type when computing imbalances. Consequently, regressions based on market orders have larger sample sizes than those based on either limit order type. 8 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 85,
    "chunk_index": 16,
    "word_count": 339,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "our main regression tests separately for each retail order type. We retain only stock-days with at least five orders of a particular type when computing imbalances. Consequently, regressions based on market orders have larger sample sizes than those based on either limit order type. 8 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 85,
    "chunk_index": 17,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "We measure firm-specific news events using the DJ archive as described in Tetlock (2010). It includes all DJ newswire and all Wall Street Journal (WSJ) stories about US stocks traded on the NYSE, AMEX, or Nasdaq during our 2003 to 2007 sample. Our news data consist of 3.73 million newswires with 735 million words. Stock codes in each newswire indicate whether DJ determines that a story meaningfully mentions any firm with a publicly traded US stock. To ensure that news content is highly relevant to the stock, we use only stories mentioning at most two US stocks and three total stocks. On a typical (median) trading day during our sample, 1,016 of 4,716 listed stocks are mentioned in DJ news. In a typical month during our sample, 95% of listed stocks have DJ news coverage. This high coverage allows us to measure the content of news ten times more frequently than quarterly earnings. Our measure of news for firm i on day t (News= 0 or 1) indicates whether firm i’s DJ stock code appears in any newswires between the close of trading day t – 1 and the close of trading day t. We measure the tone of firm-specific news using the fraction of words in the firm’s stories on trading day t that are negative according to two psycholinguistic dictionaries. As shown in Tetlock (2007) and elsewhere, fluctuations in negative words are associated with stronger market reactions and larger earnings surprises than fluctuations in positive words are. We use three negativity measures for robustness: H4Neg based on the Harvard-IV psychosocial dictionary used in Tetlock (2007), FinNeg based on Loughran and McDonald’s (2011) financial dictionary, and Neg which is an average of H4Neg and FinNeg with weightings of 1/3 and 2/3. The weightings in Neg adjust for the different scales of H4Neg and FinNeg. There are approximately twice as many negative words in the H4Neg list (4,187 versus 2,337). The overlap in the word lists is 1,121. Previous research suggests that one can interpret a low fraction of negative words as positive news. Tetlock, Saar-Tsechansky, and Macskassy (2008) show that 9 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 85,
    "chunk_index": 18,
    "word_count": 357,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "approximately twice as many negative words in the H4Neg list (4,187 versus 2,337). The overlap in the word lists is 1,121. Previous research suggests that one can interpret a low fraction of negative words as positive news. Tetlock, Saar-Tsechansky, and Macskassy (2008) show that 9 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 85,
    "chunk_index": 19,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "low (high) fractions of negative words are associated with positive (negative) returns and predict positive (negative) earnings surprises. Consequently, we demean all negativity measures by day and set negativity equal to zero when there is no firm news to facilitate comparisons between firms with news and those without news. In Table A.V of the Internet Appendix, we conduct our tests using only the sample of firms with news to show that this procedure does not affect our estimates. Panel A in Table I presents the daily cross-sectional distributions for order imbalance, news, and stock return variables. In this table, we use the sample restrictions for market order imbalances when computing statistics for the news and return variables. Panel A also reports the distributions of the three raw negativity measures—i.e., before we demean them. It shows that the interquartile range (IQR) of RawH4Neg is roughly twice as large as the IQR of RawFinNeg, which is consistent with the different numbers of words in these lists. From the 5th to the 95th percentile, the range of RawNeg is 0.059, but the range of Neg is only 0.019 because it includes firms that do not have news stories. All three order imbalance measures have means and medians that are close to zero; and the 5th and 95th percentiles are near -1 and +1, respectively. [Insert Table I here] Panel B in Table I shows daily cross-sectional correlations. We supplement our news and order data with standard variables from the Center for Research on Securities Prices (CRSP) database, including measures of firm size (MarketEquity), the ratio of book-to-market equity (Book-to-Market, with book equity obtained from Compustat), and past daily, weekly, and monthly returns (Ret[0], Ret[-5,-1], and Ret[-26,-6]). Controlling for returns at each of these horizons is important, as shown in Gutierrez and Kelley (2008). The variable MarketEquity is the natural log of market equity from the most recent June. The variable Book-to-Market is the log of 10 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 85,
    "chunk_index": 20,
    "word_count": 328,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "returns (Ret[0], Ret[-5,-1], and Ret[-26,-6]). Controlling for returns at each of these horizons is important, as shown in Gutierrez and Kelley (2008). The variable MarketEquity is the natural log of market equity from the most recent June. The variable Book-to-Market is the log of 10 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 85,
    "chunk_index": 21,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "one plus book equity from the most recent fiscal year-end scaled by market equity from the previous December. The holding period return variables are raw daily returns compounded over the specified horizons. We denote variables measured from day t + x through day t + y using the suffix [x,y] or just [x] if x = y. We exclude securities other than common stocks listed on the NYSE, Nasdaq, and AMEX and stocks with prices less than $1 at the previous month-end. The univariate correlations offer an informal preview of some results. Market orders exhibit significant positive correlations of 0.059 with current daily returns (Ret[0]) and 0.009 with past daily returns (Ret[-1]) but a negative correlation of -0.014 with past weekly returns (Ret[-5,-1]). Nonmarketable limit orders have significantly negative correlations of -0.128, -0.039, and -0.057 with current returns, past daily returns, and past weekly returns, respectively. Executed limit orders also have significantly negative correlations with returns of -0.297, -0.030, and -0.040, respectively. These findings show that aggressive buying tends to occur after positive daily returns, whereas substantial passive buying occurs after negative daily returns. All three daily negativity measures display similar correlations with current returns, ranging from -0.025 to -0.029. They also have high correlations with each other, ranging from 0.682 to 0.958.14 All results in this paper are qualitatively and quantitatively similar using any of the three negativity measures. For example, all three daily negativity measures are negatively correlated with market orders, with correlations between -0.010 and -0.009, and nonmarketable limit orders, with correlations between -0.004 and -0.001. We focus on the combined Neg measure of negativity because it has the highest contemporaneous correlation with returns, suggesting it is the most relevant measure of information. Past weekly negativity (Neg[-5,-1]) has a significant negative correlation of -0.006 with current returns, consistent with the modest return predictability found in Tetlock, Saar-Tsechansky, and Macskassy (2008).15 11 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 85,
    "chunk_index": 22,
    "word_count": 319,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "it has the highest contemporaneous correlation with returns, suggesting it is the most relevant measure of information. Past weekly negativity (Neg[-5,-1]) has a significant negative correlation of -0.006 with current returns, consistent with the modest return predictability found in Tetlock, Saar-Tsechansky, and Macskassy (2008).15 11 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 85,
    "chunk_index": 23,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "This section examines whether retail orders predict stock returns. All tests in this study use daily cross-sectional regressions in the spirit of Fama and MacBeth (1973), where the regression model is ordinary least squares for continuous variables and logistic for binary variables. Point estimates of the regression coefficients are the time series averages of the daily coefficients. Standard errors employ the Newey-West (1987) correction for autocorrelation in the time series of the Fama-MacBeth regression coefficients. To be conservative, we set the number of daily lags in this procedure equal to two times the horizon of the dependent variable. Our regression model for predicting holding period returns during days [x,y] is: Ret[x,y] = b + Imb[0] * b + LagRet * b + FirmChars * b + e (1) 0 1 2 3 0 Equation (1) includes control variables that are known predictors of returns. The LagRet matrix consists of three columns representing Ret[0], Ret[-5,-1], and Ret[-26,-6]. The FirmChars matrix consists of two columns representing MarketEquity and Book-to-Market. Our primary interest is the return predictability coefficient b on Imb[0]. 1 Table II reports regression estimates for retail imbalances from the three order types. The first result in Panel A is that market and nonmarketable limit orders predict similarly positive returns at all horizons up to 20 days. These results are highly statistically significant at conventional levels; and their economic magnitude is substantial. The sums of the b coefficients 1 from days 1 through 20 are 35.6 basis points (bps) for market orders and 29.8 bps for nonmarketable limit orders. To compare these results to KST, we convert these sums into annualized returns on long-short portfolios formed based on daily imbalance deciles with midpoints at the 5th and 95th percentiles. Multiplying the sums by (252/20) and by the 12 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "II. Predicting the Cross-Section of Returns",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 85,
    "chunk_index": 24,
    "word_count": 302,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "II. Predicting the Cross-Section of Returns (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "29.8 bps for nonmarketable limit orders. To compare these results to KST, we convert these sums into annualized returns on long-short portfolios formed based on daily imbalance deciles with midpoints at the 5th and 95th percentiles. Multiplying the sums by (252/20) and by the 12 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "II. Predicting the Cross-Section of Returns",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 85,
    "chunk_index": 25,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "II. Predicting the Cross-Section of Returns (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "appropriate range of each order imbalance type, we estimate the annual long-short returns on the portfolios formed on daily market and nonmarketable limit order imbalances to be 8.01% and 7.11%, respectively, as compared to 14% annualized based on KST’s Table III.16 Table A.I in the Internet Appendix presents similar results in tests that control for return predictability from abnormal turnover as in Gervais, Kaniel, and Mingelgrin (2001), one-year return momentum as in Jegadeesh and Titman (1993), and idiosyncratic volatility as in Ang et al. (2006). [Insert Table II here.] Panel B reports estimates of return predictability in days 21 to 240 after measuring imbalances. All coefficients on market and nonmarketable limit orders are positive, though only one is statistically significant. Thus, there is no evidence that retail return predictability reverses at the annual horizon. The economic magnitudes of the predictability coefficients appear larger at longer horizons only because these magnitudes accumulate over longer time periods17, 18 The final two columns in Table II report results based on the subset of nonmarketable limit orders that resulted in trades (XL). The point estimates on the daily retail imbalance coefficients in Panel A are all positive. Although the day-[1,5] coefficient is only marginally significant, Table A.II, Panel C in the Internet Appendix reveals days [2,5] and [6,10] coefficient estimates are both significantly positive at the 1% level. This happens because the magnitude of the negative coefficient on day [1] is much smaller than the positive coefficients on days [2,5]. These findings suggest that executed limit orders exhibit positive return predictability, like the other order types. Although the point estimates for the two longer horizons in Panel B are negative at -0.067 and -0.023, these estimates are both smaller than their standard errors, meaning there is no statistically significant evidence of reversal for executed limit orders. Economically, the sum of the two negative point estimates (-0.090) for executed limit orders is 13 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "II. Predicting the Cross-Section of Returns",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 85,
    "chunk_index": 26,
    "word_count": 323,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "II. Predicting the Cross-Section of Returns (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "B are negative at -0.067 and -0.023, these estimates are both smaller than their standard errors, meaning there is no statistically significant evidence of reversal for executed limit orders. Economically, the sum of the two negative point estimates (-0.090) for executed limit orders is 13 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "II. Predicting the Cross-Section of Returns",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 85,
    "chunk_index": 27,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "II. Predicting the Cross-Section of Returns (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "less than half the magnitude of the positive long-horizon predictability from either of the other two order types in Panel B (0.233 and 0.311). The relatively small coefficients for executed limit orders—e.g., 5.8 bps summed over days [1,20] compared to 29.8 bps for NmL—suggest that retail traders using passive orders realize lower, but still positive, returns than what would be predicted by their passive order submission decisions. This implies that the picking off effect in Linnainmaa (2010) reduces the magnitude of return predictability coming from retail orders, but all retail order types still positively predict returns. Moreover, the differing results for nonmarketable and executed limit order imbalances show that retail investors’ active decisions to submit orders, not their monitoring of orders after submission, drive much of the positive return predictability from these orders. One can view the return predictability coefficients for nonmarketable and executed limit orders as upper and lower bounds for return predictability arising from passive retail orders. In summary, the regressions in this section demonstrate that both aggressive and passive order imbalances positively predict stock returns at monthly horizons. This is consistent with Dorn, Huberman, and Sengmueller (2008), KST, and BOZ. The absence of a return reversal at horizons up to one year is somewhat unexpected in light of previous results in Hvidkjaer (2008) and BOZ.19 Although BOZ find their statistically and economically “most pronounced” evidence of return reversals during days [21,60], they focus on data before 2000 and use an indirect proxy for retail imbalances. We investigate these differences further by asking whether directly measured retail imbalances predict information about firms’ fundamentals. III. Predicting News about Firm Cash Flows A. Predicting the Tone of News 14 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "II. Predicting the Cross-Section of Returns",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 85,
    "chunk_index": 28,
    "word_count": 284,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "II. Predicting the Cross-Section of Returns (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "they focus on data before 2000 and use an indirect proxy for retail imbalances. We investigate these differences further by asking whether directly measured retail imbalances predict information about firms’ fundamentals. III. Predicting News about Firm Cash Flows A. Predicting the Tone of News 14 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "II. Predicting the Cross-Section of Returns",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 85,
    "chunk_index": 29,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "II. Predicting the Cross-Section of Returns (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "Our first test of the informed trader hypothesis analyzes whether retail order imbalances predict the tone of news articles, a proxy for innovations in expected firm cash flows. Our regression model for predicting news negativity during days [x,y] is: Neg[x,y] = c + Imb[0] * c + LagNeg * c + LagRet * c + FirmChars * c + e (2) 0 1 2 3 4 1 Equation (2) includes control variables that are likely predictors of negativity. The LagRet and FirmChars matrices are defined as before. Controlling for past returns is necessary because both negativity and order imbalances are related to past returns. The LagNeg matrix includes controls for lagged negativity from days [0], [-5,-1], and [-26,-6] because the tone of news is somewhat persistent. We focus on the coefficient c to test whether Imb[0] predicts negativity. 1 [Insert Table III here.] Table III reports regression estimates for retail imbalances based on market, nonmarketable limit, and executed limit orders. The negative and significant coefficients on Imb[0] in the first two columns show that market order imbalances negatively predict news negativity in the following month. That is, more retail buying on day [0] predicts less negativity in news stories, meaning that the tone of news after day [0] is more positive. The coefficient on market order imbalance (Imb[0]) is economically large and long- lasting compared to coefficients on other predictors of negativity, such as daily returns (Ret[0]). Bottom-to-top decile changes in Imb[0] and Ret[0] predict changes in Neg[6,20] equal to 0.42% and 0.30% of its 5th-to-95th percentile range.20 This comparison indicates that imbalances are better predictors of negativity than returns are. Interpreting the coefficient magnitudes is difficult because the variance of negativity includes an unknown and probably large amount of measurement error. Comparing the Neg[1,5] regression to the Neg[6,20] regression, the ratio of 15 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "II. Predicting the Cross-Section of Returns",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 85,
    "chunk_index": 30,
    "word_count": 309,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "II. Predicting the Cross-Section of Returns (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "comparison indicates that imbalances are better predictors of negativity than returns are. Interpreting the coefficient magnitudes is difficult because the variance of negativity includes an unknown and probably large amount of measurement error. Comparing the Neg[1,5] regression to the Neg[6,20] regression, the ratio of 15 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "II. Predicting the Cross-Section of Returns",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 85,
    "chunk_index": 31,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "II. Predicting the Cross-Section of Returns (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "the Imb[0] coefficient to the Ret[0] coefficient increases from 4:1 to 8:1. This implies that imbalances have longer-lasting predictive power than returns do. Nonmarketable limit order imbalances, however, are unrelated to negativity. Even the 99% confidence intervals on the limit order coefficients are sufficiently narrow to rule out economically large estimates, such as coefficient estimates for market orders. Moreover, executed limit order imbalances actually positively predict negativity, suggesting the subset of orders that execute are less informed than the subset that does not. This result is consistent with some limit orders being picked off by informed traders as in Linnainmaa (2010). Such adverse selection could also help explain the negative (positive) relation between executed (unexecuted) limit order imbalance and next-day returns. We note, however, these subsets of orders are not identifiable at the time of order submission. Figure 1 summarizes the ability of different order imbalances on day [0] to predict returns and news negativity during days [1,5] and [6,20]. The figure depicts standardized values of the regression coefficients on daily imbalances for these two horizons. The key point is that both market and limit orders predict returns, but only market orders correctly predict the tone of news. 21 [Insert Figure 1 here.] The nonmarketable limit order findings are somewhat surprising given the results in Table II showing these orders are strong positive predictors of returns. The inability of either nonmarketable or executed limit orders to correctly predict firm news also seems inconsistent with two empirical studies. In experimental markets, Bloomfield, O’Hara, and Saar (2005) show that traders with information about fundamentals use limit orders more often than other traders. Kaniel and Liu (2006) argue that, in theory and practice, informed traders with long-lived information are likely to use limit orders. In light of this, we extend the horizons of the news 16 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "II. Predicting the Cross-Section of Returns",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 85,
    "chunk_index": 32,
    "word_count": 308,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "II. Predicting the Cross-Section of Returns (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "with information about fundamentals use limit orders more often than other traders. Kaniel and Liu (2006) argue that, in theory and practice, informed traders with long-lived information are likely to use limit orders. In light of this, we extend the horizons of the news 16 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "II. Predicting the Cross-Section of Returns",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 85,
    "chunk_index": 33,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "II. Predicting the Cross-Section of Returns (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "negativity tests to one year and report the results in Table A.V of the Internet Appendix. The upshot is that at longer horizons, there is still no evidence that limit orders correctly predict negativity. One interpretation is that retail traders in our sample may not believe that they have sufficiently long-lived information to justify the use of limit orders. Alternatively, informed traders may submit market orders because they are unwilling to bear the cost of monitoring limit orders. Finally, some traders may submit limit orders based on types of information that our variables are unable to detect. We discuss this possibility in Section 4.D below. B. Predicting Earnings Surprises To complement our results on predicting negativity, we now test whether imbalances predict earnings surprises, as measured by the sign of analysts’ forecast errors. Because earnings announcements are ten times less frequent than news, this test has much lower statistical power than the negativity tests in Table III. But using a well-established measure of changes in firms’ fundamentals, such as earnings surprises, allows us to perform two validity checks on the news negativity results. First, we can assess whether imbalances predict earnings surprises in the same way that they predict negativity. Second, we can test whether our negativity measure predicts earnings surprises in our sample, much like Tetlock, Saar-Tsechansky, and Macskassy (2008). We use the following logistic regression model in our test: PosFE[x,y] = d + Imb[0] * d + LagRet * d + LagNeg * d + FirmChars * d + e (3) 0 1 2 3 4 1 The variable PosFE[x,y] is equal to 1 if there is a positive earnings surprise (or forecast error) between days x and y and 0 if there is a negative surprises. The earnings announcement date is the earlier of that reported by Institutional Brokers’ Estimate System (I/B/E/S) and Compustat; and the surprise is the difference between actual quarterly earnings and the median forecast 17 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "II. Predicting the Cross-Section of Returns",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 85,
    "chunk_index": 34,
    "word_count": 327,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "II. Predicting the Cross-Section of Returns (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "days x and y and 0 if there is a negative surprises. The earnings announcement date is the earlier of that reported by Institutional Brokers’ Estimate System (I/B/E/S) and Compustat; and the surprise is the difference between actual quarterly earnings and the median forecast 17 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "II. Predicting the Cross-Section of Returns",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 85,
    "chunk_index": 35,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "II. Predicting the Cross-Section of Returns (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "obtained from I/B/E/S as of the day before the earnings announcement. All independent variables in Equation (3) are the same as those in our Equation (2) model for predicting negativity. [Insert Table IV here.] The main result, reported in Table IV, is that market order imbalances positively predict earnings surprises during days [1,5] and [6,20], whereas both types of limit order imbalances have negligible ability to predict earnings surprises at either horizon.22 Based on the one-week predictability coefficient on market orders, a bottom-to-top decile change in imbalances produces a change of 25.3% = e0.126*(0.846 – (-0.940)) – 1 in the odds ratio for a positive earnings surprise. Comparing the sums of the predictability coefficients across days [1,20] produces striking differences: the market order coefficients sum to 17.4, which is statistically significant at the 1% level; but the two sets of limit order coefficients sum to -1.1 and 2.3, both of which are insignificantly different from zero and significantly less than the market order coefficients. We conclude that market order imbalances have many times more predictive power for earnings surprises during the next 20 days. These results are consistent with the hypothesis that aggressive retail orders aggregate novel information about firms’ cash flows but do not support the hypothesis that passive orders convey such information.23 Rows two, three, and four in Table IV indicate that news negativity consistently negatively predicts the sign of earnings surprises. Of the six negativity coefficients in the market imbalance models, five are negative and three are statistically significant.24 Overall, the findings in Table IV support the use of news negativity as a proxy for changes in firms’ fundamentals. 18 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "II. Predicting the Cross-Section of Returns",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 85,
    "chunk_index": 36,
    "word_count": 278,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "II. Predicting the Cross-Section of Returns (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "predicts the sign of earnings surprises. Of the six negativity coefficients in the market imbalance models, five are negative and three are statistically significant.24 Overall, the findings in Table IV support the use of news negativity as a proxy for changes in firms’ fundamentals. 18 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "II. Predicting the Cross-Section of Returns",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 85,
    "chunk_index": 37,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "II. Predicting the Cross-Section of Returns (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "This section presents four tests to evaluate the merits of the liquidity provision hypothesis for each order type. These tests all apply the idea from Grossman and Miller (1988) and others that stock return reversals are an intuitive measure of the compensation for liquidity provision. A. Return Predictability from Return Reversals We first measure the extent to which return predictability from each retail imbalance type comes from mechanical trading on stock return reversals. The Table II analysis of return predictability controls for past daily and weekly returns, which are negatively related to future returns. Excluding the control variables for past returns reveals whether retail orders benefit from autocorrelation patterns in returns. The table below shows that the imbalance coefficients for nonmarketable and executed limit orders increase substantially when the return prediction models exclude control variables for past returns, but the coefficients for marketable orders remain essentially the same. This evidence suggests that nonmarketable limit orders—in particular those that execute (XL)—correctly predict daily and/or weekly return reversal. That is, low firm returns are followed by passive retail buying activity, which is followed by high firm returns. The evidence that only return predictability from passive orders coincides with a return reversal is consistent with passive orders receiving compensation for providing liquidity. Coefficient on Imb[0] in Predicting Ret[1,5] Mkt NmL XL With all controls (i.e., Table II) 0.207 0.195 0.028 Without return controls 0.198 0.246 0.107 % change relative to Table II -4% 26% 282% Without any controls 0.212 0.275 0.123 % change relative to Table II 2% 41% 339% 19 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 85,
    "chunk_index": 38,
    "word_count": 263,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "Predicting Ret[1,5] Mkt NmL XL With all controls (i.e., Table II) 0.207 0.195 0.028 Without return controls 0.198 0.246 0.107 % change relative to Table II -4% 26% 282% Without any controls 0.212 0.275 0.123 % change relative to Table II 2% 41% 339% 19 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 85,
    "chunk_index": 39,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "B. Return Predictability in Stocks with Large Return Reversals The next test examines whether return predictability from retail orders is especially strong in stocks that tend to experience large return reversals, where the compensation for providing liquidity may be higher. We augment the return predictability regressions in Equation (1) with an interaction term between stock-level return reversals (RevQuint) and retail order imbalances. The variable RevQuint equals -2, -1, 0, 1, or 2 based on the quintile rank of the negative of a stock’s autoregression coefficient of daily returns on lagged daily returns in the year ending on day t – 1. The specification shown in Panel A of Table V includes controls for the direct effect of the reversal quintile variable, an interaction between reversal and daily returns, and an interaction between retail imbalances and firm size, as measured by a size quintile (MEQuint) variable ranging from -2 to +2 depending on a firm’s NYSE MarketEquity quintile in the most recent June. The coefficient on the size interaction indicates whether retail return predictability is higher in large versus small firms. The specification in Panel B of Table V omits the controls for past returns to show how each retail order type benefits from return reversals. [Insert Table V here] In both panels, particularly Panel B, the interaction coefficient estimates show that only limit orders are better predictors of returns in stocks subject to large return reversals. At the one- week horizon, the reversal interaction coefficients are positive and significant for nonmarketable limit orders (NmL) and negative and significant for market orders (Mkt). At longer horizons, the interactions are insignificant mainly because this test has little power to detect return reversals much beyond one day.25 The magnitude of the variation in return predictability is economically significant. In Panel A, the top-to-bottom quintile variation in one-week return predictability from limit orders is 34% (4 * 0.012 / 0.141) of the magnitude of the average return predictability. 20 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 85,
    "chunk_index": 40,
    "word_count": 330,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "much beyond one day.25 The magnitude of the variation in return predictability is economically significant. In Panel A, the top-to-bottom quintile variation in one-week return predictability from limit orders is 34% (4 * 0.012 / 0.141) of the magnitude of the average return predictability. 20 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 85,
    "chunk_index": 41,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "For market orders, the economic magnitude is similar but the effect operates in the opposite direction. This evidence suggests that limit orders, but not market orders, provide liquidity. However, this need not be the only explanation for the relation between limit order imbalance and future returns. The liquidity provision and information interpretations are not mutually exclusive, especially in a population of heterogeneous retail traders. In the first two columns of Panel A in Table V, the negative coefficient estimates on the size interaction with imbalances (Imb[0]*MEQuint) show that retail orders are better predictors of returns in small firms. By itself, this fact does not distinguish between the information, liquidity, and noise trader theories because private information, liquidity provision, and noise trading all may be more important in small firms. Empirically, this finding is consistent with greater return predictability from retail orders in small stocks in both KST and KLST. It also could be related to Ivković and Weisbenner’s (2005) finding that individual investors perform better in local stocks within the set of non-S&P 500 stocks with low analyst coverage. Retail traders may be more likely to aggregate novel information about small firms because institutions, stock analysts, and reporters focus more on gathering information about large firms. C. Daily Regressions Predicting Retail Order Imbalances Next we explore whether retail market and limit order imbalances seem to respond to past liquidity shocks. Our regression model for predicting retail imbalances on day [1] is: Imb[1] = f + LagRet*f + LagNeg*f + FirmChars*f + NewsVars*f + LagImb*f + e (4) 0 1 2 3 4 5 1 Equation (4) includes control variables for past returns, past negativity, firm characteristics, and for variables representing past news and past imbalances. The LagRet, LagNeg, FirmChars matrices are defined as before. The NewsVars matrix consists of the news dummy (News[0]) and 21 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 85,
    "chunk_index": 42,
    "word_count": 310,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "3 4 5 1 Equation (4) includes control variables for past returns, past negativity, firm characteristics, and for variables representing past news and past imbalances. The LagRet, LagNeg, FirmChars matrices are defined as before. The NewsVars matrix consists of the news dummy (News[0]) and 21 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 85,
    "chunk_index": 43,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "its interactions with Imb[0] and Ret[0]. The LagImb matrix includes controls for past imbalances during days [0], [-5,-1], and [-26,-6]. Table VI reports the regression coefficients above for imbalance measures based on the three order types in each of two regression specifications. The first specification only considers independent variables that are observable to retail traders submitting orders, while the second also controls for their past imbalances. We focus on the coefficients (f ) on LagRet, but several 1 other coefficients are interesting, including the coefficients (f and f ) on LagNeg and NewsVars. 2 4 [Insert Table VI here.] The main finding, shown in columns 1, 3, and 5 of Table VI, is that retail traders using the three different order types exhibit very different responses to past returns. Traders submitting market orders on day [1] are significant net buyers of stocks experiencing positive returns on the prior day (Ret[0]), whereas traders submitting nonmarketable limit orders and those whose limit orders execute are significant net sellers of these stocks. Moreover, the sums of the coefficients on Ret[0], Ret[-5,-1], and Ret[-26,-6] for market, nonmarketable limit, and executed limit order imbalances are 0.114, -1.347, and -0.901. These sums indicate that market orders exhibit net return momentum behavior and limit orders exhibit contrarian behavior at longer horizons, too. Table VI also shows that retail traders using market orders on day [1] are net sellers in response to high news negativity on day [0], days [-5,-1], and days [-26,-6]. That is, retail traders submit aggressive orders in the same direction as the tone of past news. Nonmarketable limit orders exhibit a similar but economically weaker relationship to news during days [-5,-1] and [-26,-6]; and executed limit orders do not significantly depend on the tone of past news. One explanation is that passive retail orders provide liquidity in response to return shocks that are not driven by news. We evaluate this interpretation by isolating their responses to returns 22 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 85,
    "chunk_index": 44,
    "word_count": 329,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "and executed limit orders do not significantly depend on the tone of past news. One explanation is that passive retail orders provide liquidity in response to return shocks that are not driven by news. We evaluate this interpretation by isolating their responses to returns 22 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 85,
    "chunk_index": 45,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "on days without news, when return reversals are known to be larger (e.g., Tetlock, 2010). The interaction coefficient between news and returns (News[0]*Ret[0]) reflects the difference between return momentum trading on news and non-news days. It is strongly positive for both nonmarketable and executed limit orders, implying these orders are more contrarian to past returns that were not accompanied by news. In contrast, the interaction is negative for market orders.26 The positive interaction coefficient for (only) limit orders is consistent with the hypothesis that limit orders provide liquidity in response to return shocks in the absence of news. These results complement earlier evidence in Table III showing that limit orders do not predict news negativity, whereas market orders do. While Table III indicates that limit order traders are not acting on information about firm cash flows, Table VI suggests that they are primarily providing liquidity. In contrast, Table III suggests that market order traders are acting on information about cash flows and Table VI implies that they are not providing liquidity.27 Turning to columns 2, 4, and 6 in Table VI, the coefficients (f ) on the lagged imbalances 5 variables are consistently and significantly positive, ranging from 0.108 to 0.220. This persistence in retail imbalances is consistent with prior evidence in BOZ and elsewhere. We exploit this persistence in subsequent tests in Section 5.A. For now, we note that the inclusion of controls for past imbalances has some effect on the past return coefficients. For market and nonmarketable limit orders, including past imbalance controls weakens the relationships between imbalance and past returns. For executed limit orders, the sign on Ret[0] actually becomes positive in this specification. The mechanical negative relation between executed imbalances and returns measured over the same period could explain why the inclusion of past imbalance controls has such a large impact on the coefficient on past returns.28 23 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 85,
    "chunk_index": 46,
    "word_count": 317,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "the sign on Ret[0] actually becomes positive in this specification. The mechanical negative relation between executed imbalances and returns measured over the same period could explain why the inclusion of past imbalance controls has such a large impact on the coefficient on past returns.28 23 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 85,
    "chunk_index": 47,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "D. Intraday Analysis of Imbalances and Returns We now analyze the relationship between imbalances and intraday stock returns. For each order in a stock, we decompose the stock’s return on the day of the order into a pre-order (RetPreO) and a post-order (RetPostO) return. These two returns are based on bid-ask quote midpoints at the last market close before the order, the order submission time, and the first close after the order. Closing quotes come from Trades and Quotes (CRSP) for NYSE and AMEX (NASDAQ) securities; and inside quotes at the time of the order come from our market centers.29 We multiply returns by the sign of the order (+1 for buys; and -1 for sells), compute a share-weighted average return across all orders of a given type on each stock-day, and then average across stocks on each day. Table VII reports the time series average of this return as a summary of the relationship between order imbalance and pre- and post-order returns. A positive (negative) value can be interpreted as a positive (negative) covariance between order imbalance and the specified intraday return. [Insert Table VII here.] The means of RetPreO in Table VII are negative (-40.65 bps to -45.79 bps) for limit orders and near zero for market orders (-1.22 bps). The former demonstrates that the daily Granger-type causality results for limit orders in Table VI generalize to intraday frequencies: even within a day, limit orders oppose past returns. The means of RetPostO are positive (12.18 and 10.17 bps) for market and nonmarketable limit orders, indicating the positive return predictability for these order types in Table II begins during day [0]. This is not the case for executed limit orders, which exhibit a strong negative RetPostO (-34.37 bps) return. The positive price impacts of market and nonmarketable limit orders can be viewed as evidence informed traders submit both order types with two important caveats: (1) this notion of 24 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 85,
    "chunk_index": 48,
    "word_count": 325,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "the case for executed limit orders, which exhibit a strong negative RetPostO (-34.37 bps) return. The positive price impacts of market and nonmarketable limit orders can be viewed as evidence informed traders submit both order types with two important caveats: (1) this notion of 24 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 85,
    "chunk_index": 49,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "information is quite broad, including both information about innovations in the firms’ expected cash flow and about the stock’s order flow dynamics; and (2) our evidence explicitly linking order imbalances to innovations in expected cash flows is only compelling for the market order type. These two points suggest that retail traders using limit orders are skilled in identifying and timing the corrections of (possibly long-lasting) transitory price shocks, even in the absence of innovations to cash flows. Traders who know when past order flow was motivated by liquidity needs can be viewed as receiving a signal about the existence of private information—e.g., as in the model of Easley and O’Hara (1992). To further analyze return patterns after order submission, we decompose each order’s instantaneous price impact (EffectiveSpread) into two components: its price impact at the end of the day (RetPostO) and its temporary price impact (RealizedSpread). The instantaneous impact is half of the bid-ask spread in percentage terms for market orders and is the return computed from the bid-ask quote midpoint to the limit price for executed limit orders. The temporary impact is the negative of the return computed from the bid (ask) price for market sell (buy) orders to the closing midpoint; and from the limit price to the closing midpoint for executed limit orders. This realized spread measure is a proxy for market maker profits if we assume no price improvement and that market maker inventory is zero at the end of the day. These returns are aggregated across orders and stock-days in the same way as the other intraday returns. For market orders, the average RealizedSpread of 6.25 bps suggests that a market maker could capture one-third of the average effective half-spread (EffectiveSpread) of 18.40 bps.30 In addition, market makers can profit by trading against market orders when daily buy and sell orders offset each other, thereby capturing the positive realized spreads from both offsetting orders. Comparing bid-ask spreads in Table VII to return predictability in Table II, we infer that 25 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 85,
    "chunk_index": 50,
    "word_count": 340,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "addition, market makers can profit by trading against market orders when daily buy and sell orders offset each other, thereby capturing the positive realized spreads from both offsetting orders. Comparing bid-ask spreads in Table VII to return predictability in Table II, we infer that 25 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 85,
    "chunk_index": 51,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "retail market orders held for 20 days or more could earn small excess returns even after trading costs. An 18.4 bps half-spread is about half of the magnitude of 20-day return predictability from a one-unit change in market order imbalances (35.6 bps). Assuming a 60-day (240-day) holding period increases the magnitude of return predictability to 44 bps (59 bps), implying an excess return of 7 bps (22 bps) after incurring a 37-bps round-trip trading cost. For executed limit orders, the average EffectiveSpread of -32.90 bps drives the large negative RetPostO (-34.37 bps) mentioned above. We attribute this to the mechanism in which buy (sell) limit orders only execute if the price movement is negative (positive) after order submission. The lack of an economically meaningful RealizedSpread suggests retail traders whose limit orders execute do not benefit within the day from providing liquidity. Figure 2 illustrates a striking similarity between the intraday and daily analyses. Panel A depicts the relations between RetPreO and RetPostO and different order types. Panel B shows analogous relations over days [-1,5] using long-short portfolios based on retail order imbalance deciles on day 0. The benchmark return comes from the Fama and French (1993) three-factor model. The figure shows that limit order submissions and executions occur in the midst of return reversals, whereas market orders do not. The positive return predictability during days [1,5] after limit order submissions is equal to a reversal of about one-third of the cumulative pre-order return during days [-1,0], while predictability from executed limit orders is less than one-tenth of the pre-order return . Collectively, the findings in Figure 2 appear most consistent with limit orders benefitting from the reversal of recent price pressure. [Insert Figure 2 here.] 26 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 85,
    "chunk_index": 52,
    "word_count": 291,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "pre-order return during days [-1,0], while predictability from executed limit orders is less than one-tenth of the pre-order return . Collectively, the findings in Figure 2 appear most consistent with limit orders benefitting from the reversal of recent price pressure. [Insert Figure 2 here.] 26 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 85,
    "chunk_index": 53,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "IV. Liquidity Provision and Return Predictability from Retail Order Imbalances (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "This section further tests the noise trader hypothesis and an alternative hypothesis based on selective broker internalization of orders. These analyses complement our earlier results. A. The Noise Trader Hypothesis The absence of a return reversal in Table II casts doubt on the noise trader hypothesis but is insufficient grounds for rejecting it altogether. Here we offer a complementary and potentially more powerful test based on the mechanism described by studies such as DHS, Hvidjkaer (2008), and BOZ. Under the hypothesis that noise traders exert persistent pressure on prices, one would expect higher return predictability in stocks with persistently higher autocorrelation in retail order imbalances.31 In the first stage of our procedure, for each stock in each quarter, we estimate retail market order imbalance persistence using a time series regression of today’s imbalance on yesterday’s imbalance. We use only market orders in the first stage for two reasons: BOZ argue that these orders exert the most pressure on prices; and we have more data on market orders, allowing for more precise estimates. Importantly, the persistent coefficients themselves exhibit substantial persistence across non-overlapping quarters. A cross-sectional regression of current persistence on the previous quarter’s (the two-quarters-ago) persistence produces a highly significant coefficient of 0.132 (0.058), indicating that certain stocks are more prone to repeated aggressive buying and repeated aggressive selling from retail investors. In the second stage, we augment the cross-sectional return predictability regressions in Equation (1) with four variables related to imbalance persistence. A variable called Persist represents the five persistence coefficient quintiles in each calendar quarter using values of +2, 27 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "V. Further Explanations for Return Predictability",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 85,
    "chunk_index": 54,
    "word_count": 267,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "V. Further Explanations for Return Predictability (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "aggressive selling from retail investors. In the second stage, we augment the cross-sectional return predictability regressions in Equation (1) with four variables related to imbalance persistence. A variable called Persist represents the five persistence coefficient quintiles in each calendar quarter using values of +2, 27 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "V. Further Explanations for Return Predictability",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 85,
    "chunk_index": 55,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "V. Further Explanations for Return Predictability (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "+1, 0, -1, and -2.32 The key variable is an interaction term between retail imbalances and persistence (Imb[0]*Persist). The coefficient on this interaction will be positive if retail imbalances are better predictors of returns stocks with higher autocorrelation in retail imbalances. We also allow for interactions between persist and daily returns (Ret[0]*Persist) and between imbalances and firm size (Imb[0]*MEQuint). [Insert Table VIII here.] Table VIII reports the coefficient estimates on all variables. The main result is that the interaction between persistence and market order imbalances (Imb[0]*Persist) significantly positively predicts returns only at the weekly horizon. As explained Section 1 of the Internet Appendix, accounting for measurement error in persistence increases the magnitude of the unadjusted interaction coefficients by 82%. Even after this adjustment, the point estimates indicate that the persistence in imbalances can explain only 26% (53%) of the return predictability from retail imbalances at the monthly (weekly) horizon. Although the point estimates of the interaction coefficient in days [6,20] are close to zero, the wide 95% confidence intervals do not allow us to reject economically large estimates. At the weekly horizon, however, the narrower confidence intervals imply that the noise trader hypothesis leaves a significant amount of return predictability unexplained. B. The Internalization Hypothesis Another possible explanation for our return predictability findings is that only relatively well-informed retail orders are routed to market makers because retail brokerages internalize the least informative order flow. That is, we may observe a non-representative sample of the retail population. To explore this, we augment our cross-sectional return predictability regression in 28 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "V. Further Explanations for Return Predictability",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 85,
    "chunk_index": 56,
    "word_count": 263,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "V. Further Explanations for Return Predictability (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "is that only relatively well-informed retail orders are routed to market makers because retail brokerages internalize the least informative order flow. That is, we may observe a non-representative sample of the retail population. To explore this, we augment our cross-sectional return predictability regression in 28 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "V. Further Explanations for Return Predictability",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 85,
    "chunk_index": 57,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "V. Further Explanations for Return Predictability (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "Equation (1) with four additional independent variables related to the extent of internalization by a subset of brokers routing to our market centers. Specifically, the data indicate which orders come from a group of brokers that internalizes according to their Rule 605 and 606 disclosures and which orders do not. The variable InternRatio summarizes the collective internalization practices of these brokers. It is defined for each stock-month and order type (market or limit) as the ratio of orders internalized as per Rule 605 disclosures to orders routed to our market centers. We use this internalization ratio to construct four variables. The first is a 0 or 1 dummy indicating whether any brokerages internalize any orders of the order’s type in the stock (IntDum) in the preceding month. Our second variable IntQuint is equal to -2, -1, 0, +1, or +2, based on a ranking of stocks into quintiles according to InternRatio in the preceding month. Our third and fourth internalization variables are interactions of IntDum and IntQuint with retail imbalances computed with orders from the subset of brokers in the same order type and stock, Imb[0]*IntDum and Imb[0]*IntQuint. We also include a size interaction with imbalances (Imb[0]*MEQuint) to ensure that estimates of the four internalization coefficients do not reflect an indirect effect of firm size. Because these regressions include only orders from a subset of brokers, we include stock-days for which there are at least two orders for each type rather than imposing the five-order filter in our main tests. [Insert Table IX here.] Table IX reports the coefficient estimates for the four internalization variables and all control variables. The six columns represent estimates for imbalances based on market, nonmarketable limit, and executed limit orders and for returns during days [1,5] and [6,20]. The coefficients on imbalances remain positive and statistically significant in all specifications.33 29 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "V. Further Explanations for Return Predictability",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 85,
    "chunk_index": 58,
    "word_count": 311,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "V. Further Explanations for Return Predictability (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "the four internalization variables and all control variables. The six columns represent estimates for imbalances based on market, nonmarketable limit, and executed limit orders and for returns during days [1,5] and [6,20]. The coefficients on imbalances remain positive and statistically significant in all specifications.33 29 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "V. Further Explanations for Return Predictability",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 85,
    "chunk_index": 59,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "V. Further Explanations for Return Predictability (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "The salient finding in Table IX is that 11 of the 12 point estimates on the two interaction coefficients between internalization and imbalances (Imb[0]*IntDum and Imb[0]*IntQuint) are actually negative. Five of the negative interaction coefficients are significant at the 5% level, whereas the single positive coefficient is not significant at even the 10% level. These results imply that orders routed to our market centers in stocks where brokers internalize more orders are actually less (not more) predictive of future returns. Not only does internalization fail to explain our main finding that retail order imbalances positively predict returns, but brokers’ internalization practices may actually reduce the predictability from retail imbalances routed to market centers. In this sense, our estimates of retail return predictability are conservatively low relative to estimates from a hypothetical data set that includes all orders at brokerages routing to our market centers. C. Connection to Previous Research on Retail Trading Our results and those in KST and KLST based on post-2000 data show that aggregate retail order imbalances positively predict the cross-section of returns, which contrasts with earlier evidence in Odean (1999), Barber and Odean (2000), and Barber and Odean (2002). Our finding that returns do not reverse at the annual horizon ostensibly disagrees with earlier evidence in Hvidkjaer (2008) and BOZ of reversals in the months following net imbalances in small trades. We now explore two possible reasons why active retail investors appear more sophisticated in the studies using retail investor data after 2000. One possibility is that the skill of retail investors differs widely across retail brokers. The post-2000 studies use data from dozens of retail brokers, whereas pre-2000 studies that directly identify retail traders mainly focus on two brokers. We test for cross-broker heterogeneity in skill 30 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "V. Further Explanations for Return Predictability",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 85,
    "chunk_index": 60,
    "word_count": 297,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "V. Further Explanations for Return Predictability (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "One possibility is that the skill of retail investors differs widely across retail brokers. The post-2000 studies use data from dozens of retail brokers, whereas pre-2000 studies that directly identify retail traders mainly focus on two brokers. We test for cross-broker heterogeneity in skill 30 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "V. Further Explanations for Return Predictability",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 85,
    "chunk_index": 61,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "V. Further Explanations for Return Predictability (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "in our sample using anonymous broker codes provided in our data. For each broker and order type, we separately measure retail buy-sell imbalances and estimate the one-week (i.e., days [1,5]) return predictability using regressions as in Table II. We then compute each broker’s return predictability coefficients by averaging the time series of regression coefficients on imbalances for each order type.34 Table X reports the distribution of return predictability coefficients across brokers. The average coefficient is significantly positive but somewhat lower than in the earlier specifications. This reduced predictability could occur because there is broker-specific noise in imbalance in the disaggregated results. Thus, the attenuation bias from measurement error could explain some of the differences between the results of many-broker and single-broker studies of retail traders. [Insert Table X here.] Equally important, there is large variation in the broker-specific return predictability coefficients. For each order type, the coefficient for the broker ranked in the 95th percentile is positive and statistically and economically significant, whereas the coefficient for the broker ranked at the 5th percentile is actually negative, though it is insignificant. These results suggest that heterogeneity in retail clientele across brokers could help reconcile the results of the post- 2000 studies, including ours, with the earlier literature. A complimentary explanation for the differences across studies is that unusually low market returns after 2000 may have hastened changes in the composition of the retail population, motivating unskilled retail investors to stop investing directly and delegate the management of their portfolios to institutions. Indeed, French (2009) shows that direct individual ownership of US stocks declines from 36.2% in 2000 to 21.5% in 2007, while mutual fund ownership rises. To 31 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "V. Further Explanations for Return Predictability",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 85,
    "chunk_index": 62,
    "word_count": 282,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "V. Further Explanations for Return Predictability (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "population, motivating unskilled retail investors to stop investing directly and delegate the management of their portfolios to institutions. Indeed, French (2009) shows that direct individual ownership of US stocks declines from 36.2% in 2000 to 21.5% in 2007, while mutual fund ownership rises. To 31 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "V. Further Explanations for Return Predictability",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 85,
    "chunk_index": 63,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "V. Further Explanations for Return Predictability (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "test this mechanism’s plausibility, we analyze whether the market’s past three-year return can predict the one-week return predictability coefficient on imbalances in a time series regression.35 [Insert Table XI here.] As Table XI shows, the three-year market return (MktRet3Yr) significantly negatively predicts the return predictability coefficients for both market orders and nonmarketable limit orders, though not for executed limit orders. The Mkt and NmL coefficient magnitudes of -0.09 imply that a top-to-bottom decile decrease in three-year market returns from 71.9% to -33.1% produces an increase in the return predictability coefficients of 0.095 = -0.09 * (-0.331 – 0.719) . This magnitude is almost half of the average return predictability coefficients of 0.20 on Mkt and NmL during our sample. Table XI also reports the results from specifications using past one-year market returns (MktRet1Yr), which do not reliably forecast return predictability from retail imbalances. These findings suggest that low-frequency differences in past market returns could help reconcile our findings with those in prior studies, particularly if the unusually large decrease in long-run market returns after the Internet boom had an unusually large impact on the composition of the retail population. Detailed data on individual investors would allow for more precise tests of theories based on heterogeneity and composition changes in the retail population. VI. Discussion and Analysis We study extensive data on retail orders and news to contribute to the debate on whether and why individual investors can predict returns. Our analysis sheds light on the merits of several explanations for return predictability that have contrasting implications for public policy and market structure. We show that retail imbalances positively predict monthly returns and that return predictability does not reverse at the annual horizon, casting doubt on the hypothesis that 32 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "V. Further Explanations for Return Predictability",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 85,
    "chunk_index": 64,
    "word_count": 294,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "V. Further Explanations for Return Predictability (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "the merits of several explanations for return predictability that have contrasting implications for public policy and market structure. We show that retail imbalances positively predict monthly returns and that return predictability does not reverse at the annual horizon, casting doubt on the hypothesis that 32 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "V. Further Explanations for Return Predictability",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 85,
    "chunk_index": 65,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "V. Further Explanations for Return Predictability (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "retail traders are a destabilizing influence on prices. There is no evidence that sample selection bias can explain these findings. Both market and nonmarketable limit orders exhibit positive predictability. Yet only retail market order imbalances predict the tone of news; and only limit order imbalances are contrarian with respect to past returns. These differing results suggest that retail traders tend to use market orders to act on novel information about firms’ cash flows but primarily use limit orders to provide liquidity. The aggregated decisions of retail investors in our sample are “wise” in two respects: they positively predict the cross-section of stock returns and they contribute to market efficiency. This suggests that researchers should heed caution when using retail trading as an empirical proxy for noise trading. However, our results do not overturn the vast literature on individual behavioral biases. Instead, they draw attention to the idea that net retail buying can predict future stock returns even if retail traders lose money from trading because of their offsetting buy and sell orders. For example, the vastly different return predictability from retail orders at different brokers suggests a sophisticated group may trade on information that is subsequently incorporated in market prices, while another group may waste its money by trading excessively in directions that usually offset. Although our study primarily demonstrates the wisdom of the former group, it does not refute the naïveté of the latter group. Moreover, while retail order imbalance strongly predicts stock returns, the implied dollar profits of self-directed retail traders do not necessarily translate to economically meaningful losses for institutions managing much larger portfolios. Future research should investigate whether the composition and behavior of traders changes over time in ways that alters the current market equilibrium. 33 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "V. Further Explanations for Return Predictability",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 85,
    "chunk_index": 66,
    "word_count": 295,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "V. Further Explanations for Return Predictability (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "the implied dollar profits of self-directed retail traders do not necessarily translate to economically meaningful losses for institutions managing much larger portfolios. Future research should investigate whether the composition and behavior of traders changes over time in ways that alters the current market equilibrium. 33 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "V. Further Explanations for Return Predictability",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 85,
    "chunk_index": 67,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "V. Further Explanations for Return Predictability (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "Ang, Andrew, Robert J. Hodrick, Yuhang Xing, and Xiaoyan Zhang, 2006, The cross-section of volatility and expected returns, Journal of Finance 61, 259−299. Barber, Brad M., and Terrance Odean, 2000, Trading is hazardous to your wealth: The common stock investment performance of individual investors, Journal of Finance 55, 773−806. Barber, Brad M., and Terrance Odean, 2002, Online investors: Do the slow do first? Review of Financial Studies 15, 455−488. Barber, Brad M., and Terrance Odean, 2008, All that glitters: The effect of attention and news on the buying behavior of individual and institutional investors, Review of Financial Studies 21, 785−818. Barber, Brad M., Yi-Tsung Lee, Yu-Jane Liu, and Terrance Odean, 2009, Just how much do individual investors lose by trading? Review of Financial Studies 22, 609−632. Barber, Barber M., Terrance Odean, and Ning Zhu, 2009, Do retail trades move markets? Review of Financial Studies 22, 151−186. Battalio, Robert H., and Tim Loughran, 2008, Does payment for order flow to your broker help or hurt you? Journal of Business Ethics 80, 37−44. Benartzi, Shlomo, and Richard H. Thaler, 2001, Naive diversification strategies in defined contribution savings plans, American Economic Review 91, 79−98. Black, Fischer, 1986, Noise, Journal of Finance 41, 529−543. Bloomfield, Robert, Maureen O’Hara, and Gideon Saar, 2005, The ‘make or take’ decision in an electronic market: Evidence on the evolution of liquidity, Journal of Financial Economics 75, 165−199. 34 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 35,
    "page_range": "p.35-36",
    "total_pages": 85,
    "chunk_index": 68,
    "word_count": 235,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.35-36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "plans, American Economic Review 91, 79−98. Black, Fischer, 1986, Noise, Journal of Finance 41, 529−543. Bloomfield, Robert, Maureen O’Hara, and Gideon Saar, 2005, The ‘make or take’ decision in an electronic market: Evidence on the evolution of liquidity, Journal of Financial Economics 75, 165−199. 34 Electronic copy available at: https://ssrn.com/abstract=1668706 Chan, Louis K. C., and Josef Lakonishok, 1995, The behavior of stock prices around institutional trades, Journal of Finance 50, 1147−1174. Chordia, Tarun, and Avanidhar Subrahmanyam, 2004, Order imbalance and stock returns: Theory and evidence, Journal of Financial Economics 72, 485−518. Dorn, Daniel, Gur Huberman, and Paul Sengmueller, 2008, Correlated trading and returns, Journal of Finance 58, 885−920. Easley, David, and Maureen O’Hara, 1992, Time and the process of security price adjustment, Journal of Finance 47, 577−605. Fama, Eugene F., and James D. MacBeth, 1973, Risk, return, and equilibrium: Empirical tests, Journal of Political Economy 81, 607−636. Fox, Merritt B., Lawrence R. Glosten, and Paul C. Tetlock, 2010, Short selling and the news: A preliminary report on an empirical study, New York Law School Law Review 54, 129−171. Frazzini, Andrea, and Owen A. Lamont, 2008, Dumb money: Mutual fund flows and the cross- section of stock returns, Journal of Financial Economics 88, 299−322. French, Kenneth R., 2008, The cost of active investing, Journal of Finance 58, 1537−1573. Gervais, Simon, Ron Kaniel, and Dan H. Mingelgrin, 2001, The high-volume return premium, Journal of Finance 56, 877−919. Griffin, John M., Jeffrey H. Harris, and Selim Topalaglu, 2003, Dynamics of institutional and individual trading, Journal of Finance 58, 2285−2320. Griffin, John M., Tao Shu, and Selim Topaloglu, 2011, Examining the dark side of financial markets: Who trades ahead of major announcements? Working paper, University of Texas. 35 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 85,
    "chunk_index": 69,
    "word_count": 289,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "H. Harris, and Selim Topalaglu, 2003, Dynamics of institutional and individual trading, Journal of Finance 58, 2285−2320. Griffin, John M., Tao Shu, and Selim Topaloglu, 2011, Examining the dark side of financial markets: Who trades ahead of major announcements? Working paper, University of Texas. 35 Electronic copy available at: https://ssrn.com/abstract=1668706 Grossman, Sanford J., and Merton H. Miller, 1988, Liquidity and market structure, Journal of Finance 43, 617−633. Gutierrez, Roberto C., and Eric K. Kelley, 2008, The long-lasting momentum in weekly returns, Journal of Finance 63, 415−447. Hvidkjaer, Soeren, 2008, Small trades and the cross-section of stock returns, Review of Financial Studies 21, 1123−1151. Ivković, Zoran, and Scott Weisbenner, 2005, Local does as local is: Information content of the geography of individual investors’ common stock investments, Journal of Finance 60, 267−305. Jegadeesh, Narasimhan, and Sheridan Titman, 1993, Returns to buying winners and selling losers: Implications for stock market efficiency, Journal of Finance 48, 65−91. Kaniel, Ron, and Hong Liu, 2006, So what orders do informed traders use? Journal of Business 79, 1867−1913. Kaniel, Ron, Shuming Liu, Gideon Saar, and Sheridan Titman, 2011, Individual investor trading and return patterns around earnings announcements, Journal of Finance, forthcoming. Kaniel, Ron, Gideon Saar, and Sheridan Titman, 2008 , Individual investor sentiment and stock returns, Journal of Finance 63, 273−310. Keim, Donald B., and Ananth Madhavan, 1997, Transactions costs and investment style: An inter-exchange analysis of institutional equity trades, Journal of Financial Economics 46, 265−292. Kyle, Albert S., 1985, Continuous auctions and insider trading, Econometrica 53, 1315-1335. Linnainmaa, Juhani T., 2010, Do limit orders alter inferences about investor performance and behavior? Journal of Finance 65, 1473−1506. 36 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 85,
    "chunk_index": 70,
    "word_count": 276,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "An inter-exchange analysis of institutional equity trades, Journal of Financial Economics 46, 265−292. Kyle, Albert S., 1985, Continuous auctions and insider trading, Econometrica 53, 1315-1335. Linnainmaa, Juhani T., 2010, Do limit orders alter inferences about investor performance and behavior? Journal of Finance 65, 1473−1506. 36 Electronic copy available at: https://ssrn.com/abstract=1668706 Lakonishok, Josef, Andrei Shleifer, Richard Thaler, and Robert Vishny, 1991, Window dressing by pension fund managers, American Economic Review Papers and Proceedings 81, 227- 231. Lou, Dong, 2011, A flow-based explanation for return predictability, working paper, London School of Economics. Loughran, Tim, and Bill McDonald, 2011, When is a liability not a liability? Textual analysis, dictionaries, and 10-Ks, Journal of Finance 66, 35−65. Newey, Whitney K., and Kenneth D. West, 1987, A simple, positive semi-definite, heteroskedasticity and autocorrelation consistent covariance matrix, Econometrica 55, 703−708. Odean, Terrance, 1998, Are investors reluctant to realize their losses? Journal of Finance 53, 1775−1798. Odean, Terrance, 1999, Do investors trade too much? American Economic Review 89, 1279−1298. Shleifer, Andrei, and Robert W. Vishny, 1997, The limits of arbitrage, Journal of Finance 52, 35−55. Tetlock, Paul C., 2007, Giving content to investor sentiment: The role of media in the stock market, Journal of Finance 62, 1139−1168. Tetlock, Paul C., Maytal Saar-Tsechansky, and Sofus Macskassy, 2008, More than words: Using language to quantify firms’ fundamentals, Journal of Finance 63, 1437−1467. Tetlock, Paul C., 2010, Does public financial news resolve asymmetric information? Review of Financial Studies 23, 3520−3557. 37 Electronic copy available at: https://ssrn.com/abstract=1668706 Tetlock, Paul C., 2011, All the news that’s fit to reprint: Do investors react to stale information? Review of Financial Studies 24, 1481−1512. 38 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 38,
    "page_range": "p.38-39",
    "total_pages": 85,
    "chunk_index": 71,
    "word_count": 275,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.38-39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "C., 2010, Does public financial news resolve asymmetric information? Review of Financial Studies 23, 3520−3557. 37 Electronic copy available at: https://ssrn.com/abstract=1668706 Tetlock, Paul C., 2011, All the news that’s fit to reprint: Do investors react to stale information? Review of Financial Studies 24, 1481−1512. 38 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 85,
    "chunk_index": 72,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "1 Grossman and Miller (1988) and related models do not specify the motives of “liquidity” traders who distort prices. Thus, the liquidity provider theory includes any retail trading that offsets temporary price pressure, even if such pressure is caused by investor sentiment as in Shleifer and Vishny (1997). Empirically, trading by institutional fund managers can exert price pressure, as shown by Chan and Lakonishok (1995) and Keim and Madhavan (1997), which highlight the role of fund turnover. Such turnover may be related to many factors, including fund investor sentiment, as suggested by Frazzini and Lamont (2008) and Lou (2011). 2 Indeed, much of the early evidence indicates that retail traders exhibit behavioral biases that detract from their performance (Odean (1998), Barber and Odean (2000), and Benartzi and Thaler (2001)). 3 KST and KLST show that retail orders executed on the New York Stock Exchange (NYSE) predict firms’ stock returns and earnings. They argue that retail investors are providing liquidity and trading on information. However, the NYSE sample of retail orders could be biased. Battalio and Loughran (2008) argue that retail brokers have incentives to route naive orders away from the NYSE; and BOZ note that most discount brokerages catering to self- directed retail investors route fewer than 1% of orders to the NYSE. In contrast to KST and KLST, DHS, Hvidkjaer (2008), and BOZ argue that retail order flow pushes prices away from fundamental values. But the samples studied in these papers are subject to criticism as well. DHS study a single German retail broker from 1998 to 2000. Hvidkjaer (2008) and BOZ use trade size to infer which trades are retail and do not use data after 2000. 4 Our data provider’s relationship with its client brokers allows it to objectively and reliably identify which orders are submitted by retail traders versus institutions. The fact that our sample is composed of orders routed to a single platform introduces sample selection concerns, which we explicitly address in Section 5 below. 5 Hvidkjaer (2008) and BOZ provide evidence of return reversals after buyer-initiated small trades—their proxy for retail trades—that suggests that a horizon of 60 trading days is sufficient to detect reversal. 6 In Section 5, we consider two other viable explanations that go beyond the three theories discussed in the introduction. 7 Bloomfield, O’Hara, and Saar (2005) provide experimental evidence that, when the value of their information is low, informed traders submit limit orders and effectively use their knowledge of fundamental value to trade as dealers against liquidity traders. 39 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 85,
    "chunk_index": 73,
    "word_count": 425,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "three theories discussed in the introduction. 7 Bloomfield, O’Hara, and Saar (2005) provide experimental evidence that, when the value of their information is low, informed traders submit limit orders and effectively use their knowledge of fundamental value to trade as dealers against liquidity traders. 39 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 85,
    "chunk_index": 74,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "8 Our data do not reveal individuals’ portfolios, holding periods, or transactions costs, precluding any direct analysis of gross or net performance of retail investors in our sample. 9 As described in Section 1 below, retail trading in our sample, including buy and sell orders that offset, accounts for about 2.3% of total CRSP dollar volume. Consequently, retail dollar profits on net imbalance—the minority of retail trading—are unlikely to meaningfully dilute the performance of large institutional portfolios and alter current views on the skills of institutional money managers. 10 A recent study of short selling activity by Fox, Glosten, and Tetlock (2010) uses a similar identification approach. 11 As an example, for marketable orders between 1000 and 1999 shares in Nasdaq-1000 securities routed by one of the top five brokers to our market centers in 2004:Q4, the market centers pay the broker 20% of the bid-ask spread up to a maximum of $0.015 per share. 12 Databases of retail trades approaching this size are studied in Griffin, Harris, and Topaloglu (2003) (165 million trades), KST ($1.55 trillion traded), and BOZ ($128 billion traded). A study by Tetlock (2011) uses roughly one quarter of our order data to test the hypothesis that some individual investors respond to stale news. 13 Our results are similar when we measure imbalances separately for true market orders and marketable limit orders. 14 These negativity correlations are qualitatively similar to those reported in Loughran and McDonald (2011), who analyze words in 10-K filings rather than news stories, The notable exception is that the correlation between daily H4Neg and daily stock returns is roughly six times (-0.025 versus -0.004) larger for news stories. 15 There are few notable correlations between MarketEquity and Book-to-Market and the order imbalance and negativity variables. One exception is the positive correlation of 0.124 between MarketEquity and negativity. This could arise because small firms are more likely to appear in the news when they experience a positive event, whereas large firms appear in the news whenever they experience any material event. 16 Similar to the predictability in KST, return predictability here is at least twice as large for positive (i.e., net buying) imbalances versus negative (i.e., net selling) imbalances. This finding is consistent with several economic stories. For example, buying may be more informative than selling because traders facing short sale constraints can only sell stocks they currently hold but can purchase any publicly traded stock. 17 Tables A.II and A.III in the Internet Appendix show that our findings remain similar in analyses based on dependent variables at several intermediate horizons as well as Fama and French (1993) risk-adjusted returns. Only 40 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 85,
    "chunk_index": 75,
    "word_count": 444,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "currently hold but can purchase any publicly traded stock. 17 Tables A.II and A.III in the Internet Appendix show that our findings remain similar in analyses based on dependent variables at several intermediate horizons as well as Fama and French (1993) risk-adjusted returns. Only 40 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 85,
    "chunk_index": 76,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "the return predictability between days 21 and 240 for nonmarketable limit orders is sensitive to the measurement of returns: it is insignificantly positive with raw returns but is significantly positive with abnormal returns. 18 The negative coefficients on past returns show that daily and weekly return reversals are statistically significant but economically much smaller than the predictability from retail order imbalances. For example, the one-day predictability from a bottom-to-top decile change in market order imbalances is 9.8 * (0.846 – (-0.940)) = 17.5 bps, whereas the one-day predictability from daily return reversal is only -132.9 * (0.0445 – (-0.0386)) = -11.9 bps. The size and book-to-market coefficients have the expected signs—negative and positive, respectively—but are economically insignificant predictors of returns at most horizons. 19 The lack of a return reversal is, however, consistent with the finding in Figure 2 of KST, which analyzes 60 days. 20 For imbalances, this calculation is -0.0067*(0.846 – (-0.940)) /(0.0153 – (-0.0135)) = -0.42%. For returns, it is -0.0009*(0.045 – (-0.039)) /(0.0153 – (-0.0135)) = -0.30%. 21 In Table A.IV of the Internet Appendix, we find similar results using an alternative specification that includes only observations with news stories. 22 The only significant coefficient for passive imbalances is the small positive coefficient on executed limit orders predicting PosFE[1,5]. Table A.VI of the Internet Appendix shows that this result holds for both PosFE[1] and PosFE[2,5] and is similar in magnitude to that for market orders. Thus, the ability of limit order imbalances to correctly predict future cash flows is confined to the first five days and is not robust across cash flow measures (e.g., news negativity). 23 In Table A.VI of the Internet Appendix, we also report tests in which we extend the horizon of the dependent earnings surprise variable beyond 20 days. We find that only market imbalances correctly predict earnings surprises: the coefficient is positive and marginally significant predicting PosFE[21,40]. Nonmarketable and executed limit imbalances actually incorrectly predict earnings surprises at horizons greater than 20 days. This evidence underscores the point that passive order imbalances do not correctly predict future cash flows. 24 In all specifications, negativity variables significantly predict earnings forecast errors at multiple horizons. 25 At the one day horizon, however, a stock’s return reversal coefficient in the prior year is quite persistent, as the negative and significant interaction coefficient between daily returns and the reversal quintile ranking shows. 41 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 85,
    "chunk_index": 77,
    "word_count": 403,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "variables significantly predict earnings forecast errors at multiple horizons. 25 At the one day horizon, however, a stock’s return reversal coefficient in the prior year is quite persistent, as the negative and significant interaction coefficient between daily returns and the reversal quintile ranking shows. 41 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 85,
    "chunk_index": 78,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "26 For market orders, it is helpful to interpret the negative interaction coefficient on news and returns along with the strong negative coefficient on past negativity. Together, these findings suggest that aggressive trading after news is more strongly related to the tone of past news than to the direction of past returns. 27 In a related test, KLST find that individuals’ trades oppose the direction of past earnings surprises. The news momentum results—and lack of any news contrarian trading for any order types—in Table VI are not necessarily inconsistent with KLST’s finding. To explore this issue, we separately identify earnings-related news events using the Earn dummy and include the sign of the forecast error, SignFE[-1,0], as a measure of earnings surprise. As shown in Table A.VII of the Internet Appendix, the coefficient on SignFE[-1,0] is negative in predicting all three order types and it is significant for both nonmarketable and executed limit orders. This suggests that individuals in our data trade against earnings surprises just as in KLST, and they do so most strongly with limit orders. It also shows that news momentum or contrarian behavior depends on the definition of news. 28 Specifically, a nonmarketable buy (sell) limit order will only execute if the stock return is negative (positive) while it is open. Table I, Panel B shows that executed limit order imbalance has a correlation of -0.279 with same- day returns. The correlation between nonmarketable limit order imbalance and same-day returns is only -0.128. 29 To eliminate potentially erroneous quotes, we retain orders only if both closing quotes and best bid and ask at order submission satisfy three conditions: (1) the ask exceeds the bid; (2) the ask is at most 150% of the bid; (3) the absolute value of returns based on the quote midpoints does not exceed 30%. 30 A formal analysis of market maker profitability is not possible without knowing dealers’ inventory management strategies and the costs of unwinding positions in interdealer transactions. 31 This prediction of the noise trader hypothesis opposes a key prediction from market microstructure theory: anticipated order flow should have a muted (or no) effect on prices because market makers adjust prices in anticipation of positively autocorrelated imbalances (Chordia and Subrahmanyam (2004)). Our tests shed light on whether the noise trader hypothesis or traditional microstructure theory provides a better description of the data. 32 In the first stage regression, we include only stocks with imbalance measures on at least 90% of the days during the estimation period and those for which the absolute value of the persistence coefficient is less than one. The mean of the persistence coefficients is 9% and the four quintile breakpoints are -4%, 5%, 12%, and 21%.For all stocks not assigned to a persistence quintile due to data limitations, we set Persist equal to zero. 42 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 85,
    "chunk_index": 79,
    "word_count": 474,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "the persistence coefficient is less than one. The mean of the persistence coefficients is 9% and the four quintile breakpoints are -4%, 5%, 12%, and 21%.For all stocks not assigned to a persistence quintile due to data limitations, we set Persist equal to zero. 42 Electronic copy available at: https://ssrn.com/abstract=1668706 33 Table A.VIII in the Internet Appendix shows that much of the differences between the imbalance coefficients in Tables II and IX arises from differences in sample restrictions. 34 For this test only, we restrict the sample to include only stock-broker-days with at least two orders of each type, broker-days with at least 100 stocks, and brokers with at least 100 days of qualifying regressions. 35 We use the CRSP value-weighted index as the proxy for the market return. 43 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 44,
    "page_range": "p.44-45",
    "total_pages": 85,
    "chunk_index": 80,
    "word_count": 135,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.44-45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "the sample to include only stock-broker-days with at least two orders of each type, broker-days with at least 100 stocks, and brokers with at least 100 days of qualifying regressions. 35 We use the CRSP value-weighted index as the proxy for the market return. 43 Electronic copy available at: https://ssrn.com/abstract=1668706 Table I: Cross-sectional Summary Statistics This table presents time series averages of daily cross-sectional summary statistics. Panel A contains daily means, standard deviations and percentiles. Panel B contains average daily cross-sectional correlation coefficients. Retail imbalances computed from market, executed limit, and nonmarketable limit orders are represented by MktImb, XLImb, and NmLImb, respectively. Buys and sells are measured in numbers of shares ordered. Imbalances are defined as buys minus sells divided by buys plus sells; they are missing on stock-days in which fewer than 5 orders occurred. Other variables include daily stock returns (Ret) measured in percent, the percentage of words in Dow Jones news stories that appear in the list of Harvard-IV negative words (RawH4Neg), the percentage that appear in the list of financial negative words of Loughran and McDonald (2011), and a composite negativity measure (RawNeg = (1/3)*RawH4Neg + (2/3)*RawFinNeg). The variable Neg is either RawNeg minus its daily mean or zero for stocks with no news coverage. The variables H4Neg and FinNeg are constructed analogously. The variables ME and BM are the natural logs of market equity from the most recent June and one plus the ratio of the most recent book equity to market equity from the most recent December. The notation [x,y] represents variables constructed from day t + x through day t + y. All other variables are measured on day t (notation suppressed). Panel A: Average daily statistics Variable Mean N Std Dev Pctl 5 Pctl 25 Pctl 50 Pctl 75 Pctl 95 MktImb -0.066 2795 0.527 -0.940 -0.466 -0.065 0.313 0.846 XLImb 0.031 1300 0.610 -0.961 -0.467 0.041 0.540 0.980 NmLImb -0.014 2166 0.567 -0.951 -0.453 -0.015 0.419 0.942 Ret 0.133 2795 3.299 -3.863 -1.140 0.005 1.206 4.450 RawH4Neg 3.136 780 2.434 0.145 1.701 2.723 3.993 7.812 RawFinNeg 1.149 780 2.238 0.000 0.024 0.335 1.218 5.641 RawNeg 1.811 780 2.135 0.060 0.704 1.227 2.082 6.010 Neg 0.000 2795 1.101 -1.237 -0.035 0.000 0.004 0.705 44 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 85,
    "chunk_index": 81,
    "word_count": 377,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "0.133 2795 3.299 -3.863 -1.140 0.005 1.206 4.450 RawH4Neg 3.136 780 2.434 0.145 1.701 2.723 3.993 7.812 RawFinNeg 1.149 780 2.238 0.000 0.024 0.335 1.218 5.641 RawNeg 1.811 780 2.135 0.060 0.704 1.227 2.082 6.010 Neg 0.000 2795 1.101 -1.237 -0.035 0.000 0.004 0.705 44 Electronic copy available at: https://ssrn.com/abstract=1668706 Table I (continued): Panel B: Average daily correlation coefficients Variable Mk Imb NmLImb XLImb Ret H4Neg FinNeg Neg NmLImb 0.260 XLImb 0.242 0.777 Ret 0.059 -0.128 -0.279 H4Neg -0.010 -0.004 -0.004 -0.025 FinNeg -0.009 -0.001 -0.002 -0.028 0.683 Neg -0.010 -0.002 -0.003 -0.029 0.861 0.958 MktImb[-1] 0.204 0.114 0.119 0.018 -0.008 -0.008 -0.008 MktImb[-5,-1] 0.227 0.120 0.130 0.009 -0.009 -0.006 -0.008 MktImb[-26,-6] 0.173 0.077 0.076 0.004 -0.011 -0.008 -0.010 NmLImb[-1] 0.128 0.253 0.207 0.019 -0.006 -0.006 -0.006 NmLImb[-5,-1] 0.127 0.241 0.204 0.016 -0.005 -0.004 -0.004 NmLImb[-26,-6] 0.083 0.122 0.099 0.004 -0.007 -0.004 -0.005 XLImb[-1] 0.111 0.190 0.197 0.000 -0.008 -0.006 -0.007 XLImb[-5,-1] 0.115 0.182 0.203 0.008 -0.005 -0.005 -0.005 XLImb[-26,-6] 0.078 0.099 0.106 0.003 -0.007 -0.005 -0.006 Ret[-1] 0.009 -0.039 -0.030 -0.044 -0.008 -0.008 -0.008 Ret[-5,-1] -0.014 -0.057 -0.040 -0.035 -0.011 -0.008 -0.010 Ret[-26,-6] -0.022 -0.029 -0.020 -0.001 -0.011 -0.012 -0.013 Neg[-5,-1] -0.010 -0.007 -0.007 -0.006 0.098 0.081 0.094 Neg[-26,-6] -0.010 -0.009 -0.009 -0.004 0.095 0.066 0.083 MarketEquity -0.007 -0.048 -0.069 -0.005 0.119 0.108 0.120 Book-to-Market -0.020 0.004 -0.003 0.004 -0.011 -0.007 -0.009 45 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 46,
    "page_range": "p.46-47",
    "total_pages": 85,
    "chunk_index": 82,
    "word_count": 229,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.46-47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "-0.035 -0.011 -0.008 -0.010 Ret[-26,-6] -0.022 -0.029 -0.020 -0.001 -0.011 -0.012 -0.013 Neg[-5,-1] -0.010 -0.007 -0.007 -0.006 0.098 0.081 0.094 Neg[-26,-6] -0.010 -0.009 -0.009 -0.004 0.095 0.066 0.083 MarketEquity -0.007 -0.048 -0.069 -0.005 0.119 0.108 0.120 Book-to-Market -0.020 0.004 -0.003 0.004 -0.011 -0.007 -0.009 45 Electronic copy available at: https://ssrn.com/abstract=1668706 Table II: Predicting Returns Using Retail Order Imbalances This table presents results from daily Fama-MacBeth (1973) regressions of future returns on retail imbalances and control variables. The independent variable Imb[0] measures day t retail imbalance constructed from market (Mkt), nonmarketable limit (NmL), or executed limit (XL) orders and equals buys minus sells divided by buys plus sells. Buys and sells are measured in numbers of shares ordered, and at least 5 orders from the corresponding order type are required. The variable Ret[x,y] is the return (measured in percent) compounded over days t+x through t+y. The variables MarketEquity and Book-to-Market are the logs of market equity from the most recent June and one plus the ratio of book equity from the most recent fiscal year to market equity from the most recent December. Panel A uses Ret[x,y] from various horizons over days t+1 through t+20 as the dependent variable. Panel B uses Ret[x,y] from various horizons over days t+21 through t+240. Average coefficients and Newey-West (1987) standard errors with lags equal to twice the horizon of the dependent variable appear in the table. The symbols **, *, and + denote significance at the 1%, 5%, and 10% level, respectively. Panel A: Market, nonmarketable limit, and executed limit imbalances predicting returns Dependent Variable Ret[1,5] Ret[6,20] Ret[1,5] Ret[6,20] Ret[1,5] Ret[6,20] Imbalance measure Mkt Mkt NmL NmL XL XL Imb[0] 0.207** 0.149** 0.195** 0.103** 0.028+ 0.030 (0.012) (0.026) (0.013) (0.023) (0.016) (0.031) Ret[0] -0.044** -0.005 -0.040** 0.001 -0.030** 0.620 (0.004) (0.007) (0.004) (0.007) (0.005) (0.644) Ret[-5,-1] -0.016** -0.002 -0.016** -0.002 -0.014** -0.176 (0.003) (0.006) (0.003) (0.006) (0.003) (0.600) Ret[-26,-6] -0.002 -0.005 -0.002 -0.005 -0.003 -0.765 (0.002) (0.005) (0.002) (0.005) (0.002) (0.485) Market Equity -0.052* -0.076 -0.047* -0.069 -0.042 -0.035 (0.023) (0.076) (0.022) (0.074) (0.026) (0.081) Book-to-Market 0.098 0.240 0.134+ 0.338 0.128 0.365 (0.073) (0.247) (0.075) (0.252) (0.086) (0.254) Intercept 1.110** 2.054 1.013* 1.882 0.963* 1.402 (0.415) (1.447) (0.412) (1.441) (0.490) (1.594) Average R2 2.30% 2.12% 2.38% 2.14% 3.25% 2.99% Average N 2688 2680 2078 2073 1248 1246 46 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 85,
    "chunk_index": 83,
    "word_count": 389,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "(0.026) (0.081) Book-to-Market 0.098 0.240 0.134+ 0.338 0.128 0.365 (0.073) (0.247) (0.075) (0.252) (0.086) (0.254) Intercept 1.110** 2.054 1.013* 1.882 0.963* 1.402 (0.415) (1.447) (0.412) (1.441) (0.490) (1.594) Average R2 2.30% 2.12% 2.38% 2.14% 3.25% 2.99% Average N 2688 2680 2078 2073 1248 1246 46 Electronic copy available at: https://ssrn.com/abstract=1668706 Table II (continued) Panel B: Market, nonmarketable limit, and executed limit imbalances predicting long-horizon returns Dependent Variable Ret[21,60] Ret[61,240] Ret[21,60] Ret[61,240] Ret[21,60] Ret[61,240] Imbalance measure Mkt Mkt NmL NmL XL XL Imb[0] 0.087* 0.146 0.010 0.301 -0.067 -0.023 (0.043) (0.153) (0.035) (0.231) (0.073) (0.125) Average R2 2.54% 2.03% 2.55% 2.13% 3.44% 2.96% Average N 2668 2615 2065 2026 1242 1221 47 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 48,
    "page_range": "p.48-49",
    "total_pages": 85,
    "chunk_index": 84,
    "word_count": 116,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.48-49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "Variable Ret[21,60] Ret[61,240] Ret[21,60] Ret[61,240] Ret[21,60] Ret[61,240] Imbalance measure Mkt Mkt NmL NmL XL XL Imb[0] 0.087* 0.146 0.010 0.301 -0.067 -0.023 (0.043) (0.153) (0.035) (0.231) (0.073) (0.125) Average R2 2.54% 2.03% 2.55% 2.13% 3.44% 2.96% Average N 2668 2615 2065 2026 1242 1221 47 Electronic copy available at: https://ssrn.com/abstract=1668706 Table III: Predicting Negativity Using Retail Order Imbalances This table presents results from daily Fama-MacBeth (1973) regressions of future negativity on retail imbalances (Imb[0]) and control variables. The dependent variable Neg[x,y] is the percentage of words in Dow Jones news stories from day t + x through day t + y that appear in the list of Harvard-IV negative words (RawH4Neg) and the percentage that appear in the list of financial negative words of Loughran and McDonald (2011), using weights of (1/3) and (2/3), respectively. This variable is constructed to have a zero mean and to be zero for stocks with no news coverage. Other variables are as defined above. Average coefficients and Newey-West (1987) standard errors with lags equal to twice the horizon of the dependent variable appear in the table. The symbols **, *, and + denote significance at the 1%, 5%, and 10% level, respectively. Dependent Variable Neg[1,5] Neg[6,20] Neg[1,5] Neg[6,20] Neg[1,5] Neg[6,20] Imbalance Measure Mkt Mkt NmL NmL XL XL Imb[0] -0.005* -0.007** 0.002 -0.001 0.008** 0.006* (0.002) (0.002) (0.002) (0.002) (0.002) (0.002) Neg[0] 0.070** 0.042** 0.067** 0.038** 0.062** 0.035** (0.002) (0.001) (0.001) (0.001) (0.002) (0.001) Neg[-5,-1] 0.089** 0.080** 0.093** 0.080** 0.096** 0.079** (0.002) (0.002) (0.002) (0.002) (0.003) (0.003) Neg[-26,-6] 0.180** 0.236** 0.185** 0.246** 0.209** 0.270** (0.006) (0.010) (0.006) (0.010) (0.006) (0.011) Ret[0] (÷ 100) -0.134** -0.086** -0.162** -0.110** -0.150** -0.085** (0.031) (0.029) (0.030) (0.027) (0.036) (0.033) Ret[-5,-1] (÷ 100) -0.074** -0.032 -0.086** -0.037 -0.092** -0.031 (0.020) (0.024) (0.020) (0.025) (0.023) (0.027) Ret[-26,-6] (÷ 100) -0.011 -0.048** -0.015 -0.046** -0.023 -0.041* (0.013) (0.017) (0.013) (0.017) (0.014) (0.019) Market Equity 0.067** 0.047** 0.067** 0.048** 0.068** 0.049** (0.003) (0.003) (0.002) (0.003) (0.002) (0.003) Book-to-Market 0.028** 0.010 0.035** 0.006 0.042** -0.002 (0.007) (0.012) (0.007) (0.012) (0.010) (0.015) Intercept -0.923** -0.643** -0.907** -0.648** -0.958** -0.679** (0.036) (0.040) (0.033) (0.039) (0.034) (0.042) Average R2 5.58% 8.55% 6.19% 9.62% 7.05% 11.37% Average n 2691 2691 2080 2080 1249 1249 48 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 49,
    "page_range": "p.49",
    "total_pages": 85,
    "chunk_index": 85,
    "word_count": 373,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "(0.002) (0.003) Book-to-Market 0.028** 0.010 0.035** 0.006 0.042** -0.002 (0.007) (0.012) (0.007) (0.012) (0.010) (0.015) Intercept -0.923** -0.643** -0.907** -0.648** -0.958** -0.679** (0.036) (0.040) (0.033) (0.039) (0.034) (0.042) Average R2 5.58% 8.55% 6.19% 9.62% 7.05% 11.37% Average n 2691 2691 2080 2080 1249 1249 48 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 85,
    "chunk_index": 86,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "Table IV: Predicting Analysts’ Earnings Forecast Errors Using Retail Order Imbalances This table presents results from daily logistic regressions of earnings forecast errors on retail imbalances (Imb[0]) and control variables. The dependent variable PosFE[x,y] is one if the analyst forecast errors for quarterly earnings announcements occurring from day t + x through day t + y is positive and zero if the forecast error is negative. The forecast error is the difference between actual earnings-per- share and the median analyst forecast from I/B/E/S. Other variables are as defined above. At least 50 earnings announcements with corresponding forecast data during the window of the dependent are required for each daily logistic regression. Average coefficients and Newey-West (1987) standard errors with lags equal to twice the horizon of the dependent variable appear in the table. The symbols **, *, and + denote significance at the 1%, 5%, and 10% level, respectively. Dependent Variable PosFE[1,5] PosFE[6,20] PosFE[1,5] PosFE[6,20] PosFE[1,5] PosFE[6,20] Imbalance Measure Mkt Mkt NmL NmL XL XL Imb[0] 0.126** 0.047** 0.015 -0.026 0.036+ -0.013 (0.022) (0.018) (0.025) (0.022) (0.022) (0.020) Neg[0] 0.050 -0.051 0.062 -0.004 0.018 -0.008 (0.073) (0.056) (0.053) (0.017) (0.023) (0.016) Neg[-5,-1] -0.014 -0.029* -0.012 -0.035* -0.013 -0.042** (0.014) (0.013) (0.013) (0.015) (0.018) (0.013) Neg[-26,-6] -0.093** -0.110** -0.103** -0.115** -0.130** -0.128** (0.015) (0.020) (0.016) (0.020) (0.016) (0.016) Ret[0] 0.033** 0.028** 0.034** 0.029** 0.045** 0.024** (0.005) (0.003) (0.006) (0.004) (0.007) (0.004) Ret[-5,-1] 0.031** 0.025** 0.031** 0.025** 0.030** 0.023** (0.004) (0.003) (0.004) (0.003) (0.004) (0.003) Ret[-26,-6] 0.024** 0.014** 0.023** 0.014** 0.020** 0.015** (0.003) (0.002) (0.002) (0.002) (0.002) (0.002) Market Equity 0.193** 0.191** 0.204** 0.194** 0.168** 0.196** (0.015) (0.014) (0.019) (0.014) (0.015) (0.013) Book-to-Market -0.384** -0.367** -0.523** -0.456** -0.413** -0.431** (0.076) (0.080) (0.102) (0.079) (0.111) (0.091) Intercept -1.614** -1.664** -1.723** -1.622** -1.274** -1.667** (0.213) (0.224) (0.245) (0.227) (0.227) (0.192) Days 673 1193 602 1173 483 905 Average R2 9.99% 8.29% 10.84% 10.07% 11.11% 9.95% Average N 265 482 214 362 161 290 49 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 85,
    "chunk_index": 87,
    "word_count": 325,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "-0.413** -0.431** (0.076) (0.080) (0.102) (0.079) (0.111) (0.091) Intercept -1.614** -1.664** -1.723** -1.622** -1.274** -1.667** (0.213) (0.224) (0.245) (0.227) (0.227) (0.192) Days 673 1193 602 1173 483 905 Average R2 9.99% 8.29% 10.84% 10.07% 11.11% 9.95% Average N 265 482 214 362 161 290 49 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 51,
    "page_range": "p.51",
    "total_pages": 85,
    "chunk_index": 88,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.51)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "Table V: Predicting Returns Using Retail Order Imbalances and Return Reversals This table presents results from daily Fama-MacBeth (1973) regressions of future returns on daily retail imbalances (Imb[0]) and interactions based on return reversals. For each stock in each calendar year and order type, we compute its return reversal as the the negative of each stock’s first-order autoregression coefficient for daily returns. The variable RevQuint equals -2, -1, 0, 1, or 2 based on the quintile rank of each stock’s return reversal in the past calendar year. The variable MEQuint equals -2, -1, 0, 1, or 2 based on the quintile rank of the firm’s MarketEquity in the prior June. Other variables are defined as above. Panel A (B) presents models with (without) return controls. The table reports average coefficients and Newey-West (1987) standard errors with lags equal to twice the horizon of the dependent variable. The symbols **, *, and + denote significance at the 1%, 5%, and 10% levels, respectively. Panel A: Models with Return Controls Dependent Variable Ret[1,5] Ret[6,20] Ret[1,5] Ret[6,20] Ret[1,5] Ret[6,20] Imbalance Measure Mkt Mkt NmL NmL XL XL Imb[0] 0.141** 0.127** 0.107** 0.068** 0.021 0.028 (0.013) (0.029) (0.012) (0.019) (0.015) (0.024) Imb[0]*RevQuint -0.012* 0.003 0.012+ -0.001 0.002 0.008 (0.006) (0.012) (0.007) (0.013) (0.009) (0.017) Imb[0]*MEQuint -0.076** -0.028+ -0.100** -0.046** -0.010 -0.003 (0.008) (0.015) (0.007) (0.013) (0.008) (0.018) Ret[0]*RevQuint -0.009** 0.000 -0.011** -0.001 -0.003 0.000 (0.002) (0.002) (0.002) (0.002) (0.002) (0.003) RevQuint 0.014 0.031 0.023+ 0.051 0.018 0.047 (0.012) (0.036) (0.014) (0.040) (0.014) (0.041) Ret[0] -0.046** -0.005 -0.040** 0.002 -0.031** 0.006 (0.004) (0.007) (0.004) (0.007) (0.004) (0.006) Ret[-5,-1] -0.016** -0.002 -0.015** -0.002 -0.014** -0.002 (0.003) (0.006) (0.003) (0.006) (0.003) (0.006) Ret[-26,-6] -0.002 -0.005 -0.002 -0.005 -0.003 -0.007 (0.002) (0.005) (0.002) (0.005) (0.002) (0.005) Market Equity -0.056* -0.079 -0.050* -0.068 -0.044+ -0.032 (0.023) (0.076) (0.022) (0.075) (0.026) (0.081) Book-to-Market 0.095 0.244 0.129+ 0.336 0.121 0.361 (0.072) (0.241) (0.073) (0.244) (0.085) (0.251) Intercept 1.167** 2.084 1.047* 1.862 0.984* 1.364 (0.415) (1.448) (0.416) (1.453) (0.488) (1.591) Average R2 2.74% 2.49% 2.91% 2.57% 3.95% 3.60% Average N 2688 2680 2078 2073 1248 1246 50 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 51,
    "page_range": "p.51",
    "total_pages": 85,
    "chunk_index": 89,
    "word_count": 350,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.51)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "(0.026) (0.081) Book-to-Market 0.095 0.244 0.129+ 0.336 0.121 0.361 (0.072) (0.241) (0.073) (0.244) (0.085) (0.251) Intercept 1.167** 2.084 1.047* 1.862 0.984* 1.364 (0.415) (1.448) (0.416) (1.453) (0.488) (1.591) Average R2 2.74% 2.49% 2.91% 2.57% 3.95% 3.60% Average N 2688 2680 2078 2073 1248 1246 50 Electronic copy available at: https://ssrn.com/abstract=1668706 Table V: Predicting Returns Using Retail Order Imbalances and Return Reversals (continued) Panel B: Models without Return Controls Dependent Variable Ret[1,5] Ret[6,20] Ret[1,5] Ret[6,20] Ret[1,5] Ret[6,20] Imbalance Measure Mkt Mkt NmL NmL XL XL Imb[0] 0.143** 0.128** 0.148** 0.067** 0.086** 0.017 (0.015) (0.030) (0.014) (0.020) (0.016) (0.030) Imb[0]*RevQuint -0.017** 0.004 0.017** 0.002 0.004 0.014 (0.006) (0.012) (0.006) (0.014) (0.008) (0.017) Imb[0]*SizeQuint -0.063** -0.025 -0.109** -0.047** -0.030** 0.000 (0.007) (0.016) (0.008) (0.013) (0.009) (0.020) RevQuint 0.011 0.032 0.020 0.051 0.015 0.047 (0.013) (0.038) (0.014) (0.042) (0.014) (0.043) Market Equity -0.049* -0.072 -0.045* -0.064 -0.032 -0.025 (0.022) (0.076) (0.022) (0.075) (0.026) (0.080) Book-to-Market 0.093 0.221 0.124+ 0.306 0.118 0.335 (0.074) (0.247) (0.074) (0.251) (0.087) (0.262) Intercept 1.057* 1.988 0.965* 1.802 0.805+ 1.265 (0.414) (1.447) (0.417) (1.458) (0.489) (1.586) Average R2 1.31% 1.56% 1.39% 1.59% 1.88% 2.21% Average N 2688 2680 2078 2073 1249 1246 51 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 52,
    "page_range": "p.52-53",
    "total_pages": 85,
    "chunk_index": 90,
    "word_count": 198,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.52-53)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "(0.026) (0.080) Book-to-Market 0.093 0.221 0.124+ 0.306 0.118 0.335 (0.074) (0.247) (0.074) (0.251) (0.087) (0.262) Intercept 1.057* 1.988 0.965* 1.802 0.805+ 1.265 (0.414) (1.447) (0.417) (1.458) (0.489) (1.586) Average R2 1.31% 1.56% 1.39% 1.59% 1.88% 2.21% Average N 2688 2680 2078 2073 1249 1246 51 Electronic copy available at: https://ssrn.com/abstract=1668706 Table VI: Predicting Next-Day Retail Order Imbalances This table presents results from daily Fama-MacBeth (1973) regressions of day t + 1 retail imbalances based on market (Mkt), nonmarketable (NmL), or executed limit (XL) orders on prior imbalances (Imb), negativity (Neg), and returns (Ret). All variables are as defined above. Average coefficients and Newey-West (1987) standard errors with 60 lags appear in the table. The symbols **, *, and + denote significance at the 1%, 5%, and 10% level, respectively. Imbalance Variable Mkt Mkt NmL NmL XL XL Neg[0] (÷ 100) -0.344** -0.253** 0.000 -0.050 0.018 -0.016 (0.040) (0.025) (0.060) (0.051) (0.076) (0.062) Neg[-5,-1] (÷ 100) -0.342** -0.270** -0.106* -0.086* -0.046 -0.067 (0.048) (0.032) (0.051) (0.036) (0.051) (0.046) Neg[-26,-6] (÷ 100) -0.601** -0.425** -0.217* -0.135** 0.037 -0.054 (0.090) (0.059) (0.089) (0.051) (0.107) (0.082) Ret[0] (÷ 100) 0.352** 0.092** -0.849** -0.325** -0.569** 0.486** (0.049) (0.036) (0.098) (0.084) (0.077) (0.070) Ret[-5,-1] (÷ 100) -0.161** -0.211** -0.385** -0.184** -0.250** -0.020 (0.016) (0.010) (0.027) (0.016) (0.023) (0.017) Ret[-26,-6] (÷ 100) -0.077** -0.058** -0.113** -0.029** -0.082** 0.002 (0.011) (0.006) (0.013) (0.007) (0.010) (0.007) News[0] -0.001 -0.002 -0.003+ -0.004** 0.001 0.001 (0.001) (0.001) (0.002) (0.001) (0.002) (0.002) News[0]*Ret[0] (÷ 100) -0.333** -0.143** 0.342** 0.141* 0.180** -0.418** (0.026) (0.019) (0.067) (0.058) (0.061) (0.057) Imb[0] 0.144** 0.208** 0.171** (0.003) (0.004) (0.006) Imb[-5,-1] 0.190** 0.164** 0.138** (0.003) (0.003) (0.003) Imb[-26,-6] 0.225** 0.124** 0.111** (0.006) (0.007) (0.007) News[0]*Imb[0] 0.011** -0.020** -0.032** (0.002) (0.002) (0.003) Market Equity 0.000 0.003** -0.012** -0.005** -0.023** -0.013** (0.002) (0.001) (0.001) (0.001) (0.001) (0.001) Book-to-Market -0.045** -0.019** -0.015** -0.011** -0.029** -0.020** (0.005) (0.002) (0.004) (0.002) (0.006) (0.004) Intercept -0.058* -0.070** 0.151** 0.058** 0.364** 0.205** (0.025) (0.012) (0.013) (0.007) (0.018) (0.012) Average R2 0.97% 7.87% 1.56% 8.79% 2.33% 7.04% Average N 2645 2647 2015 2015 1186 1185 52 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 53,
    "page_range": "p.53",
    "total_pages": 85,
    "chunk_index": 91,
    "word_count": 345,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.53)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "(0.001) (0.001) Book-to-Market -0.045** -0.019** -0.015** -0.011** -0.029** -0.020** (0.005) (0.002) (0.004) (0.002) (0.006) (0.004) Intercept -0.058* -0.070** 0.151** 0.058** 0.364** 0.205** (0.025) (0.012) (0.013) (0.007) (0.018) (0.012) Average R2 0.97% 7.87% 1.56% 8.79% 2.33% 7.04% Average N 2645 2647 2015 2015 1186 1185 52 Electronic copy available at: https://ssrn.com/abstract=1668706 Table VII: Retail Order Imbalances and Intraday Returns This table summarizes intraday returns over various horizons for market (Mkt), nonmarketable limit (NmL), and executed limit orders (XL). The variable RetPreO is the return from the prior day closing quote midpoint to the midpoint of the best quote when the order is submitted. The variable RetPostO is the return from the midpoint of the best quote when the order is submitted to the midpoint of the current day’s closing quote. The variable RealizedSpread is the negative of the return from the assumed execution price to the midpoint of the current day’s closing quote. The variable EffectiveSpread is the half spread in percentage terms based on the best quote when the order is submitted. For market limit orders, it assumes execution at the quote; for executed limit orders, it assumes execution at the limit price. For each order type and stock-day, we take a weighted average of each return where the weights are the signed quantity of the order. We average across stocks for each day t and report the time series means and Newey-West (1987) standard errors with 2 lags appear. Numbers are in basis points. The symbols **, *, and + denote significance at the 1%, 5%, and 10% level, respectively. Mkt NmL XL RetPreO -1.216** -40.650** -45.795** (0.360) (0.567) (0.750) RetPostO 12.183** 10.170** -34.374** (0.316) (0.263) (0.563) RealizedSpread 6.247** 1.447** (0.188) (0.268) EffectiveSpread 18.404** -32.901** (0.379) (0.585) Average N 2469 1926 1130 53 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 54,
    "page_range": "p.54",
    "total_pages": 85,
    "chunk_index": 92,
    "word_count": 299,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.54)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "and + denote significance at the 1%, 5%, and 10% level, respectively. Mkt NmL XL RetPreO -1.216** -40.650** -45.795** (0.360) (0.567) (0.750) RetPostO 12.183** 10.170** -34.374** (0.316) (0.263) (0.563) RealizedSpread 6.247** 1.447** (0.188) (0.268) EffectiveSpread 18.404** -32.901** (0.379) (0.585) Average N 2469 1926 1130 53 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 55,
    "page_range": "p.55",
    "total_pages": 85,
    "chunk_index": 93,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.55)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "Table VIII: Predicting Returns Using Persistent Retail Order Imbalances This table presents results from daily Fama-MacBeth (1973) regressions of future returns on retail imbalances and interactions describing the expected persistence of Imb[0]. To estimate persistence, each day t we rank firms according to their market imbalance autocorrelation coefficients computed using their most recent 63 days of imbalances. The variable Persist equals -2, -1, 0, 1, or 2 corresponding to the quintile rank of the autocorrelation coefficient. In order to be ranked on day t, a firm must have daily imbalance data from at least 90% of the available trading days in the ranking period, and its autocorrelation coefficient must be between -1 and 1. All other firms have Persist set to 0 for that day. Other variables are defined as above. Average coefficients and Newey-West (1987) standard errors with lags equal to twice the horizon of the dependent variable appear in the table. The symbols **, *, and + denote significance at the 1%, 5%, and 10% level, respectively. Dependent Variable Ret[1,5] Ret[6,20] Ret[1,5] Ret[6,20] Ret[1,5] Ret[6,20] Imbalance measure Mkt Mkt NmL NmL XL XL Imb[0] 0.141** 0.125** 0.108** 0.067** 0.024 0.030 (0.013) (0.030) (0.012) (0.019) (0.015) (0.026) Persist -0.005 -0.008 -0.007 -0.005 -0.005 -0.003 (0.006) (0.017) (0.008) (0.021) (0.009) (0.025) Imb[0]* Persist 0.021** -0.003 0.012 0.002 0.012 0.000 (0.006) (0.014) (0.008) (0.013) (0.010) (0.015) Imb[0]*MEQuint -0.076** -0.028+ -0.100** -0.046** -0.010 -0.003 (0.008) (0.015) (0.007) (0.012) (0.008) (0.018) Ret[0]* Persist 0.001 -0.002 0.001 -0.001 0.001 -0.003 (0.182) (0.207) (0.198) (0.218) (0.242) (0.261) Ret[0] -0.045** -0.005 -0.040** 0.001 -0.029** 0.006 (0.410) (0.703) (0.406) (0.699) (0.448) (0.649) Ret[-5,-1] -0.016** -0.002 -0.016** -0.002 -0.014** -0.002 (0.300) (0.602) (0.306) (0.611) (0.328) (0.602) Ret[-26,-6] -0.002 -0.005 -0.002 -0.005 -0.003 -0.008 (0.171) (0.472) (0.177) (0.465) (0.180) (0.484) Market Equity -0.055* -0.077 -0.050* -0.070 -0.043+ -0.035 (0.023) (0.076) (0.022) (0.074) (0.026) (0.082) Book-to-Market 0.096 0.239 0.133+ 0.336 0.127 0.364 (0.073) (0.247) (0.075) (0.252) (0.085) (0.253) Intercept 1.159** 2.071 1.046* 1.889 0.977* 1.398 (0.414) (1.443) (0.413) (1.442) (0.490) (1.596) Average R2 2.54% 2.31% 2.68% 2.36% 3.73% 3.38% Average N 2688 2680 2078 2073 1248 1246 54 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 55,
    "page_range": "p.55",
    "total_pages": 85,
    "chunk_index": 94,
    "word_count": 353,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.55)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "(0.026) (0.082) Book-to-Market 0.096 0.239 0.133+ 0.336 0.127 0.364 (0.073) (0.247) (0.075) (0.252) (0.085) (0.253) Intercept 1.159** 2.071 1.046* 1.889 0.977* 1.398 (0.414) (1.443) (0.413) (1.442) (0.490) (1.596) Average R2 2.54% 2.31% 2.68% 2.36% 3.73% 3.38% Average N 2688 2680 2078 2073 1248 1246 54 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 56,
    "page_range": "p.56",
    "total_pages": 85,
    "chunk_index": 95,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.56)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "Table IX: Predicting Returns Using the Extent of Broker Internalization This table presents results from daily Fama-MacBeth (1973) regressions of future returns on retail order imbalances and interactions describing the extent to which brokers internalize order flow using data from a subset of brokers in the main dataset. For each stock-day and order type, the variable InternRatio is the ratio of flow internalized to flow routed to our market centers by this subset of brokers in the preceding month. We use this ratio to construct four variables. The variable IntDum is one when InternRatio is positive and zero otherwise. For observations with IntDum equal one, the variable IntQuint equals -2, -1, 0, 1, or 2 corresponding to the quintile rank of InternRatio for that month. For observations with IntDum equal zero, IntQuint is set to 0. Other variables are defined as above. The Imb[0] calculations require at least 2 orders of the corresponding order type, and each cross-sectional regression requires at least 100 observations. Average coefficients and Newey-West (1987) standard errors with lags equal to twice the horizon of the dependent variable appear in the table. The symbols **, *, and + denote significance at the 1%, 5%, and 10% level, respectively. Ret[1,5] Ret[6,20] Ret[1,5] Ret[6,20] Ret[1,5] Ret[6,20] Mkt Mkt NmL NmL XL XL Imb[0] 0.115** 0.072* 0.094** 0.114** 0.045** 0.105** (0.014) (0.032) (0.014) (0.028) (0.016) (0.033) Imb[0]*IntDum -0.048* 0.013 -0.046* -0.063 -0.058** -0.100* (0.021) (0.042) (0.020) (0.040) (0.020) (0.045) Imb[0]*IntQuint -0.015+ -0.030* -0.004 -0.034+ -0.007 -0.027 (0.008) (0.014) (0.009) (0.018) (0.010) (0.018) IntDum -0.066 -0.192 -0.135+ -0.332 -0.177* -0.439* (0.067) (0.195) (0.069) (0.203) (0.071) (0.208) IntQuint -0.004 -0.020 0.006 0.019 -0.008 -0.010 (0.014) (0.040) (0.015) (0.045) (0.016) (0.045) Imb[0]*MEQuint -0.032** -0.035** -0.059** -0.028* -0.010 -0.003 (0.005) (0.012) (0.007) (0.012) (0.008) (0.013) Ret[0] -0.048** -0.007 -0.044** -0.001 -0.038** 0.003 (0.004) (0.006) (0.004) (0.006) (0.005) (0.006) Ret[-5,-1] -0.017** -0.003 -0.017** -0.003 -0.015** -0.002 (0.003) (0.006) (0.003) (0.006) (0.003) (0.006) Ret[-26,-5] -0.002 -0.005 -0.003 -0.005 -0.003+ -0.007 (0.002) (0.004) (0.002) (0.004) (0.002) (0.005) Market Equity -0.049+ -0.072 -0.043 -0.055 -0.038 -0.026 (0.027) (0.090) (0.027) (0.090) (0.031) (0.099) Book-to-Market 0.085 0.271 0.121 0.390 0.099 0.398 (0.073) (0.236) (0.077) (0.251) (0.080) (0.249) Intercept 1.109* 2.120 1.037* 1.865 1.026* 1.552 (0.448) (1.561) (0.451) (1.582) (0.517) (1.732) Average R2 2.79% 2.66% 2.93% 2.71% 3.60% 3.45% Average N 2478 2470 1845 1840 1333 1330 55 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 56,
    "page_range": "p.56",
    "total_pages": 85,
    "chunk_index": 96,
    "word_count": 393,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.56)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "(0.031) (0.099) Book-to-Market 0.085 0.271 0.121 0.390 0.099 0.398 (0.073) (0.236) (0.077) (0.251) (0.080) (0.249) Intercept 1.109* 2.120 1.037* 1.865 1.026* 1.552 (0.448) (1.561) (0.451) (1.582) (0.517) (1.732) Average R2 2.79% 2.66% 2.93% 2.71% 3.60% 3.45% Average N 2478 2470 1845 1840 1333 1330 55 Electronic copy available at: https://ssrn.com/abstract=1668706 Table X: Distribution of Broker-Level Return Predictability Coefficients This table presents results from daily Fama-MacBeth (1973) regressions of Ret[1,5] on retail imbalances and control variables similar to those in Table II. Regressions are run separately for each anonymous broker-code in the data. The independent variable Imb[0] measures day t retail imbalance constructed from market (Mkt), nonmarketable limit (NmL), or executed limit (XL) orders and equals buys minus sells divided by buys plus sells. Buys and sells are measured in numbers of shares ordered from the broker’s clients. For each broker-day regression, we require at least 100 observations on stocks with at least two orders of the relevant order type (Mkt, NmL, or XL); and we require 100 days of regression coefficients for each broker. The table reports means, standard deviations, and percentiles of broker-level average coefficients on the variable Imbalance[0]. Imbalance Mean N Std Dev Pctl 5 Pctl 25 Pctl 50 Pctl 75 Pctl 95 Mkt 0.095 73 0.476 -0.060 0.006 0.043 0.076 0.129 NmL 0.070 32 0.062 -0.033 0.025 0.061 0.110 0.171 XL 0.032 24 0.038 -0.030 0.010 0.026 0.061 0.085 56 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 57,
    "page_range": "p.57-58",
    "total_pages": 85,
    "chunk_index": 97,
    "word_count": 238,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.57-58)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "variable Imbalance[0]. Imbalance Mean N Std Dev Pctl 5 Pctl 25 Pctl 50 Pctl 75 Pctl 95 Mkt 0.095 73 0.476 -0.060 0.006 0.043 0.076 0.129 NmL 0.070 32 0.062 -0.033 0.025 0.061 0.110 0.171 XL 0.032 24 0.038 -0.030 0.010 0.026 0.061 0.085 56 Electronic copy available at: https://ssrn.com/abstract=1668706 Table XI: Variation in Return Predictability Coefficients over Time This table shows how the one-week return predictability coefficient on daily retail imbalances depends on market returns over the past three years. The predictability coefficient comes from the first-stage Fama-MacBeth (1973) regressions from Table II of Ret[1,5] on daily retail imbalances and control variables. The daily imbalance variable measures day t retail imbalance constructed from market (Mkt), nonmarketable limit (NmL), or executed limit (XL) orders and equals buys minus sells divided by buys plus sells. We then regress the predictability coefficients on the lagged CRSP value-weighted market return over the past 36 months (MktRet3Yr) or the past 12 months (MktRet1Yr). Coefficients and Newey-West (1987) standard errors with 20 lags appear in the table. The symbols **, *, and + denote significance at the 1%, 5%, and 10% level, respectively. Imbalance Coefficient Mkt Mkt NmL NmL XL XL MktRet3Yr -0.093* -0.089* 0.066 (0.041) (0.042) (0.043) MktRet1Yr 0.061 0.211 0.179 (0.155) (0.130) (0.154) Intercept 0.231** 0.199** 0.217** 0.165** 0.011 0.002 (0.016) (0.026) (0.018) (0.024) (0.021) (0.024) Adj. R2 0.83% 0.00% 0.58% 0.42% 0.14% 0.14% N 1215 1215 1215 1215 1215 1215 57 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 58,
    "page_range": "p.58-59",
    "total_pages": 85,
    "chunk_index": 98,
    "word_count": 244,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.58-59)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "XL XL MktRet3Yr -0.093* -0.089* 0.066 (0.041) (0.042) (0.043) MktRet1Yr 0.061 0.211 0.179 (0.155) (0.130) (0.154) Intercept 0.231** 0.199** 0.217** 0.165** 0.011 0.002 (0.016) (0.026) (0.018) (0.024) (0.021) (0.024) Adj. R2 0.83% 0.00% 0.58% 0.42% 0.14% 0.14% N 1215 1215 1215 1215 1215 1215 57 Electronic copy available at: https://ssrn.com/abstract=1668706 Figure 1: Predicting Returns and News Negativity Using Retail Order Imbalances Each bar in the figure represents a standardized predictability coefficient on retail order imbalances on day [0] from a different regression. The dependent variable in the regression is either raw returns or news negativity during days [1,5] or [6,20]. The independent variable is daily imbalance based on retail market orders (MktImb), nonmarketable limit orders (NmLImb), or executed limit orders (XLImb). Imbalance is measured using shares bought minus shares sold divided by shares bought plus shares sold. A market order is one that executes regardless of price. A limit order is one that executes (i.e., is marketable) only if its limit price is met. We determine whether a limit order is marketable using best bid and ask quotes at the time of order submission. If the limit buy (sell) price is at least as high (low) as the current best ask (bid), the limit order is marketable. All orders that are not marketable are classified as nonmarketable orders, except that we exclude nonmarketable buy (sell) orders that are not within 25% of the best bid (ask). Regression coefficients are standardized by multiplying the coefficient by the 5th- to-95th percentile range for the independent variable and dividing by the 5th-to-95th percentile range of the daily version of the dependent variable. 58 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 59,
    "page_range": "p.59",
    "total_pages": 85,
    "chunk_index": 99,
    "word_count": 275,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.59)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "orders that are not within 25% of the best bid (ask). Regression coefficients are standardized by multiplying the coefficient by the 5th- to-95th percentile range for the independent variable and dividing by the 5th-to-95th percentile range of the daily version of the dependent variable. 58 Electronic copy available at: https://ssrn.com/abstract=1668706 Figure 2, Panel A: Intraday Returns Before and After Order Submission We plot cumulative intraday returns for market (Mkt), marketable limit (NmL), and executed limit (XL) orders described in Table VII as RetPreO and RetPostO. We normalize the cumulative return at the time of order submission to be equal to zero. 0.50% 0.40% 0.30% 0.20% 0.10% 0.00% -0.10% -0.20% -0.30% -0.40% Close[-1] Order Close[0] nruteR yadartnI evitalumuC NmL Mkt XL Intraday Time 59 Electronic copy available at: https://ssrn.com/abstract=1668706 Figure 2, Panel B: Alphas for Portfolios Based on Daily Retail Order Imbalances Each day t, we sort firms into deciles based on retail order imbalances using market (Mkt), non-marketable limit (NmL), or executed limit (XL) orders and form equal-weighted portfolios. For each event day from t-1 to t+5, we compute Fama-French (1993) 3-factor alphas for a spread portfolio that is long stocks from the highest imbalance decile and short stocks from the lowest imbalance decile. We compute cumulative alphas across event days and normalize the cumulative alpha after event day t (the formation day) to be equal to zero. 3.50% 3.00% 2.50% 2.00% 1.50% 1.00% 0.50% 0.00% -0.50% -1.00% -2 -1 0 1 2 3 4 5 ahplA evitalumuC NmL Mkt XL Event Day 60 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 60,
    "page_range": "p.60-61",
    "total_pages": 85,
    "chunk_index": 100,
    "word_count": 259,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.60-61)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "event days and normalize the cumulative alpha after event day t (the formation day) to be equal to zero. 3.50% 3.00% 2.50% 2.00% 1.50% 1.00% 0.50% 0.00% -0.50% -1.00% -2 -1 0 1 2 3 4 5 ahplA evitalumuC NmL Mkt XL Event Day 60 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 62,
    "page_range": "p.62",
    "total_pages": 85,
    "chunk_index": 101,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.62)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "Internet Appendix for “How Wise Are Crowds? Insights from Retail Orders and Stock Returns”* This appendix provides the following supplemental content: • Section I quantifies the degree of error in measuring the persistence in retail order imbalances in the regression model in Table VIII. • Table A.I presents robustness tests of the models in Table II, Panel A that include control variables for one-year return momentum, abnormal turnover, and idiosyncratic volatility. • Table A.II presents models similar to those in Table II that use imbalances to predict future raw returns over a number of additional horizons. • Table A.III presents models similar to those in Table II that use imbalances to predict future risk-adjusted returns over a number of additional horizons. • Table A.IV presents robustness test of the models in Table III in which the dependent variable is raw negativity and the sample is restricted to firms with news stories over the time period spanned by the dependent variable. • Table A.V presents models similar to those in Table III that use imbalances to predict future negativity over a number of additional horizons. • Table A.VI presents models similar to those in Table IV that use imbalances to predict analyst forecast errors over a number of additional horizons. * Citation format: Kelley, Eric K., and Paul C. Tetlock, 2012, Internet Appendix to “How wise are crowds? Insights from retail orders and stock returns,” Journal of Finance, forthcoming, http://www.afajof.org/IA/2012.asp. Please note: Wiley-Blackwell is not responsible for the content or functionality of any supporting information supplied by the authors. Any queries (other than missing material) should be directed to the authors of the article. 1 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 62,
    "page_range": "p.62",
    "total_pages": 85,
    "chunk_index": 102,
    "word_count": 279,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.62)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "retail orders and stock returns,” Journal of Finance, forthcoming, http://www.afajof.org/IA/2012.asp. Please note: Wiley-Blackwell is not responsible for the content or functionality of any supporting information supplied by the authors. Any queries (other than missing material) should be directed to the authors of the article. 1 Electronic copy available at: https://ssrn.com/abstract=1668706 • Table A.VII presents models that predict next-day retail imbalances using past returns, negativity, analyst forecast errors, and interactions with earnings announcement days. • Table A.VIII presents models similar to those in Table II, Panel A using the sample from Table IX. 2 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "References",
    "page_number": 63,
    "page_range": "p.63",
    "total_pages": 85,
    "chunk_index": 103,
    "word_count": 98,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.63)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "at: https://ssrn.com/abstract=1668706 • Table A.VII presents models that predict next-day retail imbalances using past returns, negativity, analyst forecast errors, and interactions with earnings announcement days. • Table A.VIII presents models similar to those in Table II, Panel A using the sample from Table IX. 2 Electronic copy available at: https://ssrn.com/abstract=1668706 A. Calibrating the True Persistence Process Let a firm’s true persistence be given by x and its measured persistence (m ) be given it it by: m = x +ε (A1) it it it For simplicity, we assume that measurement error (ε ) is independent over time and across firms. it We further assume that true persistence follows a first-order auto-regressive (AR(1)) process: x =ρx +ν (A2) it it−1 it where the innovation in persistence ν is independent over time and across firms. it To estimate the magnitude of measurement error in our autocorrelated flow regression, we need to know ρ, which is the AR(1) coefficient for true persistence. We can estimate ρ indirectly using regressions of measured persistence on lagged measured persistence. The regression coefficient of m on m is: it it-1 Cov(m ,m ) Cov(x ,x ) Var(x ) β = it it−1 = it it−1 =ρ it−1 (A3) 1 Var(m ) Var(m ) Var(m ) it−1 it−1 it−1 The regression coefficient of m on m is: it it-2 Cov(m ,m ) Cov(x ,x ) Var(x ) β = it it−2 = it it−2 =ρ2 it−2 (A4) 2 Var(m ) Var(m ) Var(m ) it−2 it−2 it−2 We assume that the m and x processes are homoskedastic, which allows us to solve for ρ using it it the ratio of the two coefficients above: β 2 =ρ (A5) β 1 We can now estimate the variance of true persistence (x) using: 3 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 64,
    "page_range": "p.64",
    "total_pages": 85,
    "chunk_index": 104,
    "word_count": 299,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.64)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "We assume that the m and x processes are homoskedastic, which allows us to solve for ρ using it it the ratio of the two coefficients above: β 2 =ρ (A5) β 1 We can now estimate the variance of true persistence (x) using: 3 Electronic copy available at: https://ssrn.com/abstract=1668706 β 1Var(m)=Var(x) (A6) ρ where Var(m) is the cross-sectional variance of measured persistence, which we can estimate. The variance in measurement error is simply the difference between the variances of measured and true persistence: β Var(m)−Var(x)=Var(m)− 1Var(m)=Var(ε) (A7) ρ The expectation of true persistence is the same as the expectation of measured persistence: E(m)= E(x) (A8) Lastly, we can infer the variance in the innovation in persistence (ν) from the AR(1) coefficient and the variance in true persistence: (1−ρ2)Var(x)=Var(ν) (A9) Using our estimates of Var(m), E(m), β , and β (0.1502, 0.0885, 0.132, 0.058), we obtain the 1 1 following values: E(x)=0.0885 (A10) ρ=0.439 (A11) Var(x)=0.00676 (A12) Var(ε)=0.01574 (A13) Var(ν)=0.005454 (A14) B. Imbalance and Return Processes Each firm’s imbalance (i ) follows an AR(1) process governed by the true persistence it parameter (x ): it 4 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 65,
    "page_range": "p.65-66",
    "total_pages": 85,
    "chunk_index": 105,
    "word_count": 191,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.65-66)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "0.0885, 0.132, 0.058), we obtain the 1 1 following values: E(x)=0.0885 (A10) ρ=0.439 (A11) Var(x)=0.00676 (A12) Var(ε)=0.01574 (A13) Var(ν)=0.005454 (A14) B. Imbalance and Return Processes Each firm’s imbalance (i ) follows an AR(1) process governed by the true persistence it parameter (x ): it 4 Electronic copy available at: https://ssrn.com/abstract=1668706 i = x i +δ (A15) it it−1it−1 it where δ is the innovation in imbalances. We ignore the mean of imbalances, which is it approximately zero. A firm’s returns are governed by a simplified version of our regression model, where all coefficients are zero except the direct coefficient on imbalances and the interaction coefficient between imbalances and persistence. That is, we assume that the empirical regression model used in Table VIII is correctly specified, except that true persistence appears instead of measured persistence: r =γi +γx i +η (A16) ik 1it 2 it it it where the k subscript captures the fact that returns are measured over an unspecified interval after period t. The only other minor difference is that Table VIII uses quintiles, whereas Equation (A16) uses a continuous variable for true persistence (x). The simulation procedure below accounts for this discrepancy. C. Simulation Details Equations (A1) to (A16) form the basis of the simulation. We assume that all random variables follow normal distributions. We set the initial values of the imbalance, persistence, and measured persistence variables equal to random numbers drawn from their steady state distributions. Returns in each period are determined by the regression in Equation (A16). The imbalance and true persistence variables evolve according to the laws of motion in Equations (A15) and (A2), while measured persistence satisfies Equation (A1) in each period. All simulation parameters are given in Equations (A10) through (A14), except that the variance in the innovation in imbalances is calibrated to match the empirical cross-sectional 5 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 66,
    "page_range": "p.66",
    "total_pages": 85,
    "chunk_index": 106,
    "word_count": 310,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.66)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "the laws of motion in Equations (A15) and (A2), while measured persistence satisfies Equation (A1) in each period. All simulation parameters are given in Equations (A10) through (A14), except that the variance in the innovation in imbalances is calibrated to match the empirical cross-sectional 5 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 67,
    "page_range": "p.67",
    "total_pages": 85,
    "chunk_index": 107,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.67)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "variance in imbalance, which is 0.5272. The variance in the disturbance term (η ) in the return it regression does not affect any of the regression coefficients so we set it close to zero to minimize the estimation error in the simulations. The only two undetermined parameters are the return predictability coefficients on imbalance and its interaction with true persistence (γ and γ ). To determine these two 1 2 coefficients, we estimate a simplified version of the empirical regression equation in Table VIII: r =bi +bQ(m )i +e (A17) ik 1it 2 it it it where Q(m ) is a variable equal to -2, -1, 0, +1, or +2 representing the quintiles of m in period t. it it The two estimated b and b coefficients are the measured counterparts of γ and γ . We run 1 2 1 2 simulations using different γ and γ values until we obtain estimates of b and b that match our 1 2 1 2 empirical estimates in Table VIII. For example, these estimates are 0.00142 and 0.000205 at the one-week return horizon in Table VIII. In each simulation, we use 2000 firms and 20 quarterly time periods, analogous to our data. We use Fama-MacBeth time series averages of the cross-sectional regression coefficients to estimate b and b . We evaluate this time series average across 100 simulations to ensure that our 1 2 estimates are precise. When we simulate the system using γ and γ values of 0.000816 and 1 2 0.00682, we obtain b and b values of 0.00142 and 0.000205, which matches the one-week 1 2 return predictability estimates in Table VIII. The last step is to use these γ and γ values to estimate the latent true counterpart to the 1 2 model in Table VIII in which we replace measured persistence with true persistence: r =ci +c Q(x )i +e (A18) ik 1it 2 it it it The values of c and c are the true regression coefficients of interest. When we use γ and γ that 1 2 1 2 produce (the one-week) b and b values of 0.00142 and 0.000205, the corresponding values of 1 2 6 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 67,
    "page_range": "p.67",
    "total_pages": 85,
    "chunk_index": 108,
    "word_count": 368,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.67)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "it it it The values of c and c are the true regression coefficients of interest. When we use γ and γ that 1 2 1 2 produce (the one-week) b and b values of 0.00142 and 0.000205, the corresponding values of 1 2 6 Electronic copy available at: https://ssrn.com/abstract=1668706 c and c are 0.00142 and 0.000373. 1 2 By comparing the b and c coefficients, we see that b = c , whereas b = (0.548)c < c 1 1 2 2 2 because of measurement error in persistence. We therefore employ a correction factor of 1 / 0.548 = 1.824 to increase the magnitude of our interaction coefficients and their standard errors in the one-week (days [1,5]) specification. We use an analogous procedure to adjust the magnitude of the return predictability coefficients on the interaction term in the days [6,20] specification, obtaining a correction factor of 1.822. This result strongly suggests that the same correction factor applies to all horizons, meaning that measurement error has a proportional impact on the interaction coefficients. 7 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 68,
    "page_range": "p.68-69",
    "total_pages": 85,
    "chunk_index": 109,
    "word_count": 180,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.68-69)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "the return predictability coefficients on the interaction term in the days [6,20] specification, obtaining a correction factor of 1.822. This result strongly suggests that the same correction factor applies to all horizons, meaning that measurement error has a proportional impact on the interaction coefficients. 7 Electronic copy available at: https://ssrn.com/abstract=1668706 Table A.I: Predicting Returns Using Retail Imbalances and Additional Control Variables This table presents results from daily Fama-MacBeth (1973) regressions of future returns on retail imbalances and control variables. The variable AbnTurnover is the ratio of share turnover on day t scaled by average daily share turnover computed over days t – 42 through t – 1. The variable ResidualVol is the residual standard deviation from the Fama-French (1993) 3-factor model estimated over days t – 257 through t – 27. All other variables are as defined in the paper. Average coefficients and Newey-West (1987) standard errors with lags equal to twice the horizon of the dependent variable appear in the table. The symbols **, *, and + denote significance at the 1%, 5%, and 10% level, respectively. Dependent Variable Ret[1,5] Ret[6,20] Ret[1,5] Ret[6,20] Ret[1,5] Ret[6,20] Imbalance measure Mkt Mkt NmL NmL XL XL Imb[0] 0.203* 0.150** 0.189** 0.110** 0.025+ 0.036 (0.012) (0.026) (0.012) (0.021) (0.015) (0.029) Ret[0] -0.052** -0.010 -0.048** -0.004 -0.036** -0.001 (0.004) (0.007) (0.004) (0.007) (0.004) (0.007) Ret[-5,-1] -0.017** -0.005 -0.017** -0.005 -0.015** -0.006 (0.003) (0.006) (0.003) (0.006) (0.003) (0.006) Ret[-26,-6] -0.003+ -0.006 -0.003+ -0.006 -0.003* -0.008+ (0.002) (0.005) (0.002) (0.004) (0.002) (0.005) Ret[-252,-27] 0.059 0.107 0.056 0.087 0.052 0.074 (0.051) (0.154) (0.052) (0.153) (0.052) (0.147) AbnTurnover 0.036** 0.027** 0.037** 0.030** 0.021* 0.032** (0.008) (0.008) (0.008) (0.009) (0.010) (0.011) ResidualVol -2.539 -6.304 -2.465 -5.866 -5.353+ -9.681 (3.120) (10.206) (2.956) (9.898) (3.194) (10.629) Market Equity -0.066** -0.113** -0.063** -0.105* -0.075** -0.095* (0.014) (0.042) (0.014) (0.043) (0.016) (0.045) Book-to-Market 0.085 0.247 0.125+ 0.347 0.109 0.356 (0.066) (0.211) (0.067) (0.216) (0.081) (0.233) Intercept 1.287** 2.515** 1.212** 2.346** 1.498** 2.300** (0.216) (0.696) (0.225) (0.732) (0.286) (0.847) Average R2 3.78% 3.64% 3.84% 3.62% 5.04% 4.78% Average N 2688 2679 2078 2073 1248 1246 8 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 69,
    "page_range": "p.69",
    "total_pages": 85,
    "chunk_index": 110,
    "word_count": 347,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.69)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "(0.016) (0.045) Book-to-Market 0.085 0.247 0.125+ 0.347 0.109 0.356 (0.066) (0.211) (0.067) (0.216) (0.081) (0.233) Intercept 1.287** 2.515** 1.212** 2.346** 1.498** 2.300** (0.216) (0.696) (0.225) (0.732) (0.286) (0.847) Average R2 3.78% 3.64% 3.84% 3.62% 5.04% 4.78% Average N 2688 2679 2078 2073 1248 1246 8 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 70,
    "page_range": "p.70",
    "total_pages": 85,
    "chunk_index": 111,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.70)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "Table A.II: Predicting Returns Using Retail Imbalances This table presents results from daily Fama-MacBeth (1973) regressions of future returns on retail imbalances and control variables. All variables are as defined above. Panel A, B, and C use Imb constructed with market (Mkt), nonmarketable limit (NmL), and executed limit (XL) orders, respectively. Average coefficients and Newey-West (1987) standard errors with lags equal to twice the horizon of the dependent variable appear in the table. The symbols **, *, and + denote significance at the 1%, 5%, and 10% level, respectively. Panel A: Market imbalances predicting returns Dependent Variable Ret[1] Ret[2,5] Ret[6,10] Ret[11,20] Ret[21,40] Ret[41,60] Ret[61,120] Ret[121,240] Imbalance measure Mkt Mkt Mkt Mkt Mkt Mkt Mkt Mkt Imb [0] 0.098** 0.108** 0.071** 0.080** 0.068* 0.026 0.017 0.116 (0.004) (0.010) (0.012) (0.019) (0.027) (0.024) (0.052) (0.119) Ret[0] -0.013** -0.030** -0.004 0.000 -0.003 0.002 0.021+ 0.057** (0.002) (0.004) (0.003) (0.005) (0.008) (0.006) (0.012) (0.014) Ret[-5,-1] -0.007** -0.009** -0.001 -0.001 -0.002 -0.004 0.020* 0.040* (0.001) (0.002) (0.003) (0.004) (0.008) (0.006) (0.010) (0.017) Ret[-26,-6] 0.000 -0.002 -0.002 -0.003 -0.003 -0.001 0.015+ 0.035 (0.000) (0.001) (0.002) (0.003) (0.006) (0.006) (0.008) (0.022) Market Equity -0.016** -0.036* -0.029 -0.045 -0.081 -0.042 0.017 0.563+ (0.004) (0.017) (0.020) (0.047) (0.111) (0.104) (0.314) (0.292) Book-to-Market 0.032* 0.065 0.058 0.176 0.358 0.382 1.712* 2.336 (0.015) (0.057) (0.069) (0.155) (0.360) (0.321) (0.798) (1.536) Intercept 0.309** 0.812* 0.763* 1.258 2.419 1.574 1.928 -7.203 (0.069) (0.315) (0.372) (0.887) (2.069) (1.924) (5.618) (6.506) Average R2 2.18% 2.15% 1.97% 2.05% 2.26% 2.18% 2.45% 2.10% Average N 2691 2689 2686 2681 2668 2655 2615 2531 9 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 70,
    "page_range": "p.70",
    "total_pages": 85,
    "chunk_index": 112,
    "word_count": 262,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.70)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "(0.057) (0.069) (0.155) (0.360) (0.321) (0.798) (1.536) Intercept 0.309** 0.812* 0.763* 1.258 2.419 1.574 1.928 -7.203 (0.069) (0.315) (0.372) (0.887) (2.069) (1.924) (5.618) (6.506) Average R2 2.18% 2.15% 1.97% 2.05% 2.26% 2.18% 2.45% 2.10% Average N 2691 2689 2686 2681 2668 2655 2615 2531 9 Electronic copy available at: https://ssrn.com/abstract=1668706 Table A.II: Predicting Returns Using Retail Imbalances (continued) Panel B: Nonmarketable imbalances predicting returns Dependent Variable Ret[1] Ret[2,5] Ret[6,10] Ret[11,20] Ret[21,40] Ret[41,60] Ret[61,120] Ret[121,240] Imbalance measure NmL NmL NmL NmL NmL NmL NmL NmL Imb[0] 0.088** 0.108** 0.066** 0.040* 0.015 -0.004 0.059 0.232 (0.005) (0.011) (0.012) (0.016) (0.022) (0.028) (0.075) (0.170) Ret[0] -0.013** -0.027** -0.002 0.003 -0.001 0.002 0.024* 0.057** (0.002) (0.004) (0.003) (0.005) (0.008) (0.006) (0.012) (0.015) Ret[-5,-1] -0.007** -0.009** -0.001 0.000 -0.001 -0.005 0.022* 0.035* (0.001) (0.002) (0.003) (0.004) (0.008) (0.006) (0.009) (0.016) Ret[-26,-6] 0.000 -0.002 -0.002 -0.002 -0.003 -0.001 0.015+ 0.031 (0.000) (0.001) (0.002) (0.003) (0.006) (0.006) (0.008) (0.022) Market Equity -0.014** -0.034* -0.025 -0.043 -0.079 -0.039 0.018 0.576* (0.004) (0.017) (0.019) (0.046) (0.109) (0.104) (0.309) (0.282) Book-to-Market 0.044** 0.091 0.108 0.227 0.513 0.479 1.957** 3.080+ (0.015) (0.059) (0.071) (0.161) (0.363) (0.332) (0.735) (1.573) Intercept 0.270** 0.758* 0.675+ 1.176 2.291 1.473 1.744 -7.774 (0.069) (0.314) (0.370) (0.891) (2.071) (1.957) (5.659) (6.555) Average R2 2.29% 2.23% 2.03% 2.08% 2.25% 2.21% 2.46% 2.22% Average N 2080 2079 2077 2074 2065 2057 2026 1959 10 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 71,
    "page_range": "p.71-72",
    "total_pages": 85,
    "chunk_index": 113,
    "word_count": 230,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.71-72)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "(0.059) (0.071) (0.161) (0.363) (0.332) (0.735) (1.573) Intercept 0.270** 0.758* 0.675+ 1.176 2.291 1.473 1.744 -7.774 (0.069) (0.314) (0.370) (0.891) (2.071) (1.957) (5.659) (6.555) Average R2 2.29% 2.23% 2.03% 2.08% 2.25% 2.21% 2.46% 2.22% Average N 2080 2079 2077 2074 2065 2057 2026 1959 10 Electronic copy available at: https://ssrn.com/abstract=1668706 Table A.II: Predicting Returns Using Retail Imbalances (continued) Panel C: Executed limit imbalances predicting returns Dependent Variable Ret[1] Ret[2,5] Ret[6,10] Ret[11,20] Ret[21,40] Ret[41,60] Ret[61,120] Ret[121,240] Imbalance measure XL XL XL XL XL XL XL XL Imb[0] -0.021** 0.050** 0.041** -0.008 -0.013 -0.047 -0.043 0.053 (0.007) (0.014) (0.016) (0.022) (0.034) (0.040) (0.084) (0.098) Ret[0] -0.006** -0.024** 0.002 0.004 0.002 -0.004 0.022+ 0.059** (0.002) (0.004) (0.003) (0.005) (0.007) (0.007) (0.012) (0.016) Ret[-5,-1] -0.007** -0.006* 0.000 0.000 -0.001 -0.009 0.024* 0.035+ (0.001) (0.003) (0.003) (0.004) (0.008) (0.006) (0.009) (0.019) Ret[-26,-6] 0.000 -0.002 -0.003+ -0.004 -0.005 -0.002 0.017* 0.029 (0.000) (0.001) (0.002) (0.003) (0.006) (0.006) (0.008) (0.022) Market Equity -0.018** -0.024 -0.018 -0.014 -0.034 0.014 0.210 0.873** (0.005) (0.020) (0.022) (0.052) (0.119) (0.111) (0.311) (0.271) Book-to-Market 0.032+ 0.096 0.128 0.235 0.601 0.496 2.223* 3.108+ (0.019) (0.068) (0.079) (0.169) (0.393) (0.379) (0.884) (1.639) Intercept 0.344** 0.625+ 0.589 0.770 1.648 0.698 -1.192 -12.607* (0.088) (0.375) (0.437) (1.005) (2.291) (2.122) (5.754) (6.292) Average R2 3.24% 3.14% 2.89% 2.93% 3.13% 3.12% 3.18% 2.98% Average N 1249 1248 1248 1246 1242 1237 1221 1184 11 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 72,
    "page_range": "p.72-73",
    "total_pages": 85,
    "chunk_index": 114,
    "word_count": 231,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.72-73)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "(0.068) (0.079) (0.169) (0.393) (0.379) (0.884) (1.639) Intercept 0.344** 0.625+ 0.589 0.770 1.648 0.698 -1.192 -12.607* (0.088) (0.375) (0.437) (1.005) (2.291) (2.122) (5.754) (6.292) Average R2 3.24% 3.14% 2.89% 2.93% 3.13% 3.12% 3.18% 2.98% Average N 1249 1248 1248 1246 1242 1237 1221 1184 11 Electronic copy available at: https://ssrn.com/abstract=1668706 Table A.III: Predicting Risk-Adjusted Returns Using Retail Order Imbalances This table presents results from daily Fama-MacBeth (1973) regressions of future risk-adjusted returns on retail imbalances and control variables. The variable CAR[x,y] is abnormal return summed from days t + x through t + y where each day’s abnormal return is based on loadings from the Fama-French (1993) 3-factor model estimated over days t – 257 through t – 27 and contemporaneous factor realizations. All other variables are as defined above. Panels A, B, and C use Imb constructed from market (Mkt), nonmarketable limit (NmL), and executed limit (XL) order, respectively. Average coefficients and Newey- West (1987) standard errors with lags equal to twice the horizon of the dependent variable appear in the table. The symbols **, *, and + denote significance at the 1%, 5%, and 10% level, respectively. Panel A: Market imbalances predicting risk-adjusted returns Dependent variable CAR[1] CAR[2,5] CAR[6,10] CAR[11,20] CAR[21,40] CAR[41,60] CAR[61,120] CAR[121,240] Imbalance measure Mkt Mkt Mkt Mkt Mkt Mkt Mkt Mkt Imb[0] 0.097** 0.105** 0.068** 0.085** 0.072* 0.022 -0.012 0.062 (0.004) (0.010) (0.012) (0.020) (0.034) (0.036) (0.148) (0.265) Ret[0] -1.453** -2.859** -0.330 0.004 -0.125 0.426 2.767* 5.365* (0.191) (0.335) (0.301) (0.428) (0.694) (0.620) (1.343) (2.122) Ret[-5,-1] -0.653** -0.729** -0.153 0.136 0.001 0.037 2.478* 3.952* (0.083) (0.218) (0.252) (0.375) (0.710) (0.621) (1.203) (1.968) Ret[-26,-6] -0.048 -0.194 -0.179 -0.230 -0.343 -0.259 1.404 1.484 (0.038) (0.124) (0.138) (0.292) (0.564) (0.595) (1.048) (2.088) Market Equity 0.000 0.026 0.045* 0.100* 0.209 0.257* 0.894* 2.374** (0.004) (0.017) (0.020) (0.049) (0.115) (0.110) (0.364) (0.747) Book-to-Market 0.022 0.025 0.017 0.053 0.004 0.051 0.297 -1.253 (0.012) (0.046) (0.054) (0.115) (0.237) (0.232) (0.762) (1.255) Intercept -0.005 -0.408 -0.711* -1.576* -3.22 -3.985* -14.007** -36.333** (0.055) (0.251) (0.296) (0.725) (1.674) (1.593) (5.120) (11.425) Average R2 1.81% 1.83% 1.71% 1.91% 2.28% 2.24% 3.00% 3.96% Average N 2692 2689 2686 2681 2669 2656 2615 2531 12 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 73,
    "page_range": "p.73",
    "total_pages": 85,
    "chunk_index": 115,
    "word_count": 362,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.73)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "(0.046) (0.054) (0.115) (0.237) (0.232) (0.762) (1.255) Intercept -0.005 -0.408 -0.711* -1.576* -3.22 -3.985* -14.007** -36.333** (0.055) (0.251) (0.296) (0.725) (1.674) (1.593) (5.120) (11.425) Average R2 1.81% 1.83% 1.71% 1.91% 2.28% 2.24% 3.00% 3.96% Average N 2692 2689 2686 2681 2669 2656 2615 2531 12 Electronic copy available at: https://ssrn.com/abstract=1668706 Table A.III: Predicting Risk-Adjusted Returns Using Retail Order Imbalances (continued) Panel B: Nonmarketable imbalance predicting risk-adjusted returns Dependent variable CAR[1] CAR[2,5] CAR[6,10] CAR[11,20] CAR[21,40] CAR[41,60] CAR[61,120] CAR[121,240] Imbalance measure NmL NmL NmL NmL NmL NmL NmL NmL Imb[0] 0.092** 0.127** 0.091** 0.110** 0.135** 0.116** 0.351** 0.733** (0.005) (0.012) (0.012) (0.017) (0.031) (0.039) (0.128) (0.248) Ret[0] -1.395** -2.587** -0.090 0.341 0.037 0.432 3.015* 5.587* (0.188) (0.332) (0.301) (0.432) (0.704) (0.646) (1.415) (2.628) Ret[-5,-1] -0.661** -0.751** -0.152 0.176 0.039 -0.053 2.436* 3.136 (0.085) (0.223) (0.259) (0.382) (0.690) (0.635) (1.086) (2.128) Ret[-26,-6] -0.050 -0.206 -0.202 -0.290 -0.446 -0.470 0.966 0.341 (0.040) (0.129) (0.139) (0.290) (0.561) (0.573) (1.092) (2.186) Market Equity 0.0030 0.028 0.049* 0.105* 0.216 0.261* 0.901* 2.403** (0.004) (0.017) (0.020) (0.051) (0.117) (0.112) (0.373) (0.739) Book-to-Market 0.028* 0.031 0.042 0.052 0.065 0.057 0.221 -1.026 (0.013) (0.049) (0.058) (0.122) (0.238) (0.238) (0.752) (1.217) Intercept -0.063 -0.477 -0.804** -1.718* -3.433* -4.150** -14.379** -37.371** (0.058) (0.258) (0.310) (0.760) (1.749) (1.662) (5.391) (11.524) Average R2 1.95% 1.98% 1.86% 2.03% 2.35% 2.33% 3.08% 4.02% Average N 2080 2079 2077 2074 2066 2057 2026 1959 13 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 74,
    "page_range": "p.74-75",
    "total_pages": 85,
    "chunk_index": 116,
    "word_count": 233,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.74-75)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "(0.049) (0.058) (0.122) (0.238) (0.238) (0.752) (1.217) Intercept -0.063 -0.477 -0.804** -1.718* -3.433* -4.150** -14.379** -37.371** (0.058) (0.258) (0.310) (0.760) (1.749) (1.662) (5.391) (11.524) Average R2 1.95% 1.98% 1.86% 2.03% 2.35% 2.33% 3.08% 4.02% Average N 2080 2079 2077 2074 2066 2057 2026 1959 13 Electronic copy available at: https://ssrn.com/abstract=1668706 Table A.III: Predicting Risk-Adjusted Returns Using Retail Order Imbalances (continued) Panel C: Executed limit imbalance predicting risk-adjusted returns Dependent variable CAR[1] CAR[2,5] CAR[6,10] CAR[11,20] CAR[21,40] CAR[41,60] CAR[61,120] CAR[121,240] Imbalance measure XL XL XL XL XL XL XL XL Imb[0] -0.018** 0.056** 0.047** 0.034 0.059 0.025 0.095 0.324* (0.007) (0.014) (0.016) (0.025) (0.043) (0.046) (0.143) (0.155) Ret[0] -0.670** -2.166** 0.492 0.800+ 1.412* 0.857 5.291** 11.14** (0.223) (0.367) (0.329) (0.448) (0.720) (0.765) (1.685) (3.175) Ret[-5,-1] -0.691** -0.485+ -0.056 0.346 0.501 -0.039 3.484** 5.705** (0.096) (0.253) (0.285) (0.398) (0.709) (0.707) (1.068) (2.158) Ret[-26,-6] -0.056 -0.281* -0.315* -0.487 -0.570 -0.630 1.007 -0.640 (0.045) (0.138) (0.154) (0.316) (0.593) (0.589) (1.173) (2.427) Market Equity 0.006 0.066** 0.089** 0.202** 0.406** 0.450** 1.467** 3.345** (0.004) (0.018) (0.021) (0.050) (0.112) (0.106) (0.375) (0.849) Book-to-Market 0.023 0.057 0.097 0.129 0.235 0.158 0.678 -0.568 (0.017) (0.058) (0.066) (0.134) (0.265) (0.264) (0.885) (1.147) Intercept -0.107 -1.099** -1.484** -3.311** -6.559** -7.27** -23.804** -53.458** (0.066) (0.275) (0.323) (0.769) (1.731) (1.643) (5.717) (13.745) Average R2 2.85% 2.76% 2.61% 2.78% 3.11% 3.13% 4.16% 5.79% Average N 1249 1249 1248 1246 1242 1237 1221 1190 14 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 75,
    "page_range": "p.75-76",
    "total_pages": 85,
    "chunk_index": 117,
    "word_count": 234,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.75-76)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "(0.058) (0.066) (0.134) (0.265) (0.264) (0.885) (1.147) Intercept -0.107 -1.099** -1.484** -3.311** -6.559** -7.27** -23.804** -53.458** (0.066) (0.275) (0.323) (0.769) (1.731) (1.643) (5.717) (13.745) Average R2 2.85% 2.76% 2.61% 2.78% 3.11% 3.13% 4.16% 5.79% Average N 1249 1249 1248 1246 1242 1237 1221 1190 14 Electronic copy available at: https://ssrn.com/abstract=1668706 Table A.IV: Predicting Raw Negativity Using Retail Order Imbalances This table presents results from daily Fama-MacBeth (1973) regressions of future raw negativity on retail imbalances and control variables. The dependent variable RawNeg[x,y] is the percentage of words in Dow Jones news stories from day t + x through day t + y that appear in the list of Harvard-IV negative words (RawH4Neg) and the percentage that appear in the list of financial negative words of Loughran and McDonald (2011), using weights of (1/3) and (2/3), respectively. This variable is only constructed for stocks with news coverage during the [x,y] window. Other variables are as defined above. Average coefficients and Newey-West (1987) standard errors with lags equal to twice the horizon of the dependent variable appear in the table. The symbols **, *, and + denote significance at the 1%, 5%, and 10% level, respectively. Dependent Variable RawNeg[1,5] RawNeg[6,20] RawNeg[1,5] RawNeg[6,20] RawNeg[1,5] RawNeg[6,20] Imbalance Measure Mkt Mkt NmL NmL XL XL Imb[0] -0.008+ -0.011** 0.001 0.002 0.002 0.004 (0.005) (0.004) (0.006) (0.004) (0.006) (0.005) RawNeg[0] 0.065** 0.032** 0.062** 0.029** 0.059** 0.027** (0.002) (0.001) (0.002) (0.001) (0.002) (0.001) RawNeg[-5,-1] 0.123** 0.084** 0.124** 0.084** 0.123** 0.083** (0.003) (0.003) (0.003) (0.003) (0.003) (0.003) RawNeg[-26,-6] 0.330** 0.331** 0.337** 0.339** 0.353** 0.354** (0.007) (0.009) (0.007) (0.010) (0.007) (0.010) Ret[0] (÷ 100) -0.534** -0.172** -0.510** -0.171** -0.563** -0.132** (0.078) (0.048) (0.078) (0.046) (0.082) (0.049) Ret[-5,-1] (÷ 100) -0.247** -0.127** -0.249** -0.140** -0.283** -0.149** (0.045) (0.033) (0.046) (0.032) (0.049) (0.035) Ret[-26,-6] (÷ 100) -0.081** -0.074** -0.092** -0.069* -0.126** -0.081** (0.023) (0.028) (0.024) (0.028) (0.027) (0.031) Market Equity 0.082** 0.065** 0.079** 0.063** 0.071** 0.060** (0.003) (0.003) (0.003) (0.003) (0.003) (0.003) Book-to-Market 0.002 0.002 0.013 0.006 0.028+ 0.004 (0.013) (0.015) (0.013) (0.014) (0.016) (0.017) Intercept -1.148** -0.893** -1.098** -0.856** -1.003** -0.831** (0.046) (0.042) (0.043) (0.040) (0.048) (0.045) Average R2 14.69% 20.63% 15.49% 21.91% 16.42% 23.92% Average N 545 604 440 486 325 354 15 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 76,
    "page_range": "p.76",
    "total_pages": 85,
    "chunk_index": 118,
    "word_count": 369,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.76)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "(0.003) (0.003) Book-to-Market 0.002 0.002 0.013 0.006 0.028+ 0.004 (0.013) (0.015) (0.013) (0.014) (0.016) (0.017) Intercept -1.148** -0.893** -1.098** -0.856** -1.003** -0.831** (0.046) (0.042) (0.043) (0.040) (0.048) (0.045) Average R2 14.69% 20.63% 15.49% 21.91% 16.42% 23.92% Average N 545 604 440 486 325 354 15 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 77,
    "page_range": "p.77",
    "total_pages": 85,
    "chunk_index": 119,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.77)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "Table A.V: Predicting Negativity Using Retail Order Imbalances This table presents results from daily Fama-MacBeth (1973) regressions of future negativity on retail imbalances (Imb[0]) and control variables. The dependent variable Neg[x,y] is the percentage of words in Dow Jones news stories from day t + x through day t + y that appear in the list of Harvard-IV negative words (RawH4Neg) and the percentage that appear in the list of financial negative words of Loughran and McDonald (2011), using weights of (1/3) and (2/3), respectively. This variable is constructed to have a zero mean and to be zero for stocks with no news coverage. Other variables are as defined above. Panels A, B, and C use market (Mkt), nonmarketable limit (NmL), and executed limit (XL) order imbalances, respectively. Average coefficients and Newey-West (1987) standard errors with lags equal to twice the horizon of the dependent variable appear in the table. The symbols **, *, and + denote significance at the 1%, 5%, and 10% level, respectively. Panel A: Market imbalance predicting negativity Dependent Variable Neg[1] Neg[2,5] Neg[6,10] Neg[11,20] Neg[21,40] Neg[41,60] Neg[61,120] Neg[121,240] Imbalance Measure Mkt Mkt Mkt Mkt Mkt Mkt Mkt Mkt Imbalance[0] -0.010** -0.007** -0.008** -0.007** -0.007** -0.004* -0.006** -0.004** (0.001) (0.002) (0.002) (0.002) (0.002) (0.002) (0.001) (0.002) Neg[0] 0.086** 0.070** 0.058** 0.045** 0.037** 0.030** 0.031** 0.029** (0.002) (0.002) (0.002) (0.001) (0.001) (0.001) (0.001) (0.001) Neg[-5,-1] 0.058** 0.086** 0.085** 0.083** 0.075** 0.073** 0.066** 0.062** (0.001) (0.002) (0.002) (0.002) (0.002) (0.002) (0.002) (0.001) Neg[-26,-6] 0.083** 0.167** 0.184** 0.222** 0.244** 0.296** 0.249** 0.231** (0.002) (0.005) (0.006) (0.009) (0.010) (0.012) (0.012) (0.013) Ret[0] (÷ 100) -0.128** -0.051+ -0.087** 0.009 -0.088** -0.041+ -0.128** -0.106** (0.026) (0.028) (0.027) (0.024) (0.021) (0.021) (0.022) (0.028) Ret[-5,-1] (÷ 100) -0.035** -0.067** -0.021 -0.011 -0.069** -0.019 -0.101** -0.081** (0.010) (0.018) (0.022) (0.023) (0.023) (0.019) (0.026) (0.031) Ret[-26,-6] (÷ 100) -0.015** -0.011 -0.004 -0.031* -0.036* -0.029+ -0.084** -0.070** (0.005) (0.012) (0.014) (0.015) (0.018) (0.017) (0.022) (0.025) Market Equity 0.065** 0.071** 0.068** 0.054** 0.045** 0.043** 0.037** 0.041** (0.001) (0.002) (0.003) (0.003) (0.003) (0.003) (0.003) (0.003) Book-to-Market 0.029** 0.034** 0.029** 0.015 0.013 0.016 0.058** 0.068** (0.003) (0.006) (0.007) (0.010) (0.012) (0.010) (0.011) (0.016) Intercept -0.897** -0.971** -0.935** -0.746** -0.612** -0.59** -0.524** -0.587** (0.020) (0.034) (0.037) (0.040) (0.045) (0.045) (0.041) (0.052) Average R2 4.03% 5.22% 5.45% 6.83% 10.40% 13.63% 20.07% 21.47% Average N 2691 2691 2691 2691 2691 2691 2691 2691 16 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 77,
    "page_range": "p.77",
    "total_pages": 85,
    "chunk_index": 120,
    "word_count": 395,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.77)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "(0.006) (0.007) (0.010) (0.012) (0.010) (0.011) (0.016) Intercept -0.897** -0.971** -0.935** -0.746** -0.612** -0.59** -0.524** -0.587** (0.020) (0.034) (0.037) (0.040) (0.045) (0.045) (0.041) (0.052) Average R2 4.03% 5.22% 5.45% 6.83% 10.40% 13.63% 20.07% 21.47% Average N 2691 2691 2691 2691 2691 2691 2691 2691 16 Electronic copy available at: https://ssrn.com/abstract=1668706 Table A.V: Predicting Negativity Using Retail Order Imbalances (continued) Panel B: Nonmarketable imbalance predicting negativity Dependent Variable Neg[1] Neg[2,5] Neg[6,10] Neg[11,20] Neg[21,40] Neg[41,60] Neg[61,120] Neg[121,240] Imbalance Measure NmL NmL NmL NmL NmL NmL NmL NmL Imbalance[0] -0.002+ 0.003 -0.001 0.000 -0.001 0.000 -0.001 -0.001 (0.001) (0.002) (0.002) (0.002) (0.002) (0.002) (0.001) (0.002) Neg[0] 0.084** 0.067** 0.055** 0.042** 0.033** 0.028** 0.028** 0.026** (0.002) (0.002) (0.002) (0.001) (0.001) (0.001) (0.001) (0.001) Neg[-5,-1] 0.061** 0.090** 0.087** 0.083** 0.074** 0.073** 0.067** 0.062** (0.002) (0.002) (0.002) (0.002) (0.002) (0.002) (0.002) (0.002) Neg[-26,-6] 0.087** 0.172** 0.189** 0.230** 0.254** 0.303** 0.259** 0.240** (0.002) (0.005) (0.006) (0.009) (0.010) (0.011) (0.012) (0.014) Ret[0] (÷ 100) -0.167** -0.084** -0.116** -0.024 -0.104** -0.059** -0.133** -0.107** (0.026) (0.027) (0.027) (0.021) (0.021) (0.021) (0.020) (0.023) Ret[-5,-1] (÷ 100) -0.044** -0.078** -0.025 -0.025 -0.070** -0.020 -0.098** -0.076** (0.011) (0.018) (0.021) (0.023) (0.022) (0.020) (0.025) (0.027) Ret[-26,-6] (÷ 100) -0.021** -0.013 -0.010 -0.031* -0.038* -0.029+ -0.076** -0.062* (0.006) (0.011) (0.013) (0.015) (0.018) (0.016) (0.022) (0.024) Market Equity 0.065** 0.070** 0.067** 0.055** 0.045** 0.043** 0.038** 0.043** (0.001) (0.002) (0.002) (0.003) (0.003) (0.003) (0.003) (0.003) Book-to-Market 0.047** 0.043** 0.038** 0.015 0.010 0.013 0.041** 0.053** (0.003) (0.007) (0.008) (0.010) (0.013) (0.011) (0.015) (0.017) Intercept -0.884** -0.954** -0.919** -0.744** -0.611** -0.590** -0.523** -0.594** (0.019) (0.032) (0.035) (0.040) (0.043) (0.043) (0.039) (0.051) Average R2 4.30% 5.80% 6.03% 7.64% 11.55% 14.66% 21.52% 23.09% Average N 2080 2080 2080 2080 2080 2080 2080 2080 17 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 78,
    "page_range": "p.78",
    "total_pages": 85,
    "chunk_index": 121,
    "word_count": 288,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.78)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "(0.007) (0.008) (0.010) (0.013) (0.011) (0.015) (0.017) Intercept -0.884** -0.954** -0.919** -0.744** -0.611** -0.590** -0.523** -0.594** (0.019) (0.032) (0.035) (0.040) (0.043) (0.043) (0.039) (0.051) Average R2 4.30% 5.80% 6.03% 7.64% 11.55% 14.66% 21.52% 23.09% Average N 2080 2080 2080 2080 2080 2080 2080 2080 17 Electronic copy available at: https://ssrn.com/abstract=1668706 Table A.V: Predicting Negativity Using Retail Order Imbalances (continued) Panel C: Executed limit imbalance predicting negativity Dependent Variable Neg[1] Neg[2,5] Neg[6,10] Neg[11,20] Neg[21,40] Neg[41,60] Neg[61,120] Neg[121,240] Imbalance Measure XL XL XL XL XL XL XL XL Imbalance[0] 0.001 0.011** 0.007* 0.006** 0.004* 0.003+ 0.003+ 0.004+ (0.002) (0.002) (0.003) (0.002) (0.002) (0.002) (0.002) (0.002) Neg[0] 0.082** 0.063** 0.052** 0.038** 0.030** 0.025** 0.025** 0.023** (0.002) (0.002) (0.002) (0.001) (0.001) (0.001) (0.001) (0.001) Neg[-5,-1] 0.065** 0.093** 0.089** 0.081** 0.072** 0.069** 0.064** 0.059** (0.002) (0.003) (0.003) (0.002) (0.002) (0.002) (0.002) (0.002) Neg[-26,-6] 0.102** 0.196** 0.212** 0.254** 0.277** 0.320** 0.276** 0.256** (0.002) (0.006) (0.006) (0.010) (0.011) (0.011) (0.012) (0.013) Ret[0] (÷ 100) -0.164** -0.042 -0.091** 0.008 -0.063** -0.022 -0.104** -0.070* (0.032) (0.033) (0.032) (0.029) (0.022) (0.024) (0.023) (0.027) Ret[-5,-1] (÷ 100) -0.038** -0.077** -0.022 -0.022 -0.067** -0.011 -0.081** -0.059* (0.013) (0.022) (0.025) (0.024) (0.023) (0.023) (0.024) (0.026) Ret[-26,-6] (÷ 100) -0.018** -0.018 -0.010 -0.031+ -0.039* -0.018 -0.065** -0.050* (0.007) (0.013) (0.015) (0.017) (0.018) (0.017) (0.022) (0.025) Market Equity 0.070** 0.073** 0.070** 0.056** 0.047** 0.046** 0.040** 0.046** (0.001) (0.002) (0.003) (0.003) (0.003) (0.003) (0.003) (0.004) Book-to-Market 0.056** 0.049** 0.045** 0.006 0.004 0.006 0.032+ 0.043* (0.005) (0.009) (0.011) (0.013) (0.018) (0.014) (0.018) (0.021) Intercept -0.982** -1.022** -0.977** -0.777** -0.651** -0.633** -0.566** -0.643** (0.020) (0.033) (0.037) (0.040) (0.045) (0.043) (0.044) (0.058) Average R2 4.78% 6.59% 6.94% 8.84% 13.68% 16.57% 24.48% 25.87% Average N 1249 1249 1249 1249 1249 1249 1249 1249 18 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 79,
    "page_range": "p.79",
    "total_pages": 85,
    "chunk_index": 122,
    "word_count": 289,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.79)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "(0.009) (0.011) (0.013) (0.018) (0.014) (0.018) (0.021) Intercept -0.982** -1.022** -0.977** -0.777** -0.651** -0.633** -0.566** -0.643** (0.020) (0.033) (0.037) (0.040) (0.045) (0.043) (0.044) (0.058) Average R2 4.78% 6.59% 6.94% 8.84% 13.68% 16.57% 24.48% 25.87% Average N 1249 1249 1249 1249 1249 1249 1249 1249 18 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 80,
    "page_range": "p.80",
    "total_pages": 85,
    "chunk_index": 123,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.80)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "Table A.VI: Predicting Analysts’ Earnings Forecast Errors Using Retail Order Imbalances This table presents results from daily logistic regressions of earnings forecast errors on retail imbalances (Imb[0]) and control variables. The dependent variable PosFE[x,y] is one if the analyst forecast errors for quarterly earnings announcements occurring from day t + x through day t + y is positive and zero if the forecast error is negative. The forecast error is the difference between actual earnings-per-share and the median analyst forecast from I/B/E/S on the day before the announcement. Other variables are as defined above. At least 50 earnings announcements with corresponding forecast data during the window of the dependent are required for each daily logistic regression. Average coefficients and Newey-West (1987) standard errors with lags equal to twice the horizon of the dependent variable appear in the table. The symbols **, *, and + denote significance at the 1%, 5%, and 10% level, respectively. Panel A: Market imbalances predicting forecast errors Dependent Variable PosFE[1] PosFE[2,5] PosFE[6,10] PosFE[11,20] PosFE[21,40] PosFE[41,60] PosFE[61,120] PosFE[121,240] Imbalance Measure Mkt Mkt Mkt Mkt Mkt Mkt Mkt Mkt Imb[0] 0.158** 0.081** 0.054** 0.038+ 0.025+ 0.012 0.004 -0.002 (0.043) (0.020) (0.019) (0.022) (0.014) (0.012) (0.006) (0.006) Neg[0] 0.098* -0.081 0.034 -0.009 0.005 -0.053 -0.011** -0.010** (0.044) (0.146) (0.059) (0.025) (0.013) (0.043) (0.004) (0.003) Neg[-5,-1] 0.015 -0.014 -0.037** -0.026* -0.019+ -0.029** -0.020** -0.016** (0.022) (0.014) (0.014) (0.013) (0.011) (0.009) (0.003) (0.003) Neg[-26,-6] -0.089** -0.081** -0.070** -0.116** -0.122** -0.135** -0.085** -0.082** (0.021) (0.015) (0.014) (0.028) (0.017) (0.019) (0.005) (0.008) Ret[0] (÷ 100) 0.045** 0.027** 0.030** 0.027** 0.008** 0.009** 0.008** 0.006** (0.010) (0.006) (0.005) (0.005) (0.003) (0.002) (0.001) (0.001) Ret[-5,-1] (÷ 100) 0.036** 0.031** 0.026** 0.028** 0.009** 0.009** 0.007** 0.006** (0.005) (0.003) (0.004) (0.003) (0.002) (0.002) (0.001) (0.001) Ret[-26,-6] (÷ 100) 0.024** 0.023** 0.022** 0.014** 0.007** 0.011** 0.007** 0.005** (0.002) (0.002) (0.002) (0.002) (0.002) (0.001) (0.001) (0.001) Market Equity 0.174** 0.185** 0.200** 0.199** 0.202** 0.194** 0.179** 0.184** (0.018) (0.014) (0.016) (0.015) (0.014) (0.013) (0.010) (0.009) Book-to-Market -0.345** -0.445** -0.401** -0.351** -0.360** -0.315** -0.299** -0.245** (0.132) (0.075) (0.075) (0.077) (0.073) (0.066) (0.044) (0.047) Intercept -1.331** -1.526** -1.726** -1.787** -1.676** -1.599** -1.456** -1.593** (0.252) (0.199) (0.220) (0.232) (0.216) (0.207) (0.156) (0.131) Days 257 590 669 1055 1217 1213 1217 1217 Average R2 12.97% 9.64% 9.80% 9.92% 6.07% 5.73% 2.56% 2.57% Average N 109 235 264 359 691 684 1985 2226 19 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 80,
    "page_range": "p.80",
    "total_pages": 85,
    "chunk_index": 124,
    "word_count": 393,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.80)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "-1.526** -1.726** -1.787** -1.676** -1.599** -1.456** -1.593** (0.252) (0.199) (0.220) (0.232) (0.216) (0.207) (0.156) (0.131) Days 257 590 669 1055 1217 1213 1217 1217 Average R2 12.97% 9.64% 9.80% 9.92% 6.07% 5.73% 2.56% 2.57% Average N 109 235 264 359 691 684 1985 2226 19 Electronic copy available at: https://ssrn.com/abstract=1668706 20 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 81,
    "page_range": "p.81-82",
    "total_pages": 85,
    "chunk_index": 125,
    "word_count": 56,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.81-82)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "-1.593** (0.252) (0.199) (0.220) (0.232) (0.216) (0.207) (0.156) (0.131) Days 257 590 669 1055 1217 1213 1217 1217 Average R2 12.97% 9.64% 9.80% 9.92% 6.07% 5.73% 2.56% 2.57% Average N 109 235 264 359 691 684 1985 2226 19 Electronic copy available at: https://ssrn.com/abstract=1668706 20 Electronic copy available at: https://ssrn.com/abstract=1668706 Table A.VI: Predicting Analysts’ Earnings Forecast Errors Using Retail Order Imbalances (continued) Panel B: Nonmarketable limit imbalances predicting forecast errors Dependent Variable PosFE[1] PosFE[2,5] PosFE[6,10] PosFE[11,20] PosFE[21,40] PosFE[41,60] PosFE[61,120] PosFE[121,240] Imbalance Measure NmL NmL NmL NmL NmL NmL NmL NmL Imb[0] 0.051 -0.014 -0.099 -0.013 -0.039** -0.045** -0.027** -0.027** (0.040) (0.024) (0.094) (0.031) (0.013) (0.011) (0.006) (0.002) Neg[0] 0.028 0.020 -0.015 -0.024 0.001 -0.017 -0.010** -0.010** (0.069) (0.079) (0.016) (0.036) (0.015) (0.012) (0.004) (0.003) Neg[-5,-1] 0.034 -0.013 -0.050** -0.023+ -0.019+ -0.030** -0.022** -0.017** (0.030) (0.014) (0.018) (0.013) (0.011) (0.008) (0.003) (0.003) Neg[-26,-6] -0.095** -0.091** -0.086** -0.102** -0.133** -0.138** -0.094** -0.088** (0.034) (0.017) (0.029) (0.020) (0.019) (0.018) (0.006) (0.009) Ret[0] (÷ 100) 0.056** 0.029** 0.018+ 0.039* 0.007** 0.008** 0.006** 0.005** (0.017) (0.006) (0.010) (0.015) (0.003) (0.003) (0.001) (0.001) Ret[-5,-1] (÷ 100) 0.038** 0.029** 0.030** 0.024** 0.008** 0.010** 0.007** 0.006** (0.007) (0.004) (0.006) (0.003) (0.002) (0.002) (0.001) (0.001) Ret[-26,-6] (÷ 100) 0.029** 0.023** 0.025** 0.016** 0.008** 0.011** 0.007** 0.005** (0.004) (0.002) (0.005) (0.002) (0.002) (0.001) (0.001) (0.001) Market Equity 0.171** 0.184** 0.176** 0.204** 0.209** 0.203** 0.183** 0.183** (0.020) (0.015) (0.014) (0.014) (0.014) (0.013) (0.011) (0.010) Book-to-Market -0.606** -0.568** -0.718* -0.519** -0.383** -0.336** -0.281** -0.220** (0.158) (0.101) (0.280) (0.093) (0.091) (0.077) (0.042) (0.038) Intercept -1.148** -1.475** -1.220** -1.751** -1.722** -1.687** -1.505** -1.582** (0.287) (0.204) (0.305) (0.217) (0.229) (0.210) (0.164) (0.134) Days 204 533 587 867 1217 1212 1217 1217 Average R2 14.85% 10.98% 10.19% 10.04% 7.50% 7.01% 3.06% 2.91% Average N 92 186 215 315 514 513 1488 1679 21 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 82,
    "page_range": "p.82",
    "total_pages": 85,
    "chunk_index": 126,
    "word_count": 302,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.82)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "-1.475** -1.220** -1.751** -1.722** -1.687** -1.505** -1.582** (0.287) (0.204) (0.305) (0.217) (0.229) (0.210) (0.164) (0.134) Days 204 533 587 867 1217 1212 1217 1217 Average R2 14.85% 10.98% 10.19% 10.04% 7.50% 7.01% 3.06% 2.91% Average N 92 186 215 315 514 513 1488 1679 21 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 83,
    "page_range": "p.83",
    "total_pages": 85,
    "chunk_index": 127,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.83)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "Table A.VI: Predicting Analysts’ Earnings Forecast Errors Using Retail Order Imbalances (continued) Panel C: Executed limit imbalances predicting forecast errors Dependent Variable PosFE[1] PosFE[2,5] PosFE[6,10] PosFE[11,20] PosFE[21,40] PosFE[41,60] PosFE[61,120] PosFE[121,240] Imbalance Measure XL XL XL XL XL XL XL XL Imb[0] 0.149* 0.048* -0.036 -0.042* -0.043** -0.092+ -0.027** -0.028** (0.065) (0.023) (0.026) (0.019) (0.015) (0.056) (0.006) (0.005) Neg[0] 0.079 -0.030 0.045** -0.011 -0.005 -0.095 -0.006 -0.007+ (0.064) (0.038) (0.014) (0.032) (0.036) (0.064) (0.005) (0.004) Neg[-5,-1] 0.043 -0.004 -0.055** -0.045** -0.012 -0.041* -0.022** -0.016** (0.040) (0.019) (0.015) (0.013) (0.012) (0.017) (0.004) (0.004) Neg[-26,-6] -0.119* -0.131** -0.072** -0.106** -0.163** -0.177** -0.113** -0.102** (0.057) (0.020) (0.018) (0.018) (0.023) (0.033) (0.007) (0.009) Ret[0] (÷ 100) 0.056** 0.040** 0.021** 0.019** 0.005 -0.002 0.005** 0.004** (0.021) (0.008) (0.007) (0.005) (0.005) (0.008) (0.001) (0.001) Ret[-5,-1] (÷ 100) 0.029** 0.029** 0.022** 0.020** 0.007* 0.008** 0.006** 0.005** (0.008) (0.005) (0.004) (0.003) (0.003) (0.003) (0.001) (0.001) Ret[-26,-6] (÷ 100) 0.033** 0.021** 0.018** 0.015** 0.008** 0.012** 0.007** 0.005** (0.005) (0.002) (0.002) (0.002) (0.002) (0.002) (0.001) (0.001) Market Equity 0.131** 0.158** 0.152** 0.186** 0.206** 0.202** 0.182** 0.184** (0.025) (0.016) (0.014) (0.012) (0.018) (0.016) (0.012) (0.011) Book-to-Market -0.366 -0.314** -0.446** -0.493** -0.378** -0.342* -0.313** -0.261** (0.231) (0.115) (0.106) (0.092) (0.120) (0.136) (0.059) (0.044) Intercept -0.510 -1.161** -1.026** -1.492** -1.628** -1.569** -1.461** -1.569** (0.430) (0.241) (0.212) (0.191) (0.289) (0.265) (0.183) (0.139) Days 126 428 487 689 1153 1186 1217 1217 Average R2 16.36% 11.72% 10.65% 9.80% 9.17% 8.94% 3.56% 3.45% Average N 76 138 157 246 340 332 951 1063 22 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 83,
    "page_range": "p.83",
    "total_pages": 85,
    "chunk_index": 128,
    "word_count": 252,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.83)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "-1.161** -1.026** -1.492** -1.628** -1.569** -1.461** -1.569** (0.430) (0.241) (0.212) (0.191) (0.289) (0.265) (0.183) (0.139) Days 126 428 487 689 1153 1186 1217 1217 Average R2 16.36% 11.72% 10.65% 9.80% 9.17% 8.94% 3.56% 3.45% Average N 76 138 157 246 340 332 951 1063 22 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 84,
    "page_range": "p.84",
    "total_pages": 85,
    "chunk_index": 129,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.84)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "Table A.VII: Predicting Next-Day Retail Order Imbalance This table presents results from daily Fama-MacBeth (1973) regressions of day t + 1 retail imbalances based on market (Mkt), nonmarketable (NmL), or executed limit (XL) orders on prior imbalances, negativity, and returns. The variable Earn[-1,0] is one if an earnings announcement occurred and zero otherwise and the variable SignFE[-1,0] is the sign of the difference between the actual earnings and the median analyst forecast; for specifications involving Earn, at least 30 announcements are required for each cross-sectional regression. Other variables are as defined a above. Average coefficients and Newey-West (1987) standard errors with 60 lags appear in the table. The symbols **, *, and + denote significance at the 1%, 5%, and 10% level, respectively. Imbalance Variable Mkt NmL XL Neg[0] (÷ 100) -0.320** 0.003 0.080 (0.037) (0.048) (0.058) Neg[-5,-1] (÷ 100) -0.362** -0.101* -0.050 (0.034) (0.050) (0.062) Neg[-26,-6] (÷ 100) -0.620** -0.221** -0.038 (0.062) (0.077) (0.103) Ret[0] (÷ 100) 0.338** -0.865** -0.599** (0.032) (0.045) (0.044) Ret[-5,-1] (÷ 100) -0.182** -0.394** -0.260** (0.012) (0.014) (0.014) Ret[-26,-6] (÷ 100) -0.080** -0.118** -0.083** (0.007) (0.007) (0.007) News[0] 0.001 -0.002 0.004* (0.001) (0.002) (0.002) News[0]*Ret[0] (÷ 100) -0.283** 0.323** 0.239** (0.029) (0.037) (0.040) Earn[-1,0] -0.019** -0.018** -0.017** (0.003) (0.004) (0.005) Earn[-1,0]*Ret[0] (÷ 100) -0.460** 0.351** 0.084 (0.042) (0.064) (0.070) sgnFE[-1,0] -0.006+ -0.031** -0.031** (0.003) (0.005) (0.005) Market Equity 0.001 -0.012** -0.024** (0.001) (0.001) (0.001) Book-to-Market -0.043** -0.015** -0.029** (0.003) (0.003) (0.004) Intercept -0.069** 0.147** 0.374** (0.014) (0.011) (0.015) Average R2 1.08% 1.82% 2.71% Average N 2709 2032 1197 23 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 84,
    "page_range": "p.84",
    "total_pages": 85,
    "chunk_index": 130,
    "word_count": 259,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.84)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "0.351** 0.084 (0.042) (0.064) (0.070) sgnFE[-1,0] -0.006+ -0.031** -0.031** (0.003) (0.005) (0.005) Market Equity 0.001 -0.012** -0.024** (0.001) (0.001) (0.001) Book-to-Market -0.043** -0.015** -0.029** (0.003) (0.003) (0.004) Intercept -0.069** 0.147** 0.374** (0.014) (0.011) (0.015) Average R2 1.08% 1.82% 2.71% Average N 2709 2032 1197 23 Electronic copy available at: https://ssrn.com/abstract=1668706 Table A.VIII: Predicting Returns in the Broker Internalization Subsample This table presents results from daily Fama-MacBeth (1973) regressions of future returns on retail order imbalances and interactions using the same sample as those reported in Table IX. All variables are defined as above. The Imb calculations require at least 2 orders of the corresponding order type, and each cross-sectional regression requires at least 100 observations. Average coefficients and Newey-West (1987) standard errors with lags equal to twice the horizon of the dependent variable appear in the table. The symbols **, *, and + denote significance at the 1%, 5%, and 10% level, respectively. Dependent Variable Ret[1,5] Ret[6,20] Ret[1,5] Ret[6,20] Ret[1,5] Ret[6,20] Imbalance measure Mkt Mkt NmL NmL XL XL Imb[0] 0.128** 0.121** 0.134** 0.117** 0.024+ 0.062* (0.010) (0.020) (0.010) (0.021) (0.013) (0.028) Ret[0] -0.047** -0.006 -0.043** 0.000 -0.037** 0.377 (0.004) (0.007) (0.004) (0.007) (0.005) (0.646) Ret[-5,-1] -0.017** -0.002 -0.017** -0.003 -0.015** -0.175 (0.003) (0.006) (0.003) (0.006) (0.003) (0.608) Ret[-26,-6] -0.002 -0.005 -0.002 -0.005 -0.003+ -0.698 (0.002) (0.005) (0.002) (0.005) (0.002) (0.474) Market Equity -0.050* -0.080 -0.049* -0.073 -0.049* -0.056 (0.022) (0.073) (0.021) (0.070) (0.025) (0.079) Book-to-Market 0.107 0.313 0.157+ 0.469+ 0.140+ 0.481+ (0.077) (0.251) (0.081) (0.264) (0.084) (0.260) Intercept 1.081** 2.097 1.049** 1.917 1.076* 1.702 (0.401) (1.408) (0.399) (1.392) (0.462) (1.547) Average R2 2.23% 2.03% 2.32% 2.03% 2.87% 2.63% Average N 2478 2470 1845 1840 1333 1330 24 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 85,
    "page_range": "p.85",
    "total_pages": 85,
    "chunk_index": 131,
    "word_count": 283,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.85)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  },
  {
    "text": "(0.025) (0.079) Book-to-Market 0.107 0.313 0.157+ 0.469+ 0.140+ 0.481+ (0.077) (0.251) (0.081) (0.264) (0.084) (0.260) Intercept 1.081** 2.097 1.049** 1.917 1.076* 1.702 (0.401) (1.408) (0.399) (1.392) (0.462) (1.547) Average R2 2.23% 2.03% 2.32% 2.03% 2.87% 2.63% Average N 2478 2470 1845 1840 1333 1330 24 Electronic copy available at: https://ssrn.com/abstract=1668706",
    "title": "How Wise Are Crowds Insights from Retail Orders and Stock Returns",
    "source_type": "pdf",
    "document_id": "d8de9745ae3d",
    "source_file": "How Wise Are Crowds Insights from Retail Orders and Stock Returns.pdf",
    "section": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 85,
    "chunk_index": 132,
    "word_count": 50,
    "author": "Paul Tetlock",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. The Degree of Error in Measuring the Persistence in Retail Order Imbalances (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20120120125706-05'00'",
    "duration": null
  }
]