[
  {
    "text": "How Should the Long-term Investor Harvest Variance Risk Premiums? ¶ Julian D¨orries∗, Olaf Korn†, Gabriel J. Power‡ This version: December 2021 JEL Classification: G10, G11, G23 Keywords: Variance Risk Premium; Variance Factor; Trading Strategies; Long-term Investor ¶ WethankMarcoErling,FlorianReibis,MartinWallmeier,J¨orgZimmermann,aswellaspartic- ipantsofthe2021CFRresearchseminarandthe2021WorkshoponStructuredRetailProducts at the University of Hagen for helpful comments and suggestions. Vitus Benson provided excel- lent research assistance. ∗ Julian D¨orries, Chair of Finance, University of Goettingen, Platz der G¨ottinger Sieben 3, D- 37073 G¨ottingen, Germany; tel. +49 551 39 27264; email julian.doerries@uni-goettingen.de. † OlafKorn,ChairofFinance,UniversityofGoettingenandCentreforFinancialResearchCologne (CFR),PlatzderG¨ottingerSieben3,D-37073G¨ottingen,Germany;tel. +495513927265;email okorn@uni-goettingen.de. ‡ Gabriel J. Power, Universit´e Laval, Department of Finance, Insurance and Real Estate, Facult´e dessciencesdel’administration,PavillonPalasis-Prince,2325ruedelaTerrasse,Qu´ebec,Qu´ebec G1V 0A6, Canada; tel. +1 418 656-2131; email gabriel.power@fsa.ulaval.ca. Electronic copy available at: https://ssrn.com/abstract=3989529 How Should the Long-term Investor Harvest Variance Risk Premiums? Abstract Derivatives strategies that aim to earn variance risk premiums are exposed to sharp pricedeclinesduringmarketcrises, callingintoquestiontheirsuitabilityforthelong- term investor. Our paper defines, analyzes and proposes potential solutions to three problems (payoff, leverage and finite maturity) linked to designing suitable variance- basedinvestmentstrategies. Weconductanempiricalstudyofsuchstrategiesforthe S&P 500 index options market, and find strong effects of certain design elements on risk and return. Overall, our results show that variance strategies can be attractive to the long-term investor if properly designed. JEL Classification: G10, G11, G23 1 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-3",
    "total_pages": 49,
    "chunk_index": 0,
    "word_count": 210,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "designing suitable variance- basedinvestmentstrategies. Weconductanempiricalstudyofsuchstrategiesforthe S&P 500 index options market, and find strong effects of certain design elements on risk and return. Overall, our results show that variance strategies can be attractive to the long-term investor if properly designed. JEL Classification: G10, G11, G23 1 Electronic copy available at: https://ssrn.com/abstract=3989529 1 Introduction The variance risk premium (VRP) is a well-known feature in options markets and exists across asset classes and countries (Zhou 2018). There is strong evidence, in particular, of a negative variance risk premium in options on equity indexes (e.g., Hafner and Wallmeier 2007; Carr and Wu 2009; Kozhan, Neuberger, and Schneider 2013). The literature, however, does not provide much guidance on whether and how the long-term investor could benefit from the VRP. These questions are chal- lenging because the structure of variance risk involves rare, high-impact events. Yet answering these questions is highly relevant to investors, especially institutions such as pension funds, insurance companies and university endowments.1 For instance, given a persistent low-interest rate environment, pension funds managing defined- benefit plans face a steep challenge to meet future liabilities (Novy-Marx and Rauh 2011). As a result, they have turned to non-traditional, riskier assets (e.g., Aubry, Chen, and Munnell 2017; Segal 2020). Might harvesting the VRP be part of the solution? Our paper makes conceptual and empirical contributions to answer this question. First, three problems of VRP-earning strategies are highlighted: (i) The payoff problem: Which payoff profiles are appropriate? Which instruments should be used to create them? (ii) The leverage problem: Which risk level should be chosen? How can the ex-ante variance risk of different strategies be measured and compared? (iii) The finite maturity problem: Which maturities of derivatives should be chosen? When and how often should positions be rolled over? Second, starting from these problems, VRP-earning strategies with different design elements are proposed and analyzed to better understand the VRP’s potential role in long-term investing. To our knowledge, this is the first study to systematically compare different design elements of variance-based investment strategies in terms of their suitability for long-term investors. 1 Litterman (2011) argues that long-horizon institutional investors are natural sellers of tail-risk insurance. 2 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 49,
    "chunk_index": 1,
    "word_count": 363,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "role in long-term investing. To our knowledge, this is the first study to systematically compare different design elements of variance-based investment strategies in terms of their suitability for long-term investors. 1 Litterman (2011) argues that long-horizon institutional investors are natural sellers of tail-risk insurance. 2 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 49,
    "chunk_index": 2,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "In a study of S&P 500 index options, we assess the different VRP strategies empiri- cally. Our data sample ranges from January 1996 to June 2021, therefore including the two most consequential stock market crashes in recent decades. This data fea- ture is essential to study variance strategies. As for implementation, we use realistic assumptions about transaction costs and CBOE margin requirements for option po- sitions. As potential solutions of the leverage problem, we suggest and implement two methods to determine risk exposure: First, we use the maximum possible ex- posure by levering positions until capital is fully tied up. Second, we use an equal ex-ante factor exposure for all strategies. To compare exposure, we propose a new model-free measure of nonlinearity (option gamma) obtained from current option prices alone. Both methods do not require any estimation period to determine exposure, thus leaving the full sample period of 25 years for the measurement of long-term performance. Our empirical analysis provides the following main results: (i) Maximum exposure strategies differ greatly in terms of their return and risk profile. Some strategies ex- hibit risk levels that most investors would find excessive. (ii) Equal exposure strate- gies also differ from each other, but much less than maximum exposure strategies. Remaining differences are due to the different instruments on which the strategies are based, resulting in different payoff profiles and transaction costs. (iii) For all variance strategies, correlation with the market is significantly positive, but varies across strategies due to different payoff profiles. (iv) Variance strategies consistently earn premiums throughout the whole sample period. This is in stark contrast with strategies based on the Fama-French (2015) factors or the momentum factor, which have not shown a significant upward trend since 2008. (v) The variance factor trans- lates into an attractive factor strategy for long-term investors, both as a stand-alone factor and as a complement to the market investment, despite being correlated with the market. Overall, our study shows that although variance strategies exhibit ex- treme payoff distributions with high negative skewness and excess kurtosis, they recover quite quickly from large drawdowns and continue to consistently earn pre- 3 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 49,
    "chunk_index": 3,
    "word_count": 360,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "complement to the market investment, despite being correlated with the market. Overall, our study shows that although variance strategies exhibit ex- treme payoff distributions with high negative skewness and excess kurtosis, they recover quite quickly from large drawdowns and continue to consistently earn pre- 3 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 49,
    "chunk_index": 4,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "miums. Thus, when properly designed, these strategies are attractive to long-term investors. 2 Related Literature The objective of this paper is to seek effective ways for the long-term investor to harvest the VRP via options strategies. Formally, the VRP is the deviation between the expected (physical) variance realized over the life of the option and the option- implied (risk-neutral) variance. More loosely speaking, the VRP is the expected return on the “variance factor”. Since this variance factor is far from uniformly defined in the literature, approaches to earn its factor premium can differ greatly. What they have in common, however, is that they provide exposure to variance changes. Below,webrieflydiscusspriorworkontradingstrategiesthatearnvariance premiums and position our paper in this literature. A first set of trading strategies hold options in combination with their underlying, usually a broad market index. Since options have non-linear payoffs, they provide exposure to changes in variance. Whaley (2002) describes and analyzes the Chicago Board Options Exchange (CBOE) BuyWrite Index, which consists of a short po- sition in an out-of-the money (OTM) S&P 500 index call and a long position in the S&P 500 index. Ungar and Moran (2009) outline a put-write strategy used as the basis for the CBOE S&P 500 PutWrite Index. These strategies outperform the S&P 500 on a risk-adjusted basis.2 They represent, however, a portfolio approach rather than a pure variance strategy, as they are not delta-hedged but in most cases fully collateralized with a position in the index. Such a design implies a mixture of market exposure and variance exposure, with exposure varying over time (Israelov and Nielsen 2015). Another strand of literature considers variance exposure as an additional element in a broader portfolio context and examines its role in optimal portfolio choice. 2 Other related strategies, such as PutWrite and BuyWrite strategies with varying strike prices of options or with additional caps and floors, are assessed by Clark and Dickson (2019). 4 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 49,
    "chunk_index": 5,
    "word_count": 323,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "additional element in a broader portfolio context and examines its role in optimal portfolio choice. 2 Other related strategies, such as PutWrite and BuyWrite strategies with varying strike prices of options or with additional caps and floors, are assessed by Clark and Dickson (2019). 4 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 49,
    "chunk_index": 6,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "Hafner and Wallmeier (2008) consider an investor with constant relative risk aver- sion (CRRA) utility and investment opportunities in a stock index, a risk-free asset and a variance swap. They show that asset weights of index variance swaps jump when certain thresholds of preference parameters are crossed, a consequence of the high negative skewness and high kurtosis of variance swaps. Egloff, Leippold, and Wu (2010) use a similar setting with CRRA utility investors, a stock index and a risk-free asset. However, they augment the investment opportunity set with two dis- tinct variance swaps with different maturities. They find that short-term variance swaps enter the optimal portfolio with short positions, whereas long-term variance swaps enter with long positions. Overall, considering variance swaps in their portfo- lio problem leads to significant improvements in performance. Bri`ere, Burgues, and Signori (2010) use a mean-modified Value-at-Risk (VaR) framework to study the efficient frontier of an equity investor who complements her portfolio with volatility positions. They find that taking short positions in variance swaps enhances portfolio returns but adds little diversification benefits. In a similar vein, Fallon, Park, and Yu (2015) augment hypothetical institutional investment portfolios with a variance portfolio and find that adding small amounts of variance risk exposure enhances long-term returns but increases short-term tail risk. In summary, this literature documents certain benefits and difficulties that variance positions create in a port- folio context. However, it does not analyze the trade-offs between alternative design elements of the “variance factor” that may be helpful to overcome such difficulties. Trading the VIX can also earn premiums linked to variance exposure. These strate- gies typically involve VIX futures (Simon and Campasano 2014) or VIX options (Simon 2017) and aim to roll down the term structure of option-implied volatility (IV), which is typically in contango. Investors can go short in longer-term futures to roll down the VIX futures term structure and, on average, earn the corresponding premium. However, this premium is less a VRP than it is a VIX term premium.3 This is because VIX strategies earn gains via changes in IV between two points in 3 Bri`ere, Burgues, and Signori (2010) also clearly distinguish between strategies that aim to earn the VRP and strategies that profit from changes in IV. 5 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 49,
    "chunk_index": 7,
    "word_count": 379,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "a VIX term premium.3 This is because VIX strategies earn gains via changes in IV between two points in 3 Bri`ere, Burgues, and Signori (2010) also clearly distinguish between strategies that aim to earn the VRP and strategies that profit from changes in IV. 5 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 49,
    "chunk_index": 8,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "time, and not by means of the difference between implied and expected realized (physical) volatility, i.e., the VRP that we investigate in our study.4 Lastly, the literature has used different instruments to quantify VRPs. Coval and Shumway (2001) use zero-beta straddles as a means to generate variance exposure and Bakshi and Kapadia (2003) employ delta-hedged calls and puts to quantify the VRP. Variance swaps are used, for example, in the studies by Hafner and Wallmeier (2007), CarrandWu(2009), andKozhanetal.(2013). FallonandPark(2016)adda further design element to a variance swap strategy. By adding a cap to a one-month S&P 500 variance swap, they suggest a specific solution to the leverage problem. Our paper goes a step further. Its central contribution is to consider a variety of different derivatives strategies with different design elements and to compare all of them in terms of their suitability for the long-term investor. Furthermore, our study is the first to include the period of the Covid-19 pandemic. Inclusion of this period and its stock market shock is potentially very important to learn about long-term variance strategies. 3 Strategies, Data, and Study Design 3.1 Three Problems Designing long-term strategies aimed at harvesting VRPs entails three major prob- lems. Thefirstoneiswhatwecallthepayoff problem. Inprinciple,varianceexposure can be generated by selling any convex payoff structure. However, different payoff profilesmaybemoreorlesssuitabletoachievecertaindesirablegoals. First, apayoff profile should provide sufficient factor exposure that is priced in the market. Sec- ond, it should be only weakly correlated with other risk factors, to allow for portfolio diversification benefits. Third, it should limit the occurrence of extreme negative returns in order to avoid large drawdowns. Fourth, it should be implementable with 4 Of course, changes in IV may be correlated with realized volatility. Nevertheless, this type of strategy earns a premium that is conceptually distinct. 6 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 49,
    "chunk_index": 9,
    "word_count": 298,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "should limit the occurrence of extreme negative returns in order to avoid large drawdowns. Fourth, it should be implementable with 4 Of course, changes in IV may be correlated with realized volatility. Nevertheless, this type of strategy earns a premium that is conceptually distinct. 6 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 49,
    "chunk_index": 10,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "low transaction costs. This last point is crucial for long-term investors, as such costs erode their compounding returns. To be sure, achieving these four goals involves trade-offs, which are at the heart of the payoff problem, i.e., the problem of choosing suitable payoff profiles. Second is the leverage problem. Variance strategies use derivatives to sell convex payoff profiles. Since some derivative strategies require no initial capital (e.g., swap contracts) while others actually generate capital (e.g., delta-hedged puts), a ques- tion arises as to the appropriate amount of leverage. The leverage problem can be cast in terms of some similar trade-offs as the payoff problem. On the one hand, strategies should provide sufficient exposure to variance risk. On the other hand, they should limit extreme losses that jeopardize the strategy’s long-term success— all in a cost-effective manner. The leverage problem, however, also raises distinct issues. Different strategies may use different instruments despite having similar or even identical payoffs. Therefore, potential leverage may be more constrained for one strategy than another due to differences in initial capital or margin require- ments. In addition, differences in leverage between strategies can lead to sharply different factor exposures, making meaningful comparisons difficult. Third, there is the finite maturity problem involving its own trade-offs. Because derivatives have finite maturities, long-term investors must periodically roll their positions. Investors determine which maturities to choose, when to roll, and how many instruments to use at once. Longer-term contracts may have less factor ex- posure but require less frequent trading, reducing transaction costs. Shorter-term contractsmaybemoreliquid, however, resultinginlowertransactioncostspertrade. 3.2 Variance Strategies We now present strategies aiming to harvest VRPs and address some of the associ- ated trade-offs. We begin with a short position in an at-the-money (ATM) straddle as a first intuitive approach to selling protection against rising variances. The short straddle limits market exposure because it combines a short call (with negative 7 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 49,
    "chunk_index": 11,
    "word_count": 318,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "and address some of the associ- ated trade-offs. We begin with a short position in an at-the-money (ATM) straddle as a first intuitive approach to selling protection against rising variances. The short straddle limits market exposure because it combines a short call (with negative 7 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 49,
    "chunk_index": 12,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "delta) with a short put (with positive delta).5 It consists of only two ATM instru- ments, thus limiting transaction costs. The short straddle’s stylized payoff profile is shown in part (a) of Figure 1. This payoff is generally consistent with an instrument showing variance exposure. The risk here is that large negative or positive price movements in the underlying could result in large negative returns–even medium price movements already lead to losses. [Insert Figure 1 about here.] A first idea to reduce the risk of the straddle is the short strangle, which involves shifting option strike prices from ATM to out-of-the-money (OTM), thereby avoid- ing losses in case of medium price changes in the underlying. It also reduces the magnitude of losses in case of large price moves in the underlying, compared with the straddle. Such a payoff profile is depicted in part (b) of Figure 1. The strangle’s disadvantages include, first, that OTM options have less variance exposure than ATM options, and second, the maximum payoff is lower than for a straddle. Fi- nally, large negative returns can still occur since the payoff function has no lower bound. To counter the risk of extreme losses, one could add a floor to the payoff profile. By adding a long OTM call and a long OTM put, a straddle becomes a butterfly spread, as shown in part (c) of Figure 1.6 Limiting the downside risk, however, also comes with drawbacks. Since two long option positions enter the portfolio together with short positions, the portfolio’s overall variance exposure is reduced. Moreover, the additional long positions in calls and puts incur costs—both transaction costs and costs of capital for the option premiums. A further approach is to sell delta-hedged call or put options, i.e., puts or calls hedged with positions in the market index. Delta-hedged options have a similar payoff structure as a straddle. Therefore, they have similar advantages, i.e., limited 5 One could even set the strike price of the options such that the beta of the straddle is exactly zero. 6 Of course, adding a floor is also possible for the strangle. Such a portfolio is called a condor strangle. 8 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 49,
    "chunk_index": 13,
    "word_count": 365,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "advantages, i.e., limited 5 One could even set the strike price of the options such that the beta of the straddle is exactly zero. 6 Of course, adding a floor is also possible for the strangle. Such a portfolio is called a condor strangle. 8 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 49,
    "chunk_index": 14,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "correlation with the market factor and a portfolio made up of only two instruments, but also similar disadvantages, i.e., potentially large downside risk. However, the long-term performance of delta-hedged options may differ considerably from that of a straddle strategy, since they contain different instruments. Differences in perfor- mance may be due to a different potential for leverage or to different transaction costs and margin requirements. Finally, aninvestorcangainvarianceexposurethroughavariance swap, whichisthe most direct way to earn the VRP. Variance swaps may also limit correlation with the market factor, since they are initially delta-neutral by construction (Kozhan, Neuberger, and Schneider 2013). However, a variance swap can be viewed as a fairly complex option portfolio with potentially high transaction costs and leverage constraints. Moreover, since variance is calculated as the squared difference from the mean, a variance swap could be prone to extreme losses if the realized variance reaches a peak. Overall,weselectsevenportfolios: Straddle,strangle,butterflyspread,condorstran- gle, delta-hedged call, delta-hedged put, and variance swap. All offer convex payoff structures, so selling these portfolios has the potential to earn VRPs. We further target differences in their designs to get insights on trade-offs for variance exposure, downside risk, transaction costs, capital requirements, and margins. The long-term investor’s next question is: What quantities should be held in each portfolio to obtain a suitable risk-return profile? We address this issue in two ways. First, under the maximum exposure approach, the investor generates the maximum possible exposure for each strategy by levering portfolio positions until her capital is fully invested in long positions and margins for short positions. This approach is informative on the impact of various instruments on potential leverage. Under the equal exposure approach, all strategies are levered until each strategy has the same ex-ante factor exposure. If one strategy requires less capital to achieve this exposure than another, the remaining funds are invested in a risk-free account. Equal exposure strategies help us compare different strategies on an ex-ante risk 9 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 49,
    "chunk_index": 15,
    "word_count": 326,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "are levered until each strategy has the same ex-ante factor exposure. If one strategy requires less capital to achieve this exposure than another, the remaining funds are invested in a risk-free account. Equal exposure strategies help us compare different strategies on an ex-ante risk 9 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 49,
    "chunk_index": 16,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "basis but require an ex-ante measure of factor exposure. The literature suggests different measures associated with the non-linearity of options, in particular vega and gamma (Cremers, Halling, and Weinbaum 2015). But using vega is problematic here because in general, it is dependent on which valuation model is used.7 Thus, we use option gamma as a general measure of non-linearity or convexity. To avoid model dependence, we apply a model-free approach. We determine gamma and, to be consistent, also delta in this manner. The model-free greeks are derived based on the option-implied (risk-neutral) distribution (RND) of returns, discussed in more detail in the next subsection. 3.3 Data, RNDs and Greeks We use data on European S&P 500 index options obtained from OptionMetrics IvyDB (U.S.). This database provides historical closing quotes from the CBOE, as well as implied volatilities (IV), interest rates, underlying spot prices, and implied dividend yields. Our sample period starts in January 1996 and ends in June 2021, covering 305 months. We filter our option data set with standard filters from the literature (Goyal and Saretto 2009; Cao and Han 2013). We require best bid and best ask quotes as well as the bid-ask-spread to be non-negative and discard options with special settlement and options that do not have a.m. settlement. Moreover, IV must be greater than zero and we require options to survive standard no-arbitrage conditions. For every month in our sample, we only use data for the first trading day after the third Friday of that respective month. The latter is the standard expiration date of CBOE-traded options. We also require options to mature in the next month. This step retains options with approximately one month to maturity. Our final sample consists of 24,980 call options and 25,450 put options for 305 months with an average time to maturity of approximately 28 days. Model-free deltas and gammas require an estimate of the S&P 500 index RND, to which end we follow the approach outlined in Figlewski (2010). At every point in 7 Specifically, the Black-Scholes vega measures variance risk in a setting where no variance risk premium exists. 10 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 49,
    "chunk_index": 17,
    "word_count": 357,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "deltas and gammas require an estimate of the S&P 500 index RND, to which end we follow the approach outlined in Figlewski (2010). At every point in 7 Specifically, the Black-Scholes vega measures variance risk in a setting where no variance risk premium exists. 10 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 49,
    "chunk_index": 18,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "time we select OTM forward put and call options that survive our filter criteria and convert their midquotes to the corresponding Black and Scholes (1973) IVs. As put and call options might trade at slightly different IVs, we smooth out potential jumps in IV at the transition point from put to call. In an interval of 2.5% around the ATMforwardprice, weapplytheblendingapproachsuggestedinFiglewski(2010)to achieve a smoothed weighted-average IV. Next, we perform a quartic spline to inter- polate the IV curve across a broad range of observed strike prices. We then compute a fine grid of 12,000 equally spaced strike prices on the interval [0.001,3·X ], where t X is the current index level, and determine their corresponding IVs. These IVs t are then converted back into put option prices, which we use to estimate the risk- neutral density by approximating derivatives of the put price function with respect to the strike price according to Breeden and Litzenberger (1978). This procedure is only valid between the lowest and the highest available strike prices. For strike prices beyond the observed range, we estimate a generalized extreme value (GEV) distribution to extend the risk-neutral density to the left and right tail. Given the RND, we compute model-free deltas and gammas according to a simple comparative static analysis. First, we assume that the entire RND is shifted upward by an infinitesimally small amount ε. Next, we reprice options under this shifted RND and observe the price change. Then, we consider a downward shift of the entire RND and perform the same repricing procedure. Lastly, we determine the average absolute price change from the two price changes, divide it by ε and use this measure as the model-free delta. The same idea is applied to gamma.8 3.4 Implementation of Strategies General Specifications Wenowturntotheconcretedesignofthetradingstrate- gies, which are based on the portfolios we presented in Subsection 3.2. As we use 8 Given the assumptions in play, model-free deltas of long call options are simply the probability masstotherightofthestrikeprice,whileforlongputoptionstheyarethenegativevalueofthe probability mass to the left of the strike price. Model-free gammas are simply the probability mass “at” the strike price, for both long call and long put options. Formally, these properties are provided in Appendix A1. 11 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 49,
    "chunk_index": 19,
    "word_count": 370,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "long call options are simply the probability masstotherightofthestrikeprice,whileforlongputoptionstheyarethenegativevalueofthe probability mass to the left of the strike price. Model-free gammas are simply the probability mass “at” the strike price, for both long call and long put options. Formally, these properties are provided in Appendix A1. 11 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 49,
    "chunk_index": 20,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "approximately one-month maturity S&P 500 options and hold them until expira- tion, we have to open new positions every month. Positions are established every Monday after the third Friday of the month. We index each strategy to a level of 100 as of January 1996 and then determine the cumulative wealth level through the end of our data sample in June 2021. For transaction costs, we use the ask price for option purchases (long positions) and the bid price for option sales (short positions). However, since institutional investors can probably trade at terms better than the quoted spread (Mayhew 2002; De Fontnouvelle, Fishe, and Harris 2003), we use an effective spread of 25% of the quoted spread as our baseline case.9 This is more conservative than approaches used by other papers examining option trading strategies—Goyal and Saretto (2009) and Cao and Han (2013) even assume an effective spread of 0% as the base case, i.e., trading is possible at the midquote. Transaction costs are incurred each time an option or the underlying is bought or sold. However, as cash-settled options do not incur additional transaction costs at expiration, we let options expire. We assume that transactions in the underlying, necessary for delta hedging, are possible at a quoted bid-ask spread of 3 basis points. In addition, we require margin accounts to collateralize the positions. For option trades, we apply the CBOE margin rules.10 We use the margin rules for initial margins and assume that there are no maintenance margins or other adjustments required within the trading month. For short positions in the underlying index, we assume that 150% of the short sale proceeds must be deposited, which is equivalent to the Federal Reserve Board’s “Regulation T”. Finally, the margin requirements for varianceswapsaresetinaccordancewiththe“marginrequirementsfornon-centrally 9 In practice, institutional investors also use limit order strategies to reduce transaction costs below the quoted spread. 10These rules provide detailed guidelines for individual options and option portfolios. Cao et al. (2021), for example, also use the CBOE margin rules for their option trading strategies. An overview of the CBOE margin requirements used in our study is provided in Appendix A2. 12 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 49,
    "chunk_index": 21,
    "word_count": 360,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "10These rules provide detailed guidelines for individual options and option portfolios. Cao et al. (2021), for example, also use the CBOE margin rules for their option trading strategies. An overview of the CBOE margin requirements used in our study is provided in Appendix A2. 12 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 49,
    "chunk_index": 22,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "cleared derivatives” of the Basel Committee on Banking Supervision (BCBS).11 We assume that margin accounts bear interest at the risk-free rate. We calculate the maximum possible exposure of trading strategies by levering the positions until the capital is fully used to buy long positions and provide margins on short positions. For equal exposure strategies, we lever the positions until each strategyhasthesamefactorexposure. Ineachperiod,weselectthestrategywiththe lowestgammawhenitisfullyleveredundermaximumexposure. Allotherstrategies are then scaled down to this exposure and the remaining capital is invested risk-free. Straddle and Butterfly Spread For the straddle, we choose a call and a put with strike prices closest to the ATM forward point. A straddle has its own CBOE marginrules. Thebutterflyspreadisobtainedbyaddingtwooptionstothestraddle. We add a call with a model-free delta of 0.05 and a put with a model-free delta of -0.05. Both options enter the straddle as long positions.12 Butterfly spread margins are those of a short call spread plus those of a short put spread, as there are no separate rules for butterfly spreads. Both the straddle and the butterfly spread may have some residual index exposure that we delta-hedge with an index position at initiation. At maturity, the option positions are cash-settled and the hedge positions in the index are closed. This is true for all strategies we consider. Strangle and Condor Strangle These are similar to the straddle and butterfly spread. We choose a call and a put expiring next month with model-free deltas of 0.20 and -0.20, respectively. Selling these two options results in a strangle. For the condor strangle, we again add two options. We add a call with a model-free delta of 0.05 and a put with a model-free delta of -0.05.13 The CBOE provides its own 11The BCBS requires that 15% of the variance notional be deposited as initial margin. The variance notional is the notional amount by which the difference between the floating leg and the fixed leg is multiplied. 12The choice of deltas is inspired by the CBOE S&P 500 Iron Butterfly Index, which is a hypo- thetical option trading strategy calculated by the CBOE that sells butterfly spreads. For more detail, see https://www.cboe.com/us/indices/dashboard/BFLY/ 13ThischoiceissimilartotheCBOES&P500IronCondorIndex, whichisahypotheticaloption- trading strategy from the CBOE selling condor strangles. For more detail, see https://www. cboe.com/us/indices/dashboard/CNDR/ 13 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 49,
    "chunk_index": 23,
    "word_count": 372,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "the CBOE S&P 500 Iron Butterfly Index, which is a hypo- thetical option trading strategy calculated by the CBOE that sells butterfly spreads. For more detail, see https://www.cboe.com/us/indices/dashboard/BFLY/ 13ThischoiceissimilartotheCBOES&P500IronCondorIndex, whichisahypotheticaloption- trading strategy from the CBOE selling condor strangles. For more detail, see https://www. cboe.com/us/indices/dashboard/CNDR/ 13 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 49,
    "chunk_index": 24,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "margin rules for the strangle, while for the condor strangle we combine the margins of a short call spread with those of a short put spread. Again, any remaining delta of the strategies is hedged via index positions. Delta-Hedged Call and Delta-Hedged Put Here, we select the call and put optionsexpiringnextmonththatareclosesttotheATMforwardpoint. Wesellthese options at the best bid (accounting for the effective spread) and hedge the resulting delta exposure with a long position in the underlying.14 To keep transaction costs low, the delta hedge is set up at initiation and is not readjusted until maturity. Variance Swap For this strategy, we calculate the variance swap rate according to Kozhan, Neuberger, and Schneider (2013). This leads to consistent pricing based on the same options for all strategies in our study. We select all OTM forward call andputoptionstocalculateswaprates. Transactioncostsareaccountedforbyusing bid quotes instead of midquotes to calculate variance swap rates. The strategy sells variance swaps at the swap rate and holds this position until maturity. By design, variance swaps are delta-neutral at inception. At maturity, the realized variance over the last month, calculated from daily data according to Kozhan, Neuberger, and Schneider (2013), is taken to determine the variance swap’s payoff. 4 Empirical Results 4.1 Maximum Exposure Strategies The first set of results relates to maximum exposure strategies and aims at a better understanding of the leverage problem. These strategies show whether desirable long-horizon risk-return patterns and reasonable leverage constraints result from the capital requirements of an initial investment (if any) plus margins. If not, the 14Thus, the short call requires a long position in the underlying, while the short put requires a short position in the underlying, for which additional margins must be deposited. 14 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 49,
    "chunk_index": 25,
    "word_count": 287,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "from the capital requirements of an initial investment (if any) plus margins. If not, the 14Thus, the short call requires a long position in the underlying, while the short put requires a short position in the underlying, for which additional margins must be deposited. 14 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 49,
    "chunk_index": 26,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "questioniswhethertheconstraintsarealreadytootighttoearnsignificantpremiums or, on the contrary, too loose to protect long-term investors from excessive risk. [Insert Figure 2 about here.] Figure 2 provides the accumulated wealth over time, as created by different strate- gies. For each strategy, the initial budget in January 1996 is $100. The figure shows large differences among strategies. One group of extremely risky strategies consists of the straddle and the strangle. These strategies reach very high wealth levels by 2007, but collapse during the financial crisis in October 2008. While the straddle recovers quickly from this shock, the strangle barely survives and does not have enough capital to recover quickly. It is eventually hit by the market turmoil due to the Covid-19 pandemic and is forced into bankruptcy in March 2020. The straddle also takes a massive hit from the pandemic. The butterfly spread and the condor strangle dampen to some extent the extremes of the straddle and the strangle. How- ever, they are still very risky and are also hit hard by the variance shocks of the financial crisis and the Covid-19 pandemic. Interestingly, the delta-hedged put and call strategies display different behavior. The delta-hedged put fluctuates more and shows a steeper trend. In contrast, the delta-hedged call has a very smooth path, but does not seem to generate enough exposure for a significant upward movement, especially after the financial crisis. Finally, the variance swap combines a clear up- ward trend with a very smooth path, except during the most extreme months of the financial crisis and the Covid-19 pandemic. [Insert Table 1 about here.] Table 1 shows, by means of summary statistics, how the different strategies perform. Panel A reports the sample moments of monthly returns and Panel B describes downside risk. The first three measures of downside risk (VaR, CVaR, Max Loss) take a monthly perspective and refer to (potential) losses in the following month. This view is sufficient for a monthly investment horizon. A long-term investor, 15 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 49,
    "chunk_index": 27,
    "word_count": 329,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "monthly returns and Panel B describes downside risk. The first three measures of downside risk (VaR, CVaR, Max Loss) take a monthly perspective and refer to (potential) losses in the following month. This view is sufficient for a monthly investment horizon. A long-term investor, 15 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 49,
    "chunk_index": 28,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "however, cares about the characteristics of the entire path. In particular, the ability of a given strategy to recover from an intermediate downturn is crucial. Therefore, Panel B offers four different drawdown statistics. The maximum drawdown (Max DD) is the maximum percentage loss of a strategy from its current maximum value toatrough. Theaveragedrawdown(AverageDD)showshowfar(onaverageoverall months of the 25-year period) a strategy is from its previous maximum. Drawdown length indicates how many months it takes to reach a new wealth maximum at a given point in time. For this measure, we report the maximum number of months (Max DD Length) and the average (over all months of the 25-year period) number of months (Average DD Length). For completeness, Panel C of Table 1 repeats the final wealth levels at the end of the sample period as seen in Figure 2 and converts them to annual geometric average returns. Table 1 reveals several key differences between the strategies. First, compared to the strangle, the straddle’s returns have a higher mean, a lower standard deviation, are less skewed to the left, and have a lower kurtosis. The straddle is less risky than the strangle by all measures of downside risk. Therefore, under maximum exposure, replacing a straddle with a strangle does not reduce risk, especially for large downturns. Both straddle and strangle strategies are highly speculative, with high mean returns but massive downside risk. Second, for insight into the impact of floors we compare straddles to butterfly spreads and strangles to condor strangles. Floors result in less negative skewness and less kurtosis, but they also lower mean returns. Because of this cost, such floors may not be the best way to reduce risk. Indeed, the butterfly spread and the condor strangle display much more downside risk than the delta-hedged put, the delta-hedged call, and the variance swap. Third, the variance swap’s monthly returns show by far the most negative skewness and the highest kurtosis of all variance strategies. However, these characteristics do not necessarily imply high downside risk, as standard deviation and path dynamics also matter. Although the variance swap experiences some heavy losses (the maximum monthly loss is almost 37%), the relatively short drawdown length shows that the strategy can recover quite well from such losses. 16 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 49,
    "chunk_index": 29,
    "word_count": 379,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "necessarily imply high downside risk, as standard deviation and path dynamics also matter. Although the variance swap experiences some heavy losses (the maximum monthly loss is almost 37%), the relatively short drawdown length shows that the strategy can recover quite well from such losses. 16 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 49,
    "chunk_index": 30,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "In summary, there are clear differences between the various maximum exposure strategies. The delta-hedged call seems to generate relatively low factor exposure, even compared to the delta-hedged put. Other strategies create large exposure and massiverisks(straddle, strangle); stillothersseemtohavevarianceexposureoffering promising risk-return profiles (delta-hedged put, variance swap) and relatively quick recovery from setbacks. In factor investing, however, investors seek to manage and control exposure. They look for a strategy that most efficiently exploits a given exposure, which can be studied using equal exposure strategies. 4.2 Equal Exposure Strategies Figure 3 and Table 2 show the wealth accumulation and summary statistics of dif- ferent equal exposure strategies. As expected, standardizing strategies by ex-ante gamma leads to a more homogeneous picture, with the following key results. First, there is no clear evidence that a strangle helps reduce the risk of a straddle, as strangle returns are even more left-skewed and leptokurtic. In terms of downside risk, the different measures point in different directions. The straddle has a less negative VaR and CVaR, but a higher maximum loss. The maximum drawdown (DD) and maximum DD length are lower for the strangle, but the straddle offers loweraverageDDandaverageDDlength. Second, whilethebutterfly’sandcondor’s floors help with monthly skewness and kurtosis, they are not effective in reducing downside risk. Third, the delta-hedged put, delta-hedged call, and straddle have very similar paths and distributional properties. So if these behave differently un- der maximum exposure, it is due to their different potential for leverage. Indeed, the delta-hedged call requires going long in the index, which consumes considerable cap- ital. In contrast, the delta-hedged put involves shorting the index, with only margin requirements. The delta-hedged put therefore has much greater leverage potential compared to the call. A (delta-hedged) straddle requires a very small investment (long or short) in the index. In addition, the CBOE’s margin requirements for a short straddle are much lower than the sum of the margin requirements for a short 17 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 49,
    "chunk_index": 31,
    "word_count": 324,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "greater leverage potential compared to the call. A (delta-hedged) straddle requires a very small investment (long or short) in the index. In addition, the CBOE’s margin requirements for a short straddle are much lower than the sum of the margin requirements for a short 17 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 49,
    "chunk_index": 32,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "call and a short put. Therefore, straddles can achieve much higher gammas than the other strategies. Fourth and last, the variance swap has the highest return of all the variance strategies while showing the lowest downside risk for the majority of the risk measures. [Insert Figure 3 about here.] [Insert Table 2 about here.] 4.3 Why do Strategies Differ? Is it Payoff or Costs? Differences remain between the strategies even with the same gamma exposure. Where do they come from? Two possible reasons are different payoff structures and potential differences in transaction costs. Since new derivative positions must be set up regularly due to the finite maturity of options, the latter may be substantial. The similarityofthepayoffsshouldbereflectedinhighreturncorrelations. Table3shows such correlations between the monthly returns of the different strategies. Delta- hedged call, delta-hedged put, and straddle have very high correlations (over 0.99), consistent with theory.15 Strangle, condor strangle, and butterfly spread are less correlated, consistent with their modified payoff profiles, but still show correlations above 0.9 with the first group. Most striking is the variance swap’s lower correlation (below 0.7) with all other strategies, indicating uniqueness. [Insert Table 3 about here.] At first glance, it is difficult to say whether it is the payoff profile that makes the variance swap unique. This payoff depends on the realized variance over the price path, while other strategies have payoffs that depend only on the price of the underlying (index level) at the options’ maturity date. The initial replicating portfolio of the variance swap, however, can provide some intuition. Its payoff 15In a world without transaction costs, where put-call parity holds exactly, the payoff profiles of the three strategies are identical for the same gamma exposure. 18 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 49,
    "chunk_index": 33,
    "word_count": 287,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "the options’ maturity date. The initial replicating portfolio of the variance swap, however, can provide some intuition. Its payoff 15In a world without transaction costs, where put-call parity holds exactly, the payoff profiles of the three strategies are identical for the same gamma exposure. 18 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 49,
    "chunk_index": 34,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "function can be directly compared with the payoff profile of the other strategies. For example, Figure 4 shows the payoff functions of the delta-hedged put and the variance swap replicating portfolio for the setup date 24/10/2016. This picture is also quite typical for other setup dates.16 The payoff function of the delta-hedged put is a piecewise linear function, with a kink at the forward price. Thus, losses grow linearly with the distance between the index and the forward price. The variance swap’s payoff profile, on the other hand, is strongly non-linear. There is a wide range around the forward price where the payoff function is almost flat. This feature also leads to a relatively large gap between the two break-even points (-3.62% and 3.36%), compared to the delta-hedged put (-2.01% and 3.4%). The variance swap makes similar profits over a wide range around the ATM point, consistent with the strategy’s relatively smooth path of cumulative wealth. The variance swap’s payoff is also strongly asymmetrical: losses remain moderate when the index level rises, contributing to a smooth path. Only when the index loses massively does the variance swap realize losses that seem to grow exponentially with the index decline. The latter observation is consistent with the high negative skewness and high maximum loss of the variance swap. [Insert Figure 4 about here.] Transaction costs provide another possible reason for differences between strategies. An intuitive guess is that strategies using more than two option contracts, or OTM and ITM options, are costlier than those using only one or two ATM options. The former properties apply to the strangle, butterfly spread, condor strangle, and the replicating portfolio of the variance swap, while the latter one characterizes the delta-hedged call, delta-hedged put, and straddle. The intuitive guess is confirmed by Figure 5. Part (a) shows the strategies’ cumulative wealth when we reduce the effective spread from 25% (base case) to zero. Part (b) shows cumulative wealth for an effective spread of 50%. Moving from a 50% effective spread to zero improves 16The payoff function depends on the forward price, the available strike prices and the deltas of the options on the setup date. Therefore, the payoff function varies over time. 19 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 49,
    "chunk_index": 35,
    "word_count": 372,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "for an effective spread of 50%. Moving from a 50% effective spread to zero improves 16The payoff function depends on the forward price, the available strike prices and the deltas of the options on the setup date. Therefore, the payoff function varies over time. 19 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 49,
    "chunk_index": 36,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "the final wealth (after 25 years) of the condor strangle by 30%, the butterfly spread by 24%, and the variance swap by 18%. In contrast, the delta-hedged call, put and straddle only show an increase in wealth of about 14% to 16%. That said, the variance swap retains the highest final wealth even under a 50% effective spread. The condor strangle, strangle and butterfly spread still deliver the lowest terminal wealthevenwithouttransactioncosts. Thus, differenttransactioncostsarecertainly not the only cause of differences in performance. [Insert Figure 5 about here.] 4.4 Variance Strategies and Market Movements We can learn more about the properties of variance strategies by looking at their relationship to market (index) movements. The performance of variance strategies is closely linked to the market for at least two reasons. First, in our study, the index is the underlying of the derivatives positions that implement variance strate- gies. Therefore, by construction, strategy payoffs are linked to market movements, which can be clearly seen in Figures 1 and 4. Choosing between profiles is indeed our “payoff problem”. Second, previous research has shown an inverse relationship between market movements and variance changes, i.e., variances tend to increase when the market goes down (Black 1976; Christie 1982; Bollerslev et al. 2006). Our variance strategies, however, need not be affected in a similar way. In what follows, we focus on only two strategies as the strangle, condor strangle, and butterfly spread do not provide improvements. The first, the delta-hedged put, represents the group consisting of delta-hedged call, put and straddle. The second strategy is the variance swap. To give these strategies a chance to exploit their full “variance exposure”, we consider their maximum exposure variants. Figure 6 shows the cumulative wealth of a buy-and-hold index investment in the S&P 500, along with the two variance strategies. An investment in the risk-free instrument is also shown as a reference point. Since 2003, the market and the two 20 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 49,
    "chunk_index": 37,
    "word_count": 325,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "maximum exposure variants. Figure 6 shows the cumulative wealth of a buy-and-hold index investment in the S&P 500, along with the two variance strategies. An investment in the risk-free instrument is also shown as a reference point. Since 2003, the market and the two 20 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 49,
    "chunk_index": 38,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "variance strategies show similar trends. Setbacks of the index are clearly visible in the delta-hedged put strategy. This is obviously the case for the 2008 financial crisis and the Covid-19 shock in 2020, but it is also true for the 2002 market downturn (i.e., the aftermath of 9/11) and the market drop at the end of 2018. In contrast, the variance swap strategy seems to be mainly affected only by the two very large market shocks. This observation suggests market returns would be more highly correlated with delta-hedged put returns than with variance swap returns. However, the opposite is true, with monthly return correlations of 0.38 (market and delta- hedged put) and 0.52 (market and variance swap). [Insert Figure 6 about here.] Figure 7 sheds light on this result and plots monthly delta-hedged put returns (part (a)) and variance swap returns (part (b)) as a function of market returns. For the delta-hedged put, the relationship is clearly positive when the market falls, but it is negative when the market rises. Overall, this non-linear relationship results in a moderately positive correlation, because large negative market movements are more frequent than positive ones. For the variance swap, the relationship is nearly flat over much of the market’s return distribution. Only for very large negative market returns is the relationship clearly positive. Since there is no offsetting effect for rising markets, the correlation between the market and variance swap is positive and higher than for the delta-hedged put. These results are well in line with the examples of the payoff profiles in Figure 4. [Insert Figure 7 about here.] 4.5 “Variance” as an Investment Style The strategies under study are different ways to earn VRPs. More broadly, they are examples of factor investments because “stock index variance” is just one among many equity-based factors. In this section, we relate variance strategies to other 21 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 49,
    "chunk_index": 39,
    "word_count": 316,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "4.5 “Variance” as an Investment Style The strategies under study are different ways to earn VRPs. More broadly, they are examples of factor investments because “stock index variance” is just one among many equity-based factors. In this section, we relate variance strategies to other 21 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 49,
    "chunk_index": 40,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "factor investments. Specifically, we consider the S&P 500 index (market), long-short portfolios of the remaining four factors of the Fama and French (2015) five-factor model (Size (SMB), Value (HML), Profitability (RMW), Investment (CMA)), plus Momentum (MOM).17 Factor returns are constructed such that their return periods coincide with the roll-over periods from our option strategies.18 We achieve this by computing geometric returns over the specified investment horizon for every individual portfolio and eventually determine the factor returns according to the definitions from Fama and French (2015). Data on the additional factors is from Kenneth French’s website.19 [Insert Figure 8 about here.] Figure 8 shows the growth in cumulative wealth for each of the factor investments. One result especially stands out. After the financial crisis, since mid-2009, none of theSMB,HML,RMW,CMA,andMOMstrategieshasanupwardtrend.20 Onlythe market and the two variance strategies show meaningful upward movements during this period. This distinguishes the variance strategies from the other five strategies that try to earn additional risk premiums besides the market. What is more, in the period prior to the financial crisis, the variance strategies and momentum show the strongest upward trend. Table 4 presents return and risk statistics for the different factor investments. In our view, the most relevant reference point for variance strategies is the market investment, as it is alone in generating significant premiums after the financial crisis. Lookingatthemonthlyreturnstatistics, marketandvariancestrategiesdonotdiffer much in terms of mean returns and standard deviations. However, the variance 17Since long-short portfolios do not require an initial investment, the initial capital of $100 is invested in an account earning the risk-free rate. 18The original monthly Fama and French (2015) factor returns are based on calendar months. 19https://mba.tuck.dartmouth.edu/pages/faculty/ken.french/data_library.html. 20When interpreting the performance of these five factor strategies, one has to keep in mind that they provide an overly optimistic view of the corresponding styles. The reason is that no transaction costs of portfolio revisions are taken into account in the performance calculations, as is the case with the variance strategies. 22 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 49,
    "chunk_index": 41,
    "word_count": 332,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "strategies, one has to keep in mind that they provide an overly optimistic view of the corresponding styles. The reason is that no transaction costs of portfolio revisions are taken into account in the performance calculations, as is the case with the variance strategies. 22 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 49,
    "chunk_index": 42,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "strategies–especially the variance swap–show more negative skewness and higher excess kurtosis, supporting the idea of “picking up nickels in front of a steamroller”. What do these results mean for the long-term investor? Most of the time, the vari- ance strategies generate a cumulative wealth above the wealth level of the market investment. What is more, as shown in Panel B, the variance swap has lower down- side risk than the market according to all measures except for maximum loss. While variance strategies do occasionally experience extreme losses, their magnitude is similar to the market’s. Moreover, variance strategies recover from previous losses relatively quickly, i.e., they generate strong upside movements in a fairly short pe- riod of time. This feature is especially clear after the 2008 financial crisis and after the low point of the Covid-19 pandemic.21 In this sense, variance strategies are able to pick up more than “nickels” in such periods. [Insert Table 4 about here.] Finally, we examine the monthly co-movement of variance strategies with other factor portfolios. This helps us understand under which economic conditions the variance premiums are smaller or larger. Table 5 shows the results of regressing monthly variance strategy returns on either the market returns or the returns of all six factor portfolios. For the market, the relationship is positive and statistically significant. As seen above, the linear approximation does not fully reveal the true non-linear structure, at least for the delta-hedged put. However, an overall positive co-movement is economically intuitive. It is consistent with large market down- turns (within a month) being larger than large market upturns, and the notion of increasing variance in falling equity markets. [Insert Table 5 about here.] The only other significant factor is size, which loads positively. Strategies that sell insuranceagainsthighmarketvolatilitytendtoperformpoorlywhensmallcapsalso 21Unfortunately, our data set ends in June 2021, but some degree of recovery from the Covid-19 shock is already evident since March 2020. The variance swap has already recovered 46% of its loss since the market crashed, the delta-hedged put 29%. 23 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 49,
    "chunk_index": 43,
    "word_count": 340,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "that sell insuranceagainsthighmarketvolatilitytendtoperformpoorlywhensmallcapsalso 21Unfortunately, our data set ends in June 2021, but some degree of recovery from the Covid-19 shock is already evident since March 2020. The variance swap has already recovered 46% of its loss since the market crashed, the delta-hedged put 29%. 23 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 49,
    "chunk_index": 44,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "underperform. This makes economic sense: during volatile times, small caps likely will struggle more than large caps because they are more vulnerable, on average.22 Taken together, the market and size factors capture 20% (delta-hedged put) or 32% (variance swap) of the variance strategies’ return fluctuations. Then, are variance strategies valuable additions to the long-term investor’s oppor- tunity set of stock-related factors? Given the results of Table 5, the answer is ambiguous. The alphas of the delta-hedged put and the variance swap in the full regression model (columns (3) and (4)) are 0.30% and 0.22% per month, respec- tively. This is economically significant compared with an average market return of 0.93%. However, these alphas are not statistically significant. One reason is the high residual variance caused by only two observations, October 2008 and March 2020. Indeed, thesetwomonthshaveanoutsizedinfluenceontheresultingestimatesofthe factor loadings, as the OLS estimator is not robust.23 We therefore re-estimate the regression models with a more robust method, the least absolute deviation (LAD) estimator, which minimizes the mean absolute residual error.24 Table 6 presents the LAD regression results. First, under LAD, factor loadings are much smaller for market and size; indeed the market coefficient becomes insignifi- cant for the delta-hedged put. This finding suggests potentially high diversification benefits if a delta-hedged put strategy complements a market investment, given that such benefits are measured in terms of mean absolute deviations instead of standard deviations.25 Second, compared to OLS, LAD regressions attribute a higher pro- portion of the variance strategies’ mean returns to alpha. The estimated alphas of 22This conjecture is supported by, for example, Duffee (1995) and Ang and Chen (2002). 23Specifically,Cook’sdistances(Cook(1977))forthesetwoobservationsreachfrom10to226times the average Cook’s distance in the respective models, indicating highly influential observations. 24See, for example, Hill and Holland (1977). To account for potential heteroskedasticity and autocorrelation in the LAD framework, we determine standard errors with a block bootstrap method. We use a block length of 12, to be consistent with the number of lags applied for the Newey and West (1987) t-statistics of Table 5. 25By moving from a pure market investment to a 50/50 market/delta-hedged put portfolio, the monthly standard deviation is reduced by about 20% and the mean absolute deviation is low- ered by more than 40%. As the results by Goldstein and Taleb (2007) suggest, even finance professionals consider mean absolute deviation to be a more intuitive dispersion measure than standard deviation. 24 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 49,
    "chunk_index": 45,
    "word_count": 400,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "deviation is reduced by about 20% and the mean absolute deviation is low- ered by more than 40%. As the results by Goldstein and Taleb (2007) suggest, even finance professionals consider mean absolute deviation to be a more intuitive dispersion measure than standard deviation. 24 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 49,
    "chunk_index": 46,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "1.02% and 0.53% per month of the delta-hedged put and variance swap strategies, respectively, are clearly economically and statistically significant. [Insert Table 6 about here.] Overall,theresultssuggestthatvariancestrategiesareattractivefactorstrategiesfor long-term investors. These strategies can provide valuable alternatives to a market investment, with a similar overall performance but clearly different downside risk characteristics. They can also be useful complements to a market investment by providing diversification benefits and significant alpha. 5 Conclusion The variance risk premium is a well-documented empirical phenomenon in option markets. This paper analyzes whether and how investors can exploit this premium for long-term capital accumulation. We identify three general problems that arise in designing long-term variance-based investment strategies. We suggest specific design elements to help mitigate these problems and propose corresponding trading strategies. To determine how much variance risk these strategies are exposed to ex- ante, we consider either (i) the maximum exposure based on capital requirements or (ii) equalized exposure using a model-free measure of convexity (gamma). In an empirical study for the S&P 500 index options market, we analyze the performance of different variance strategies. We compare them to each other and to equity- based factor investing strategies. Our analysis shows that variance strategies differ substantially in some key aspects of risk and return, are significantly positively correlated with the market, and consistently earn premiums over the entire study period. The latter distinguishes variance strategies from other factor strategies, which have not generated premiums since the 2008 financial crisis. Even though variance strategies can be hit hard by rare stock market crashes, they also can recover quickly from these shocks. In sum, our empirical results show that variance 25 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 49,
    "chunk_index": 47,
    "word_count": 276,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "strategies from other factor strategies, which have not generated premiums since the 2008 financial crisis. Even though variance strategies can be hit hard by rare stock market crashes, they also can recover quickly from these shocks. In sum, our empirical results show that variance 25 Electronic copy available at: https://ssrn.com/abstract=3989529 strategies can be attractive to the long-term investor—both as an alternative and as a complement to a market investment—if properly designed. 26 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Document",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 49,
    "chunk_index": 48,
    "word_count": 77,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "crashes, they also can recover quickly from these shocks. In sum, our empirical results show that variance 25 Electronic copy available at: https://ssrn.com/abstract=3989529 strategies can be attractive to the long-term investor—both as an alternative and as a complement to a market investment—if properly designed. 26 Electronic copy available at: https://ssrn.com/abstract=3989529 A1 Model-Free Deltas and Gammas In order not to depend on a specific valuation model, in particular the Black-Scholes model, which does not allow for variance risk premiums, we compute deltas and gammas in a model-free fashion. For illustrative purposes, consider a discrete dis- tribution of the future stock price with price states S , i = 1,...,¯i,...,N, and i corresponding risk-neutral probabilities q . Further, assume that the risk-free rate i is zero. Now, shift the whole price distribution state by state by an infinitesimally small amount ε to the right, such that the new price states and corresponding prob- abilities are S +ε,...,S +ε, 1 N q ,...,q . 1 N The value of a European call option CE with X = S prior to the shift is ¯i N (cid:88) CE(X) = (S −X)q . (A.1) i i i=¯i+1 After the shift, the value is N (cid:88) CE(X) = (S +ε−X)q i i i=¯i N N (cid:88) (cid:88) = (S i −X)q i + εq i +(S ¯i +ε−X)q ¯i (A.2) i=¯i+1 i=¯i+1 N N (cid:88) (cid:88) = (S −X)q + εq . i i i i=¯i+1 i=¯i The delta of an option O is defined as the change in value of the option divided by the change in value of the underlying, that is ∆ = dO/dS. Equations (A.1) and 27 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Appendix",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 49,
    "chunk_index": 49,
    "word_count": 280,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Appendix (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "= (S −X)q + εq . i i i i=¯i+1 i=¯i The delta of an option O is defined as the change in value of the option divided by the change in value of the underlying, that is ∆ = dO/dS. Equations (A.1) and 27 Electronic copy available at: https://ssrn.com/abstract=3989529 (A.2) show that the change in value of the call equals (cid:80)N εq . Thus, i=¯i i dO (cid:80)N εq (cid:88) N ∆ = = i=¯i i = q . (A.3) C i dS ε i=¯i For a European call option, this example with discrete price states shows that the model-free delta equals the cumulative probability of all future outcomes above the strike price. Conversely, it can be shown that the model-free delta for a put option is dO − (cid:80)¯i εq (cid:88) ¯i ∆ = = i=1 i = − q . (A.4) P i dS ε i=1 With the deltas from Equations (A.3) and (A.4), it follows that a model-free gamma γ—the change in the delta of an option induced by a infinitesimal change in the underlying’s price—equals the probability density function q (PDF) at the strike ¯i price for both calls and puts: γ = γ = q . (A.5) C P ¯i 28 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Appendix",
    "page_number": 29,
    "page_range": "p.29-30",
    "total_pages": 49,
    "chunk_index": 50,
    "word_count": 212,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Appendix (p.29-30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "gamma γ—the change in the delta of an option induced by a infinitesimal change in the underlying’s price—equals the probability density function q (PDF) at the strike ¯i price for both calls and puts: γ = γ = q . (A.5) C P ¯i 28 Electronic copy available at: https://ssrn.com/abstract=3989529 A2 CBOE Margin Requirements This appendix provides a summary of relevant CBOE margin requirements that are used to implement the variance strategies. Further information and sample calculations can be found on the homepage of the CBOE.26 Short Call Initial Margin Requirement: • 100% of option proceeds, plus 15% of aggregate underlying index value (num- ber of contracts × index level × $100) less out-of-the-money amount, if any • minimum requirement is option proceeds plus 10% of the aggregate underlying index value • proceeds received from sale of call(s) may be applied to the initial margin requirement Short Put Initial Margin Requirement: • 100% of option proceeds, plus 15% of aggregate underlying index value (num- ber of contracts × index level × $100) less out-of-the-money amount, if any • minimumrequirementisoptionproceedsplus10%oftheput’saggregatestrike price (number of contracts × strike price × $100) • proceeds received from sale of puts(s) may be applied to the initial margin requirement Short Straddle Initial Margin Requirement: • short call(s) or short put(s) requirement, whichever is greater, plus the option proceeds of the other side • proceeds from sale of entire straddle may be applied to initial margin require- ment 26https://www.cboe.com/us/options/strategy_based_margin/. 29 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Appendix",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 49,
    "chunk_index": 51,
    "word_count": 248,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Appendix (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "to the initial margin requirement Short Straddle Initial Margin Requirement: • short call(s) or short put(s) requirement, whichever is greater, plus the option proceeds of the other side • proceeds from sale of entire straddle may be applied to initial margin require- ment 26https://www.cboe.com/us/options/strategy_based_margin/. 29 Electronic copy available at: https://ssrn.com/abstract=3989529 • short call(s) or short put(s) requirement, whichever is greater, plus the option proceeds of the other side • proceeds from sale of entire strangle may be applied to initial margin require- ment Short Call Spread Initial Margin Requirement: • the amount by which the short call aggregate strike price is below the long call aggregate strike price (aggregate strike price = number of contracts × strike price × $100) • long call(s) must be paid for in full • proceedsreceivedfromsaleofshortcall(s)maybeappliedtotheinitialmargin requirement Short Put Spread Initial Margin Requirement: • the amount by which the long put aggregate strike price is below the short put aggregate strike price (aggregate strike price = number of contracts × strike price × $100) • long put(s) must be paid for in full • proceedsreceivedfromsaleofshortput(s)maybeappliedtotheinitialmargin requirement 30 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "Short Strangle Initial Margin Requirement:",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 49,
    "chunk_index": 52,
    "word_count": 187,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Short Strangle Initial Margin Requirement: (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "Requirement: • the amount by which the long put aggregate strike price is below the short put aggregate strike price (aggregate strike price = number of contracts × strike price × $100) • long put(s) must be paid for in full • proceedsreceivedfromsaleofshortput(s)maybeappliedtotheinitialmargin requirement 30 Electronic copy available at: https://ssrn.com/abstract=3989529 Ang, A. and J. Chen (2002). Asymmetric correlations of equity portfolios. Journal of Financial Economics 63(3), 443–494. Aubry, J.-P., A. Chen, and A. H. Munnell (2017). A first look at alternative invest- ments and public pensions. Center for Retirement Research at Boston College 55, 1–18. Bakshi, G. and N. Kapadia (2003). Delta-hedged gains and the negative market volatility risk premium. Review of Financial Studies 16(2), 527–566. Black, F. (1976). Studies of stock market volatility changes. Proceedings of the American Statistical Association, Business and Economic Statistics Section, 177– 181. Black, F. and M. Scholes (1973). The pricing of options and corporate liabilities. Journal of Political Economy 81(3), 637–654. Bollerslev, T., J.Litvinova, andG.Tauchen(2006). Leverageandvolatilityfeedback effects in high-frequency data. Journal of Financial Econometrics 4(3), 353–384. Breeden, D. T. and R. H. Litzenberger (1978). Prices of state-contingent claims implicit in option prices. Journal of Business 51(4), 621–651. Bri`ere, M., A. Burgues, and O. Signori (2010). Volatility exposure for strategic asset allocation. Journal of Portfolio Management 36(3), 105–116. Cao, J. and B. Han (2013). Cross section of option returns and idiosyncratic stock volatility. Journal of Financial Economics 108(1), 231–249. Cao, J., B. Han, X. Zhan, and Q. Tong (2021). Option return predictability. Review of Financial Studies, forthcoming. Carr, P. and L. Wu (2009). Variance risk premiums. Review of Financial Stud- ies 22(3), 1311–1341. 31 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "References",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 49,
    "chunk_index": 53,
    "word_count": 274,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "and idiosyncratic stock volatility. Journal of Financial Economics 108(1), 231–249. Cao, J., B. Han, X. Zhan, and Q. Tong (2021). Option return predictability. Review of Financial Studies, forthcoming. Carr, P. and L. Wu (2009). Variance risk premiums. Review of Financial Stud- ies 22(3), 1311–1341. 31 Electronic copy available at: https://ssrn.com/abstract=3989529 Christie, A. A. (1982). The stochastic behavior of common stock variances—Value, leverage and interest rate effects. Journal of Financial Economics 10(4), 407–432. Clark, S. P. and M. Dickson (2019). Performance expectations of basic options strategies may be different than you think. Journal of Asset Management 20(2), 91–102. Cook, R. D. (1977). Detection of influential observation in linear regression. Tech- nometrics 19(1), 15–18. Coval, J. D. and T. Shumway (2001). Expected option returns. Journal of Fi- nance 56(3), 983–1009. Cremers, M., M. Halling, and D. Weinbaum (2015). Aggregate jump and volatility risk in the cross-section of stock returns. Journal of Finance 70(2), 577–614. De Fontnouvelle, P., R. P. H. Fishe, and J. H. Harris (2003). The behavior of bid- ask spreads and volume in options markets during the competition for listings in 1999. Journal of Finance 58(6), 2437–2463. Duffee, G. R. (1995). Stock returns and volatility—A firm-level analysis. Journal of Financial Economics 37(3), 399–420. Egloff, D., M.Leippold, andL.Wu(2010). Thetermstructureofvarianceswaprates and optimal variance swap investments. Journal of Financial and Quantitative Analysis 45(5), 1279–1310. Fallon, W. and J. Park (2016). An asset class characterization of the U.S. equity index volatility risk premium. Journal of Portfolio Management 43(1), 72–84. Fallon, W., J. Park, and D. Yu (2015). Asset allocation implications of the global volatility premium. Financial Analysts Journal 71(5), 38–56. Fama, E. F. and K. R. French (2015). A five-factor asset pricing model. Journal of Financial Economics 116(1), 1–22. 32 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "References",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 49,
    "chunk_index": 54,
    "word_count": 291,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "Portfolio Management 43(1), 72–84. Fallon, W., J. Park, and D. Yu (2015). Asset allocation implications of the global volatility premium. Financial Analysts Journal 71(5), 38–56. Fama, E. F. and K. R. French (2015). A five-factor asset pricing model. Journal of Financial Economics 116(1), 1–22. 32 Electronic copy available at: https://ssrn.com/abstract=3989529 Figlewski, S. (2010). Estimating the implied risk-neutral density for the U.S. market portfolio. In T. Bollerslev, J. R. Russell, and M. Watson (Eds.), Volatility and Time Series Econometrics: Essays in Honor of Robert F. Engle, pp. 323–353. New York: Oxford University Press. Goldstein, D. G. and N. N. Taleb (2007). We don’t quite know what we are talking about when we talk about volatility. Journal of Portfolio Management 33(4), 84–86. Goyal, A. and A. Saretto (2009). Cross-section of option returns and volatility. Journal of Financial Economics 94(2), 310–326. Hafner, R.andM.Wallmeier(2007). Volatilityasanassetclass: Europeanevidence. European Journal of Finance 13(7), 621–644. Hafner, R. and M. Wallmeier (2008). Optimal investments in volatility. Financial Markets and Portfolio Management 22(2), 147–167. Hill, R. W. and P. W. Holland (1977). Two robust alternatives to least-squares regression. Journal of the American Statistical Association 72(360a), 828–833. Israelov, R. and L. N. Nielsen (2015). Covered calls uncovered. Financial Analysts Journal 71(6), 44–57. Kozhan, R., A. Neuberger, and P. Schneider (2013). The skew risk premium in the equity index market. Review of Financial Studies 26(9), 2174–2203. Litterman, R. (2011). Who should hedge tail risk? Financial Analysts Jour- nal 67(3), 6–11. Mayhew, S. (2002). Competition, market structure, and bid-ask spreads in stock option markets. Journal of Finance 57(2), 931–958. Newey, W.K.andK.D.West(1987). Asimple, positivesemi-definite, heteroskedas- ticityandautocorrelationconsistentcovariancematrix. Econometrica 55(3), 703– 708. 33 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "References",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 49,
    "chunk_index": 55,
    "word_count": 273,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "26(9), 2174–2203. Litterman, R. (2011). Who should hedge tail risk? Financial Analysts Jour- nal 67(3), 6–11. Mayhew, S. (2002). Competition, market structure, and bid-ask spreads in stock option markets. Journal of Finance 57(2), 931–958. Newey, W.K.andK.D.West(1987). Asimple, positivesemi-definite, heteroskedas- ticityandautocorrelationconsistentcovariancematrix. Econometrica 55(3), 703– 708. 33 Electronic copy available at: https://ssrn.com/abstract=3989529 Novy-Marx, R. and J. Rauh (2011). Public pension promises: How big are they and what are they worth? Journal of Finance 66(4), 1211–1249. Segal, J. (2020). Pensions love alternative investments more than ever. Institutional Investor. Simon, D. P. (2017). Trading the VIX futures roll and volatility premiums with VIX options. Journal of Futures Markets 37(2), 184–208. Simon, D. P. and J. Campasano (2014). The VIX futures basis: Evidence and trading strategies. Journal of Derivatives 21(3), 54–69. Ungar, J. and M. T. Moran (2009). The cash-secured PutWrite strategy and perfor- mance of related benchmark indexes. Journal of Alternative Investments 11(4), 43–56. Whaley, R. E. (2002). Return and risk of CBOE Buy Write monthly index. Journal of Derivatives 10(2), 35–42. Zhou, H. (2018). Variance risk premia, asset predictability puzzles, and macroeco- nomic uncertainty. Annual Review of Financial Economics 10, 481–497. 34 Electronic copy available at: https://ssrn.com/abstract=3989529 Figure 1: Stylized Payoffs: Straddle, Strangle, and Butterfly Spread (a) Straddle Short (b) Strangle Short (c) Butterfly Spread Short Note: Thisfigureshowsstylizedpayoffsofashortpositioninastraddle(part(a)),ashortposition in a strangle (part (b)), and a short position in a butterfly spread (part (c)). 35 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "References",
    "page_number": 35,
    "page_range": "p.35-37",
    "total_pages": 49,
    "chunk_index": 56,
    "word_count": 236,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.35-37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "10, 481–497. 34 Electronic copy available at: https://ssrn.com/abstract=3989529 Figure 1: Stylized Payoffs: Straddle, Strangle, and Butterfly Spread (a) Straddle Short (b) Strangle Short (c) Butterfly Spread Short Note: Thisfigureshowsstylizedpayoffsofashortpositioninastraddle(part(a)),ashortposition in a strangle (part (b)), and a short position in a butterfly spread (part (c)). 35 Electronic copy available at: https://ssrn.com/abstract=3989529 Figure 2: Maximum Exposure Strategies: Cumulative Wealth 2000 2005 2010 2015 2020 0006 0005 0004 0003 0002 0001 0 Date ralloD ni htlaeW Delta−Hedged Call Delta−Hedged Put Variance Swap Straddle Butterfly Spread Strangle Condor Strangle 1654.31 1625.52 947.38 828.62 678.03 452.13 0 Note: This figure shows the cumulative wealth development of seven maximum exposure variance strategies for an initial investment of $100. The data period covers January 1996 to June 2021. 36 Electronic copy available at: https://ssrn.com/abstract=3989529 Figure 3: Equal Exposure Strategies: Cumulative Wealth 2000 2005 2010 2015 2020 006 005 004 003 002 001 Date ralloD ni htlaeW Delta−Hedged Call Delta−Hedged Put Variance Swap Straddle 548.19 Butterfly Spread Strangle Condor Strangle 430.27 429.74 422.1 411.77 391.98 301.74 Note: This figure shows the cumulative wealth development of seven equal exposure variance strategies for an initial investment of $100. The data period covers January 1996 to June 2021. 37 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "References",
    "page_number": 37,
    "page_range": "p.37-39",
    "total_pages": 49,
    "chunk_index": 57,
    "word_count": 203,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.37-39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "Variance Swap Straddle 548.19 Butterfly Spread Strangle Condor Strangle 430.27 429.74 422.1 411.77 391.98 301.74 Note: This figure shows the cumulative wealth development of seven equal exposure variance strategies for an initial investment of $100. The data period covers January 1996 to June 2021. 37 Electronic copy available at: https://ssrn.com/abstract=3989529 Figure 4: Payoffs of Delta-Hedged Put and Variance Swap (a) Delta-Hedged Put 1600 1800 2000 2200 2400 2600 2800 Index Level at Expiration ffoyaP noitisoP −2.01 % 3.4 % (b) Variance Swap 1600 1800 2000 2200 2400 2600 2800 Index Level at Expiration ffoyaP noitisoP −3.62 % 3.36 % Note: This figure shows payoff diagrams of a delta-hedged put option (part (a)) and a variance swap (part (b)). The diagram is based on the positions set up on October 24, 2016. The x-axis showsthepotentialindexlevelsatexpiration(November18,2016)andthey-axisthecorresponding payoffs of the delta-hedged put option and the variance swap, respectively. The horizontal solid linedepictsthebreak-evenpayoffandtheverticaldashedlinetheindexlevelatinitiation(October 24, 2016). 38 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "References",
    "page_number": 39,
    "page_range": "p.39-40",
    "total_pages": 49,
    "chunk_index": 58,
    "word_count": 157,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.39-40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "delta-hedged put option (part (a)) and a variance swap (part (b)). The diagram is based on the positions set up on October 24, 2016. The x-axis showsthepotentialindexlevelsatexpiration(November18,2016)andthey-axisthecorresponding payoffs of the delta-hedged put option and the variance swap, respectively. The horizontal solid linedepictsthebreak-evenpayoffandtheverticaldashedlinetheindexlevelatinitiation(October 24, 2016). 38 Electronic copy available at: https://ssrn.com/abstract=3989529 Figure 5: Equal Exposure Strategies: Impact of Transaction Costs (a) Effective Spread: 0% of Quoted Spread 2000 2005 2010 2015 2020 006 005 004 003 002 001 Date ralloD ni htlaeW Delta−Hedged Call Delta−Hedged Put Variance Swap Straddle 595.54 Butterfly Spread Strangle Condor Strangle 463.33 458.53 457.44 453.73 414.06 342.4 (b) Effective Spread: 50% of Quoted Spread 2000 2005 2010 2015 2020 005 004 003 002 001 Date ralloD ni htlaeW Delta−Hedged Call Delta−Hedged Put Variance Swap Straddle 504.44 Butterfly Spread Strangle Condor Strangle 403.96 398.61 392.71 371.4 369.6 264.24 Note: This figure shows the cumulative wealth development of seven equal exposure variance strategies for an initial investment of $100. The data period covers January 1996 to June 2021. Part (a) shows strategies with an effective options spread of 0% of the quoted bid-ask spread and part (b) the same strategies with an effective options spread of 50% of the quoted spread. 39 Electronic copy available at: https://ssrn.com/abstract=3989529 Figure 6: Maximum Exposure Strategies vs. Market Investment 2000 2005 2010 2015 2020 0021 0001 008 006 004 002 Date ralloD ni htlaeW Delta−Hedged Put Variance Swap S&P 500 Risk−Free 1097.8 828.62 678.03 185.16 Note: Thisfiguredepictsthecumulativewealthdevelopmentoffourdifferenttradingstrategiesfor aninitialinvestmentof$100. Thestrategiesarethemaximumexposuredelta-hedgedputstrategy (dashedblueline),thevarianceswapstrategy(solidblackline),abuyandholdinvestmentstrategy in the S&P 500 total return index (solid red line), and an investment in risk-free assets (dashed red line). The data period covers January 1996 to June 2021. 40 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "References",
    "page_number": 40,
    "page_range": "p.40-41",
    "total_pages": 49,
    "chunk_index": 59,
    "word_count": 281,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.40-41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "Delta−Hedged Put Variance Swap S&P 500 Risk−Free 1097.8 828.62 678.03 185.16 Note: Thisfiguredepictsthecumulativewealthdevelopmentoffourdifferenttradingstrategiesfor aninitialinvestmentof$100. Thestrategiesarethemaximumexposuredelta-hedgedputstrategy (dashedblueline),thevarianceswapstrategy(solidblackline),abuyandholdinvestmentstrategy in the S&P 500 total return index (solid red line), and an investment in risk-free assets (dashed red line). The data period covers January 1996 to June 2021. 40 Electronic copy available at: https://ssrn.com/abstract=3989529 Figure 7: Returns of Variance Strategies versus Market Returns (a) Delta-Hedged Put 0.0 −0.2 −0.4 −0.3 −0.2 −0.1 0.0 0.1 0.2 Market Return nruteR tuP degdeh−atleD (b) Variance Swap 0.0 −0.2 −0.4 −0.3 −0.2 −0.1 0.0 0.1 0.2 Market Return nruteR pawS ecnairaV Note: This figure provides return scatter plots that show the contemporaneous relation between monthly market returns and monthly delta-hedged put returns (part (a)) and monthly variance swap returns (part (b)), respectively. The blue lines indicate a linear trend, estimated via least squares. 41 Electronic copy available at: https://ssrn.com/abstract=3989529 Figure 8: Alternative Factor Investment Strategies: Cumulative Wealth 2000 2005 2010 2015 2020 0021 0001 008 006 004 002 Date ralloD ni htlaeW Delta−Hedged Put Variance Swap MKT SMB HML 1097.8 RMW CMA MOM 828.62 678.03 451.98 309.52 279.38 274.7 201.38 Note: Thisfigureprovidesthecumulativewealthdevelopmentoftwomaximumexposurevariance strategies (delta-hedged put and variance swap) and six factor investment strategies that refer to the Fama and French (2015) five-factor model and the momentum factor. The data period covers January 1996 to June 2021. MKT is the market factor, SMB is the size factor, HML is the value factor,RMWistheprofitabilityfactor,CMAistheinvestmentfactor,andMOMisthemomentum factor. 42 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "References",
    "page_number": 42,
    "page_range": "p.42-44",
    "total_pages": 49,
    "chunk_index": 60,
    "word_count": 240,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.42-44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "and six factor investment strategies that refer to the Fama and French (2015) five-factor model and the momentum factor. The data period covers January 1996 to June 2021. MKT is the market factor, SMB is the size factor, HML is the value factor,RMWistheprofitabilityfactor,CMAistheinvestmentfactor,andMOMisthemomentum factor. 42 Electronic copy available at: https://ssrn.com/abstract=3989529 Table 1: Return and Risk of Maximum Exposure Strategies Panel A: Basic Monthly Summary Statistics Delta- Delta- Variance Straddle Butterfly Strangle Condor Hedged Hedged Swap Spread Strangle Call Put Mean 0.0053 0.0083 0.0069 0.0188 0.0145 0.0157 0.0132 Standard Dev. 0.0241 0.0491 0.0306 0.1205 0.0979 0.1395 0.0967 Skewness −2.6606 −2.9863 −8.1976 −2.3080 −1.5098 −4.0907 −2.7688 Exc. Kurtosis 13.1318 17.3526 90.4404 9.5963 3.7083 23.1548 8.8446 Sharpe Ratio 0.1343 0.1278 0.1580 0.1391 0.1277 0.0976 0.1151 Panel B: Downside Risk Statistics Delta- Delta- Variance Straddle Butterfly Strangle Condor Hedged Hedged Swap Spread Strangle Call Put VaR (95%) −0.0296 −0.0619 −0.0074 −0.1681 −0.1756 −0.1949 −0.1884 CVaR (95%) −0.0672 −0.1396 −0.0661 −0.3510 −0.2765 −0.4448 −0.3145 Max Loss −0.1670 −0.3860 −0.3676 −0.6729 −0.4106 −1.0000 −0.5085 Average DD −0.0372 −0.0755 −0.0433 −0.1934 −0.2295 −0.2733 −0.2006 Max DD −0.2550 −0.5266 −0.3676 −0.8684 −0.7238 −1.0000 −0.7384 Average DD Length 5.4146 5.8500 4.6250 13.1000 19.5000 19.3077 14.9412 Max DD Length 34 35 23 110 122 154 112 Panel C: Annualized Geometric Mean Return and Terminal Wealth Delta- Delta- Variance Straddle Butterfly Strangle Condor Hedged Hedged Swap Spread Strangle Call Put Ann. Geom. Return[%] 6.12 8.68 7.82 11.67 11.60 −100.00 9.25 Term. Wealth[$] 452.13 828.62 678.03 1654.31 1625.52 0.00 947.38 Note: This table provides return- and risk-statistics of seven maximum exposure variance strate- gies. Panel A depicts basic summary statistics of monthly returns, while Panel B is dedicated to downside risk statistics. In particular, it considers asymmetric risk metrics for monthly returns suchasthe95%value-at-risk(VaR),the95%conditionalvalue-at-risk(CVaR),andthemaximum loss (max loss). Additionally, it shows path-dependent drawdown measures: The average draw- down (Average DD), the maximum drawdown (Max DD), the average drawdown length (Average DDlength),andthemaximumdrawdownlength(MaxDDLength). PanelCshowstheannualized geometric return and the terminal wealth of the strategies. 43 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "References",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 49,
    "chunk_index": 61,
    "word_count": 333,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "considers asymmetric risk metrics for monthly returns suchasthe95%value-at-risk(VaR),the95%conditionalvalue-at-risk(CVaR),andthemaximum loss (max loss). Additionally, it shows path-dependent drawdown measures: The average draw- down (Average DD), the maximum drawdown (Max DD), the average drawdown length (Average DDlength),andthemaximumdrawdownlength(MaxDDLength). PanelCshowstheannualized geometric return and the terminal wealth of the strategies. 43 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "References",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 49,
    "chunk_index": 62,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "Table 2: Return and Risk of Equal Exposure Strategies Panel A: Basic Monthly Summary Statistics Delta- Delta- Variance Straddle Butterfly Strangle Condor Hedged Hedged Swap Spread Strangle Call Put Mean 0.0051 0.0050 0.0057 0.0051 0.0051 0.0048 0.0041 Standard Dev. 0.0237 0.0246 0.0154 0.0240 0.0288 0.0225 0.0294 Skewness −2.7521 −2.7274 −7.9266 −2.7385 −1.9972 −3.5271 −3.1228 Exc. Kurtosis 14.1351 13.9611 85.0546 13.9829 9.6098 16.3090 14.0693 Sharpe Ratio 0.1292 0.1228 0.2400 0.1280 0.1061 0.1215 0.0701 Panel B: Downside Risk Statistics Delta- Delta- Variance Straddle Butterfly Strangle Condor Hedged Hedged Swap Spread Strangle Call Put VaR (95%) −0.0291 −0.0315 −0.0064 −0.0301 −0.0393 −0.0318 −0.0529 CVaR (95%) −0.0666 −0.0698 −0.0354 −0.0677 −0.0786 −0.0712 −0.0939 Max Loss −0.1670 −0.1705 −0.1821 −0.1673 −0.1697 −0.1417 −0.2064 Average DD −0.0352 −0.0355 −0.0229 −0.0346 −0.0515 −0.0447 −0.0579 Max DD −0.2457 −0.2535 −0.1821 −0.2467 −0.2892 −0.2293 −0.3270 Average DD Length 5.3415 5.2683 4.3846 5.1905 6.8529 5.7576 7.0303 Max DD Length 34 34 18 34 35 17 41 Panel C: Annualized Geometric Mean Return and Terminal Wealth Delta- Delta- Variance Straddle Butterfly Strangle Condor Hedged Hedged Swap Spread Strangle Call Put Ann. Geom. Return[%] 5.90 5.83 6.92 5.91 5.73 5.52 4.44 Term. Wealth[$] 429.74 422.10 548.19 430.27 411.77 391.98 301.74 Note: This table provides return- and risk-statistics of seven equal exposure variance strategies. PanelAdepictsbasicsummarystatisticsofmonthlyreturns,whilePanelBisdedicatedtodownside risk statistics. In particular, it considers asymmetric risk metrics for monthly returns such as the 95% value-at-risk (VaR), the 95% conditional value-at-risk (CVaR), and the maximum loss (max loss). Additionally,itshowspath-dependentdrawdownmeasures: Theaveragedrawdown(Average DD),themaximumdrawdown(MaxDD),theaveragedrawdownlength(AverageDDlength),and themaximumdrawdownlength(MaxDDLength). PanelCshowstheannualizedgeometricreturn and the terminal wealth of the strategies. 44 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "References",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 49,
    "chunk_index": 63,
    "word_count": 259,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "variance strategies. PanelAdepictsbasicsummarystatisticsofmonthlyreturns,whilePanelBisdedicatedtodownside risk statistics. In particular, it considers asymmetric risk metrics for monthly returns such as the 95% value-at-risk (VaR), the 95% conditional value-at-risk (CVaR), and the maximum loss (max loss). Additionally,itshowspath-dependentdrawdownmeasures: Theaveragedrawdown(Average DD),themaximumdrawdown(MaxDD),theaveragedrawdownlength(AverageDDlength),and themaximumdrawdownlength(MaxDDLength). PanelCshowstheannualizedgeometricreturn and the terminal wealth of the strategies. 44 Electronic copy available at: https://ssrn.com/abstract=3989529 Table 3: Equal Exposure Strategies’ Return Correlation Matrix Delta- Delta- Variance Straddle Butterfly Strangle Hedged Hedged Swap Spread Call Put Delta-Hedged Put 0.9961 Variance Swap 0.6611 0.6565 Straddle 0.9990 0.9990 0.6589 Butterfly Spread 0.9724 0.9752 0.6025 0.9747 Strangle 0.9302 0.9307 0.6221 0.9315 0.8596 Condor Strangle 0.9092 0.9155 0.5340 0.9133 0.8997 0.9537 Note: This table depicts the correlations between the monthly returns of seven equal exposure variance strategies. 45 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "References",
    "page_number": 46,
    "page_range": "p.46-47",
    "total_pages": 49,
    "chunk_index": 64,
    "word_count": 123,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.46-47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "Variance Swap 0.6611 0.6565 Straddle 0.9990 0.9990 0.6589 Butterfly Spread 0.9724 0.9752 0.6025 0.9747 Strangle 0.9302 0.9307 0.6221 0.9315 0.8596 Condor Strangle 0.9092 0.9155 0.5340 0.9133 0.8997 0.9537 Note: This table depicts the correlations between the monthly returns of seven equal exposure variance strategies. 45 Electronic copy available at: https://ssrn.com/abstract=3989529 Table 4: Return and Risk of Alternative Factor Investment Strategies Panel A: Basic Monthly Summary Statistics Delta- Variance MKT SMB HML RMW CMA MOM Hedged Swap Put Mean 0.0083 0.0069 0.0093 0.0042 0.0029 0.0053 0.0036 0.0049 StandardDev. 0.0491 0.0306 0.0520 0.0303 0.0361 0.0271 0.0214 0.0540 Skewness −2.9863 −8.1976 −0.9220 −0.0649 0.3880 0.3611 0.5523 −1.6817 Exc. Kurtosis 17.3526 90.4404 6.8907 2.1928 2.5327 5.7716 1.3767 8.3779 SharpeRatio 0.1278 0.1580 0.1395 0.0708 0.0254 0.1218 0.0736 0.0529 Panel B: Downside Risk Statistics Delta- Variance MKT SMB HML RMW CMA MOM Hedged Swap Put VaR(95%) −0.0619 −0.0074 −0.0743 −0.0409 −0.0460 −0.0306 −0.0289 −0.0912 CVaR(95%) −0.1396 −0.0661 −0.1286 −0.0619 −0.0734 −0.0557 −0.0382 −0.1475 MaxLoss −0.3860 −0.3676 −0.3052 −0.1332 −0.1264 −0.1103 −0.0544 −0.3438 AverageDD −0.0755 −0.0433 −0.0769 −0.0677 −0.0712 −0.0617 −0.0606 −0.1037 MaxDD −0.5266 −0.3676 −0.4993 −0.2938 −0.4937 −0.3347 −0.1922 −0.6709 AverageDDLength 5.8500 4.6250 7.0303 11.4583 14.0526 12.7500 15.8824 14.3684 MaxDDLength 35 23 74 83 154 65 99 152 Panel C: Annualized Geometric Mean Return and Terminal Wealth Delta- Variance MKT SMB HML RMW CMA MOM Hedged Swap Put Ann. Geom. Return[%] 8.68 7.82 9.89 4.55 2.79 6.11 4.13 4.06 Term. Wealth[$] 828.62 678.03 1097.84 309.52 201.38 451.98 279.38 274.70 Note: This table provides return- and risk-statistics of two maximum exposure variance strategies (delta-hedged put and variance swap) and six other equity-based factor investment strategies. Returns of factor investment strategies are calculated according to the Fama and French (2015) five-factor model, such that the return periods coincide with the return periods from the variance strategies. MKTisthemarketfactor,SMBisthesizefactor,HMListhevaluefactor,RMWisthe profitability factor, CMA is the investment factor, and MOM is the momentum factor. Panel A depicts basic summary statistics of monthly returns, while Panel B is dedicated to downside risk statistics. In particular, it considers asymmetric risk metrics for monthly returns such as the 95% value-at-risk (VaR), the 95% conditional value-at-risk (CVaR), and the maximum loss (max loss). Additionally,itshowspath-dependentdrawdownmeasures: Theaveragedrawdown(AverageDD), the maximum drawdown (Max DD), the average drawdown length (Average DD length), and the maximum drawdown length (Max DD Length). Panel C shows the annualized geometric return and the terminal wealth of the strategies. 46 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "References",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 49,
    "chunk_index": 65,
    "word_count": 399,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "value-at-risk (CVaR), and the maximum loss (max loss). Additionally,itshowspath-dependentdrawdownmeasures: Theaveragedrawdown(AverageDD), the maximum drawdown (Max DD), the average drawdown length (Average DD length), and the maximum drawdown length (Max DD Length). Panel C shows the annualized geometric return and the terminal wealth of the strategies. 46 Electronic copy available at: https://ssrn.com/abstract=3989529 Table 5: Maximum Exposure Strategies vs. Alternative Factor Invest- ment Strategies: OLS Regression Delta- Variance Delta- Variance Hedged Swap Hedged Swap Put Put α 0.0036 0.0026 0.0030 0.0022 (1.3718) (1.1808) (1.0561) (0.8880) β 0.3622∗∗∗ 0.3075∗∗∗ 0.3273∗∗∗ 0.2867∗∗∗ MKT (3.8259) (2.9265) (4.4261) (2.8935) β 0.3249∗∗ 0.2110∗∗ SMB (2.0869) (2.3077) β 0.2525 0.1478 HML (1.4827) (1.2230) β 0.0818 0.0267 RMW (0.5974) (0.2864) β −0.1324 −0.1069 CMA (−0.5423) (−1.2982) β −0.0133 0.0201 MOM (−0.1723) (0.3549) n 305 305 305 305 Adj. R2 0.1453 0.2716 0.2060 0.3244 F-statistic 52.6718 114.3799 14.1417 25.3288 Note: This table shows the ordinary least squares (OLS) regression results from a regression of the monthly returns of two maximum exposure variance strategies (delta-hedged put, variance swap) on the returns of other factor investment strategies. Specifically, we consider the S&P 500 index (MKT), long-short portfolios of the remaining four factors of the Fama and French (2015) five-factor model (Size (SMB), Value (HML), Profitability (RMW), Investment (CMA)), plus Momentum (MOM). Newey and West (1987) robust t-statistics with 12 lags are reported in parentheses and asterisks indicate significance at the 1% (∗∗∗), 5% (∗∗), and 10% (∗) level, respectively. 47 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "References",
    "page_number": 48,
    "page_range": "p.48-49",
    "total_pages": 49,
    "chunk_index": 66,
    "word_count": 242,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.48-49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "and French (2015) five-factor model (Size (SMB), Value (HML), Profitability (RMW), Investment (CMA)), plus Momentum (MOM). Newey and West (1987) robust t-statistics with 12 lags are reported in parentheses and asterisks indicate significance at the 1% (∗∗∗), 5% (∗∗), and 10% (∗) level, respectively. 47 Electronic copy available at: https://ssrn.com/abstract=3989529 Table 6: Maximum Exposure Strategies vs. Alternative Factor Invest- ment Strategies: LAD Regression Delta- Variance Delta- Variance Hedged Swap Hedged Swap Put Put α 0.0110∗∗∗ 0.0051∗∗∗ 0.0102∗∗∗ 0.0053∗∗∗ (4.0705) (6.5419) (3.3790) (5.7689) β 0.1171 0.0917∗∗∗ 0.0904 0.0892∗∗∗ MKT (0.8567) (3.9679) (0.6606) (3.5577) β 0.1832∗ 0.0499∗ SMB (1.7019) (1.8948) β −0.0219 0.0027 HML (−0.1910) (0.0900) β 0.2034 −0.0094 RMW (1.3246) (−0.2884) β −0.0588 0.0118 CMA (−0.2649) (0.2690) β −0.0616 −0.0195 MOM (−0.9598) (−0.7240) n 305 305 305 305 R2 0.0050 0.0782 0.0236 0.0997 Pseudo Note: This table shows the least absolute deviation (LAD) regression results from a regression of the monthly returns of two maximum exposure variance strategies (delta-hedged put, variance swap) on the returns of other factor investment strategies. Specifically, we consider the S&P 500 index (MKT), long-short portfolios of the remaining four factors of the Fama and French (2015) five-factor model (Size (SMB), Value (HML), Profitability (RMW), Investment (CMA)), plus Momentum (MOM). Standard errors are determined using a block bootstrap with a block length of 12 and 20,000 bootstrap samples for each individual regression model. Corresponding t-statistics are reported in parentheses and asterisks indicate significance at the 1% (∗∗∗), 5% (∗∗), and 10% (∗) level, respectively. 48 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "References",
    "page_number": 49,
    "page_range": "p.49",
    "total_pages": 49,
    "chunk_index": 67,
    "word_count": 253,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  },
  {
    "text": "Standard errors are determined using a block bootstrap with a block length of 12 and 20,000 bootstrap samples for each individual regression model. Corresponding t-statistics are reported in parentheses and asterisks indicate significance at the 1% (∗∗∗), 5% (∗∗), and 10% (∗) level, respectively. 48 Electronic copy available at: https://ssrn.com/abstract=3989529",
    "title": "How Should the Long - term Investor Harvest Variance Risk Premiums",
    "source_type": "pdf",
    "document_id": "f2f767a4c383",
    "source_file": "How Should the Long-term Investor Harvest Variance Risk Premiums.pdf",
    "section": "References",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 49,
    "chunk_index": 68,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211220074556+01'00'",
    "duration": null
  }
]