[
  {
    "text": "Individual Investors and Local Bias Mark S. Seasholes Ning Zhu HKUST U.C. Davis This Version 30-November-2009∗ Abstract The paper tests whether individuals have value-relevant information about local stocks (where “local” is defined as being headquartered near where an investor lives). Our methodology uses two types of calendar-time portfolios—one based on holdings and one based on transactions. Portfolios of local holdings do not generate abnormal performance (alphas are zero). When studying transactions, purchases of local stocks significantly underperform sales of local stocks. Theunderperformanceremainswhenfocusingonstockswithpotentiallyhigh-levelsofinforma- tion asymmetries. We conclude that individuals do not help incorporate information into stock prices. Our conclusions directly contradict existing studies. Keywords: Information Aggregation, Individual Investors, Home Bias JEL number: G15, F3, D1 ∗Wethankalargediscountbroker,BradBarber,andTerryOdeanforprovidingthedatausedinthisstudy. Terry Hendershott, Chris Hennessy, Gur Huberman, Alok Kumar, Tobias Moskowitz, Terry Odean, and Richard Stanton havegivenmanyhelpfulcomments. CynthiaQiPanprovidedexcellentresearchassistance. Weareespeciallygrateful toBradBarberwhohasbeeninstrumentalinthedevelopmentofthispaper. Contactinformation: MarkS.Seasholes, Tel: 510-931-7531; email: Mark.Seasholes@emailias.com; Ning Zhu, 129 AOB IV, Graduate School of Management, UC Davis, Davis, CA 95616; Tel: 530-752-3871; email: nzhu@ucdavis.edu. EEleleccttrroonnicic ccooppyy aavvaailialabblele aatt:: hhttttpps::////ssssrrnn..ccoomm//aabbssttrraacctt==881177550044",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 66,
    "chunk_index": 0,
    "word_count": 163,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "D1 ∗Wethankalargediscountbroker,BradBarber,andTerryOdeanforprovidingthedatausedinthisstudy. Terry Hendershott, Chris Hennessy, Gur Huberman, Alok Kumar, Tobias Moskowitz, Terry Odean, and Richard Stanton havegivenmanyhelpfulcomments. CynthiaQiPanprovidedexcellentresearchassistance. Weareespeciallygrateful toBradBarberwhohasbeeninstrumentalinthedevelopmentofthispaper. Contactinformation: MarkS.Seasholes, Tel: 510-931-7531; email: Mark.Seasholes@emailias.com; Ning Zhu, 129 AOB IV, Graduate School of Management, UC Davis, Davis, CA 95616; Tel: 530-752-3871; email: nzhu@ucdavis.edu. EEleleccttrroonnicic ccooppyy aavvaailialabblele aatt:: hhttttpps::////ssssrrnn..ccoomm//aabbssttrraacctt==881177550044 Thispaperstudiesthegeographyofindividualinvestors’portfolios. Recentresearchprovides ample evidence that individuals tilt their portfolios towards local stocks. For example, the typical U.S. household has about 30% of its portfolio invested in stocks headquartered within a 250 mile radius of the family home. On average, only 12% of all firms (the market) are headquartered within the same radius. In Finland, the median non-Helsinki headquartered firm has 12% higher weight among investors in its municipality than it does among all Finnish investors. Finally, individuals in mainland China invest 8% more in firms from their province-of-residence than a market-capitalization portfolio would predict.1 Despite consistent and strong evidence of local bias, an unanswered question remains: Why do investors have a preference for local stocks? The ability to exploit non-public information could be one reason individuals tilt their portfolios towards local stocks. Ivkovic and Weisbenner (2005, p. 305) conclude that individ- ual households are “able to process and exploit locally available information to earn excess returns”. The authors note their findings are “particularly strong where information asym- metries are likely to play the most pronounced role—among the non-S&P 500, less widely known stocks.” A second paper by Massa and Simonov (2006) studies individual portfolio holdings in Sweden. Investors “deliberately tilt their portfolios towards stocks that are most closely related to them” including geographically local stocks. The authors conclude that information is driving these investment choices. Finding that individuals exploit non-public information and achieve superior returns on their local investments has a number of implications. First, such a finding would help financial economists better understand how markets aggregate information—a topic that has 1 EEleleccttrroonnicic ccooppyy aavvaailialabblele aatt:: hhttttpps::////ssssrrnn..ccoomm//aabbssttrraacctt==881177550044",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 66,
    "chunk_index": 1,
    "word_count": 317,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "conclude that information is driving these investment choices. Finding that individuals exploit non-public information and achieve superior returns on their local investments has a number of implications. First, such a finding would help financial economists better understand how markets aggregate information—a topic that has 1 EEleleccttrroonnicic ccooppyy aavvaailialabblele aatt:: hhttttpps::////ssssrrnn..ccoomm//aabbssttrraacctt==881177550044 been central to the field since early rational expectations models.2 Two obvious empirical questions arise from these theory models: Which agents help impound information into prices? Can we uncover evidence of information being incorporated into prices by examining investors’ holdings and trades? If the conclusions reached by Ivkovic and Weisbenner (2005) are correct, individual investors may play a key role in incorporating information into prices. Finding that individuals achieve superior returns on local stocks has a second set of implications regarding advice (implicit or explicit) that financial economists provide to the investing public. The ability to achieve superior returns might help justify shifting one’s portfolio away from the market portfolio and away from indexing. If such superior returns are possible, individuals might rationally engage in stock picking—provided the returns of these stocks cover the costs associated with acquiring them. Our paper tests whether individuals earn superior returns on their local investments. We study both households’ portfolio holdings and their transactions. Our basic methodology involvesformingportfoliosbasedontheholdingsortradesofmanyinvestors. Throughoutthe paper these aggregations are referred to as either “holdings-based calendar-time portfolios” or “transactions-based calendar-time portfolios”. Studying both holdings and trades is one aspect of our paper that sets it apart from existing studies of individual investor geography. Calendar-timeportfoliosaddressfourpitfallsthatpotentiallyaffectstudiesofindividuals’ investments. These same four pitfalls affect earlier studies of individual investors and local bias. First, calendar-time portfolios take into account cross-sectional correlation of stock returns. Earlier studies of individuals’ portfolio returns assumed independence. Second, 2 EEleleccttrroonnicic ccooppyy aavvaailialabblele aatt:: hhttttpps::////ssssrrnn..ccoomm//aabbssttrraacctt==881177550044",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 66,
    "chunk_index": 2,
    "word_count": 293,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "it apart from existing studies of individual investor geography. Calendar-timeportfoliosaddressfourpitfallsthatpotentiallyaffectstudiesofindividuals’ investments. These same four pitfalls affect earlier studies of individual investors and local bias. First, calendar-time portfolios take into account cross-sectional correlation of stock returns. Earlier studies of individuals’ portfolio returns assumed independence. Second, 2 EEleleccttrroonnicic ccooppyy aavvaailialabblele aatt:: hhttttpps::////ssssrrnn..ccoomm//aabbssttrraacctt==881177550044",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 66,
    "chunk_index": 3,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "portfolios dampen the effect of small stocks on returns. Existing studies of individuals’ portfolios tend to over-weight the effect of small positions and/or small stocks. Third, and when studying investor geography specifically, portfolios from a given geographic area can be compared against a passive benchmark from the same geographic area. Fourth, and finally, forming portfolios makes it easy to use a dataset’s entire time-series. Some earlier papers used holdings based on a single point in time. Our paper starts with a standard performance analysis of individuals’ local holdings (using holdings-based calendar-time portfolios). Holdings of local stocks outperform the riskless asset by 1.1% per month over our sample period. Regression analysis, with con- trols for the market’s excess return, an investor-specific passive index, and the Fama-French factors, paints a different picture. Individuals’ local portfolios do not generate abnormal performance (i.e., portfolios “alphas” are not different from zero). Point estimates are eco- nomically close to zero. Tables III, IV, and V in this paper, combined with five tables in the associated Internet Appendix, test 45 different regression permutations. None of the alphas is significantly different from zero at the 5%-level (nor at the 10%-level.) We conclude that individuals do not appear to have value-relevant information about the local stocks they hold. The second step of our analysis uses transactions-based calendar-time portfolios to test the following hypothesis: If individuals have value-relevant information, the locals stocks they buy should outperform the local stocks they sell. We study 249,555 transactions of local stocks. We form one portfolio based on purchases of local stocks. We form a second portfolio based on sales of local stocks. Stocks are held in our portfolios for one year which 3 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 66,
    "chunk_index": 4,
    "word_count": 285,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "outperform the local stocks they sell. We study 249,555 transactions of local stocks. We form one portfolio based on purchases of local stocks. We form a second portfolio based on sales of local stocks. Stocks are held in our portfolios for one year which 3 Electronic copy available at: https://ssrn.com/abstract=817504 is approximately the average holding period for investors in our sample. We then measure the average return of the “Buys-minus-Sells” portfolio and find it to be -1.7% per year. When confining the analysis to only trades of local non-S&P 500 stocks, the Buys-minus- Sells portfolio has a return of -2.3% per year.3 In other words, local buys of these stocks underperform local sells by 2.3% per year. Individuals appear to have no value-relevant information about the local stocks they trade. The finding regarding local, non-S&P 500 stocks is especially important as these stocks have potentially high levels of information asymmetry. Our conclusions directly contradict the conclusions reached in earlier papers. Pitfalls When Studying Individual Investor Behavior The methodology used in our paper addresses four pitfalls that arise when studying individuals’ portfolios. Pitfall #1. Cross-Sectional Correlation of Individuals’ Portfolio Returns: The first pitfall comes from the fact that individuals’ portfolio returns are cross-sectionally cor- related. Although our dataset of local holdings-based portfolio returns contains 938,644 observations, we do not have nearly this many independent observations. Investors in our data hold 5,779 different stocks in their local portfolios. The dataset spans of 71 months. There are 215,512 unique stock-month combinations. The monthly returns of two investors who hold the same stocks are obviously correlated and are not independent. Similar issues arise when studying transactions. We address issues related to the number of independent observations in two different ways. Withtheholdings-basedportfolios, wecomputeRogers(1993)standarderrorsthatare 4 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 66,
    "chunk_index": 5,
    "word_count": 294,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "215,512 unique stock-month combinations. The monthly returns of two investors who hold the same stocks are obviously correlated and are not independent. Similar issues arise when studying transactions. We address issues related to the number of independent observations in two different ways. Withtheholdings-basedportfolios, wecomputeRogers(1993)standarderrorsthatare 4 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 66,
    "chunk_index": 6,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "robust to heteroscedasticity and contemporaneous correlation (clustered by month.) With the transactions-based portfolios, we calculate the returns of a Buys-minus-Sells portfolio which results in a single time-series. The single time-series takes care of cross-sectional correlation. PleaseseeAppendixAandAppendixCforadditionalnotesrelatedtoPitfall#1. Pitfall #2. Small Stocks and Individual Portfolios: The second pitfall arises when studying investor-level portfolios. As mentioned above, our local holdings data produce 938,644 household-month observations. The median household has approximately three stocks in its portfolio in a given month. If one third of a typical portfolio is classified as local, then some individuals have a single stock in their local portfolios. Thus, the monthly return of a single, small stock may be counted as an observation in a regression analysis.4 When conducting standard performance analysis, the monthly return of a wealthy, well- diversified individual is counted as a single observation. The monthly return of a not-so- wealthy, poorly diversified individual is also counted as a single observation. Thus, single small stocks can overly influence results (in much the same way that equal-weighting a portfolio can alter its returns). We address possible biases caused by small stocks by form- ing portfolios that combine the value-weighted holdings of many investors. We also use transactions-based portfolios to combine all purchases or sales into a single, value-weighted portfolio. Weights in the transactions-based portfolios are initially set equal to the value of the underlying transactions. See Appendix B for additional notes related to small stocks and Pitfall #2. Pitfall #3. Geographic Selection Biases: The third pitfall concerns a cross-sectional 5 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 66,
    "chunk_index": 7,
    "word_count": 257,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "a single, value-weighted portfolio. Weights in the transactions-based portfolios are initially set equal to the value of the underlying transactions. See Appendix B for additional notes related to small stocks and Pitfall #2. Pitfall #3. Geographic Selection Biases: The third pitfall concerns a cross-sectional 5 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 66,
    "chunk_index": 8,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "sample selection bias. In this paper, we study 43,132 households who invest through a large discount broker in the United States. Neither investors, nor firms, nor industries are uniformlydistributedacrossthecountry. Agraphicexampleofthenon-uniformdistributions can be seen in Figure 1 of Ivkovic and Weisbenner (2005). In the figure, it is clear that firm headquarters have highest density in the Northeast of the country, around Chicago, and in the San Francisco Bay Area. Investors are densely populated in the Northeast and in the Bay Area. During our 1991-1996 sample period, some industries experienced high returns (Banks, Finance, Business Services, and Electrical Equipment all had average monthly returns over 2%) while some industries experienced low returns (Utilities, Construction, Tobacco, Gold, and Coal had average monthly returns less than 1%). Since investors in our sample live disproportionately near Silicon Valley and New York City (and all investors tend to tilt their portfolios towards local stocks), we might incorrectly conclude that local stock pickers are able to earn abnormally high returns. The incorrect conclusion would be due to a cross- sectional sampling error. Our holdings-based portfolio analysis addresses geographic biases by including passive, local indices as control variables. Transactions-based portfolios address potential geographic biases by testing whether buys of local stocks outperform sales of local stocks. Pitfall #4. Time-Series Selection Biases: The fourth and final pitfall is a time-series selection bias. The main sample of 34,517 households studied by Ivkovic and Weisben- ner (2005) is based on households with at least $1,000 in stock holdings at the end of 1991. Individuals (as a group) have varying performance between 1991 and 1996. We show that 6 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 66,
    "chunk_index": 9,
    "word_count": 272,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "bias. The main sample of 34,517 households studied by Ivkovic and Weisben- ner (2005) is based on households with at least $1,000 in stock holdings at the end of 1991. Individuals (as a group) have varying performance between 1991 and 1996. We show that 6 Electronic copy available at: https://ssrn.com/abstract=817504 local buys outperform local sells in 1991, break even in 1995, and underperform in 1992, 1993, 1994, and 1996. Our paper addresses potential time-series biases by considering all holdings and transactions over the entire 1991-1996 sample period. Individual Investors and Performance Ourpaperispartofanongoinginvestigationintotheperformanceofindividualinvestors. Odean (1998) finds winning stocks sold by individuals outperform losing stocks held by individuals over a 1 year horizon. Odean (1999) considers all stocks individuals trade (not just recent winners and losers in their portfolios) and finds buys underperform sells. Our paper differs by testing whether individuals achieve abnormally high performance when trading local stocks. We also consider stocks with potentially lower and higher levels of information asymmetries. There are two, recent papers that show that individual investors’ Buys-minus-Sells pre- dict future positive returns at short horizons in the USA. Kaniel, Saar, and Titman (2008) study trades by individual investors on the New York Stock Exchange (NYSE). Stocks most heavily bought outperform stocks most heavily sold over a one-week to four-week horizon. The authors present evidence that individuals are being compensated for providing immedi- acy to institutions. Individuals buy (sell) when institutions are selling (buying) and prices are falling (rising). The subsequent price increase (decrease) compensates the individuals in a manner similar to how market makers are compensated. Barber, Odean, and Zhu (2009) study small trades (those less than $5,000 in value) which they interpret as coming from individual investors. They find that buys outperform 7 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 66,
    "chunk_index": 10,
    "word_count": 293,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "subsequent price increase (decrease) compensates the individuals in a manner similar to how market makers are compensated. Barber, Odean, and Zhu (2009) study small trades (those less than $5,000 in value) which they interpret as coming from individual investors. They find that buys outperform 7 Electronic copy available at: https://ssrn.com/abstract=817504 sales at horizons of 1 week to 1 month. They write “stocks heavily bought by individual investors one week earn strong returns in the subsequent week, while stocks heavily sold one week earn poor returns in the subsequent week. This pattern persists for a total of three to four weeks and then reverses for the subsequent several weeks.” Finally, Kumar (2004), like our paper, examines whether individual investors have su- perior information about local stocks. His methodology uses time-varying, investor-specific benchmarks. Kumar (2004) finds that, at most, one-third of investors possess local infor- mation. He finds information drives purchases of small-cap, value stocks. He also finds information effects are particularly strong for investors who reside in remote geographical locations. We proceed with our paper as follows. Section 2 describes the data and gives summary statistics. Section 3 presents our results. Section 4 concludes. I. Data A. Individual Investor Data Our individual investor data come from a large, discount brokerage house and have been extensivelystudiedinthebehavioralfinanceliterature.5 TransactiondatastartonJanuary1, 1991 and end on November 30, 1996. Monthly portfolio positions start on January 31, 1991 andendonNovember1, 1996. Ademographicfilewithinformationonasubsetofhouseholds contains the five-digit zip code and state in which a household is located. Throughout this paper we use the terms “individual” and “household” interchangeably. 8 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 66,
    "chunk_index": 11,
    "word_count": 263,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "extensivelystudiedinthebehavioralfinanceliterature.5 TransactiondatastartonJanuary1, 1991 and end on November 30, 1996. Monthly portfolio positions start on January 31, 1991 andendonNovember1, 1996. Ademographicfilewithinformationonasubsetofhouseholds contains the five-digit zip code and state in which a household is located. Throughout this paper we use the terms “individual” and “household” interchangeably. 8 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 66,
    "chunk_index": 12,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "B. Stock Price and Return Data Our holdings-based calendar-time portfolios use monthly returns obtained from Center for Research in Security Prices (CRSP). The transactions-based calendar-time portfolios use daily returns also obtained from the CRSP. Returns of the value-weighted market portfo- lio, the riskfree rate, and Fama-French-Carhart factors are downloaded from Ken French’s website (monthly and daily.) We recalculate monthly returns of the value-weighted mar- ket portfolio using only stocks with zip code information. Doing so eliminates a potential selection bias but has no effect on our results. C. Location Data We translate household zip codes into latitudes and longitudes using the 1990 Census U.S. Gazetteer www.census.gov. For each of 8,773 different listed common stock (CUSIP numbers), state and county information is obtained from Compustat. The U.S. Gazetteer is used to translate state and county information into latitudes and longitudes of the firms’ headquarters. Using state and county information (instead of zip codes obtained from Com- pustat) increases the sample size considerably. Throughout this paper we divide each household’s portfolio into local stocks and remote (nonlocal) stocks using a distance-based measure. Stocks whose headquarters are within a 250 mile radius of where an investor lives are considered local for that investor. Stocks whose headquarters are outside the 250 mile radius are considered remote.6 Thus, the same stock (say Microsoft) is considered to be local for investors living in Seattle but is considered to be remote for investors living in Atlanta. The distance-based measure allows us to create 9 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 66,
    "chunk_index": 13,
    "word_count": 252,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "headquarters are outside the 250 mile radius are considered remote.6 Thus, the same stock (say Microsoft) is considered to be local for investors living in Seattle but is considered to be remote for investors living in Atlanta. The distance-based measure allows us to create 9 Electronic copy available at: https://ssrn.com/abstract=817504 investor-specific definitions of local and remote. D. Information Asymmetry/Size Classification We useS&P 500indexmembership toclassifystocks into thoselikelyto have lower-levels of information asymmetry and those likely to have higher-levels of information asymmetries. The S&P 500 index is comprised of large firms and constitutes approximately 80% of the market capitalization of US equities. Stocks in the index are generally followed by large numbers of institutional investors and by many analysts. Non-S&P 500 stocks are typically smaller firms that constitute the remaining 20% of the market capitalization of US equities (approximately).7 We obtain the history of firms in the S&P 500 from Barclay, Hendershott, and Jones (2008). E. Summary Statistics Table I provides summary statistics of our data. Panel A starts with 77,795 household accounts. Focusingonhouseholdswithlocationinformationreducesthesamplesizeto54,538 households. We further focus on households within the continental United States and those with at least one holding of common stock between 1991 and 1996. The last filter requires households to hold at least one common stock with location information. The final sample contains 43,132 households. While the average household holds approximately three stocks at a time, many hold only a single stock (which may or may not be classified as local). The sparsity of holdings at the household-level is one reason this paper advocates forming portfolios. 10 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 66,
    "chunk_index": 14,
    "word_count": 265,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "contains 43,132 households. While the average household holds approximately three stocks at a time, many hold only a single stock (which may or may not be classified as local). The sparsity of holdings at the household-level is one reason this paper advocates forming portfolios. 10 Electronic copy available at: https://ssrn.com/abstract=817504 [ Table I about here ] Table I, Panel B shows the number of households and value of holdings at the end of each year. There are 32,723 households at the end of 1991 and this number falls to 16,738 households by the end of 1995. The aggregate value of holdings is just over US$ 1 billion at the end of 1991. The value rises to US$ 1.6 billion by the end of 1993 before falling back to just about US$1 billion by the end of 1995. Panels C, D, and E show overviews of our transactions data. There are 983,322 total transactions of which 249,555 involve local stocks. Local buys outnumber local sells (134,766 vs. 114,789) though local sales have higher value. Of the transactions in local stocks, 92,320 are in S&P 500 stocks while 157,235 transactions are not. Holdings, Location, and Local Bias We test whether individual investors overweigh local stocks in their portfolios relative to a market-capitalization portfolio. Table II presents results based on year-end holdings. We show that investors hold approximately 30% of their portfolios in stocks located within a 250 mile radius of their home. Approximately 12% of the market is headquartered within the same radius. [ Table II about here ] We calculate three measures of local bias. The difference between local holdings and available local holdings ranges between 17.1% and 18.4% with little variation over the five 11 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 66,
    "chunk_index": 15,
    "word_count": 290,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Approximately 12% of the market is headquartered within the same radius. [ Table II about here ] We calculate three measures of local bias. The difference between local holdings and available local holdings ranges between 17.1% and 18.4% with little variation over the five 11 Electronic copy available at: https://ssrn.com/abstract=817504 years. The ratio of local holdings to available local holdings ranges between 1.40 and 1.56 each year (after subtracting one). The natural log of the previous ratio ranges between 0.88 and 0.94 each year. All measures generate consistent results that households tilt their portfolios towards local stocks. Table 2 of the associated Internet Appendix shows local bias exists when using a 100 mile radius, a 100 km radius, and state boundaries. II. Results A. Holdings-Based Calendar-Time Portfolios We test whether individuals’ local investments earn superior returns using standard performance analysis. For each individual, we calculate the value-weighted return of his local holdings. Our holdings data are monthly and each individual produces a single time- series with up to 71 months of local returns. Table III, Panel A shows overview statistics for the monthly returns. Our data produce 938,644 individual-month observations. We report means and standard deviations across all 938,644 observations. [ Table III about here ] We regress an individual’s excess local returns (R − R ) on the market’s excess local,i f return (R∗ − R ), the excess returns of passive zip code-level index (R − R ), and the m f z,i f Fama-French-Carhart factors (SMB, HML, and MOM). To lessen the effect of small stocks (see Pitfall #2 mentioned in the introduction), we winsorize local portfolio returns at the 12 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 66,
    "chunk_index": 16,
    "word_count": 279,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "excess returns of passive zip code-level index (R − R ), and the m f z,i f Fama-French-Carhart factors (SMB, HML, and MOM). To lessen the effect of small stocks (see Pitfall #2 mentioned in the introduction), we winsorize local portfolio returns at the 12 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 66,
    "chunk_index": 17,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "0.5% and 99.5% levels.) The market’s return is denoted R∗ and is defined as the value- m weighted return of all CRSP stocks with zip code information. Each household in our data is located within one of 7,832 zip codes. A single, passive zip code-level index is calculated as the value-weighted return of all stocks headquartered within a 250 mile radius of the given zip code. Individuals who live in different zip codes are associated with different passive zip code-level indices. Estimation is by pooled ordinary least squares. Since individual i’s return in a given month may be correlated with individual j’s return in the same month, we compute standard errors that are robust to heteroscedasticity and contemporaneous correlation (clustered by month). Please see Appendix C for additional information about statistical inference and clustered standard errors. TableIII,PanelB,Regression1showstheaverageexcessreturnis105.8basispoints(bp) per month. Regression 2 shows that investors’ portfolios of local holdings outperform the market (R∗ ) by only 7.3 bp per month after adjusting for market beta. Regression 3 shows m thelocalholdingsoutperformtherespectivepassive, zipcode-levelindex(R ,i)by6.9bpper z month with 0.4 t-statistic. Note, had we not used clustered standard errors, we would have (erroneously) reported a 6.6 t-statistic for the constant in Regression 3. The last regression in Table III, Regression 7, contains all control variables and shows an alpha of 6.7 bp per month. An outperformance of 6.7 bp per month translates to an alpha of 0.8% per annum which is not economically significant. We aggregate households’ returns into value-weighted portfolios at the zip code-level to 13 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 66,
    "chunk_index": 18,
    "word_count": 257,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "all control variables and shows an alpha of 6.7 bp per month. An outperformance of 6.7 bp per month translates to an alpha of 0.8% per annum which is not economically significant. We aggregate households’ returns into value-weighted portfolios at the zip code-level to 13 Electronic copy available at: https://ssrn.com/abstract=817504 check the robustness of our results. There are at least two advantages of this alternative approach. First, zip code-level analysis helps alleviate potential influence from outliers at the household-level (Pitfall #2). Second, compared with individual-level analysis, the zip code- level analysis assigns equal weight to each geographic area. This helps circumvent problems related to geographic selection bias and the distribution of retail investors (Pitfall #3). [ Table IV about here ] TableIV,PanelBreportsregressionresultswhencalendar-timeportfoliosareaggregated at the zip code-level. After controlling for market-level or zip code-level returns, alphas in the table are not significantly different from zero. T-statistics range from 0.11 to 0.76 in Regressions 2 to 7. The alphas are economically small as well. Our next set of results involves holdings-based portfolios and the difference between an individual’s local portfolio returns and his remote portfolio returns. We use this difference portfolioasthedependentvariableinourregressionanalysis. Wedonotnecessarilyadvocate forming long-short portfolios based on individual holdings because individuals rarely short stocks. Thissaid, formingsuchaportfolioallowspossiblytheclosestcomparisonwithresults in Table V of the Ivkovic and Weisbenner (2005) paper. Coincidentally, our results using local-minus-remote holdings are shown in our Table V. [ Table V about here ] In our Table V, we regress the local-minus-remote returns (R −R ) on the dif- local,i remote,i ference between passive local and remote portfolios (R −R∗ ). The passive, local portfolio z,i m\\z 14 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 66,
    "chunk_index": 19,
    "word_count": 271,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "shown in our Table V. [ Table V about here ] In our Table V, we regress the local-minus-remote returns (R −R ) on the dif- local,i remote,i ference between passive local and remote portfolios (R −R∗ ). The passive, local portfolio z,i m\\z 14 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 66,
    "chunk_index": 20,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "is denoted R and is formed at the investor’s zip code level. The passive, remote portfolio z,i is denoted R∗ and contains all stocks not in certain radius of the investor. Our Table V, m\\z Regressions 3 shows an alpha of 0.9 with a 0.2 t-statistic. The alpha is neither economi- cally nor statistically different from zero. Our Table V provides additional and compelling evidence that an individual’s local holdings do not outperform his remote holdings. The associated Internet Appendix contains five, additional robustness checks using re- gression analysis and holdings-based calendar-time portfolios. First, we define local with a 100 mile radius (Internet Appendix Table 3i). Second, we define local with a 100 km radius (Table 3ii). Third, we define local stocks as those being headquartered within the same state as the investors (Table 4i). Fourth, we consider only states with large numbers of individuals and firms. Our goal is to avoid states with few investors and/or few firms overly influencing the regression results (Table 4ii). Appendix D discusses forming holdings-based portfolios at the zip code-level and at the state-level. Fifth, and finally, we estimate a more flexible state-level regression that allows market betas to vary by state (Table 4iii). Results of the robustness checks shown in the Internet Appendix are consistent with results presented in Tables III, IV, and V shown in the main paper. Tables III, IV, and V in the main paper paint a very clear picture. After controlling for passive state-level indices and/or Fama-French factors, individual investors do not generate significantly positive alpha with their local holdings. In Table III, Regression 7, the alpha is 6.7 bp per month or 0.8% per annum with a 0.6 t-statistic. In Table IV, Regression 7, the alpha is 1.3 bp per month or 0.2% per annum with a 0.1 t-statistic. In Table V, Regression 3, the alpha is 0.9 bp per month or 0.1% per annum with a 0.2 t-statistic. 15 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 66,
    "chunk_index": 21,
    "word_count": 327,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "with a 0.6 t-statistic. In Table IV, Regression 7, the alpha is 1.3 bp per month or 0.2% per annum with a 0.1 t-statistic. In Table V, Regression 3, the alpha is 0.9 bp per month or 0.1% per annum with a 0.2 t-statistic. 15 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 66,
    "chunk_index": 22,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "B. Transactions-Based Calendar-Time Portfolios We test whether purchases of local stocks predict future positive returns and whether sales predict future negative returns. Our methodology uses transactions-based calendar- time portfolios to aggregate the trades of many individuals and control for cross-sectional correlation of stock returns.8 Stocks are held in the portfolios for one year, which is close to the average holding period of the investors in our sample. Our data contain hundreds of transactions each day and returns are calculated on a daily basis. Despite using daily returns, our calendar-time portfolios are free from potential micro-structure effects. Please see Appendix E for additional descriptions of transactions-based calendar-time portfolios. The returns of our transactions-based calendar-time portfolios have two, natural eco- nomic interpretations. First, they represent the returns experienced by an investor who mimics the trades of individuals in our data and holds stocks for a set period of time (i.e., 1 year). Second, they represent the opposite returns of an investor (such as an institution) who trades against individuals in our data and who holds stocks for a year. If individuals lose 2% per year, an investor trading against the individuals stands to make 2% per year. All returns are calculated before transactions costs. Table VI presents the transactions-based calendar-time portfolio results. In Panel A, the calendar-time “Buys” portfolio has an average return of 6.1 basis points per day. The calendar-time “Sells” portfolio has an average return of 6.9 bp per day. The difference of returns (Buys-minus-Sells) are -0.8 bp per day which works out to -2.0% per annum. This difference is statistically significant with a -2.5 t-statistic. 16 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 66,
    "chunk_index": 23,
    "word_count": 272,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "6.1 basis points per day. The calendar-time “Sells” portfolio has an average return of 6.9 bp per day. The difference of returns (Buys-minus-Sells) are -0.8 bp per day which works out to -2.0% per annum. This difference is statistically significant with a -2.5 t-statistic. 16 Electronic copy available at: https://ssrn.com/abstract=817504 [ Table VI about here ] We calculate abnormal returns (or “Alpha”) for the transactions-based calendar-time portfolios by regressing the returns of the Buys-minus-Sells portfolio on a constant and the market’s excess returns. Statistical inference is straightforward as there is only a single time series of returns. T-statistics are based on Newey-West standard errors. Please see Appendix C for additional descriptions of statistical inference. In Table VI, Panel A, the alpha is -2.2% per annum with a -2.7 t-statistic. Table VI, Panel B classifies stocks by location. Local buys minus local sells have an average return of -1.7% per annum with a -1.8 t-statistic. We conclude that locals buys underperform local sells and the difference is statistically significant at the 7%-level. C. Stocks with Lower/Higher Levels of Information Asymmetries We test whether trades of individual investors have value-relevant information for stocks with lower/higher levels of information asymmetry. As discussed in the Data section, the S&P 500 index is used to help identify stocks with different levels of information asymmetry. Stocks not in the index are identified as those with higher levels of information asymmetry. TableVI,PanelDshowstheaverageBuys-minus-Sellsreturnoflocalnon-S&P500stocks is -2.3% per annum with a -2.5 t-statistic. We note that results involving the transactions- based calendar-time portfolios do not suffer from low-powered tests. We show economically and statistically significant underperformance when it exists. The associated Internet Appendix contains ten tables with alternative specifications and 17 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 66,
    "chunk_index": 24,
    "word_count": 286,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "-2.3% per annum with a -2.5 t-statistic. We note that results involving the transactions- based calendar-time portfolios do not suffer from low-powered tests. We show economically and statistically significant underperformance when it exists. The associated Internet Appendix contains ten tables with alternative specifications and 17 Electronic copy available at: https://ssrn.com/abstract=817504 robustness checks (see Table 6i to Table 6Dii). We define local using 100 mile and 100 km radii. We form equally-weighted transactions-based calendar-time portfolios. We consider holding periods of 3 months, and 6 months. The results are consistent with those presented in Table VI of the main paper. As noted in the introduction to this paper, results involving local non-S&P 500 stocks are some of our most important findings. If individuals have any valuable information, we hypothesize that the information is likely to be about local stocks with high-levels of infor- mation asymmetries. However, when we focus only on these types of stocks, individual buys do not predict future price increases. Individual sells do not predict future price decreases. In fact, we see the opposite. D. Different Time Periods Wemeasuretime-variationofthetransactions-basedresults. TableVIIshowstheaverage daily return in basis points for the Buys-minus-Sells portfolios over each of six different calendar years. Buys of local stocks actually outperform sells by 1.4 bp per day in 1991. The local buys and local sells portfolios have roughly similar returns in 1995. [ Table VII about here ] Overtheremainingyears, localbuysunderperformlocalsellswiththeright-handcolumn showing an average -0.7 bp per day underperformance over all years (matches results shown in Table VI, Panel B.) The strong outperformance of local stocks in 1991 might account for the conclusions in Ivkovic and Weisbenner (2005) as the earlier paper defined locality based 18 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 66,
    "chunk_index": 25,
    "word_count": 282,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "showing an average -0.7 bp per day underperformance over all years (matches results shown in Table VI, Panel B.) The strong outperformance of local stocks in 1991 might account for the conclusions in Ivkovic and Weisbenner (2005) as the earlier paper defined locality based 18 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 66,
    "chunk_index": 26,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "on 1991 holdings. E. Individual Trades and Contemporaneous Returns We end our empirical analysis by checking whether individuals tend to buy (sell) stocks on days prices are rising or falling. Due to data limitations, the contemporaneous daily relationship between trades and prices represents the highest frequency we can study. If individuals have value-relevant information, we expect prices to go up on days individuals are buying (or prices may go up in the immediate future.) Likewise, prices should go down on days they are selling or in the immediate future. We again form two calendar time portfolios: one “Buys” portfolio and one “Sells” port- folio. We measure the value-weighted return on the day individuals trade—i.e., stocks enter the portfolios for one day only. We specifically do not skip a day after trade dates as we want to measure a contemporaneous effect. We again form a Buys-minus-Sells transactions-based calendar-timeportfolioandmeasureanaveragedailyreturnof-57.4bp, whichissignificantly different from zero at all conventional levels. The negative sign might indicate that individ- uals actively buy as prices are falling and sell as prices are rising. Alternatively, individuals might have stale limit orders. As prices fall, individuals are “picked off” and thus appear to be selling into a falling market. The result in this section is consistent with findings in Kaniel, Saar, and Titman (2006). We do not see prices going up on days individuals are buying. We do not see prices falling on days individuals are selling. We find the opposite and thus provide further evidence that individuals do not have value-relevant information. III. Conclusions 19 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 66,
    "chunk_index": 27,
    "word_count": 261,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "and Titman (2006). We do not see prices going up on days individuals are buying. We do not see prices falling on days individuals are selling. We find the opposite and thus provide further evidence that individuals do not have value-relevant information. III. Conclusions 19 Electronic copy available at: https://ssrn.com/abstract=817504 It is well documented that individuals tilt their portfolios towards locally-headquartered stocks. Despite strong evidence from US and international studies, a question remains: why do investors have a preference for local stocks? Recent papers by Ivkovic and Weis- benner (2005) and Massa and Simonov (2006) suggest that individuals can exploit local information. If this is true, one might rationalize tilting portfolios away from the market portfolio and towards local stocks. Our paper tests whether individuals earn superior returns on their local investments. Our methodology involves forming calendar-time (aggregate) portfolios based on holdings and transactions. We classify holdings and transactions based on whether the stock is local or remote for a given investor. The use of both holdings-based and transactions-based calendar-time portfolios is one aspect that sets our paper apart from related work. The calendar-time portfolios address four potential pitfalls that arise when studying individuals’ investments and geography. These pitfalls are: 1) cross-sectional correlation of portfolio returns; 2) small stocks and individual portfolios; 3) geographic selection biases; and 4) time-series selection biases. We analyze holdings of local stocks using standard portfolio analysis. After including the market’s excess return and the excess return of a passive local index, investors are found not to generate abnormally high returns. The average alpha is 0.8% per annum with a 0.6 t-statistic. The finding that individuals do not generate abnormally high returns differs from extant studies. We next use transactions-based calendar-time portfolios and find buys of local stocks 20 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 66,
    "chunk_index": 28,
    "word_count": 298,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "found not to generate abnormally high returns. The average alpha is 0.8% per annum with a 0.6 t-statistic. The finding that individuals do not generate abnormally high returns differs from extant studies. We next use transactions-based calendar-time portfolios and find buys of local stocks 20 Electronic copy available at: https://ssrn.com/abstract=817504 do not predict positive returns and sells of local stocks do not predict negative returns. In fact, a local Buys-minus-Sells portfolio earns -1.7% per annum with a -1.8 t-statistic. We hypothesize that if individuals have valuable information about a stock, it is likely that the stock is local and has high levels of information asymmetry (i.e., the stock is not in the S&P 500 index.) Even when constraining our analysis to only these local, non S&P 500 stocks, buys do not outperform sells. The Buys-minus-Sells portfolio has a return of -2.3% perannumwitha-2.5t-statistic. Thefindingthatlocalbuysunderperformlocalsellsdirectly contradicts conclusions reached in existing papers. Our results are robust to many alternative specifications. We divide the time series of transactions-based calendar-time portfolio returns by calendar year. We consider definitions of local and remote based on radii of 100 miles, 100 km, and state boundaries. We consider alternative measures of information asymmetries that include dollar trading volume and number of analysts following a stock. The associated Internet Appendix contains 17 pages of additional tables. Results are qualitatively similar and provide additional support for our conclusions. Our findings point to indexing as a straightforward solution to the perils faced by indi- vidual investors. An investor who indexes can minimize transactions costs and avoid losses associated with trading individual stocks. On average, individuals do not have value-relevant information about the local stocks they hold and trade. 21 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 66,
    "chunk_index": 29,
    "word_count": 283,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "as a straightforward solution to the perils faced by indi- vidual investors. An investor who indexes can minimize transactions costs and avoid losses associated with trading individual stocks. On average, individuals do not have value-relevant information about the local stocks they hold and trade. 21 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 66,
    "chunk_index": 30,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Appendix A: Cross-Sectional Correlation of Individuals’ Portfolio Returns When studying the returns individual investors’ portfolios, the number of independent observations is often related to the number of stocks in the market and not to the number of investors in the dataset. This fact can cause confusion and represents Pitfall #1 mentioned in the paper’s introduction. Since the number of independent observations is a quantity that affects statistical inference, we provide additional insights by way of an example. Consider studying the investment decisions of 40,000 individuals in a market with only two stocks. At the beginning of the year, suppose each individual independently decides what fraction α of his portfolio to invest in Stock A. The remaining fraction of his portfolio A,i (α = 1−α ) is invested in Stock B. We next record each of the 40,000 portfolio returns B,i A,i (r ) at the end of the year. Assume no re-balancing for simplicity. Since r = r + p,i p,i B α (r −r ), financial economists will notice a relationship between r and α provided A,i A B p,i A,i the two stocks have different returns over the year. How statistically significant is the observed relationship between an individual’s portfo- lio returns (r ) and his portfolio choice (α ) in the previous example? Even if all 40,000 p,i A,i individuals make independent portfolio decisions, there are not 40,000 independent observa- tions. Inthisexample, thereareonlytwoindependentobservationsandafinancialeconomist has no ability to reliably conclude whether increased investments in one type of stock (e.g., local stocks) enhances an investor’s returns. In more realistic examples, the number of in- dependent stock returns increases as the number of different stocks in investors’ portfolios increases (though there must be corrections if an underlying factor structure determines re- 22 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 66,
    "chunk_index": 31,
    "word_count": 297,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "type of stock (e.g., local stocks) enhances an investor’s returns. In more realistic examples, the number of in- dependent stock returns increases as the number of different stocks in investors’ portfolios increases (though there must be corrections if an underlying factor structure determines re- 22 Electronic copy available at: https://ssrn.com/abstract=817504 turns.) Using calendar-time portfolios and clustered standard errors allow us to account for cross-sectional correlation of stock returns. 23 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 24,
    "page_range": "p.24-25",
    "total_pages": 66,
    "chunk_index": 32,
    "word_count": 74,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.24-25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "number of different stocks in investors’ portfolios increases (though there must be corrections if an underlying factor structure determines re- 22 Electronic copy available at: https://ssrn.com/abstract=817504 turns.) Using calendar-time portfolios and clustered standard errors allow us to account for cross-sectional correlation of stock returns. 23 Electronic copy available at: https://ssrn.com/abstract=817504 Appendix B: Small Stocks and Individual Portfolios When studying investor-level portfolios, small stocks can overly influence results. Some portfolios are comprised of very few stocks. It is possible that a single stock constitutes the local part of an investor’s portfolio. During our sample period, the Center for Research in Security Prices (CRSP) reports 192 instances of monthly stock returns over 200% (which compounds to over 53,000,000% per annum). Incredibly, one stock reports a return of 1,250% one month. When looking at the firms associated with these high-return events, the average market capitalization at the beginning of the month is less than 7.5 million dollars. Half of the events are associated with stocks having market capitalizations less than 2.5 million dollars. Not surprisingly, small stocks can (on occasion) have extreme returns. To understand how extreme returns can affect large data samples, consider the following example: The local holdings-based portfolios shown in Table III have an average return of 1.4% per month. Our data consists of 938,644 observations (or household-months). If only 75 of the stock-months had a return of 1,250%, the average would go up 1.5% per month. Note that 75 out of 938,644 represents less than 0.008% of the sample. Asmentionedintheintroduction, weaddresspossiblesmall-stockbiasesbyformingport- folios that combine and value-weight holdings of many investors. We also use transactions- based portfolios that combine all purchases or sales into a single portfolio. 24 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 66,
    "chunk_index": 33,
    "word_count": 283,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "up 1.5% per month. Note that 75 out of 938,644 represents less than 0.008% of the sample. Asmentionedintheintroduction, weaddresspossiblesmall-stockbiasesbyformingport- folios that combine and value-weight holdings of many investors. We also use transactions- based portfolios that combine all purchases or sales into a single portfolio. 24 Electronic copy available at: https://ssrn.com/abstract=817504 Appendix C: Statistical Inference and Calendar-Time Portfolios Holdings-Based Calendar-Time Portfolios: We test whether portfolios of local stock holdings have abnormally high returns. The portfolios are formed at the individual level. For a given individual i, we have up to 71 monthly observations. Table III in the paper, for example, estimates stacked (pooled) regressions using ordinary least squares. Returns of portfolios formed from investors i and j may be contemporaneously corre- lated. To account for this cross-sectional dependence, we use Roger’s standard errors that are clustered by month. See Rogers (1993); Petersen (2008); and Cameron, Gelbach, and Miller (2007) for details regarding cluster-robust standard errors. The variance of the esti- mator is shown below where G is the number of clusters. In our paper, G=71 since we have 71 months of data. (cid:34) (cid:35) G (cid:16) (cid:17) (cid:88) Var β ˆ = (X(cid:48)X)−1 X(cid:48)uˆ uˆ(cid:48)X (X(cid:48)X)−1 g g g g g=1 (cid:16) (cid:17) ˆ uˆ = y X β g g g Transactions-Based Calendar-Time Portfolios: Ourtransactions-basedcalendar-time portfolios produce single time-series of daily returns. Statistical inference is straightforward. The difference of two calendar-time portfolios is regressed on a constant and market’s excess returns. SerialcorrelationandheteroscedasticityofresidualsareaddressedwithNewey-West standard errors with five lags. The regression equation is: R = α +β (R −R )+ε Buy−Sell,t p p m,t f,t t where R is the difference between two daily calendar-time portfolios, R is the Buy−Sell,t m,t 25 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 66,
    "chunk_index": 34,
    "word_count": 285,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "a constant and market’s excess returns. SerialcorrelationandheteroscedasticityofresidualsareaddressedwithNewey-West standard errors with five lags. The regression equation is: R = α +β (R −R )+ε Buy−Sell,t p p m,t f,t t where R is the difference between two daily calendar-time portfolios, R is the Buy−Sell,t m,t 25 Electronic copy available at: https://ssrn.com/abstract=817504 daily CRSP value-weighted return, and R is the daily return on the riskfree asset. f,t 26 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 27,
    "page_range": "p.27-28",
    "total_pages": 66,
    "chunk_index": 35,
    "word_count": 71,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.27-28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "−R )+ε Buy−Sell,t p p m,t f,t t where R is the difference between two daily calendar-time portfolios, R is the Buy−Sell,t m,t 25 Electronic copy available at: https://ssrn.com/abstract=817504 daily CRSP value-weighted return, and R is the daily return on the riskfree asset. f,t 26 Electronic copy available at: https://ssrn.com/abstract=817504 Appendix D: Holdings-Based Calendar-Time Portfolios formed at the Zip Code-Level and State-Level To overcome possible biases caused by positions in small/low-priced stocks (Pitfall #2), investors are aggregated by the zip code or state in which they live. When focusing on zip codes, we create a portfolio that contains the local investments of all investors living at a given zip code. Local investments are defined using as 250 mile radius as described in the paper. When focusing on states, local stocks are defined as being headquartered in the state where an individual lives. The return of an aggregate portfolio is the monthly value-weighted return of stocks in the portfolio. Portfolio weights are determined by the values of holdings at the beginning of each month. We consider all zip codes with investors. The net result is 7,832 time series of local (zip code-level) returns. With states, we start with all 50 states plus the District of Columbia, but exclude Delaware, Maine, Montana, New Mexico, North Dakota, and Wyoming due to insufficient investor and/or firm data. The net result is 45 time series of local (state-level) returns. Holdings-based calendar-time portfolios have the advantage that an investor’s actual holding period is reflected in the time series of portfolio returns. Consider a household in Seattle that buys Microsoft stock on March 29, 1991 and sells the stock February 28, 1992. Microsoft stock will be in Washington State’s local portfolio for the 11 months the investor holds the stock. The disadvantage is that holdings are only sampled once a month. To address a possible geographic sampling bias (Pitfall #3), we create passive zip-code specific or state-specific indices (called R or R ) and require investors to outperform these indices z s 27 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 66,
    "chunk_index": 36,
    "word_count": 341,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "the stock. The disadvantage is that holdings are only sampled once a month. To address a possible geographic sampling bias (Pitfall #3), we create passive zip-code specific or state-specific indices (called R or R ) and require investors to outperform these indices z s 27 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 66,
    "chunk_index": 37,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "if we are to conclude they have value-relevant information. We estimate pooled regressions using ordinary least squares. When aggregating by zip code the dependent variable has dimensions 369,219×1. When we use data from 45 states, the stacked dependent variable has dimensions 3,190×1 indicating an average of 70.9 months of data per state. To account for cross-sectional correlation of zip code i’s and zip code j’s returns (or state i’s and state j’s returns), t-statistics are based on clustered standard errors (clustered by month). Table IV in the main paper shows results when investors are aggre- gated by zip code. The alpha associated with local holdings remains insignificantly different from zero. The point estimate is only 1.3 bp per month in Regression 7. Internet Appendix Table 4i shows results when investors and firms are classified by state rather than by zip code. The alpha associated with local holdings remains insignificantly different from zero. What’s more, the point estimate is only 1.6 bp per month in Regression 7. This works out to 0.2% per annum. Tofurthercontrolforpossiblebiasescausedbysmallpositionsinsmall/low-pricedstocks (Pitfall #2), we re-estimate regressions using only returns from the 20 most represented states. See, Internet Appendix Table 4ii. As a final robustness check, we allow all coefficients on the market excess return and the passive state portfolios to vary by state. In Internet Appendix Table 4iii, the alpha is still constrained to be the same across the 45 states. The alpha associated with local holdings remains insignificantly different from zero. The robustness checks support the conclusions reached in this paper. 28 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 66,
    "chunk_index": 38,
    "word_count": 261,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "portfolios to vary by state. In Internet Appendix Table 4iii, the alpha is still constrained to be the same across the 45 states. The alpha associated with local holdings remains insignificantly different from zero. The robustness checks support the conclusions reached in this paper. 28 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 66,
    "chunk_index": 39,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Appendix E: Transactions-Based Calendar-Time Portfolios We mimic the buys and sells of investors by forming “Buys” calendar-time portfolios and “Sells” portfolios. Each time an investor buys a stock, we place the same number of shares in our calendar-time “buy” portfolio. Each time an investor sells a stock, we place the same number of shares in our calendar-time “sell” portfolio. Shares are held in a portfolio for a pre-determined length of time. Our strategy of mimicking the number of shares traded is called a value-weighted calendar-time portfolio. A value-weighted calendar-time portfolio refers to buying or selling the same number of shares that individual investors buy or sell. In this way, large transactions initially receive more weight than small transactions. An equal-weighted calendar-time portfolio refers to initially buying (selling) $1 of each stock bought (sold). Buying (selling) $1 of a stock corresponds to buying (selling) $1 ÷ Pt shares of the stock where Pt is the share price in dollars. Thevalueofsharesheldinaportfoliochangesasthestockpricegoesupanddown. Thus, bothvalue-weightedandequal-weightedcalendar-timeportfoliosaccountforchangesinstock prices. Both the value-weighted and equal-weighted calendar-time portfolios calculate the weighted average return of stocks in the portfolio each day. The main difference between the two types of portfolios is that a position in the equal-weighted portfolio starts at $1 worth of shares while a position in the value-weighted portfolio starts at the value of shares actually bought by individuals in our dataset. The tables in the main paper consider a 1 year holding period which is close to the average holding period for investors in our data. Internet Appendix Tables 6A; Table 6Bi; 29 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 66,
    "chunk_index": 40,
    "word_count": 261,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "starts at the value of shares actually bought by individuals in our dataset. The tables in the main paper consider a 1 year holding period which is close to the average holding period for investors in our data. Internet Appendix Tables 6A; Table 6Bi; 29 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 66,
    "chunk_index": 41,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Table 6Bii; Table 6Ci; Table 6Cii; Table 6Di; and Table 6Dii give results for holding periods of 3 months, 6 months, and 1 year. Internet Appendix Table 6iii shows results from an equal-weighted calendar-time portfolio with a one-year holding period. As investors in our dataset buy stocks (for example), the composition of our “calendar- time buys portfolio” changes. The return of the portfolio on any day is the weighted average return of the portfolio on that day. Weights are determined by the beginning-of-the-day values of shares held in the portfolio. Share values are recalculated each day based on close- of-market prices from the previous day. Importantly, we do not change the number of shares (of a single position) over its holding period. We do not re-balance the portfolio (other than adding stocks and holding them for the pre-determined length of time.) We follow a buy-and-hold strategy. A calendar-time portfolio produces a single time series of returns. The total length of the time series is equal to the number of days between the first and last transaction in the sample plus the holding period (i.e., approximately seven years long in our case.) Our transactions-based calendar-time portfolios address potential micro-structure effects in two ways. First, we place shares in our portfolios at the end of the day after an individual actually buys or sells the shares. In other words, we skip a day between the actual pur- chase/sale date and when we start recording prices. If buys take place at the ask and sales atthebid, weavoidanymean-reversioninducedbythebid-askspread. Second, oureconomic results/conclusions are based on the differences of two calendar-time portfolios (buys minus sells.) Since each portfolio is comprised of hundreds or thousands of stocks at any point in time, our returns are not subject to the bias described in Blume and Stambaugh (1983). 30 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 66,
    "chunk_index": 42,
    "word_count": 305,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "oureconomic results/conclusions are based on the differences of two calendar-time portfolios (buys minus sells.) Since each portfolio is comprised of hundreds or thousands of stocks at any point in time, our returns are not subject to the bias described in Blume and Stambaugh (1983). 30 Electronic copy available at: https://ssrn.com/abstract=817504 That is, bid-ask bounce does not bias returns due to volatility. Our calendar-time portfolios diversify away individual stock bid-ask bounce. 31 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Document",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 66,
    "chunk_index": 43,
    "word_count": 76,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "any point in time, our returns are not subject to the bias described in Blume and Stambaugh (1983). 30 Electronic copy available at: https://ssrn.com/abstract=817504 That is, bid-ask bounce does not bias returns due to volatility. Our calendar-time portfolios diversify away individual stock bid-ask bounce. 31 Electronic copy available at: https://ssrn.com/abstract=817504 [1] Admati, Anat R. 1985. “A Noisy Rational Expectations Equilibrium for Multi-Asset Securities Markets.” Econometrica 53(3), 629-58. [2] Barber, Brad M. and John D. Lyon, 1997, “Detecting Long-Run Abnormal Stock Re- turns: The Empirical Power and Specification of Test Statistics,” Journal of Financial Economics 43(3), 341-372. [3] Barber,BradM.andTerranceOdean,2000,“TradingisHazardoustoYourWealth: The Common Stock Investment Performance of Individual Investors,” Journal of Finance 55(2) April, 773-806. [4] Barber, Brad M. and Terrance Odean, 2001, “Boys will be Boys: Gender, Overconfi- dence, and Common Stock Investment,” Quarterly Journal of Economics 116(1) Febru- ary, 261-292. [5] Barber, Brad M. and Terrance Odean, 2002, “Online Investors: Do the Slow Die First?” Review of Financial Studies 15(2), 455-489. [6] Barber, Brad M., Terrance Odean, and Ning Zhu, 2009, “Do Retail Trades Move Mar- kets?”, Review of Financial Studies, Forthcoming. [7] Barclay, Michael J., Terrance Hendershott, and Charles M. Jones, 2008, “Order Con- solidation, Price Efficiency, and Extreme Liquidity Shocks,” Journal of Financial and Quantitative Analysis 43 March, 93-121. 32 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "References",
    "page_number": 33,
    "page_range": "p.33-34",
    "total_pages": 66,
    "chunk_index": 44,
    "word_count": 216,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.33-34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "and Ning Zhu, 2009, “Do Retail Trades Move Mar- kets?”, Review of Financial Studies, Forthcoming. [7] Barclay, Michael J., Terrance Hendershott, and Charles M. Jones, 2008, “Order Con- solidation, Price Efficiency, and Extreme Liquidity Shocks,” Journal of Financial and Quantitative Analysis 43 March, 93-121. 32 Electronic copy available at: https://ssrn.com/abstract=817504 [8] Blume, Marshall E. and Robert F. Stambaugh, 1983, “Biases in Computed Returns An Application to the Size Effect,” Journal of Financial Economics 12, 387-404. [9] Brav, Alon and Paul A. Gompers, 1997, “Myth or Reality? The Long-Run Underper- formance of Initial Public Offerings,” Journal of Finance 52(5), 1791-1821. [10] Cameron, A. Colin, Jonah B. Gelbach, and Douglas L. Miller, 2007, “Robust Inference with Multi-way Clustering,” Working Paper, U.C. Davis. [11] Cumming, Douglas and Na Dai, 2009, “Local Bias in Venture Capital Investments,” Forthcoming Journal of Empirical Finance. [12] Coval, Joshua D., David Hirshleifer, and Tyler Shumway, 2002, “Can Individual In- vestors Beat the Market,” Working Paper Harvard University. [13] Coval, Joshua D. and Tobias J. Moskowitz, 2001, “The Geography of Investment: In- formed Trading and Asset Prices,” Journal of Political Economy 109(4), 811-841. [14] Dhar, Ravi and Ning Zhu, 2006, “Up Close and Personal: Investor Sophistication and the Disposition Effect,” Management Science 52(5) May, 726-740. [15] Diamond, Douglas W. and Robert E. Verrecchia, 1981, “Information Aggregation in a Noisy Rational Expectations Equilibrium,” Journal of Financial Economics 9, 221-235. [16] Feng, Lei and Mark S. Seasholes, 2004, “Portfolio Choice and Location of Trade,” Working Paper U.C. Berkeley. [17] French, Kenneth R and James M. Poterba, 1991, “Investor Diversification and Interna- tional Equity Markets,” American Economic Review 81(2), 222-226. 33 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "References",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 66,
    "chunk_index": 45,
    "word_count": 274,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "of Financial Economics 9, 221-235. [16] Feng, Lei and Mark S. Seasholes, 2004, “Portfolio Choice and Location of Trade,” Working Paper U.C. Berkeley. [17] French, Kenneth R and James M. Poterba, 1991, “Investor Diversification and Interna- tional Equity Markets,” American Economic Review 81(2), 222-226. 33 Electronic copy available at: https://ssrn.com/abstract=817504 [18] Goetzmann, William N. and Alok Kumar, 2008, “Equity Portfolio Diversification,” Review of Finance 12(3), 433-463. [19] Graham, John R. and Alok Kumar, 2006, “Do Dividend Clienteles Exist? Evidence on Dividend Preferences of Retail Investors,” Journal of Finance 61(3) June, 1305-1336. [20] Grinblatt, Mark and Matti Keloharju, 2001, “How Distance, Language, and Culture Influence Stockholdings and Trades,” Journal of Finance 56(3) June, 1053-1073. [21] Hau, Harald, 2001, “Location Matters: An Examination of Trading Profits,” Journal of Finance 56(5) October, 1959-1983. [22] Hellwig, Martin F. 1980. “On the Aggregation of Information in Competitive Markets.” Journal of Economic Theory 22(3), 477-98. [23] Huberman, Gur, 2001, “Familiarity Breeds Investment,” Review of Financial Studies 14(3), 659-680. [24] Ivkovic, Zoran, James Poterba, and Scott Weisbenner, 2005, “Tax-Motivated Trading by Individual Investors,” American Economic Review 95(5) December, 1605-1630. [25] Ivkovic, Zoran and Scott Weisbenner, 2005, “Local Does as Local Is: Information Con- tent of the Geography of Individual Investors’ Common Stock Investments,” Journal of Finance 60(1) February, 267-306. [26] Jeng, Leslie A., Andrew Metrick, and Richard Zeckhauser, 2003, “Estimating the Re- turns to Insider Trading: A Performance-Evaluation Perspective,” Review of Economics and Statistics 85(2) May, 453-471. 34 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "References",
    "page_number": 35,
    "page_range": "p.35-36",
    "total_pages": 66,
    "chunk_index": 46,
    "word_count": 246,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.35-36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "tent of the Geography of Individual Investors’ Common Stock Investments,” Journal of Finance 60(1) February, 267-306. [26] Jeng, Leslie A., Andrew Metrick, and Richard Zeckhauser, 2003, “Estimating the Re- turns to Insider Trading: A Performance-Evaluation Perspective,” Review of Economics and Statistics 85(2) May, 453-471. 34 Electronic copy available at: https://ssrn.com/abstract=817504 [27] Kaniel, Ron, Gideon Saar, and Sheridan Titman, 2008, “Individual Investor Trading and Stock Returns,” Journal of Finance 63, 273-310. [28] Kang, Jun-Koo and Rene M. Stulz, 1997, “Why is There Home Bias? An Analysis of Foreign Portfolio Equity Ownership in Japan,” Journal of Financial Economics 46(1), 328. [29] Kumar, Alok, 2004, “Is the Local Bias of Individual Investors Induced by Familiarity or Information-Asymmetry?,” Working paper Notre Dame University. [30] Kumar, Alok, 2008a, “Dynamic Style Preferences of Individual Investors and Stock Returns,” Forthcoming Journal of Financial and Quantitative Analysis. [31] Kumar, Alok, 2008b, “Hard-To-Value Stocks, Behavioral Biases, and Informed Trad- ing,” Forthcoming Journal of Financial and Quantitative Analysis. [32] Kumar, Alok and Charles M.C. Lee, 2006, “Retail Investor Sentiment and Return Co- movements,” Journal of Finance 61(5) October, 2451-2486. [33] Kumar, Alok and Sonya Lim, 2008, “How do Decision Frames Influence the Stock Investment Choices of Individual Investors?” Management Science 54(6), 1052-1064. [34] Lyon, JohnD., BradM.Barber, andChih-LingTsai1999, “ImprovedMethodsforTests of Long-Run Abnormal Stock Returns,” Journal of Finance 54(1) February. [35] Massa, Massimo and Andrei Simonov, 2006, “Hedging, Familiarity, and Portfolio Choice,” Review of Financial Studies 19(2), 633-685. 35 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "References",
    "page_number": 36,
    "page_range": "p.36-37",
    "total_pages": 66,
    "chunk_index": 47,
    "word_count": 242,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.36-37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Stock Investment Choices of Individual Investors?” Management Science 54(6), 1052-1064. [34] Lyon, JohnD., BradM.Barber, andChih-LingTsai1999, “ImprovedMethodsforTests of Long-Run Abnormal Stock Returns,” Journal of Finance 54(1) February. [35] Massa, Massimo and Andrei Simonov, 2006, “Hedging, Familiarity, and Portfolio Choice,” Review of Financial Studies 19(2), 633-685. 35 Electronic copy available at: https://ssrn.com/abstract=817504 [36] Odean, Terrance, 1998, “Are Investors Reluctant to Realize Their Losses?” Journal of Finance 53(5), 1775-1798. [37] Odean, Terrance, 1999, “Do Investors Trade Too Much?,” American Economic Review December, 1279-1298. [38] Petersen, Mitchell A., 2008, “Estimating Standard Errors in Finance Panel Data Sets: Comparing Approaches,” Forthcoming Review of Financial Studies. [39] Rogers, William H., 1993, “Regression Standard Errors in Clustered Samples,” Stata Technical Bulletin 13, 19-23. [40] Zhu, Ning, 2003, “The Local Bias of Individual Investors,” Working paper Yale Univer- sity. 36 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "References",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 66,
    "chunk_index": 48,
    "word_count": 137,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Errors in Finance Panel Data Sets: Comparing Approaches,” Forthcoming Review of Financial Studies. [39] Rogers, William H., 1993, “Regression Standard Errors in Clustered Samples,” Stata Technical Bulletin 13, 19-23. [40] Zhu, Ning, 2003, “The Local Bias of Individual Investors,” Working paper Yale Univer- sity. 36 Electronic copy available at: https://ssrn.com/abstract=817504 1 For U.S. results see Ivkovic and Weisbenner (2005) and Zhu (2003). For Finnish results see Grinblatt and Keloharju (2001). For results from mainland China see Feng and Seasholes (2004). Throughout this paper we primarily consider a distance-based measure of “local” and “remote”. Stocks that are headquartered within a certain radius of an household are considered local for that household. Stocks that are headquartered outside the radius are considered remote. We consider radii of 100 km, 100 miles, and 250 miles. 2 For examples, see Hellwig (1980), Diamond and Verrecchia (1981), and Admati (1985). 3 Non-S&P 500 stocks are generally smaller, have less institutional trading, and are not followed by many analysts as stocks in the index. We refer to these stocks as ones with “higher levels of information asymmetries”. Please see the Data section for additional description of the classification methodology. 4 Returns of individuals’ portfolios are always value-weighted in our paper. Some port- folios, however, may only contain a single local stock. 5 See Barber and Odean (2000, 2001, 2002); Barber, Odean, and Zhu (2009); Dhar and Zhu (2006); Goetzmann and Kumar (2008); Graham and Kumar (2006); Ivkovic, Poterba, andWeisbenner(2005); IvkovicandWeisbenner(2005); Kumar(2004,2008a,2008b); Kumar and Lee (2006); Kumar and Lim (2008); and Odean (1998, 1999). A detailed description of the data can be found in Barber and Odean (2000). 6 Coval and Moskowitz (2001) provide a distance formula in footnote 3 on p. 815. We 37 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Footnotes",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 66,
    "chunk_index": 49,
    "word_count": 292,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Footnotes (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "IvkovicandWeisbenner(2005); Kumar(2004,2008a,2008b); Kumar and Lee (2006); Kumar and Lim (2008); and Odean (1998, 1999). A detailed description of the data can be found in Barber and Odean (2000). 6 Coval and Moskowitz (2001) provide a distance formula in footnote 3 on p. 815. We 37 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Footnotes",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 66,
    "chunk_index": 50,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Footnotes (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "present results based on the 250 mile radius, in order to make straightforward comparisons with existing papers. Results based on 100 miles and 100 km radii are qualitatively similar and shown in the Internet Appendix. Ideally we would also like to measure the distance from each investor’s home to each stock’s closest branch office or subsidiary. Although we do not have such data, Massa and Simonov (2006, p. 652) are able to construct this measure using Swedish data. They find results do not differ materially when using a measure based on firm headquarters compared with a measure based on the closest branch office/subsidiary. 7 Table 1 of the associated Internet Appendix shows an alternative measure of informa- tion asymmetry based on dollar trading volume, analyst coverage, and S&P 500 inclusion. The alternative measure has an 88%to 98% overlap with S&P 500 inclusion. The advantages of using only S&P 500 inclusion are that it is straightforward, does not reduce the sample size by requiring stocks to have certain data, allows for comparison with existing papers, and avoids any dependence on stock returns (which are used to quantify investor performance). 8 Events-based and transactions-based calendar-time portfolios have been used in a num- ber of applications. Barber and Lyon (1997) and Lyon, Barber, and Tsai (1999) detail statistical properties relating to long-run tests of abnormal stock returns. Brav and Gom- pers (1997) measure returns to investing in the initial public offerings. Jeng, Metrick, and Zeckhauser (2002) use calendar-time portfolios to study the returns to insider trading. 38 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Footnotes",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 66,
    "chunk_index": 51,
    "word_count": 259,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Footnotes (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Barber, and Tsai (1999) detail statistical properties relating to long-run tests of abnormal stock returns. Brav and Gom- pers (1997) measure returns to investing in the initial public offerings. Jeng, Metrick, and Zeckhauser (2002) use calendar-time portfolios to study the returns to insider trading. 38 Electronic copy available at: https://ssrn.com/abstract=817504 Table I Summary Statistics Table shows overview statistics of our data. Investor data come from a large, discount brokerage. Household location is based on each household’s zip code. Firm-location information is based on the county and state of the headquarters as reported by Compustat. In Panels D and E, local stocks are defined as being headquartered within a 250 mile radius of a household. Remote stocks are defined as being headquartered outside the 250 mile radius. In Panel E, stocks are also classified by whether or not they are included in the S&P 500 Index. Panel A: Number of Households ( i ) Households 77,795 ( ii ) Households from (i) with Location Information 54,538 ( iii ) Households from (ii) in Continental United States 53,443 ( iv ) Households from (iii) with at Least One Common Stock Holding During Our Sample Period 44,836 ( v ) Households from (iv) with at Least One Common Stock Holding with Firm-Location Information 43,132 Panel B: Holdings Number of Value of Portfolio Date Households * Holdings ($ mil) Dec-1991 32,723 1,012.0 Dec-1992 33,483 1,701.9 Dec-1993 28,736 1,592.4 Dec-1994 21,021 1,187.6 Dec-1995 16,738 1,069.9 Households with at least one common stock holding * with firm-location information from (v) in Panel A Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Footnotes",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 66,
    "chunk_index": 52,
    "word_count": 262,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Footnotes (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "B: Holdings Number of Value of Portfolio Date Households * Holdings ($ mil) Dec-1991 32,723 1,012.0 Dec-1992 33,483 1,701.9 Dec-1993 28,736 1,592.4 Dec-1994 21,021 1,187.6 Dec-1995 16,738 1,069.9 Households with at least one common stock holding * with firm-location information from (v) in Panel A Electronic copy available at: https://ssrn.com/abstract=817504 Table I Summary Statistics – Continued Panel C: Transactions per Year Number of Transactions Value ($ million) Year Buys Sells Total Buys Sells Total 1991 92,164 68,434 160,598 885 828 1,712 1992 88,962 68,209 157,171 902 864 1,765 1993 84,791 75,177 159,968 913 943 1,855 1994 72,268 62,678 134,946 784 800 1,584 1995 93,268 85,092 178,360 1,221 1,297 2,518 1996 102,892 89,387 192,279 1,426 1,512 2,938 Total 534,345 448,977 983,322 6,130 6,243 12,373 Panel D: Transactions by Locations Location Based on 250 Mile Radius; All Years Together Number of Transactions Value ($ million) Buys Sells Total Buys Sells Total Local Stocks 134,766 114,789 249,555 1,585 1,719 3,304 Remote Stocks 399,579 334,188 733,767 4,545 4,524 9,069 Total 534,345 448,977 983,322 6,130 6,243 12,373 Panel E: Transactions by Location and S&P 500 Inclusion Location Based on 250 Mile Radius; All Years Together Number of Transactions Value ($ million) Buys Sells Total Buys Sells Total Local + S&P 500 47,696 44,624 92,320 655 736 1,390 Local + Non-S&P 500 87,072 70,163 157,235 930 983 1,914 Remote + S&P 500 162,546 141,806 304,352 2,250 2,300 4,550 Remote + Non-S&P 500 237,031 192,384 429,415 2,295 2,224 4,519 Total 534,345 448,977 983,322 6,130 6,243 12,373 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Footnotes",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 66,
    "chunk_index": 53,
    "word_count": 254,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Footnotes (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "S&P 500 47,696 44,624 92,320 655 736 1,390 Local + Non-S&P 500 87,072 70,163 157,235 930 983 1,914 Remote + S&P 500 162,546 141,806 304,352 2,250 2,300 4,550 Remote + Non-S&P 500 237,031 192,384 429,415 2,295 2,224 4,519 Total 534,345 448,977 983,322 6,130 6,243 12,373 Electronic copy available at: https://ssrn.com/abstract=817504 Table II Holdings, Location, and Local Bias Table shows the degree to which households overweigh local stocks. We report averages across households. In the table below, we calculate the fraction of each household’s portfolio invested within a 250 mile radius of the family home. Distance is measured from the household’s zip code to the zip code of the firm’s headquarters. For each household, we also calculate the fraction of the market (all stocks) within the same radius. The difference or ratio of Columns A and B represents a measure of local bias. (A) (B) Average % of Local Bias Measures Household’s Average Portfolio Portfolio % of Market Difference Ratio #1 Ratio #2 Date 250 miles 250 miles A - B A/B – 1 ln(A/B) Dec-1991 30.3 12.6 17.7 1.40 0.88 Dec-1992 29.3 12.1 17.2 1.42 0.88 Dec-1993 30.2 11.8 18.4 1.56 0.94 Dec-1994 29.1 12.0 17.1 1.43 0.89 Dec-1995 30.2 12.0 18.2 1.52 0.92 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Footnotes",
    "page_number": 42,
    "page_range": "p.42-43",
    "total_pages": 66,
    "chunk_index": 54,
    "word_count": 209,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Footnotes (p.42-43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "#1 Ratio #2 Date 250 miles 250 miles A - B A/B – 1 ln(A/B) Dec-1991 30.3 12.6 17.7 1.40 0.88 Dec-1992 29.3 12.1 17.2 1.42 0.88 Dec-1993 30.2 11.8 18.4 1.56 0.94 Dec-1994 29.1 12.0 17.1 1.43 0.89 Dec-1995 30.2 12.0 18.2 1.52 0.92 Electronic copy available at: https://ssrn.com/abstract=817504 Table III Holdings-Based Calendar-Time Portfolios Table shows results from analysis using holdings-based calendar-time portfolios. Panel A shows overview statistics of monthly return variables. Panel B shows pooled regression results with R – R as the dependent local,i f variable. R – R is the monthly excess return of an individual’s local holdings. Local stocks are defined as local,i f being headquartered within 250 miles of an investor’s home. R is the riskfree return from Ken French’s website. f R* – R is the value-weighted excess market return for all stocks with zip-code information. R – R is the m f z,i f excess return of a passive, zip-code level index. T-statistics are based on Rogers standard errors (clustered by month) and are robust to heteroscedasticity. Panel A: Overview Statistics of Monthly Returns Mean (%) Stdev (%) R 1.4042 10.66 local,i R* 1.2511 2.88 m R 1.3328 3.53 z,i R 0.3460 0.09 f R – R 1.0582 10.66 local,i f R – R* 0.1531 10.19 local,i m R – R 0.0714 10.06 local,i z,i Panel B: Regressions with R – R as the Dependent Variable local,i f Reg 1 Reg 2 Reg 3 Reg 4 Reg 5 Reg 6 Reg 7 Alpha (bp) 105.82 7.25 6.87 5.57 6.80 11.40 6.72 (t-stat) (2.42) (0.34) (0.40) (0.31) (0.50) (1.00) (0.56) R* – R 1.0891 0.0642 1.1395 0.1961 m f (t-stat) (12.36) (0.58) (30.02) (4.49) R – R 1.0027 0.9570 1.0122 0.8804 z,i f (t-stat) (20.54) (18.21) (38.34) (29.00) SMB 0.5093 0.4227 0.4338 (t-stat) (8.01) (7.90) (8.11) HML 0.0863 0.0533 0.0776 (t-stat) (1.38) (1.15) (1.55) MOM -0.2317 -0.2034 -0.2208 (t-stat) (-5.10) (-5.26) (-5.92) # of Obs 938,644 938,644 938,644 938,644 938,644 938,644 938,644 # of Months 71 71 71 71 71 71 71 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Footnotes",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 66,
    "chunk_index": 55,
    "word_count": 344,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Footnotes (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "(29.00) SMB 0.5093 0.4227 0.4338 (t-stat) (8.01) (7.90) (8.11) HML 0.0863 0.0533 0.0776 (t-stat) (1.38) (1.15) (1.55) MOM -0.2317 -0.2034 -0.2208 (t-stat) (-5.10) (-5.26) (-5.92) # of Obs 938,644 938,644 938,644 938,644 938,644 938,644 938,644 # of Months 71 71 71 71 71 71 71 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Footnotes",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 66,
    "chunk_index": 56,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Footnotes (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Table IV Holdings-Based Calendar-Time Portfolios—Aggregated at the Zip Code-Level Table shows results from analysis of holdings-based calendar-time portfolios. Panel A shows overview statistics of monthly return variables. Panel B shows pooled regression results with R – R as the dependent local,z f variable. R – R is the excess return of a portfolio that aggregates the local holdings of all investors living at local,z f a given zip code. R is the riskfree return from Ken French’s website. R* – R is the value-weighted excess f m f market return for all stocks with zip-code information. R – R is the excess return of a passive, zip code-level z f index. T-statistics are based on Rogers standard errors (clustered by month) and are robust to heteroscedasticity. Panel A: Overview Statistics of Monthly Returns Mean (%) Stdev (%) R 1.3320 8.94 local,z R* 1.2715 2.87 m R 1.3075 3.37 z R 0.3523 0.09 f R – R 0.9797 8.93 local,z f R – R* 0.0605 8.44 local,z m R – R 0.0245 8.31 local,z z Panel B: Regressions with R – R as the Dependent Variable local,z f Reg 1 Reg 2 Reg 3 Reg 4 Reg 5 Reg 6 Reg 7 Alpha (bp) 97.97 3.08 4.87 1.51 2.26 7.18 1.25 (t-stat) (2.55) (0.21) (0.37) (0.11) (0.22) (0.76) (0.13) R* – R 1.0324 0.1558 1.0732 0.2371 m f (t-stat) (15.91) (1.98) (37.06) (6.13) R – R 0.9746 0.8599 0.9842 0.8197 z f (t-stat) (24.80) (26.69) (44.88) (33.70) SMB 0.3819 0.3278 0.3372 (t-stat) (8.30) (7.39) (7.89) HML 0.0911 0.0547 0.0858 (t-stat) (2.03) (1.39) (2.09) MOM -0.1734 -0.1440 -0.1642 (t-stat) (-5.05) (-4.06) (-5.10) # of Obs 369,219 369,219 369,219 369,219 369,219 369,219 369,219 # of Months 71 71 71 71 71 71 71 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Footnotes",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 66,
    "chunk_index": 57,
    "word_count": 295,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Footnotes (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "(33.70) SMB 0.3819 0.3278 0.3372 (t-stat) (8.30) (7.39) (7.89) HML 0.0911 0.0547 0.0858 (t-stat) (2.03) (1.39) (2.09) MOM -0.1734 -0.1440 -0.1642 (t-stat) (-5.05) (-4.06) (-5.10) # of Obs 369,219 369,219 369,219 369,219 369,219 369,219 369,219 # of Months 71 71 71 71 71 71 71 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Footnotes",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 66,
    "chunk_index": 58,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Footnotes (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Table V Holdings-Based Calendar-Time Portfolios—Local - Remote on LHS Dependent variable is the monthly return of a long-short holdings-based calendar-time portfolio. The long-short portfolio is the return of locals stocks held by an investor in our sample minus the return of remote stocks held by the same investor ( R – R ). Local stocks are defined as being headquartered within a 250 miles local,i remote,i radius of an investor’s home. Remote stocks are defined as being headquartered outside a 250 miles radius of an investor’s home. The variable R is the value-weighted return of a passive zip code-level index. The variable z,i R* is the value-weighted return of a passive remote index and defined differently for each zip code. The m\\z “m\\z” portfolio contains all stocks in the market except those stocks headquartered within a 250 mile radius of a given zip code. The portfolios SMB, HML, and MOM are from Ken French’s website. T-statistics are based on Rogers standard errors (clustered by month) and are robust to heteroscedasticity. Panel A: Overview Statistics of Monthly Returns Mean (%) Stdev (%) R – R 0.1068 12.91 local,i remote,i R* 1.2478 2.84 m\\z R 1.3206 3.48 z,i R 0.3454 0.09 f Panel B: Regressions with R –R as the Dependent Variable local,i remote,i Reg 1 Reg 2 Reg 3 Alpha (bp) 10.68 5.26 0.85 (t-stat) (2.20) (1.21) (0.18) R – R* 0.7435 0.7431 z,i m\\z (t-stat) (24.51) (24.64) SMB 0.0375 (t-stat) (2.20) HML 0.0550 (t-stat) (3.13) MOM 0.0058 (t-stat) (0.38) # of Obs 647,899 647,899 647,899 # of Months 71 71 71 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Footnotes",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 66,
    "chunk_index": 59,
    "word_count": 266,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Footnotes (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Reg 3 Alpha (bp) 10.68 5.26 0.85 (t-stat) (2.20) (1.21) (0.18) R – R* 0.7435 0.7431 z,i m\\z (t-stat) (24.51) (24.64) SMB 0.0375 (t-stat) (2.20) HML 0.0550 (t-stat) (3.13) MOM 0.0058 (t-stat) (0.38) # of Obs 647,899 647,899 647,899 # of Months 71 71 71 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Footnotes",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 66,
    "chunk_index": 60,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Footnotes (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Table VI Transactions-Based Calendar-Time Portfolios Table shows average returns of transactions-based calendar-time portfolios. Portfolios are formed by mimicking the trades of all investors in our sample between 1991 and 1996. Stocks are held in a calendar-time portfolio for one year. For a given group of stocks, we form one calendar-time portfolio based on stocks bought (“Buys”) and another portfolio based on stocks sold (“Sells”). We show the difference of returns between the Buys and Sells portfolios (“Diff”) in both basis points per day and annualized in percentages. The “Alpha” reports the annualized constant from a regression of the Buys-minus-Sells portfolio returns on the market’s excess returns. Local stocks are defined as being headquartered within a 250 mile radius of an investor’s home. In Panels C and D, we consider whether or not a stock is part of the S&P500 Index. T-statistics are based on Newey-West standard errors with five lags and robust to heteroscedasticity and serial correlation of residuals. Panel A: All Stocks Average Returns (bp/Day) Annual Diff Alpha Buys Sells Diff % t-stat % t-stat All 6.083 6.889 -0.805 -2.01% -2.50 -2.16% -2.66 Panel B: Sorted by Location Average Returns (bp/Day) Annual Diff Alpha Buys Sells Diff % t-stat % t-stat Local 6.725 7.421 -0.696 -1.74% -1.81 -1.66% -1.69 Remote 6.072 6.878 -0.806 -2.01% -2.46 -2.25% -2.72 Panel C: S&P500 Stocks and Location Average Returns (bp/Day) Annual Diff Alpha Buys Sells Diff % t-stat % t-stat Local 7.260 7.638 -0.378 -0.95% -0.64 -0.87% -0.58 Remote 6.324 7.153 -0.829 -2.07% -1.67 -2.29% -1.83 Panel D: Non-S&P500 Stocks and Location Average Returns (bp/Day) Annual Diff Alpha Buys Sells Diff % t-stat % t-stat Local 6.313 7.215 -0.902 -2.25% -2.49 -2.11% -2.28 Remote 5.736 6.603 -0.867 -2.16% -2.83 -2.43% -3.20 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Footnotes",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 66,
    "chunk_index": 61,
    "word_count": 293,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Footnotes (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "-0.87% -0.58 Remote 6.324 7.153 -0.829 -2.07% -1.67 -2.29% -1.83 Panel D: Non-S&P500 Stocks and Location Average Returns (bp/Day) Annual Diff Alpha Buys Sells Diff % t-stat % t-stat Local 6.313 7.215 -0.902 -2.25% -2.49 -2.11% -2.28 Remote 5.736 6.603 -0.867 -2.16% -2.83 -2.43% -3.20 Electronic copy available at: https://ssrn.com/abstract=817504 Table VII Transactions-Based Calendar-Time Portfolios By Year This table expands the average daily calendar-time returns shown in Table VI, Panels A and B. We report the average return of the Buys-minus-Sells calendar-time portfolio in basis points per day. Average returns are calculated during each of six calendar years. Portfolios are formed based on mimicking the trades of all investors in our sample. Boldfaced numbers in the column labeled “All Years” match results shown Table VI, Panels A and B of this paper. The earlier table provides measures of statistical significance. All Buys-minus-Sells 1991 1992 1993 1994 1995 1996 Years All Stocks 0.663 -1.359 -1.793 -1.400 -0.629 0.165 -0.805 Local Stocks 1.379 -0.856 -1.649 -2.258 -0.003 -0.385 -0.696 Remote Stocks 0.483 -1.432 -1.757 -1.064 -0.865 0.278 -0.806 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Footnotes",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 66,
    "chunk_index": 62,
    "word_count": 181,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Footnotes (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "paper. The earlier table provides measures of statistical significance. All Buys-minus-Sells 1991 1992 1993 1994 1995 1996 Years All Stocks 0.663 -1.359 -1.793 -1.400 -0.629 0.165 -0.805 Local Stocks 1.379 -0.856 -1.649 -2.258 -0.003 -0.385 -0.696 Remote Stocks 0.483 -1.432 -1.757 -1.064 -0.865 0.278 -0.806 Electronic copy available at: https://ssrn.com/abstract=817504 for Individual Investors and Local Bias 30-November-2009 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 48,
    "page_range": "p.48-49",
    "total_pages": 66,
    "chunk_index": 63,
    "word_count": 62,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.48-49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "1992 1993 1994 1995 1996 Years All Stocks 0.663 -1.359 -1.793 -1.400 -0.629 0.165 -0.805 Local Stocks 1.379 -0.856 -1.649 -2.258 -0.003 -0.385 -0.696 Remote Stocks 0.483 -1.432 -1.757 -1.064 -0.865 0.278 -0.806 Electronic copy available at: https://ssrn.com/abstract=817504 for Individual Investors and Local Bias 30-November-2009 Electronic copy available at: https://ssrn.com/abstract=817504 Table 1 Alternative Measure of Information Asymmetries This table extends a definition used in Data section of the paper. We consider an alternative methodology for indentifying stocks with low levels of information asymmetries. We create a proxy variable using dollar trading volume, number of analysts, and inclusion in the S&P500 index. Our proxy has a 88% to 98% overlap with a method that identifies stocks based on S&P500 index inclusion alone. Step 1: Get stocks and data 2,346 Unique CUSIPs Stocks chosen with three criteria: i) Held or traded in our data ii) Dollar volume available iii) Number of analysts available 302 S&P500 D(S&P500) = 1 2,044 Non-S&P500 D(S&P500) = 0 Step 2: Calculate standardized measures of two variables (based on cross-sectional means and stdevs) ln(Volume$) mean[ln(Volume$)] Std[ln(Volume$)]  i i [ln(Volume$)] ln(NumAnalysts) mean[ln(NumAnalysts)] Std[ln(NumAnalysts)]  i i [ln(NumAnalysts)] Step 3: Create a proxy called “LowInfoAsym” indicating stocks with low levels of information asymmetries i Being classified as having low information asymmetries is more likely for stocks with high volume, many analysts, and in the S&P 500 index. LowInfoAsym StdlnVolume$ StdlnNumAnalysts DS&P500 i i i i Summary statistics for LowInfoAsym i Mean 0.56 10-ptile -1.81 Stdev 1.99 25-ptile -0.94 50-ptile +0.24 75-ptile +1.71 90-ptile +3.62 Step 4: Rank the 2,346 stocks by our proxy variable “LowInfoAsym” i Of the top 302 stocks 87.75% In S&P500 12.25% Non-S&P500 Of the bottom 2,044 stocks 1.81% In S&P500 98.19% Non-S&P500 2 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 49,
    "page_range": "p.49",
    "total_pages": 66,
    "chunk_index": 64,
    "word_count": 293,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "10-ptile -1.81 Stdev 1.99 25-ptile -0.94 50-ptile +0.24 75-ptile +1.71 90-ptile +3.62 Step 4: Rank the 2,346 stocks by our proxy variable “LowInfoAsym” i Of the top 302 stocks 87.75% In S&P500 12.25% Non-S&P500 Of the bottom 2,044 stocks 1.81% In S&P500 98.19% Non-S&P500 2 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 66,
    "chunk_index": 65,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Table 2 Local Bias in Holdings—100 miles, 100 km, and State-Level This table extends results shown in Table II of the main paper. We shows the degree to which households overweigh local stocks. We report averages across households. In Panel A, we calculate the fraction of each household’s portfolio invested within a 100 mile radius of the family home. Distance is measured from the household’s zip code to the zip code of the firm’s headquarters. For each household, we also calculate the fraction of the market (all stocks) within the same radii. In Panel B, we calculate the fraction of each household’s portfolio invested within a 100 km radius of the family home. In Panel C, we calculate the fraction of each household’s portfolio invested within an investor’s home state. In all three panels, the difference or ratio of Columns A and B represents a measure of local bias. Panel A: Local Bias Measure by 100 mile Radius Around Each Household’s Location (A) (B) Average % of Bias Measures Household’s Average Portfolio Portfolio % of Market Difference Ratio #1 Ratio #2 Date 100 miles 100 miles A - B A/B – 1 ln(A/B) Dec-1991 22.4 7.1 15.3 2.15 1.15 Dec-1992 21.6 6.9 14.7 2.13 1.14 Dec-1993 22.4 6.8 15.6 2.29 1.19 Dec-1994 22.0 7.0 15.0 2.14 1.15 Dec-1995 22.4 6.9 15.5 2.25 1.18 Panel B: Local Bias Measure by 100 km Radius Around Each Household’s Location (A) (B) Average % of Bias Measures Household’s Average Portfolio Portfolio % of Market Difference Ratio #1 Ratio #2 Date 100 km 100 km A - B A/B – 1 ln(A/B) Dec-1991 19.8 5.7 14.1 2.47 1.25 Dec-1992 19.0 5.6 13.4 2.39 1.22 Dec-1993 19.7 5.5 14.2 2.58 1.28 Dec-1994 19.5 5.6 13.9 2.48 1.25 Dec-1995 19.9 5.5 14.4 2.62 1.29 Panel C: Local Bias Measured by State (A) (B) Average % of Bias Measures Household’s Average Portfolio Portfolio % of Market Difference Ratio #1 Ratio #2 Date In-State In Same Area A - B A/B – 1 ln(A/B) Dec-1991 24.2 2.5 21.7 8.78 2.28 Dec-1992 24.1 2.4 21.7 8.97 2.30 Dec-1993 23.6 2.5 21.1 8.58 2.26 Dec-1994 23.4 2.6 20.8 7.98 2.19 Dec-1995 23.9 2.8 21.1 7.50 2.14 3 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 66,
    "chunk_index": 66,
    "word_count": 371,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Ratio #2 Date In-State In Same Area A - B A/B – 1 ln(A/B) Dec-1991 24.2 2.5 21.7 8.78 2.28 Dec-1992 24.1 2.4 21.7 8.97 2.30 Dec-1993 23.6 2.5 21.1 8.58 2.26 Dec-1994 23.4 2.6 20.8 7.98 2.19 Dec-1995 23.9 2.8 21.1 7.50 2.14 3 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 51,
    "page_range": "p.51",
    "total_pages": 66,
    "chunk_index": 67,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.51)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Table 3i Holdings-Based Calendar-Time Portfolios—100mi Radius This table extends results shown in Table III of the main paper. We report results from analysis of holdings- based calendar-time portfolios. Panel A shows overview statistics of monthly return variables. Panel B shows pooled regression results with R – R as the dependent variable R – R is the monthly excess return of an local,i f local,i f individual’s local holdings. Local stocks are defined as being headquartered within a 100 mile radius of an investor’s home. R is the riskfree return from Ken French’s website. R* – R is the value-weighted excess f m f market return for all stocks with zip-code information. R – R is the excess return of a passive, zip-code level z,i f index. T-statistics are based on Rogers standard errors (clustered by month) and are robust to heteroscedasticity. Panel A: Overview Statistics of Monthly Returns Mean (%) Stdev (%) R 1.4496 10.99 local,i R* 1.2528 2.88 m R 1.3570 3.59 z,i R 0.3462 0.09 f R – R 1.1034 10.99 local,i f R – R* 0.1968 10.52 local,i m R – R 0.0926 10.39 local,i z,i Panel B: Regressions with R – R as the Dependent Variable local,i f Reg 1 Reg 2 Reg 3 Reg 4 Reg 5 Reg 6 Reg 7 Alpha (bp) 110.34 9.58 8.93 7.24 8.49 14.25 8.49 (t-stat) (2.43) (0.41) (0.48) (0.37) (0.57) (1.20) (0.68) R* – R 1.1114 0.0835 1.1594 0.2383 m f (t-stat) (11.84) (0.68) (27.25) (5.08) R – R 1.0033 0.9451 1.0054 0.8484 z,i f (t-stat) (20.39) (15.34) (36.24) (24.99) SMB 0.5657 0.4574 0.4722 (t-stat) (8.03) (7.98) (8.26) HML 0.0870 0.0479 0.0778 (t-stat) (1.28) (0.98) (1.48) MOM -0.2371 -0.2094 -0.2301 (t-stat) (-4.80) (-5.25) (-5.99) # of Obs 728,262 728,262 728,262 728,262 728,262 728,262 728,262 # of Months 71 71 71 71 71 71 71 4 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 51,
    "page_range": "p.51",
    "total_pages": 66,
    "chunk_index": 68,
    "word_count": 311,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.51)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "SMB 0.5657 0.4574 0.4722 (t-stat) (8.03) (7.98) (8.26) HML 0.0870 0.0479 0.0778 (t-stat) (1.28) (0.98) (1.48) MOM -0.2371 -0.2094 -0.2301 (t-stat) (-4.80) (-5.25) (-5.99) # of Obs 728,262 728,262 728,262 728,262 728,262 728,262 728,262 # of Months 71 71 71 71 71 71 71 4 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 52,
    "page_range": "p.52",
    "total_pages": 66,
    "chunk_index": 69,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.52)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Table 3ii Holdings-Based Calendar-Time Portfolios—100km Radius This table extends results shown in Table III of the main paper. We report results from analysis of holdings- based calendar-time portfolios. Panel A shows overview statistics of monthly return variables. Panel B shows pooled regression results with R – R as the dependent variable. R – R is the monthly excess return of an local,i f local,i f individual’s local holdings. Local stocks are defined as being headquartered within a 100 km radius of an investor’s home. R is the riskfree return from Ken French’s website. R* – R is the value-weighted excess f m f market return for all stocks with zip-code information. R – R is the excess return of a passive, zip-code level z,i f index. T-statistics are based on Rogers standard errors (clustered by month) and are robust to heteroscedasticity. Panel A: Overview Statistics of Monthly Returns Mean (%) Stdev (%) R 1.4834 11.10 local,i R* 1.2529 2.88 m R 1.3617 3.60 z,i R 0.3462 0.09 f R – R 1.1362 11.10 local,i f R – R* 0.2295 10.63 local,i m R – R 0.1207 10.49 local,i z,i Panel B: Regressions with R – R as the Dependent Variable local,i f Reg 1 Reg 2 Reg 3 Reg 4 Reg 5 Reg 6 Reg 7 Alpha (bp) 113.62 11.88 10.48 9.03 10.07 15.37 9.78 (t-stat) (2.46) (0.48) (0.55) (0.45) (0.66) (1.29) (0.78) R* – R 1.1221 0.0717 1.1697 0.2303 m f (t-stat) (11.66) (0.58) (26.51) (4.90) R – R 1.0156 0.9659 1.0161 0.8648 z,i f (t-stat) (20.30) (15.38) (36.29) (24.87) SMB 0.5873 0.4747 0.4913 (t-stat) (8.03) (8.11) (8.34) HML 0.0906 0.0509 0.0803 (t-stat) (1.27) (1.01) (1.48) MOM -0.2368 -0.2094 -0.2295 (t-stat) (-4.66) (-5.18) (-5.89) # of Obs 650,512 650,512 650,512 650,512 650,512 650,512 650,512 # of Months 71 71 71 71 71 71 71 5 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 52,
    "page_range": "p.52",
    "total_pages": 66,
    "chunk_index": 70,
    "word_count": 311,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.52)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "SMB 0.5873 0.4747 0.4913 (t-stat) (8.03) (8.11) (8.34) HML 0.0906 0.0509 0.0803 (t-stat) (1.27) (1.01) (1.48) MOM -0.2368 -0.2094 -0.2295 (t-stat) (-4.66) (-5.18) (-5.89) # of Obs 650,512 650,512 650,512 650,512 650,512 650,512 650,512 # of Months 71 71 71 71 71 71 71 5 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 53,
    "page_range": "p.53",
    "total_pages": 66,
    "chunk_index": 71,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.53)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Table 4i Holdings-Based Calendar-Time Portfolios—Aggregated at the State Level This table extends results shown in Table IV of the main paper. We report results from analysis of holdings- based calendar-time portfolios. Panel A shows overview statistics of monthly return variables. Panel B shows pooled regression results with R – R as the dependent variable. R – R is the excess return of a portfolio local,s f local,s f that aggregates the local holdings of all investors living in a given state. Local stocks are defined as being headquartered within the same state as an investor’s home. R is the riskfree return from Ken French’s website. f R* – R is the value-weighted excess market return for all stocks with zip-code information. R – R is the m f s f excess return of a passive, state-level index. T-statistics are based on Rogers standard errors (clustered by month) and are robust to heteroscedasticity. Panel A: Overview Statistics of Monthly Returns Mean (%) Stdev (%) R 1.5270 5.88 local,s R* 1.3339 2.86 m R 1.3718 3.94 s R 0.3609 0.09 f R – R 1.1661 5.87 local,s f R – R* 0.1931 5.17 local,s m R – R 0.1552 4.34 local,s s Panel B: Regressions with R – R as the Dependent Variable local,s f Reg 1 Reg 2 Reg 3 Reg 4 Reg 5 Reg 6 Reg 7 Alpha (bp) 116.61 21.21 15.00 10.89 2.04 8.38 1.59 (t-stat) (3.17) (1.32) (1.50) (1.02) (0.19) (0.95) (0.18) R* – R 0.9806 0.0852 0.9997 0.1218 m f (t-stat) (22.95) (1.61) (29.47) (2.69) R – R 1.0051 0.9639 0.9887 0.9344 s f (t-stat) (39.70) (21.53) (38.36) (23.30) SMB 0.4171 0.2014 0.2151 (t-stat) (7.21) (3.46) (3.91) HML 0.1644 0.0479 0.0824 (t-stat) (3.07) (0.91) (1.64) MOM 0.0298 0.0277 0.0141 (t-stat) (0.68) (0.76) (0.40) # of Obs 3,190 3,190 3,190 3,190 3,190 3,190 3,190 # of Months 71 71 71 71 71 71 71 6 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 53,
    "page_range": "p.53",
    "total_pages": 66,
    "chunk_index": 72,
    "word_count": 322,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.53)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "SMB 0.4171 0.2014 0.2151 (t-stat) (7.21) (3.46) (3.91) HML 0.1644 0.0479 0.0824 (t-stat) (3.07) (0.91) (1.64) MOM 0.0298 0.0277 0.0141 (t-stat) (0.68) (0.76) (0.40) # of Obs 3,190 3,190 3,190 3,190 3,190 3,190 3,190 # of Months 71 71 71 71 71 71 71 6 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 54,
    "page_range": "p.54",
    "total_pages": 66,
    "chunk_index": 73,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.54)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Table 4ii Holdings-Based Calendar-Time Portfolios—20 Most Represented States This table extends results shown in Table IV of the main paper. We report results from analysis of holdings- based calendar-time portfolios. Panel A shows overview statistics of monthly return variables. Panel B shows pooled regression results with R – R as the dependent variable. R – R is the excess return of a portfolio local,s f local,s f that aggregates the local holdings of all investors living in a given state. Local stocks are defined as being headquartered within the same state as an investor’s home. R is the riskfree return from Ken French’s website. f R* – R is the value-weighted excess market return for all stocks with zip-code information. R – R is the m f s f excess return of a passive, state-level index. T-statistics are based on Rogers standard errors (clustered by month) and are robust to heteroscedasticity. Panel A: Overview Statistics of Monthly Returns Mean (%) Stdev (%) R 1.5056 4.20 local,s R* 1.3365 2.86 m R 1.4196 3.44 s R 0.3609 0.09 f R – R 1.1446 4.19 local,s f R – R* 0.1691 2.99 local,s m R – R 0.0860 2.42 local,s s Panel B: Regressions with R – R as the Dependent Variable local,s f Reg 1 Reg 2 Reg 3 Reg 4 Reg 5 Reg 6 Reg 7 Alpha (bp) 114.46 13.45 8.76 5.59 10.17 10.43 5.27 (t-stat) (3.05) (0.95) (0.80) (0.48) (0.97) (1.16) (0.56) R* – R 1.0355 0.1273 1.0367 0.1669 m f (t-stat) (26.94) (1.82) (26.58) (3.13) R – R 0.99.85 0.9112 0.9877 0.8792 s f (t-stat) (39.88) (18.09) (37.80) (21.67) SMB 0.3273 0.2355 0.2471 (t-stat) (5.37) (4.46) (5.03) HML 0.0409 0.0101 0.0358 (t-stat) (0.70) (0.21) (0.74) MOM -0.0509 -0.0588 -0.0696 (t-stat) (-1.33) (-1.45) (-1.91) # of Obs 1,420 1,420 1,420 1,420 1,420 1,420 1,420 # of Months 71 71 71 71 71 71 71 7 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 54,
    "page_range": "p.54",
    "total_pages": 66,
    "chunk_index": 74,
    "word_count": 321,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.54)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "SMB 0.3273 0.2355 0.2471 (t-stat) (5.37) (4.46) (5.03) HML 0.0409 0.0101 0.0358 (t-stat) (0.70) (0.21) (0.74) MOM -0.0509 -0.0588 -0.0696 (t-stat) (-1.33) (-1.45) (-1.91) # of Obs 1,420 1,420 1,420 1,420 1,420 1,420 1,420 # of Months 71 71 71 71 71 71 71 7 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 55,
    "page_range": "p.55",
    "total_pages": 66,
    "chunk_index": 75,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.55)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Table 4iii Holdings-Based Calendar-Time Portfolios—Variable Market Betas This table extends results shown in Table IV of the main paper. We report results from analysis of holdings- based calendar-time portfolios. Panel A shows overview statistics of monthly return variables. Panel B shows pooled regression results with R – R as the dependent variable. R – R is the excess return of portfolio local,s f local,s f that aggregates the local holdings of all investors living in a given state. Local stocks are defined as being headquartered within the same state as an investor’s home. R is the riskfree return from Ken French’s website. f R* – R is the value-weighted excess market return for all stocks with zip-code information. R – R is the m f s f excess return of a passive, state-level index. T-statistics are based on Rogers standard errors (clustered by month) and are robust to heteroscedasticity. Panel A: Overview Statistics of Monthly Returns Mean (%) Stdev (%) R 1.5270 5.88 local,s R* 1.3339 2.86 m R 1.3718 3.94 s R 0.3609 0.09 f R – R 1.1661 5.87 local,s f R – R* 0.1931 5.17 local,s m R – R 0.1552 4.34 local,s s Panel B: Regressions with R – R as the Dependent Variable local,s f Reg 1 Reg 2 Reg 3 Reg 4 Reg 5 Reg 6 Reg 7 Alpha (bp) 116.61 21.19 14.33 11.02 2.01 7.88 2.20 (t-stat) (3.17) (1.31) (1.50) (1.15) (0.18) (0.90) (0.26) R* – R Varied Varied Varied Varied m f (t-stat) Coefs Coefs Coefs Coefs R – R Varied Varied Varied Varied s f (t-stat) Coefs Coefs Coefs Coefs SMB 0.4174 0.1814 0.1860 (t-stat) (7.17) (3.20) (3.62) HML 0.1645 0.0495 0.0845 (t-stat) (3.05) (0.95) (1.70) MOM 0.0300 0.0259 0.0122 (t-stat) (0.68) (0.66) (0.34) # of Obs 3,190 3,190 3,190 3,190 3,190 3,190 3,190 # of Months 71 71 71 71 71 71 71 8 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 55,
    "page_range": "p.55",
    "total_pages": 66,
    "chunk_index": 76,
    "word_count": 319,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.55)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "SMB 0.4174 0.1814 0.1860 (t-stat) (7.17) (3.20) (3.62) HML 0.1645 0.0495 0.0845 (t-stat) (3.05) (0.95) (1.70) MOM 0.0300 0.0259 0.0122 (t-stat) (0.68) (0.66) (0.34) # of Obs 3,190 3,190 3,190 3,190 3,190 3,190 3,190 # of Months 71 71 71 71 71 71 71 8 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 56,
    "page_range": "p.56",
    "total_pages": 66,
    "chunk_index": 77,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.56)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Table 6i Transactions-Based Calendar-Time Portfolios—100 mile Radius This table extends results shown in Table VI of the main paper. We report average returns of transactions-based calendar-time portfolios. Portfolios are formed by mimicking the trades of all investors in our sample between 1991 and 1996. Stocks are held in a calendar-time portfolio for one year. For a given group of stocks, we form one calendar-time portfolio based on stocks bought (“Buys”) and another portfolio based on stocks sold (“Sells”). We show the difference of returns between the Buys and Sells portfolios (“Diff”) in both basis points per day and annualized in percentages. The “Alpha” reports the annualized constant from a regression of the Buys-minus-Sells portfolio returns on the market’s excess returns. Local stocks are defined as being headquartered within a 100 mile radius of an investor’s home. In Panels C and D, we consider whether or not a stock is part of the S&P500 Index. T-statistics are based on Newey-West standard errors with five lags and robust to heteroscedasticity and serial correlation of residuals. Panel A: All Stocks Average Returns (bp/Day) Annual Diff Alpha Buys Sells Diff % t-stat % t-stat All 6.083 6.889 -0.805 -2.01% -2.50 -2.16% -2.66 Panel B: Sorted by Location Average Returns (bp/Day) Annual Diff Alpha Buys Sells Diff % t-stat % t-stat Local 7.104 7.729 -0.625 -1.56% -1.50 -1.43% -1.35 Remote 6.064 6.874 -0.810 -2.02% -2.47 -2.25% -2.73 Panel C: S&P500 Stocks and Location Average Returns (bp/Day) Annual Diff Alpha Buys Sells Diff % t-stat % t-stat Local 7.472 7.849 -0.377 -0.95% -0.57 -0.85% -0.51 Remote 6.349 7.150 -0.801 -2.00% -1.63 -2.22% -1.77 Panel D: Non-S&P500 Stocks and Location Average Returns (bp/Day) Annual Diff Alpha Buys Sells Diff % t-stat % t-stat Local 6.981 7.769 -0.788 -1.97% -1.88 -1.76% -1.65 Remote 5.971 6.807 -0.836 -2.08% -2.79 -2.31% -3.09 9 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 56,
    "page_range": "p.56",
    "total_pages": 66,
    "chunk_index": 78,
    "word_count": 308,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.56)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "-0.51 Remote 6.349 7.150 -0.801 -2.00% -1.63 -2.22% -1.77 Panel D: Non-S&P500 Stocks and Location Average Returns (bp/Day) Annual Diff Alpha Buys Sells Diff % t-stat % t-stat Local 6.981 7.769 -0.788 -1.97% -1.88 -1.76% -1.65 Remote 5.971 6.807 -0.836 -2.08% -2.79 -2.31% -3.09 9 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 57,
    "page_range": "p.57",
    "total_pages": 66,
    "chunk_index": 79,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.57)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Table 6ii Transactions-Based Calendar-Time Portfolios—100 km Radius This table extends results shown in Table VI of the main paper. We report average returns of transactions-based calendar-time portfolios. Portfolios are formed by mimicking the trades of all investors in our sample between 1991 and 1996. Stocks are held in a calendar-time portfolio for one year. For a given group of stocks, we form one calendar-time portfolio based on stocks bought (“Buys”) and another portfolio based on stocks sold (“Sells”). We show the difference of returns between the Buys and Sells portfolios (“Diff”) in both basis points per day and annualized in percentages. The “Alpha” reports the annualized constant from a regression of the Buys-minus-Sells portfolio returns on the market’s excess returns. Local stocks are defined as being headquartered within a 100 km radius of an investor’s home. In Panels C and D, we consider whether or not a stock is part of the S&P500 Index. T-statistics are based on Newey-West standard errors with five lags and robust to heteroscedasticity and serial correlation of residuals. Panel A: All Stocks Average Returns (bp/Day) Annual Diff Alpha Buys Sells Diff % t-stat % t-stat All 6.083 6.889 -0.805 -2.01% -2.50 -2.16% -2.66 Panel B: Sorted by Location Average Returns (bp/Day) Annual Diff Alpha Buys Sells Diff % t-stat % t-stat Local 7.300 7.850 -0.550 -1.38% -1.29 -1.20% -1.11 Remote 6.055 6.872 -0.817 -2.04% -2.48 -2.27% -2.75 Panel C: S&P500 Stocks and Location Average Returns (bp/Day) Annual Diff Alpha Buys Sells Diff % t-stat % t-stat Local 7.606 7.893 -0.287 -0.72% -0.43 -0.60% -0.36 Remote 6.357 7.160 -0.803 -2.00% -1.62 -2.22% -1.77 Panel D: Non-S&P500 Stocks and Location Average Returns (bp/Day) Annual Diff Alpha Buys Sells Diff % t-stat % t-stat Local 7.208 7.941 -0.733 -1.83% -1.68 -1.58% -1.42 Remote 5.950 6.796 -0.846 -2.11% -2.82 -2.33% -3.13 10 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 57,
    "page_range": "p.57",
    "total_pages": 66,
    "chunk_index": 80,
    "word_count": 308,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.57)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "-0.36 Remote 6.357 7.160 -0.803 -2.00% -1.62 -2.22% -1.77 Panel D: Non-S&P500 Stocks and Location Average Returns (bp/Day) Annual Diff Alpha Buys Sells Diff % t-stat % t-stat Local 7.208 7.941 -0.733 -1.83% -1.68 -1.58% -1.42 Remote 5.950 6.796 -0.846 -2.11% -2.82 -2.33% -3.13 10 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 58,
    "page_range": "p.58",
    "total_pages": 66,
    "chunk_index": 81,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.58)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Table 6iii Transactions-Based Calendar-Time Portfolios—Equal Weighted (EW) This table extends results shown in Table VI of the main paper. We report average returns of equal-weighted transactions-based calendar-time portfolios. Portfolios are formed by mimicking the trades of all investors in our sample between 1991 and 1996. Stocks are held in a calendar-time portfolio for one year. For a given group of stocks, we form one calendar-time portfolio based on stocks bought (“Buys”) and another portfolio based on stocks sold (“Sells”). We show the difference of returns between the Buys and Sells portfolios (“Diff”) in both basis points per day and annualized in percentages. The “Alpha” reports the annualized constant from a regression of the Buys-minus-Sells portfolio returns on the market’s excess returns. Local stocks are defined as being headquartered within a 250 mile radius of an investor’s home. In Panels C and D, we consider whether or not a stock is part of the S&P500 Index. T-statistics are based on Newey-West standard errors with five lags and robust to heteroscedasticity and serial correlation of residuals. Panel A: All Stocks Average Returns (bp/Day) Annual Diff Alpha Buys Sells Diff % t-stat % t-stat All 6.393 7.145 -0.752 -1.88% -2.67 -1.87% -2.61 Panel B: Sorted by Location Average Returns (bp/Day) Annual Diff Alpha Buys Sells Diff % t-stat % t-stat Local 7.372 7.852 -0.480 -1.20% -1.28 -0.92% -0.98 Remote 6.209 6.979 -0.770 -1.92% -2.80 -1.97% -2.81 Panel C: S&P500 Stocks and Location Average Returns (bp/Day) Annual Diff Alpha Buys Sells Diff % t-stat % t-stat Local 7.265 7.401 -0.136 -0.34% -0.30 -0.29% -0.24 Remote 5.821 6.657 -0.836 -2.08% -2.12 -2.24% -2.22 Panel D: Non-S&P500 Stocks and Location Average Returns (bp/Day) Annual Diff Alpha Buys Sells Diff % t-stat % t-stat Local 7.503 8.320 -0.817 -2.04% -1.62 -1.52% -1.21 Remote 6.505 7.404 -0.899 -2.24% -2.39 -2.33% -2.45 11 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 58,
    "page_range": "p.58",
    "total_pages": 66,
    "chunk_index": 82,
    "word_count": 309,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.58)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "-0.24 Remote 5.821 6.657 -0.836 -2.08% -2.12 -2.24% -2.22 Panel D: Non-S&P500 Stocks and Location Average Returns (bp/Day) Annual Diff Alpha Buys Sells Diff % t-stat % t-stat Local 7.503 8.320 -0.817 -2.04% -1.62 -1.52% -1.21 Remote 6.505 7.404 -0.899 -2.24% -2.39 -2.33% -2.45 11 Electronic copy available at: https://ssrn.com/abstract=817504 Table 6A Transactions-Based Calendar-Time Portfolios—Expanded This table extends results shown in Table VI, Panel A of the main paper. We report the average daily returns of two calendar-time portfolios: Buys (using all stocks) and Sells (using all stocks). The Buy portfolio and the Sell portfolio are formed by mimicking the trades of all investors in our sample between 1991 and 1996. Positions are held for 3 months, 6 months, or 1 year. Panel B shows the average return of the difference of two calendar-time portfolios (Buys minus Sells). “Alpha” reports the constant from a regression of the Buys-minus- Sells portfolio returns on the market’s excess returns. Boldfaced numbers match results shown in Table VI, Panel A of the main paper. T-statistics are based on Newey-West standard errors with five lags and robust to heteroscedasticity and serial correlation of residuals. Panel A: Average Daily Return of Calendar-Time Portfolio (in Basis Points per Day) Holding Period Buys Sells 3 months 5.575 6.588 6 months 5.846 6.629 1 year 6.083 6.889 Panel B: Differences of Calendar-Time Portfolio Returns (Buys – Sells) Buys – Sells Holding Avg. Return Buys – Sells Alpha Alpha Period (b.p. per Day) Annualized t-stat (b.p. per Day) Annualized t-stat 3 months -1.013 -2.52% -2.10 -1.176 -2.92% -2.45 6 months -0.782 -1.95% -1.98 -0.903 -2.25% -2.27 1 year -0.805 -2.01% -2.50 -0.868 -2.16% -2.66 12 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 59,
    "page_range": "p.59",
    "total_pages": 66,
    "chunk_index": 83,
    "word_count": 280,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.59)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Sells Holding Avg. Return Buys – Sells Alpha Alpha Period (b.p. per Day) Annualized t-stat (b.p. per Day) Annualized t-stat 3 months -1.013 -2.52% -2.10 -1.176 -2.92% -2.45 6 months -0.782 -1.95% -1.98 -0.903 -2.25% -2.27 1 year -0.805 -2.01% -2.50 -0.868 -2.16% -2.66 12 Electronic copy available at: https://ssrn.com/abstract=817504 Table 6Bi Transactions-Based Calendar-Time Portfolios—Local Expanded This table extends results shown in Table VI, Panel B of the main paper. We report the average daily returns of two calendar-time portfolios: (Local Buys and Local Sells). Portfolios are formed based on mimicking the trades of all investors in our sample between January 1, 1991 and November 30, 1996. Positions are held for 3 months, 6 months, or 1 year. Panel B shows the average daily returns of the difference of two calendar-time portfolios (Local Buys minus Local Sells). “Alpha” reports the constant from a regression of the Buys-minus- Sells portfolio returns on the market’s excess returns. Boldfaced numbers match results shown in Table VI, Panel B of the main paper. T-statistics are based on Newey-West standard errors with five lags and robust to heteroscedasticity and serial correlation of residuals. Panel A: Average Daily Return of Calendar-Time Portfolio (in Basis Points per Day) Holding Period Buys Sells 3 months 6.508 6.972 6 months 6.697 7.156 1 year 6.725 7.421 Panel B: Differences of Calendar-Time Portfolio Returns (Buys – Sells) Buys – Sells Holding Avg. Return Buys – Sells Alpha Alpha Period (b.p. per Day) Annualized t-stat (b.p. per Day) Annualized t-stat 3 months -0.464 -1.16% -0.85 -0.537 -1.34% -0.97 6 months -0.459 -1.15% -0.99 -0.475 -1.19% -1.01 1 year -0.696 -1.74% -1.81 -0.663 -1.66% -1.69 13 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 60,
    "page_range": "p.60",
    "total_pages": 66,
    "chunk_index": 84,
    "word_count": 279,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.60)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Sells Holding Avg. Return Buys – Sells Alpha Alpha Period (b.p. per Day) Annualized t-stat (b.p. per Day) Annualized t-stat 3 months -0.464 -1.16% -0.85 -0.537 -1.34% -0.97 6 months -0.459 -1.15% -0.99 -0.475 -1.19% -1.01 1 year -0.696 -1.74% -1.81 -0.663 -1.66% -1.69 13 Electronic copy available at: https://ssrn.com/abstract=817504 Table 6Bii Transactions-Based Calendar-Time Portfolios—Remote Expanded This table extends results shown in Table VI, Panel B of the main paper. We report the average daily returns of two calendar-time portfolios: (Remote Buys and Remote Sells). Portfolios are formed based on mimicking the trades of all investors in our sample between January 1, 1991 and November 30, 1996. Positions are held for 3 months, 6 months, or 1 year. Panel B shows the average daily returns of the difference of two calendar-time portfolios (Remote Buys minus Remote Sells). “Alpha” reports the constant from a regression of the Buys- minus-Sells portfolio returns on the market’s excess returns. Boldfaced numbers match results shown in Table VI, Panel B of the main paper. T-statistics are based on Newey-West standard errors with five lags and robust to heteroscedasticity and serial correlation of residuals. Panel A: Average Daily Return of Calendar-Time Portfolio (in Basis Points per Day) Holding Period Buys Sells 3 months 5.282 6.380 6 months 5.687 6.534 1 year 6.072 6.878 Panel B: Differences of Calendar-Time Portfolio Returns (Buys – Sells) Buys – Sells Holding Avg. Return Buys – Sells Alpha Alpha Period (b.p. per Day) Annualized t-stat (b.p. per Day) Annualized t-stat 3 months -1.097 -2.73% -2.27 -1.282 -3.18% -2.67 6 months -0.847 -2.11% -2.11 -1.000 -2.49% -2.49 1 year -0.806 -2.01% -2.46 -0.902 -2.25% -2.72 14 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 61,
    "page_range": "p.61",
    "total_pages": 66,
    "chunk_index": 85,
    "word_count": 279,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.61)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Sells Holding Avg. Return Buys – Sells Alpha Alpha Period (b.p. per Day) Annualized t-stat (b.p. per Day) Annualized t-stat 3 months -1.097 -2.73% -2.27 -1.282 -3.18% -2.67 6 months -0.847 -2.11% -2.11 -1.000 -2.49% -2.49 1 year -0.806 -2.01% -2.46 -0.902 -2.25% -2.72 14 Electronic copy available at: https://ssrn.com/abstract=817504 Table 6Ci Transactions-Based Calendar-Time Portfolios—S&P500 Local Expanded This table extends results shown in Table VI, Panel C of the main paper. We only considers trades of S&P 500 stocks and reports the average daily returns of two calendar-time portfolios (Local Buys and Local Sells). Portfolios are formed based on mimicking the trades of all investors in our sample between January 1, 1991 and November 30, 1996. Positions are held for 3 months, 6 months, or 1 year. Panel B shows the average daily returns of the difference of two calendar-time portfolios (Local Buys minus Local Sells). “Alpha” reports the constant from a regression of the Buys-minus-Sells portfolio returns on the market’s excess returns. Boldfaced numbers match results shown in Table VI, Panel C of the main paper. T-statistics are based on Newey- West standard errors with five lags and robust to heteroscedasticity and serial correlation of residuals. Panel A: Average Daily Return of Calendar-Time Portfolio (in Basis Points per Day) Holding Period Buys Sells 3 months 7.098 7.045 6 months 7.351 7.055 1 year 7.260 7.638 Panel B: Differences of Calendar-Time Portfolio Returns (Buys – Sells) Buys – Sells Holding Avg. Return Buys – Sells Alpha Alpha Period (b.p. per Day) Annualized t-stat (b.p. per Day) Annualized t-stat 3 months 0.053 0.13% 0.06 -0.025 -0.06% -0.03 6 months 0.296 0.75% 0.41 0.253 0.64% 0.35 1 year -0.378 -0.95% -0.64 -0.347 -0.87% -0.58 15 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 62,
    "page_range": "p.62",
    "total_pages": 66,
    "chunk_index": 86,
    "word_count": 288,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.62)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Sells Holding Avg. Return Buys – Sells Alpha Alpha Period (b.p. per Day) Annualized t-stat (b.p. per Day) Annualized t-stat 3 months 0.053 0.13% 0.06 -0.025 -0.06% -0.03 6 months 0.296 0.75% 0.41 0.253 0.64% 0.35 1 year -0.378 -0.95% -0.64 -0.347 -0.87% -0.58 15 Electronic copy available at: https://ssrn.com/abstract=817504 Table 6Cii Transactions-Based Calendar-Time Portfolios—S&P500 Remote Expanded This table extends results shown in Table VI, Panel C of the main paper. We only considers trades of S&P 500 stocks and reports the average daily returns of two calendar-time portfolios (Remote Buys and Remote Sells). Portfolios are formed based on mimicking the trades of all investors in our sample between January 1, 1991 and November 30, 1996. Positions are held for 3 months, 6 months, or 1 year. Panels B shows the average daily returns of the difference of two calendar-time portfolios (Remote Buys minus Sells). “Alpha” reports the constant from a regression of the Buys-minus-Sells portfolio returns on the market’s excess returns. Boldfaced numbers match results shown in Table VI, Panel C of the main paper. T-statistics are based on Newey- West standard errors with five lags and robust to heteroscedasticity and serial correlation of residuals. Panel A: Average Daily Return of Calendar-Time Portfolio (in Basis Points per Day) Holding Period Buys Sells 3 months 6.068 6.641 6 months 6.273 6.616 1 year 6.324 7.153 Panel B: Differences of Calendar-Time Portfolio Returns (Buys – Sells) Buys – Sells Holding Avg. Return Buys – Sells Alpha Alpha Period (b.p. per Day) Annualized t-stat (b.p. per Day) Annualized t-stat 3 months -0.573 -1.43% -0.82 -0.746 -1.86% -1.06 6 months -0.343 -0.86% -0.56 -0.484 -1.21% -0.78 1 year -0.829 -2.07% -1.67 -0.921 -2.29% -1.83 16 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 63,
    "page_range": "p.63",
    "total_pages": 66,
    "chunk_index": 87,
    "word_count": 287,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.63)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Sells Holding Avg. Return Buys – Sells Alpha Alpha Period (b.p. per Day) Annualized t-stat (b.p. per Day) Annualized t-stat 3 months -0.573 -1.43% -0.82 -0.746 -1.86% -1.06 6 months -0.343 -0.86% -0.56 -0.484 -1.21% -0.78 1 year -0.829 -2.07% -1.67 -0.921 -2.29% -1.83 16 Electronic copy available at: https://ssrn.com/abstract=817504 Table 6Di Transactions-Based Calendar-Time Portfolios—Non-S&P500 Local Expanded This table extends results shown in Table VI, Panel D of the main paper. We only considers trades of non-S&P 500 stocks and reports the average daily returns of two calendar-time portfolios (local Buys and Sell). Portfolios are formed based on mimicking the trades of all investors in our sample between January 1, 1991 and November 30, 1996. Positions are held for 3 months, 6 months, or 1 year. Panel B shows the average daily returns of the difference of two calendar-time portfolios (local Buys minus Sells). “Alpha” reports the constant from a regression of the Buys-minus-Sells portfolio returns on the market’s excess returns. Boldfaced numbers match results shown in Table VI, Panel D of the main paper. T-statistics are based on Newey-West standard errors with five lags and robust to heteroscedasticity and serial correlation of residuals. Panel A: Average Daily Return of Calendar-Time Portfolio (in Basis Points per Day) Holding Period Buys Sells 3 months 6.499 7.176 6 months 6.343 7.187 1 year 6.313 7.215 Panel B: Differences of Calendar-Time Portfolio Returns (Buys – Sells) Buys – Sells Holding Avg. Return Buys – Sells Alpha Alpha Period (b.p. per Day) Annualized t-stat (b.p. per Day) Annualized t-stat 3 months -0.677 -1.69% -1.20 -0.733 -1.83% -1.30 6 months -0.844 -2.10% -1.85 -0.831 -2.07% -1.80 1 year -0.902 -2.25% -2.49 -0.846 -2.11% -2.28 17 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 64,
    "page_range": "p.64",
    "total_pages": 66,
    "chunk_index": 88,
    "word_count": 285,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.64)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Sells Holding Avg. Return Buys – Sells Alpha Alpha Period (b.p. per Day) Annualized t-stat (b.p. per Day) Annualized t-stat 3 months -0.677 -1.69% -1.20 -0.733 -1.83% -1.30 6 months -0.844 -2.10% -1.85 -0.831 -2.07% -1.80 1 year -0.902 -2.25% -2.49 -0.846 -2.11% -2.28 17 Electronic copy available at: https://ssrn.com/abstract=817504 Table 6Dii Transactions-Based Portfolios—Non-S&P500 Remote Expanded This table extends results shown in Table VI, Panel D of the main paper. We only considers trades of non-S&P 500 stocks and reports the average daily returns of two calendar-time portfolios (remote Buys and Sells). Portfolios are formed based on mimicking the trades of all investors in our sample between January 1, 1991 and November 30, 1996. Positions are held for 3 months, 6 months, or 1 year. Panels B shows the average daily returns of the difference of two calendar-time portfolios (remote Buys minus Sells). “Alpha” reports the constant from a regression of the Buys-minus-Sells portfolio returns on the market’s excess returns. Boldfaced numbers match results shown in Table VI, Panel D of the main paper. T-statistics are based on Newey- West standard errors with five lags and robust to heteroscedasticity and serial correlation of residuals. Panel A: Average Daily Return of Calendar-Time Portfolio (in Basis Points per Day) Holding Period Buys Sells 3 months 5.040 6.518 6 months 5.280 6.484 1 year 5.736 6.603 Panel B: Differences of Calendar-Time Portfolio Returns (Buys – Sells) Buys – Sells Holding Avg. Return Buys – Sells Alpha Alpha Period (b.p. per Day) Annualized t-stat (b.p. per Day) Annualized t-stat 3 months -1.478 -3.66% -2.96 -1.674 -4.13% -3.42 6 months -1.204 -2.99% -2.96 -1.375 -3.41% -3.43 1 year -0.867 -2.16% -2.83 -0.975 -2.43% -3.20 18 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 65,
    "page_range": "p.65",
    "total_pages": 66,
    "chunk_index": 89,
    "word_count": 285,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.65)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  },
  {
    "text": "Sells Holding Avg. Return Buys – Sells Alpha Alpha Period (b.p. per Day) Annualized t-stat (b.p. per Day) Annualized t-stat 3 months -1.478 -3.66% -2.96 -1.674 -4.13% -3.42 6 months -1.204 -2.99% -2.96 -1.375 -3.41% -3.43 1 year -0.867 -2.16% -2.83 -0.975 -2.43% -3.20 18 Electronic copy available at: https://ssrn.com/abstract=817504 Table 7 Transactions-Based Calendar-Time Portfolios—Expanded by Year This table extends results shown in Table VII of the main paper. We show the average return of the Buys- minus-Sells calendar time portfolio in basis points per day. Portfolios are formed based on mimicking the trades of all investors in our sample between 1991 and 1996. Boldfaced numbers match results shown in Table VII of the main paper. Panel A: All Stocks Holding All Period 1991 1992 1993 1994 1995 1996 Years 3 months 1.000 -2.736 -2.174 -0.961 -1.011 0.519 -1.013 6 months 0.888 -1.389 -1.729 -1.070 -0.819 -0.143 -0.782 1 year 0.663 -1.359 -1.793 -1.400 -0.629 0.165 -0.805 Panel B: Local Stocks Holding All Period 1991 1992 1993 1994 1995 1996 Years 3 months 1.459 -1.804 -1.322 -1.129 -0.101 0.724 -0.464 6 months 1.531 -0.652 -1.646 -1.246 -0.107 -0.263 -0.459 1 year 1.379 -0.856 -1.649 -2.258 -0.003 -0.385 -0.696 Panel C: Remote Stocks Holding All Period 1991 1992 1993 1994 1995 1996 Years 3 months 0.936 -2.516 -2.686 -0.809 -1.326 0.567 -1.097 6 months 0.742 -1.394 -1.896 -0.953 -1.013 -0.128 -0.847 1 year 0.483 -1.432 -1,757 -1.064 -0.865 0.278 -0.806 19 Electronic copy available at: https://ssrn.com/abstract=817504",
    "title": "Individual Investors and Local Bias",
    "source_type": "pdf",
    "document_id": "051c480d4944",
    "source_file": "Individual Investors and Local Bias.pdf",
    "section": "Internet Appendix",
    "page_number": 66,
    "page_range": "p.66",
    "total_pages": 66,
    "chunk_index": 90,
    "word_count": 245,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.66)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20091201140343+08'00'",
    "duration": null
  }
]