[
  {
    "text": "Informed Trading of Out-of-the-Money Options and * Market Efficiency Chang-Mo Kang(cid:132) Donghyun Kim(cid:133) Junyong Kim§ Geul Lee¶ Abstract We examine stock return predictability of “Out-of-The-Money (OTM) put-to-OTM call trading volume ratio” (OTMPC). Our numerical analysis predicts that, in the U.S. equity option market, informed investors hardly write OTM options because the leverage effect is not sufficient to compensate for transaction costs. OTMPC, thus, captures the informed investors’ OTM put purchase volume relative to their OTM call purchase volume. After controlling for the existing empirical proxies for informed op- tion trading, we find that OTMPC predicts future stock returns and corporate news. The return predictability offers implementable stock portfolio strategies. Our find- ings suggest that market inefficiency can emerge from uninformed investors’ limited knowledge about how transaction costs influence the trading strategies of informed investors. Keywords: Options, return predictability, trading volume. JEL classification: G11, G12, G13, G14. *This work was supported by the research fund of Hanyang University (HY- 202000000000515). We thank Kingsley Fong, Xing Han, Gi Ho Jeong, Jungmu Kim, Dong-Hoon Shin, Wing Wah Tham, Qinghai Wang, Pradeep Yadav, Wenrui Zhang and seminar participants at University of Wisconsin-Milwaukee, 2016 Optionmetrics Research Conference, 2016 Financial Research Network Annual Meeting, 2016 Conference on Asia-Pacific Financial Markets, 2016 Australasian Finance and Baking Conference, 2016 Auckland Finance Meeting,2016KoreaDerivativesAssociationAutumnMeeting,2016FinancialInformationSocietyofKorea Annual Meeting for valuable comments and suggestions. This paper supersedes the earlier versions entitled “Stock return predictability of out-of-the-money option trading” and “Market segmentation of stock and options.” (cid:132)Department of Finance, School of Business, Hanyang University, Seoul, South Korea, cmkang@hanyang.ac.kr, Phone: +82-2-2220-2587 (cid:133)Chung-Ang University, School of Business Administration, Email: donghyunkim@cau.ac.kr, Phone: +82-2-820-5657 §Lubar Business School, University of Wisconsin-Milwaukee, Email: junyong@uwm.edu ¶Coinplug Inc., Email: glee@coinplug.com, Phone: +82-10-4678-5582 1 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 51,
    "chunk_index": 0,
    "word_count": 286,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "“Market segmentation of stock and options.” (cid:132)Department of Finance, School of Business, Hanyang University, Seoul, South Korea, cmkang@hanyang.ac.kr, Phone: +82-2-2220-2587 (cid:133)Chung-Ang University, School of Business Administration, Email: donghyunkim@cau.ac.kr, Phone: +82-2-820-5657 §Lubar Business School, University of Wisconsin-Milwaukee, Email: junyong@uwm.edu ¶Coinplug Inc., Email: glee@coinplug.com, Phone: +82-10-4678-5582 1 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 51,
    "chunk_index": 1,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "1 Introduction The role of option contracts in financial market efficiency has been a long-standing issue in financial economics. Options can enhance the market efficiency by providing investors with more contingencies or by relaxing market frictions such as the leverage constraints of investors or the stock short-selling constraints (Black 1975, Ross 1976, Easley et al. 1998). Consistent with this insight, a number of empirical studies reported evidence of stock price discovery function of options markets.1 Some of these studies found that the information contained in option trading volume or implied volatilities is slowly incorporated into the underlying stock prices.2 In this paper, we develop a novel empirical measure that extracts information from publicly available option trading data and investigate the responsiveness of stock prices to the information. Our study innovates the literature by considering how the option market conditions, such as margin requirements and transaction costs (i.e., bid-ask spreads), affect the informed trading activities. Specifically, we show that more precise information can be obtained from the trading volume or the change in open interests of certain classes of options that require high margins and transaction costs. As it turns out, the information contained in our measure is not captured by the existing trading volume-based or price-based measures and, furthermore, is slowly diffused into the stock market. Our study thus extends the understanding of information diffusion between options and stock markets and provides novelevidencethatthemarketinefficiencycanemergefromtheuninformedinvestors’limited 1See, e.g., Manaster and Rendleman (1982), Vijh (1988), Anthony (1988), Conrad (1989), Stephan and Whaley (1990), Mayhew et al. (1995), Chan et al. (2002), Cao et al. (2005), Pan and Poteshman (2006), Johnson and So (2012), Muravyev (2016), Ge et al. (2016), and Patel et al. (2020) who studied the stock price discovery function of option markets. 2See, e.g., Cremers and Weinbaum (2010), Xing et al. (2010), Johnson and So (2012), and An et al. (2014). 2 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 51,
    "chunk_index": 2,
    "word_count": 315,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "Johnson and So (2012), Muravyev (2016), Ge et al. (2016), and Patel et al. (2020) who studied the stock price discovery function of option markets. 2See, e.g., Cremers and Weinbaum (2010), Xing et al. (2010), Johnson and So (2012), and An et al. (2014). 2 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 51,
    "chunk_index": 3,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "knowledge about how the market conditions influence the trading strategies of informed investors. Our methodology is built on the stylized fact that bid-ask spreads and margin require- ments vary with the moneyness of options. Specifically, previous studies reported that, in the US equity options market, investors are subject to higher bid-ask spreads and margin requirements for out-of-the-money (OTM) option trades than near-the-money (NTM) or in-the-money (ITM) option trades.3 Given these institutional features, cash-constrained in- formed investors who have private information about the fundamental value of underlying stock would trade OTM options only if the leverage effect of OTM option trading is suffi- ciently high to compensate for the transaction costs. Using a numerical analysis, we show that informed trades of OTM options are more skewed to long strategies than those of NTM or ITM options. While long OTM option strategies can provide sufficiently high returns to informed investors if they predict a large stock price change, short OTM option strategies yield lower returns net of transaction costs than other option trading strategies because the leverage effect for writing OTM options is curtailed by the higher margin requirements. The analysis results provide a number of testable hypotheses. First, our analysis sug- gests that “OTM put-to-call trading volume ratio (OTMPC vol)” captures the informed investors’ OTM put purchase volume relative to their OTM call purchase volume because the seller-initiated informed OTM option trading is unlikely to occur. We also complement OTMPC vol using the change in OTM options open interest. Specifically, while the trading volume may include liquidating trades that unwind existing positions, the increase in open interest corresponds to the increase in aggregate naked positions and, thus, may capture net 3See, e.g., Jameson and Wilhelm (1992), George and Longstaff (1993), and Chakravarty et al. (2004) for the relation between bid-ask spreads and option moneyness and Santa-Clara and Saretto (2009) for margin requirements of US option exchanges. 3 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 51,
    "chunk_index": 4,
    "word_count": 321,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "aggregate naked positions and, thus, may capture net 3See, e.g., Jameson and Wilhelm (1992), George and Longstaff (1993), and Chakravarty et al. (2004) for the relation between bid-ask spreads and option moneyness and Santa-Clara and Saretto (2009) for margin requirements of US option exchanges. 3 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 51,
    "chunk_index": 5,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "purchases of informed investors better. Motivated by this insight, we use “OTM Put-to-Call open interest increment ratio (OTMPC oi)” as an alternative proxy for the informed OTM option trades. Next, our analysis suggests that higher OTMPC ratios would predict lower stock returns if the information contained in OTM option trading is slowly diffused into the stock market. Finally, our analysis shows that, because of high transaction costs, the informed traders purchase OTM calls (resp. OTM puts) only if they predict a large increase (resp. decrease) in the future stock price. We, thus, hypothesize that higher (resp. lower) OTMPC ratios predict a price crash (resp. a price surge) of underlying stock. Before presenting the empirical findings, it is noteworthy that our study is novel in the large body of literature about multi-market information diffusion. Black (1975) provides insight that high leverage effect of long OTM option strategies induces informed investors to purchase OTM options prior to placing other option trades, but the subsequent empiri- cal studies find that informed traders are more likely to purchase NTM options because of transaction costs (e.g., Cao et al. 2005 and Augustin et al. 2017) and that they also write options (Pan and Poteshman 2006). By considering the interaction of transaction costs, margin requirements and leverage effect of option trading, we explain why attentive public investors can obtain more precise information from the trading volume or the open interest of OTM options though informed trading may occur more actively in NTM options markets. Specifically, our analysis shows that informed investors hardly write OTM options and pur- chase them only if they expect sufficiently large stock price changes. While the informed investors may trade NTM options more frequently, the lack of informed OTM option writing allows OTMPC ratios to capture the informed trading activities more precisely than the corresponding measures of NTM options. As a proxy for informed OTM option trading, OTMPC is likely to capture novel in- 4 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 51,
    "chunk_index": 6,
    "word_count": 328,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "NTM options more frequently, the lack of informed OTM option writing allows OTMPC ratios to capture the informed trading activities more precisely than the corresponding measures of NTM options. As a proxy for informed OTM option trading, OTMPC is likely to capture novel in- 4 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 51,
    "chunk_index": 7,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "formation relative to other option market measures proposed by previous studies. Most studies do not focus on the OTM option trading mainly because of relatively low trading volume. An exception is the work of Xing et al. (2010). They predict that investors may buy OTM puts after acquiring bad news about the underlying stock and that, as suggested by the demand-based option pricing model (Gaˆrleanu et al. 2008), the informed OTM put purchases may create the implied volatility smirk. Consistent with this prediction, they find that the smirk is negatively associated with future stock returns. Relative to their measure, OTMPC can provide novel information in three aspects: First, recent studies show that the return predictability of the implied volatility smirk is associated with the stock market liquidity shocks (Goncalves-Pinto et al. 2020) or the stock borrowing fees (Muravyev et al. 2018). By contrast, OTMPC is a trading volume-based measure and thus less likely to be influenced by these stock market factors. Furthermore, OTMPC can also capture the posi- tive information contained in OTM call trading. Finally, while the implied volatility smirk is negatively associated with the underlying stock return positive skewness, OTMPC does not haveamechanicalrelationshipwithit. Rather, wefindthatOTMPCishigherforovervalued lottery-like stocks (i.e., stocks with positively skewed returns), suggesting that it captures OTM put purchases of informed investors rather than skewness preference of uninformed investors. Using the U.S. equity options trading data, we first examine the stock return predictabil- ityofmonthlyOTMPCratiosandreportthreemainfindings. Tobeginwith,aftercontrolling for option trading volume-based and price-based measures proposed by previous studies, we findthathigherOTMPCratios, bothtradingvolumeratioandopeninterestincrementratio, predict lower stock returns in a monthly horizon. Consistent with our prediction, the put- to-call trading volume or open interest increment ratios of at-the-money (ATM) and ITM 5 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 51,
    "chunk_index": 8,
    "word_count": 285,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "predictabil- ityofmonthlyOTMPCratiosandreportthreemainfindings. Tobeginwith,aftercontrolling for option trading volume-based and price-based measures proposed by previous studies, we findthathigherOTMPCratios, bothtradingvolumeratioandopeninterestincrementratio, predict lower stock returns in a monthly horizon. Consistent with our prediction, the put- to-call trading volume or open interest increment ratios of at-the-money (ATM) and ITM 5 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 51,
    "chunk_index": 9,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "options do not exhibit significant return predictability. We further refine OTMPC ratios by excluding the trading volume and open interest changes of OTM options that fall into ATM or ITM by the end of the calendar month. Notice that the information contained in the purchases of these options has been substantially incorporated into the price within the trading calendar month. The refined OTMPC ratios exhibit stronger return predictabilities that remain statistically significant for two months. We also find that, as suggested by our numerical analysis, higher (resp. lower) OTMPC ratios predict the occurrence of a stock price crash (resp. surge) in the following month. The return predictability of monthly OTMPC ratios provides an implementable portfolio strategy. Anequalweightedlong-shortstrategythatbuysabottomdecileportfolioofrefined monthly OTMPC vol and short-sells a top decile portfolio offers 0.88% of monthly 4-factor alpha, equivalently, 10.6%annualalpha. Avalue-weightedlong-shortstrategyofbottomand top decile portfolios yields 0.75% of monthly alpha, equivalently, 9% annual alpha. Refined monthly OTMPC oi offers even more profitable portfolio strategies. A long-short strategy of equal-weighted (resp. value-weighted) bottom and top decile portfolios earn 0.90% (resp. 0.86%) of monthly alpha, equivalently, 10.8% (resp. 10.3%) annual alpha. Finally, we examine the presence of informed OTM option trading around two material corporate events, i.e., earnings announcements and M&A announcements, to understand the information contents of OTMPC ratios.4 Regarding earnings announcements, our monthly Fama and MacBeth (1973) regression shows that higher (resp. lower) OTMPC ratios in a month ahead of earning announcements predict a negative (resp. positive) earnings sur- prise. Regarding M&A announcements, we find that the OTMPC ratios of target firms are significantly lower than those of matched firms since four months ahead of the announce- 4The predictability of option order flow on these events were also examined by Cao et al. (2005) and Hu (2014). 6 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 51,
    "chunk_index": 10,
    "word_count": 296,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "we find that the OTMPC ratios of target firms are significantly lower than those of matched firms since four months ahead of the announce- 4The predictability of option order flow on these events were also examined by Cao et al. (2005) and Hu (2014). 6 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 51,
    "chunk_index": 11,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "ment month. The findings suggest that OTMPC rations indeed contain undisclosed material information about the firm value. This paper contributes to the literature of information diffusion between stock and option markets. A strand of literature has studied whether the information contained in publicly available option trading volume predicts the future stock returns. Using the signed option trading volume estimated by Lee and Ready (1991) algorithm, Cao et al. (2005) find signifi- cant stock return predictability around the takeover announcement period but not in normal times, and Pan and Poteshman (2006) find stock return predictability only for the following two trading days. Our paper shows that, by considering the moneyness of traded options, stronger and more persistent return predictability can be obtained from publicly observable unsigned option trading volume. Johnson and So (2012) show that a long-lived stock return predictability can be obtained by using stock and option trading volumes together. They find that the ratio of option trading volume to stock trading volume (O/S) is negatively associated with the weekly future stock returns. While they also use publicly observable trading volume data, our paper differs from their study in several aspects. First, the information contained in our option trading volume measure is not captured by their O/S measure. Furthermore, while their economic mechanism suggests that the return predictability of O/S measure arises from negative information about underlying stocks, we show that OTMPC contains both positive and negative information. Our study is also closely related to Augustin et al. (2017). They consider the effect of option transaction costs on the“bang-for-the-buck” strategy of informed investors and show that the investors are less likely to trade OTM options. While our study is also motivated by the same feature of option transaction costs, we focus on extracting information contained in 7 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 51,
    "chunk_index": 12,
    "word_count": 302,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "effect of option transaction costs on the“bang-for-the-buck” strategy of informed investors and show that the investors are less likely to trade OTM options. While our study is also motivated by the same feature of option transaction costs, we focus on extracting information contained in 7 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 51,
    "chunk_index": 13,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "option trading volume by considering the effect of transaction costs on both long and short option strategies.5 Finally, another strand of literature finds stock return predictability of option price-based measures (e.g., Cremers and Weinbaum 2010, Xing et al. 2010 and An et al. 2014). While these findings can be interpreted as evidence of slow information diffusion between option and stock markets, Goncalves-Pinto et al. (2020) and Muravyev et al. (2018) show that they can be also related to the stock market liquidity shocks to the stock borrowing fees. By using option trading volume, our study addresses this concern and provides convincing evidence of slow information diffusion between the two markets. The paper is organized as follows. Section 2 studies the effect of option transaction costs on trading strategies of informed investors and develops testing hypotheses. Section 3 de- scribesthedataandprovidessummarystatisticsofOTMPCandotherkeyvariables. Section 4 presents evidence of return predictability of OTMPC. Section 5 develops implementable portfolio strategies using the return predictability of OTMPC. Section 6 presents the results of robustness checks, and Section 7 concludes. 2 Hypothesis development: transaction costs and in- formed option trading In this section, we examine how the margin requirements and the transaction costs (i.e., bid- ask spreads) influence the option trading strategy of a cash-constrained informed investors who have private information about the fundamental value of underlying stock. As dis- 5In a recent study, Bernile et al. (2019) report that the trading volume-weighted strike-to-stock price ratio of options is positively associated with the future underlying stock returns. 8 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 51,
    "chunk_index": 14,
    "word_count": 255,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "a cash-constrained informed investors who have private information about the fundamental value of underlying stock. As dis- 5In a recent study, Bernile et al. (2019) report that the trading volume-weighted strike-to-stock price ratio of options is positively associated with the future underlying stock returns. 8 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 51,
    "chunk_index": 15,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "cussed below, our analysis proposes a novel empirical measure that captures the information contained in option trading activities. Specifically, we focus on the informed trading of OTM options. Previous studies report that both margin requirements and bid-ask spreads increase with the out-of-the-moneyness of options in the U.S. equity option markets. Jameson and Wilhelm (1992), George and Longstaff (1993), and Chakravarty et al. (2004) report that bid-ask spreads of OTM options tend to be wider than those of NTM or ITM options. Regarding the margin requirement of US option exchanges, Santa-Clara and Saretto (2009) report that OTM option writers are required to maintain higher margins than NTM or ITM option writers. A cash-constrained informed investors would trade OTM options only if the leverage effect of OTM option trading is sufficiently high to compensate for the transaction costs. We predict that informed traders of OTM options are more skewed to buyers relative to sellers than those of NTM or ITM options. That is, the informed investors who predict a stock price increase (resp. decrease) rarely write OTM puts (resp. OTM calls). Informed investors may buy OTM options if they predict a large change in stock prices because the leverage effect of long option strategies tends to increase with the out-of-the-moneyness of options. On the other hand, the higher margin requirements for OTM options curtail the leverage effect of writing OTM options and, thus, make the informed investors favor to write NTM or ITM options. We illustrate our intuition using a simple numerical analysis. Consider a market in which European options are traded with bid-ask spreads. For the sake of simplicity, we assume that the mid-point option price is determined by the Black-Scholes pricing formula: for an underlying stock price S, a risk-free rate r, and a stock return volatility σ, a strike price K 9 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 51,
    "chunk_index": 16,
    "word_count": 308,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "are traded with bid-ask spreads. For the sake of simplicity, we assume that the mid-point option price is determined by the Black-Scholes pricing formula: for an underlying stock price S, a risk-free rate r, and a stock return volatility σ, a strike price K 9 Electronic copy available at: https://ssrn.com/abstract=2803724 and a time-to-maturity t, call and put options are priced as: C(K,t;r,σ,S) = SN(d )−Ke−rtN(d ) (1) 1 2 P(K,t;r,σ,S) = Ke−rt −S +C(K,t;r,σ,S), (2) respectively, where N(.) is the c.d.f. of standard normal distribution, 1 (cid:20) (cid:18) S (cid:19) (cid:18) σ2(cid:19) (cid:21) √ d = √ ln + r+ t and d = d −σ t. 1 2 1 σ t K 2 We model the bid-ask spread b as a function of Black-Scholes option price X and the underlying stock price S. Specifically, we set the spread as b = max(exp(−2.17+0.47logX +0.0175logS),0.01), (3) where the coefficients of exponential function are estimated using the US equity option trading data described in Section 3. The minimum spread 0.01, which corresponds to one percentile of the US equity option sample spreads, is set to exclude extremely illiquid deep OTM options from our analysis. Our spread function features that OTM option trading is subject to higher bid-ask spreads than NTM or ITM option trading. For the option writers, we consider the margin µ required by Chicago Board Option Exchange (CBOE):    max(P +0.2S −1 K<S (S −K),P +0.1K) for puts µ = (4)   max(C +0.2S −1 S<K (K −S),C +0.1S) for calls, 10 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 51,
    "chunk_index": 17,
    "word_count": 260,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "option trading. For the option writers, we consider the margin µ required by Chicago Board Option Exchange (CBOE):    max(P +0.2S −1 K<S (S −K),P +0.1K) for puts µ = (4)   max(C +0.2S −1 S<K (K −S),C +0.1S) for calls, 10 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 51,
    "chunk_index": 18,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "where 1 (resp. 1 ) is an indicator function that assigns one if K < S (resp. S < K) K<S S<K and zero, otherwise. Notice that, while the required margin decreases with the out-of-the- moneyness of options, the slope is kinked and becomes flatter for deep OTM options. Given the option prices, bid-ask spreads and margin requirements, we solve for the ex- pected option trading profits of a cash-constrained informed investor. Without loss of gener- ality, wefocusonthecaseinwhichtheinvestorhaspositiveinformationabouttheunderlying stock price. Specifically, the investor receives a private signal indicating that the fair under- lying stock price is the current price S with probability 1−p, or (1+∆)S with probability p, where ∆ > 0. For the sake of simplicity, we assume that the fair stock price is dis- closed to the market instantaneously and, thus, the investor does not delay trades.6 Under this assumption, the investor’s expected return from buying a call with strike price K and time-to-maturity t can be written as: (cid:18) pmax(Ch −0.5bh,0)+(1−p)max(C0 −0.5b0,0) (cid:19) Π (K,t;r,σ,S) = max C C −1,0 , (5) C C0 +0.5b0 c where Ch = C(K,t;r,σ,(1+∆)S) is the call price when the underlying stock price increases to (1+∆)S, C0 = C(K,t;r,σ,S) is the call price when the underlying stock price does not change, and bh and b0 are the size of call bid-ask spread in each state, respectively. The C C investor’s expected return from writing a put with strike price K and time-to-maturity t can be written as: (cid:18) (P0 −0.5b0)−p(Ph +0.5bh)−(1−p)(P0 +0.5b0) (cid:19) Π (K,t;r,σ,S) = max P P P ,0 , (6) P µ(P0,S)−P0 6Our analysis does not consider the uncertainty in the timing of information disclosure. See Augustin et al. (2017) who examine the effect of this uncertainty on the optimal option purchase strategy of informed investors. 11 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 51,
    "chunk_index": 19,
    "word_count": 304,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "= max P P P ,0 , (6) P µ(P0,S)−P0 6Our analysis does not consider the uncertainty in the timing of information disclosure. See Augustin et al. (2017) who examine the effect of this uncertainty on the optimal option purchase strategy of informed investors. 11 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 51,
    "chunk_index": 20,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "where Ph = P(K,t;r,σ,(1+∆)S) is the put price when the underlying stock price increases, P0 = P(K,t;r,σ,S) is the put price when the underlying stock price does not change, µ(P0,S) is the margin required for writing a put, and bh and b0 are bid-ask spreads in each P P state, respectively. Note that the denominator µ(P0,S)−P0 corresponds to the amount of cash that the investor should deposit as the initial margin for writing puts. Before discussing the effect of bid-ask spreads and margin constraints on the profitabil- ity of informed option trading strategies, it is noteworthy that, in the absence of margin requirement (i.e., µ(P0,S) = P0) and bid-ask spreads, informed investors can relax their cash constraint and lever up their investments unlimitedly by writing options. This observa- tion suggests that, given sufficiently low margin requirements, writing options can be more profitable than buying them to cash-constrained informed investors. Figure 1 illustrates how the profits of informed option trading strategies are influenced by margin requirements and bid-ask spreads. Panels (a)–(c) show how the expected returns of informed option trading strategies change with the out-of-the-moneyness, i.e., K for calls S and S for puts. In all numerical analysis, we set the parameter values to S = 30, σ = 0.4, K r = 0.03, t = 20/250, ∆ = 0.05 and p = 0.3.7 Panel (a) presents how the expected returns from buying calls and those from writing puts change with the moneyness when bid-ask spreads (resp. margin requirements) are set to zero (resp. 10% of Black-Scholes put price P0). The expected returns of both long and short strategies increase with the out-of- the-moneyness of call options, implying that the leverage effect of informed option trading strategies is positively associated with the out-of-the-moneyness. Furthermore, short option strategies yield higher returns than long strategies because of low margin requirements. Panel (b) considers the CBOE margin requirement and zero bid-ask spreads. Relative to 7We execute the analysis with many other parameter values and find qualitatively consistent results. Other analysis results are available on request. 12 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 51,
    "chunk_index": 21,
    "word_count": 347,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "higher returns than long strategies because of low margin requirements. Panel (b) considers the CBOE margin requirement and zero bid-ask spreads. Relative to 7We execute the analysis with many other parameter values and find qualitatively consistent results. Other analysis results are available on request. 12 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 51,
    "chunk_index": 22,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "Panel (a), the expected return of short strategy decreases with the out-of-the-moneyness of putoptions, implyingthattheCBOEmarginrequirementisdisadvantageoustoOTMoption writers. Panel (c) presents the results of a numerical analysis where the bid-ask spreads are set to b as in (3). Compared with Panel (b), it shows that the spreads substantially reduce the expected return from buying or writing OTM options. Given the expected large change in stock price (∆ = 0.05), buying OTM calls (e.g., the calls with K ∈ [1.05,1.1]) still yields S higher expected returns than buying NTM calls, but writing puts with the corresponding out-of-the-moneyness is not profitable. Panel (d) presents how the optimal out-of-moneynesses of calls and puts for informed in- vestors (i.e., the options that yield highest expected returns from informed trading) change with ∆. All other parameter values including the bid-ask spreads and the margin require- ments are set to the same as those in Panel (c). Informed investors can obtain higher returns from buying OTM calls than buying NTM calls when they expect a large increase in the stock price. Writing OTM puts, on the other hand, underperforms writing NTM puts for all parameter ranges of ∆ ∈ [0.03,0.1]. Figure 1 echoes our intuition. While the transaction costs substantially reduce the ex- pected returns from informed OTM option trading, informed investors may still buy OTM options to employ the leverage effect if they anticipate a large change in the stock price. The investors are unlikely to write OTM options because the leverage effect curtailed by higher margin requirements is not sufficient to compensate for the transaction costs. Our analysis provides a number of testable predictions: First, since informed traders of OTM options are more likely to be skewed to buyers, we predict that higher (resp. lower) OTM puts trading volume relative to OTM calls trading volume contains negative (reps. positive) information about the underlying stock price, in particular, about a large decrease 13 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 51,
    "chunk_index": 23,
    "word_count": 321,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "traders of OTM options are more likely to be skewed to buyers, we predict that higher (resp. lower) OTM puts trading volume relative to OTM calls trading volume contains negative (reps. positive) information about the underlying stock price, in particular, about a large decrease 13 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 51,
    "chunk_index": 24,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "(resp. increase) in the stock price. As a proxy for informed OTM option trading activities, however, the OTM puts-to-call trading volume ratio may be noisy partly because trading volume includes liquidating trades that unwind existing positions. To filter out the liquidat- ing trades, we also consider the increase in open interest of OTM options that capture the informed investors’ net purchase of OTM options better. Our analysis suggests that larger (resp. smaller) increase in OTM puts open interest relative to OTM calls open interest includes negative (resp. positive) information about the underlying stock price. Next, iftheinformationcontainedinOTMoptiontradingactivitiesisslowlydiffusedinto the stock market, the OTM put-to-call trading volume ratio or open interest increment ratio can predict the future stock returns, in particular, a large change in stock prices because informed investors would buy OTM calls (resp. puts) only if they predict a large increase (resp. decrease) in underlying stock prices. In sum: Hypothesis. Consider OTM put-to-call (OTMPC) trading volume ratio and open interest increment ratio. 1. Higher OTMPC ratios precede a negative news about the underlying stock. 2. Higher OTMPC ratios predict lower stock returns if the information is slowly diffused into the stock market. 3. The return predictability of OTMPC ratios, if any, is more pronounced for a large change in the future stock price. Before taking the predictions to data, it is worthwhile to discuss the novelty of our analysis relative to the previous studies. The analysis of Black (1975) provides insight that, in the absence of transaction costs, high leverage effect of long OTM option strategies 14 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 51,
    "chunk_index": 25,
    "word_count": 261,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "price. Before taking the predictions to data, it is worthwhile to discuss the novelty of our analysis relative to the previous studies. The analysis of Black (1975) provides insight that, in the absence of transaction costs, high leverage effect of long OTM option strategies 14 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 51,
    "chunk_index": 26,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "induces informed investors to purchase OTM options prior to placing other option trades. Empirical studies, however, find that informed investors are more likely to buy NTM options than OTM options (e.g., Cao et al. 2005 and Augustin et al. 2017) and also write options (Pan and Poteshman 2006). By considering transaction costs, margin requirements and the leverage effect of option trading in tandem, our analysis shows that informed investors hardly write OTM options and purchase them only if they expect sufficiently large stock pricechanges. Notably,wedonotpredictthatinformedtradingoccursmostfrequentlyinthe OTM option market because informed investors would trade NTM options if they anticipate a small change in the stock price. While informed trading of NTM options may occur more frequently, the lack of informed OTM option writing makes OTMPC ratios capture the informed trading activities more precisely than the corresponding ratios of NTM options which may include both informed purchases and sales. 3 Data and variables We use five datasets in this study. From the IvyDB OptionMetrics database, we collect information about individual equity options such as maturity date, strike price, daily closing quotes, trading volume, implied volatility and option delta. The number of shares outstand- ing, daily stock price, and stock trading volume are obtained from the Center for Research in Security Prices (CRSP) database, and financial/accounting information from the Com- pustat database. Finally, we retrieve information about takeover announcements from the SDC Platinum Financial Securities database and analyst earnings forecast from the Thom- son Reuters I/B/E/S. All variables are described in Appendix. Our sample period spans from 1996 to 2015. 15 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 51,
    "chunk_index": 27,
    "word_count": 263,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "information from the Com- pustat database. Finally, we retrieve information about takeover announcements from the SDC Platinum Financial Securities database and analyst earnings forecast from the Thom- son Reuters I/B/E/S. All variables are described in Appendix. Our sample period spans from 1996 to 2015. 15 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 51,
    "chunk_index": 28,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "Following Johnson and So (2012), we employ the following data filters to reduce the measurement error associated with illiquidity of option markets: first, for each trading date, we include only option contracts that do not expire within the calendar month and that have an absolute delta between 0.02 and 0.98; then, we exclude the firm-months in which less than 50 call and 50 put contracts are traded, or in which the close stock price goes below five dollars. Our final sample for the main analysis consists of 356,541 firm-months for 5,226 unique firms.8 Relative to the CRSP universe, our sample stocks are larger and more glamorous over the sample period mainly because we filter out penny stocks and the stocks with illiquid options.9 AsdiscussedinSection2, ourkeyexplanatoryvariablesareOTMPut-to-Calltradingvol- ume ratio (OTMPC vol) and open interest increment ratio (OTMPC oi). Following Bollen and Whaley (2004) and Ge et al. (2016), we define OTM options with respect to the option delta. Specifically, we classify a call option as OTM if 0.02 < option delta ≤ 0.375, and a put option as OTM if −0.375 < option delta ≤ −0.02. Formally, we construct monthly OTMPC vol as follows: for each option contract of stock i and month t, we first compute the sum of daily trading volume when it was OTM during the month. We then compute the monthly OTMPC vol of stock i in month t using the OTM options at the last trading day of month t as follows: Sum of OTM trading volume of puts OTMPC vol = . (7) i,t Sum of OTM trading volume of all options Likewise, wecalculateOTMPC oiasfollows: foreachoptioncontractk ofstockiandmonth i 8The sample size varies across analyses, depending on the availability of control variables. Tables report the number of observations used in each analysis. 9Table OA1 in Online Appendix describes the market capitalization and the book-to-market value ratio of our sample and CRSP universe each year. 16 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 51,
    "chunk_index": 29,
    "word_count": 323,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "sample size varies across analyses, depending on the availability of control variables. Tables report the number of observations used in each analysis. 9Table OA1 in Online Appendix describes the market capitalization and the book-to-market value ratio of our sample and CRSP universe each year. 16 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 51,
    "chunk_index": 30,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "t, we first compute the sum of daily changes in open interest when it was OTM during the month, denoted as (∆OTM open interest) . We then compute a net “increase” in open in- ki,t terestofeachcontractasOTM,i.e.,(∆ OTM open interest) ≡ max(0,(∆OTM open interest) ). + ki,t ki,t Finally, we compute the monthly OTMPC open interest increment ratio using the OTM op- tions at the last trading day of month t as follows: Sum of ∆ OTM open interest of puts + OTMPC oi = . (8) i,t Sum of ∆ OTM open interest of all options + We also consider refined measures of monthly OTMPC ratios, denoted as rOTMPC vol and rOTMPC oi, which exclude the trading volume and the open interest increment of OTM options that fall into NTM or ITM on the last trading day of each month, respectively. Notice that the information contained in the purchases of these OTM options has already beenincorporatedintothestockpricesubstantiallybytheendofthetradingcalendarmonth. Table 1 presents the summary statistics of OTMPC ratios and their refined measures. Panel A shows that the refined measures are on average less than 0.5 but greater than the corresponding OTMPC ratio, implying that OTM calls are more actively traded and also more likely to be in-the-money within the calendar month than OTM puts. Figure 2 presents the cross-sectional cumulative distribution of OTMPC ratios. OTMPC ratios are fairly uniformly distributed, although it exhibits fat tails and negative skewness. Top and bottom decile ratios of OTMPC vol are around 0.11 and 0.80, respectively, while the median ratio is 0.44. For OTMPC oi, top and bottom decile ratios are around 0.08 and 0.85, respectively, and the median ratio is 0.46. The refined measures are more evenly distributed than the corresponding OTMPC ratios. Panel A of Table 1 also presents the persistence of OTMPC ratios, measured by the time- 17 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 51,
    "chunk_index": 31,
    "word_count": 309,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "and bottom decile ratios are around 0.08 and 0.85, respectively, and the median ratio is 0.46. The refined measures are more evenly distributed than the corresponding OTMPC ratios. Panel A of Table 1 also presents the persistence of OTMPC ratios, measured by the time- 17 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 51,
    "chunk_index": 32,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "series average of cross-sectional Pearson product-moment correlation between month t and t+τ. Bothratiosexhibiteconomicallyweakpersistence: thecorrelationofOTMPC vol(resp. OTMPC oi) values 0.30 (resp. 0.21) at one-month lag and decays to 0.12 (resp. 0.10) at twelve-month lag. The persistence of refined measures are even weaker. The low persistence of OTMPC ratios also indicate lower correlation between these measures and time-invariant firm characteristics. To further examine the persistence of OTMPC ratios, we sort firms into deciles on a monthly basis based on OTMPC ratios and measure the fraction of firms that remain in each decile portfolio over the following months. Panel B reports that, for both OTMPC ratios, extreme decile portfolios exhibit more persistence than other deciles. Around 30% of firms in top and bottom deciles of OTMPC vol remain in the same decile in the next month while only 14–18% of firms do so in other deciles. The decile portfolios of refined measures exhibit similar patterns though the transition probabilities are higher than the corresponding OTMPC ratio. Finally, we examine whether and how OTMPC ratios are associated with the following variablesproposedbypreviousstudiesasproxiesforinformedoptiontrading: (i)OS decile— options to stock trading volume ratio (Johnson and So 2012), (ii) ∆CVOL and ∆PVOL— changes in implied volatilities of ATM calls and ATM puts, respectively (An et al. 2014), (iii) Skew—the difference between implied volatilities of OTM puts and ATM calls (Xing et al. 2010), (iv) VS—the aggregated difference between implied volatilities of calls and puts with the same maturity and strike price (Bali and Hovakimian 2009 and Cremers and Weinbaum 2010), and (v) Short interest—stock short interest rate (Diether et al. 2009).10 Panel C presents the correlation between OTMPC ratios and existing informed option trading measures. Both OTMPC ratios and the refined measures exhibit moderate positive 10More details about variable construction are provided in Appendix. 18 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 51,
    "chunk_index": 33,
    "word_count": 301,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "and (v) Short interest—stock short interest rate (Diether et al. 2009).10 Panel C presents the correlation between OTMPC ratios and existing informed option trading measures. Both OTMPC ratios and the refined measures exhibit moderate positive 10More details about variable construction are provided in Appendix. 18 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 51,
    "chunk_index": 34,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "correlations with OS decile and Short interest. Given that stock short-selling constraints allow OS decile to capture the informed put purchases (Johnson and So 2012 and Ge et al. 2016), the positive correlations suggests that OTMPC ratios may capture the negative infor- mationcontainedinOSdeciles. Asshownbelow, however, OTMPCratiosinnovatethesetwo measures by extracting positive information contained in option trading as well. Regarding option price-based measures, OTMPC ratios are not significantly correlated with ∆CVOL and ∆PVOL but negatively associated with Skew and VS. To control for the correlations between these measures, we also run Fama and MacBeth (1973) regression of OTMPC ra- tios on all informed option trading measures. Table A2 in Appendix shows that OTMPC ratios are significantly associated with contemporaneous informed option trading measures, suggesting that OTMPC ratios may capture the information contained in these price-based measures. In our analysis below, we control for all existing informed option trading measures to identify the information exclusively captured by OTMPC ratios. Notably, the negative correlation between OTMPC ratios and Skew is at odds given that Skew captures negative information contained in OTM put trading (Xing et al. 2010). One possible explanation is that Skew is negatively associated with the stock return skewness. Consistent with this prediction, Table A3 in Appendix shows that lottery-like stocks, which have positively skewed returns, exhibit lower Skew but higher OTMPC. The positive cor- relation between OTMPC and stock return skewness suggests that informed investors may purchase OTM puts of overvalued lottery-like stocks.11 11See Kumar (2009) who reports the underperformance of lottery-like stock portfolio. 19 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 51,
    "chunk_index": 35,
    "word_count": 259,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "which have positively skewed returns, exhibit lower Skew but higher OTMPC. The positive cor- relation between OTMPC and stock return skewness suggests that informed investors may purchase OTM puts of overvalued lottery-like stocks.11 11See Kumar (2009) who reports the underperformance of lottery-like stock portfolio. 19 Electronic copy available at: https://ssrn.com/abstract=2803724 4 Stock return predictability of OTMPC ratios In this section, we test the stock return predictability of OTMPC ratios. As discussed in Section 2, we hypothesize that higher OTMPC ratios predict lower stock returns and, in particular, indicate stronger (resp. weaker) likelihood of the future stock price crash (resp. surge). We first examine the stock return predictability of OTMPC ratios in monthly horizons and then investigate their predictability for large stock price changes. 4.1 Monthly stock return predictability We first test the stock return predictability of monthly OTMPC ratios by estimating the following Fama and MacBeth (1973) regression models: for each stock i, month t, and lag length τ, r =α+β ·(OTMPC ratio) +(Controls) ·Γ +ε , (9) i,t+τ i,t i,t+τ−1 i,t+τ where r is the monthly return of stock i on month t + τ. We control for the exist- i,t+τ ing informed option trading measures described in Section 3 and the stock characteristics including log market capitalization, book-to-market ratio, Amihud (2002) illiquidity mea- sure, momentum (past six-month stock returns), and short-term reversal (one-month lagged return).12 Table 2 reports the estimation results at one-month lag (τ = 1). Columns (1) shows that, after controlling for the stock characteristics and other informed option trading measures, higher OTMPC vol predicts lower stock returns. Specifically, one standard deviation de- 12We run the regression with different combinations of control variables and find qualitatively consistent results. 20 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 51,
    "chunk_index": 36,
    "word_count": 288,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "1). Columns (1) shows that, after controlling for the stock characteristics and other informed option trading measures, higher OTMPC vol predicts lower stock returns. Specifically, one standard deviation de- 12We run the regression with different combinations of control variables and find qualitatively consistent results. 20 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 51,
    "chunk_index": 37,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "crease in monthly OTMPC vol predicts 7.1 bp stock returns in the following month and the coefficient estimate is statistically significant at 5% level. Column (2) reports the monthly stock return predictability of OTMPC oi. One standard deviation decrease in OTMPC oi predicts 7.7 bp monthly return, which is statistically significant at 1% level. Among other in- formed option trading measures, only VS exhibits statistically significant return predictabil- itythoughthesignsoftheircoefficientestimatesareconsistentwiththoseofpreviousstudies. Columns (3) and (4) show that the refined OTMPC rations exhibit much stronger stock return predictabilities. One standard deviation decrease in rOTMPC vol predicts 14.9 bp returns in the following month while the decrease in rOTMPC oi predicts 15.8 bp returns. Both coefficient estimates are statistically significant at 1% level. In columns (5) and (6), we test the return predictability of the put-to-call trading volume and open interest increment ratios of ATM and ITM options. These options include puts (resp. calls) of which strike price is greater (resp. smaller) than or equal to the underlying stock price. We denote the ratios as AITMPC vol and AITMPC oi, respectively. Consistent with the prediction of our numerical analysis in Section 2, both AITMPC ratios do not exhibit significant stock return predictabilities. Overall, our findings show that OTMPC ratios contain novel information relative to the existing informed option trading measures. Next, we examine the persistence of the monthly return predictability of OTMPC ratios. Table 3 reports the monthly stock return predictability of OTMPC ratios and of the refined measures up to three-month lag (τ = 1,2,3). We control for the changes in sample sizes across return lags by restricting the sample to the firm-months in which the stock returns are available over the following three months. Control variables include stock characteristics and other informed option trading measures. Column (1) shows that the coefficient estimate of OTMPC vol is significantly negative only in the one-month lag. The coefficient estimates 21 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 51,
    "chunk_index": 38,
    "word_count": 320,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "in which the stock returns are available over the following three months. Control variables include stock characteristics and other informed option trading measures. Column (1) shows that the coefficient estimate of OTMPC vol is significantly negative only in the one-month lag. The coefficient estimates 21 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 51,
    "chunk_index": 39,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "at two- and three-month lags are economically and statistically negligible. Column (2) reports that the return predictability of OTMPC oi is also significantly only at the one- month lag. Columns (3) and (4) show that the return predictability of refined measures are more persistent. The coefficient estimates are negative and marginally significant at two- month lag. Overall, our results suggest that the information contained in OTMPC ratios are substantially incorporated into the stock price in the following month. 4.2 Predictability for large stock price changes We next examine whether OTMPC ratios predict a large change in the future stock price. As discussed in Section 2, informed investors are likely to purchase OTM calls (resp. OTM puts) only when they predict a sufficiently large stock price increase (resp. decrease) to compensate for the high bid-ask spreads of OTM options and to fully employ the convexity of OTM option payoffs. We thus hypothesize that OTMPC ratios predict a large stock price change. In our baseline test, we set a monthly stock return above 10% (resp. below −10%) as a threshold for the stock price surge (resp. crash).13 Specifically, for stock i and month t, we create two dummy variables that indicate the monthly stock price surge (i.e., r > 10%) i,t+1 and the price crash (i.e., r < −10%), respectively. For each dummy variable, we run a i,t+1 logistic regression as follows: (Stock price surge/crash dummy) =α+β ·(OTMPC ratio) i,t+1 i,t +(Controls) ·Γ +ε . (10) i,t i,t+1 13In an unreported analysis, we find that the results are qualitatively consistent when setting a monthly return ±5% as thresholds. 22 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 51,
    "chunk_index": 40,
    "word_count": 272,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "we run a i,t+1 logistic regression as follows: (Stock price surge/crash dummy) =α+β ·(OTMPC ratio) i,t+1 i,t +(Controls) ·Γ +ε . (10) i,t i,t+1 13In an unreported analysis, we find that the results are qualitatively consistent when setting a monthly return ±5% as thresholds. 22 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 51,
    "chunk_index": 41,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "As a stock return predictor, we consider cross-sectionally demeaned OTMPC ratios to con- trol for the market-wise demand for OTM puts and OTM calls. We also include stock characteristics and other informed option trading measures as control variables. Table 4 presents the estimation results. For brevity, we focus on the predictability of refined measures.14 Columns (1) and (2) report that higher rOTMPC vol and rOTMPC oi predict a lower likelihood of stock price surge in the following month, respectively. Columns (3) and (4) show that higher these ratios are also positively associated with the occurrence of stock price crash in the next month. The coefficient estimates of all ratios are statistically significant at 1% level in all logistic regressions. We also test whether OTMPC ratios predict the payoff that investors can gain from buying 10% OTM options (i.e., a strike-to-spot ratio is 1.1 for calls and 0.9 for puts) on the last trading day of month t and exercising at the last trading day of month t+1. Specifically, we run a Fama-Macbeth regression as follows: Payoff from 10% OTM call (or put) =α+β ·(OTMPC ratio) i,t+1 i,t +(Controls) ·Γ +ε , (11) i,t i,t+1 where the payoff from 10% OTM call exercise is max(r −0.1, 0) and of the payoff from i,t+1 10% OTM put exercise is max(−0.1−r , 0). Columns (5) and (6) in Table 4 show that i,t+1 higher rOTMPC vol and rOTMPC oi predict a lower payoff from the OTM call exercise in the following month, respectively. Columns (7) and (8), on the other hand, report that these ratios are positively associated with the payoff from OTM put exercises in the next month. Overall, these results suggest that OTMPC predicts a large stock price change. 14The estimation results of OTMPC ratios are reported in online appendix. 23 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 51,
    "chunk_index": 42,
    "word_count": 305,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "the other hand, report that these ratios are positively associated with the payoff from OTM put exercises in the next month. Overall, these results suggest that OTMPC predicts a large stock price change. 14The estimation results of OTMPC ratios are reported in online appendix. 23 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 51,
    "chunk_index": 43,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "5 Portfolio analysis In this section, we propose an implementable investment strategy that exploits the informa- tion contained in monthly OTMPC ratios, in particular, the refined measures. Specifically, we first sort the stocks into deciles based on their monthly rOTMPC ratios in month t, and calculate the monthly excess return and Carhart (1997) four factors alpha of each decile portfolio in month t+1. We also examine the profitability of long-short strategies that use the decile portfolios. Panel A in Table 5 reports the monthly excess returns and alphas of rOTMPC decile portfolios. Column (1) shows that the equal-weighted bottom decile portfolio built based on rOTMPC vol yields 1.36% monthly excess return while the top decile portfolio earns 0.56%. The long-short strategy that buys bottom decile portfolio and short-sells top decile portfolio on a monthly basis, therefore, yields 0.81% monthly returns, equivalently, 9.68% per annum. Column (2) shows that the long-short strategy of value-weighted bottom and top decile portfolios earns 0.65% monthly excess return, equivalently, 7.74% per annum. Columns (3) and (4) present the four factor alphas of equal-weighted and value-weighted decile portfolios, respectively. The long-short strategy of equal-weighted bottom and top decile portfolios earn 10.59% annual alpha while that of value-weighted portfolios yield 8.97% annual alpha. It is noteworthy that the long-short strategies yield higher returns from long positions (i.e., bottom decile) rather than short positions and, thus, they are relatively robust to the stock short-selling constraints. Columns (5)–(8) present the monthly excess returns and alphas of decile portfolios built basedonmonthlyrOTMPC oi. TheportfoliosbuiltonrOTMPC oiareevenmoreprofitable than those built on rOTMPC vol. Columns (5) and (7) report that the long-short strategy thatbuysequal-weightedbottomdecileportfolioandshort-sellsthetopdecileportfolioyields 24 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 51,
    "chunk_index": 44,
    "word_count": 276,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "and, thus, they are relatively robust to the stock short-selling constraints. Columns (5)–(8) present the monthly excess returns and alphas of decile portfolios built basedonmonthlyrOTMPC oi. TheportfoliosbuiltonrOTMPC oiareevenmoreprofitable than those built on rOTMPC vol. Columns (5) and (7) report that the long-short strategy thatbuysequal-weightedbottomdecileportfolioandshort-sellsthetopdecileportfolioyields 24 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 51,
    "chunk_index": 45,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "around 10.16% annual excess returns and 10.76% annual alphas, respectively. The value- weighted portfolio returns are smaller but still economically and statistically significant. Columns (6) and (8) show that the long-short strategy of value-weight bottom and top decile portfolios offer 9.37% annual returns and 10.34% annual alpha. The outperformance relative to the long-short strategies built on rOTMPC vol arises mostly from the short position. Next, we also examine whether the revised OTMPC ratios provide a novel investment strategy relative to the existing informed option trading measures. Specifically, we build the decile portfolios based on the residual of monthly rOTMPC ratios orthogonal to these measures. Columns (9) and (10) present the four factor alphas of equal-weighted and value- weighted portfolios built based on the residual of rOTMPC vol, respectively. The long- short strategies of equal-weighted bottom and top decile portfolios yield 8.33% alpha per annum while those of value-weighted portfolios earn 8.29% alpha per annum. The residual of rOTMPC oi offers an investment strategy that yield slightly lower profits. Column (11) shows that the long-short strategies of equal-weighted bottom and top decile portfolios yield 7.47% alpha per annum while column (12) report that those of value-weighted portfolios offer 7.06% alphas. The profitable stock portfolio strategies suggest that rOTMPC ratios provide novel information to stock market investors relative to the existing option price- or trading volume-based measures.15 15As a robustness check, we also calculate the monthly portfolio returns from the second trading day of each calendar month, and find that equal-weighted (resp., value-weighted) long-short portfolio based on rOTMPC vol yields about 8% (resp. 6%) annual alpha. The results are available in online appendix. 25 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 51,
    "chunk_index": 46,
    "word_count": 277,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "robustness check, we also calculate the monthly portfolio returns from the second trading day of each calendar month, and find that equal-weighted (resp., value-weighted) long-short portfolio based on rOTMPC vol yields about 8% (resp. 6%) annual alpha. The results are available in online appendix. 25 Electronic copy available at: https://ssrn.com/abstract=2803724 6 Robustness checks 6.1 Subsample period analysis WefirstchecktherobustnessofreturnpredictabilityofOTMPCratiosinsubsampleperiods. Specifically, werunaFama-MacBethmonthlystockreturnregressionovertwoperiods, 1996– 2006 (pre-2006) and 2007–2015 (post-2007). Table 6 presents the estimation results. For brevity, we focus on the refined OTMPC ratios. Columns (1) and (2) show that higher rOTMPC vol predicts lower monthly stock returns in pre-2006 and post-2007, respectively. The return predictability is, however, statistically and economically more significant in the earlier period. The return predictability of rOTMPC oi exhibits a similar pattern. Columns (3)and(4)reportthatthereturnpredictabilityofrOTMPC oiisalsostatisticallysignificant in pre-2006 and post-2007, respectively, though it becomes slightly weaker in recent years. Overall, the results confirm that the information contained in OTMPC ratios is still slowly diffused into the stock market in the recent period after the financial crisis. 6.2 Corporate news predictability of OTMPC Finally, we examine whether OTMPC ratios change before the major corporate events, namely, earnings surprises and M&A announcements. Previous studies (e.g., Cao et al. 2005, Hu 2014, Augustin et al. 2017) report that informed option trading occurs before these announcements. Notably, the two events differ in the regularity of occurrence and in the direction of stock market reaction. While M&A announcements occur irregularly and are mostly accompanied with positive market reaction for target firms, earnings announcements occur regularly and can be followed by either positive or negative stock returns, depending on the ex-ante forecast of investors. These distinctive features of two events allow us to run 26 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 51,
    "chunk_index": 47,
    "word_count": 285,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "irregularly and are mostly accompanied with positive market reaction for target firms, earnings announcements occur regularly and can be followed by either positive or negative stock returns, depending on the ex-ante forecast of investors. These distinctive features of two events allow us to run 26 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 51,
    "chunk_index": 48,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "richer tests about the information contained in OTMPC ratios. For brevity, we focus on the predictability of refined OTMPC ratios in this section. WefirsttestwhetherrOTMPCratiospredictearningssurprises. Specifically, weestimate the following regression: for each firm i and time t, Surprise =α+β ·rOTMPC +(Controls) ·Γ +ε . (12) i,t+1 i,t i,t i,t+1 We consider two dependent variables: (i) SUE , the standard unexplained earnings based AF on I/B/E/S reported analyst forecasts and actual EPS, which is defined as the difference between the actual and the most recent consensus EPSs divided by the stock price, and (ii) CAR(0,21), the cumulative benchmark-adjusted return (CAR) during five trading days after the announcement date. Table 7 provides the regression results. Both rOTMPC ratios are negatively associated with earnings surprise measures, implying that higher rOTMPC ratios in a month ahead of theearningsannouncementpredictsnegativeearningssurprises. Theresultssuggestthatthe investors who have information about the upcoming earnings news trade OTM options, and that the stock price does not fully adjust to the information before the actual announcement. Next, we examine the predictive power of rOTMPC ratios for M&A announcements. We first match each target firm with control firms that belong to the same Fama-French 49 industry and size quintile but that do not make any M&A announcement in the quarter, and then compare rOTMPC ratios of the two groups of firms in the time window from 8 months before the announcement to two months after the announcements. Our final sample consists of 8,467 M&A cases that occur between 1996 and 2015. Table 8 reports the analysis results. The two groups of firms exhibit substantial differ- 27 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 51,
    "chunk_index": 49,
    "word_count": 266,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "in the time window from 8 months before the announcement to two months after the announcements. Our final sample consists of 8,467 M&A cases that occur between 1996 and 2015. Table 8 reports the analysis results. The two groups of firms exhibit substantial differ- 27 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 51,
    "chunk_index": 50,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "ences in their rOTMPC ratios before M&A announcements. Specifically, relative to con- trol firms, target firms exhibit significantly lower (resp. higher) rOTMPC ratios since 4–5 months before the announcements. The difference in rOTMPC ratios between the two groups gets wider as it nears the announcement month. Specifically, target firms exhibit around 1–2% lower rOTMPC ratios over the four months before the announcement. After the announcement, the difference in rOTMPC ratios between target and matched firms flips mainly because of the market reaction to the announcement. Specifically, target firms have 2–3% higher rOTMPC ratios in the announcement month and the following two months. The results suggest that informed OTM option trading tends to occur before the M&A announcements. 7 Conclusion This paper examines the information contained in OTM option trading activities and in- vestigates how quickly the information is impounded into the underlying stock prices. Our numerical analysis shows that, in the U.S. option markets, the investors who have directional information about the future stock price rarely write OTM options because the leverage ef- fect curtailed by tighter margin requirements is not sufficient to compensate for transaction costs. Our analysis also suggests that put-to-call trading volume ratio of OTM options (OTMPC) can be used as a proxy for informed OTM option trading. We find strong evi- dence that the information contained in this measure is slowly diffused into the stock market. Higher OTMPC predicts lower future stock returns in a monthly horizon. The return pre- dictability offers implementable portfolio strategies. We also find that OTMPC predicts the future corporate events such as M&A or earnings surprises. The slow information diffusion 28 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 51,
    "chunk_index": 51,
    "word_count": 275,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "diffused into the stock market. Higher OTMPC predicts lower future stock returns in a monthly horizon. The return pre- dictability offers implementable portfolio strategies. We also find that OTMPC predicts the future corporate events such as M&A or earnings surprises. The slow information diffusion 28 Electronic copy available at: https://ssrn.com/abstract=2803724 suggests that market inefficiency may emerge from the uninformed investors’ limited knowl- edge about how the transaction costs in options markets influence the trading strategies of informed investors. 29 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "Document",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 51,
    "chunk_index": 52,
    "word_count": 84,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "such as M&A or earnings surprises. The slow information diffusion 28 Electronic copy available at: https://ssrn.com/abstract=2803724 suggests that market inefficiency may emerge from the uninformed investors’ limited knowl- edge about how the transaction costs in options markets influence the trading strategies of informed investors. 29 Electronic copy available at: https://ssrn.com/abstract=2803724 Amihud, Y., 2002.Illiquidityandstockreturns: Cross-sectionandtime-serieseffects.Journal of Financial Markets 5, 31–56. An, B.-J., Ang, A., Bali, T. G., Cakici, N., 2014. The joint cross section of stocks and options. Journal of Finance 69, 2279–2337. Anthony, J. H., 1988. The interrelation of stock and option market trading-volume data. Journal of Finance 43, 949–961. Augustin, P., Brenner, M., Grass, G., Subrahmanyam, M., 2017. Informed options trading prior to M&A announcements: Insider trading?, Working paper, available at SSRN. Bali, T. G., Cakici, N., Whitelaw, R. F., 2011. Maxing out: Stocks as lotteries and the cross-section of expected returns. Journal of Financial Economics 99, 427–446. Bali, T. G., Hovakimian, A., 2009. Volatility spreads and expected stock returns. Manage- ment Science 55, 1797–1812. Bernile, G., Gao, F., Hu, J., 2019. Center of volume mass: Does options trading predict stock returns?, Working paper, available at SSRN. Black, F., 1975. Fact and fantasy in use of options. Financial Analysts Journal 31, 36–72. Bollen, N. P. B., Whaley, R. E., 2004. Does net buying pressure affect the shape of implied volatility functions? Journal of Finance 59, 711–753. Cao, C., Chen, Z., Griffin, J. M., 2005. Informational content of option volume prior to takeovers. The Journal of Business 78, 1073–1109. 30 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 51,
    "chunk_index": 53,
    "word_count": 255,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "P. B., Whaley, R. E., 2004. Does net buying pressure affect the shape of implied volatility functions? Journal of Finance 59, 711–753. Cao, C., Chen, Z., Griffin, J. M., 2005. Informational content of option volume prior to takeovers. The Journal of Business 78, 1073–1109. 30 Electronic copy available at: https://ssrn.com/abstract=2803724 Carhart, M. M., 1997. On persistence in mutual fund performance. Journal of Finance 52, 57–82. Chakravarty, S., Gulen, H., Mayhew, S., 2004. Informed trading in stock and option markets. Journal of Finance 59, 1235–1257. Chan, K., Chung, P., Fong, W.-M., 2002. The informational role of stock and option volume. Review of Financial Studies 15, 1049–1076. Conrad, J., 1989. The price effects of option introduction. Journal of Finance 44, 487–498. Cremers, M., Weinbaum, D., 2010. Deviations from put-call parity and stock return pre- dictability. Journal of Financial and Quantitative Analysis 45, 335–367. Diether, K. B., Lee, K.-H., Werner, I. M., 2009. Short-sale strategies and return predictabil- ity. Review of Financial Studies 22, 575–607. Easley, D., O’Hara, M., Srinivas, P. S., 1998. Option volume and stock prices: Evidence on where informed traders trade. Journal of Finance 53, 431–465. Fama, E. F., MacBeth, J. D., 1973. Risk, return, and equilibrium: Empirical tests. Journal of Political Economy 81, 607–636. Gaˆrleanu, N., Pedersen, L. H., Poteshman, A. M., 2008. Demand-based option pricing. Review of Financial Studies 22, 4259–4299. Ge, L., Lin, T.-C., Pearson, N. D., 2016. Why does the option to stock volume ratio predict stock returns? Journal of Financial Economics 120, 601–622. George, T. J., Longstaff, F. A., 1993. Bid-ask spreads and trading activity in the S&P 100 index options market. Journal of Financial and Quantitative Analysis 28, 381–397. 31 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 51,
    "chunk_index": 54,
    "word_count": 281,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "Why does the option to stock volume ratio predict stock returns? Journal of Financial Economics 120, 601–622. George, T. J., Longstaff, F. A., 1993. Bid-ask spreads and trading activity in the S&P 100 index options market. Journal of Financial and Quantitative Analysis 28, 381–397. 31 Electronic copy available at: https://ssrn.com/abstract=2803724 Goncalves-Pinto, L., Grundy, B. D., Hameed, A., van der Heijden, T., Zhu, Y., 2020. Why do option prices predict stock returns? the role of price pressure in the stock market. Management Science . Hu, J., 2014. Does option trading convey stock price information? Journal of Financial Economics 111, 625–645. Jameson, M., Wilhelm, W., 1992. Market making in the options markets and the costs of discrete hedge rebalancing. Journal of Finance 47, 765–779. Johnson, T. L., So, E. C., 2012. The option to stock volume ratio and future returns. Journal of Financial Economics 106, 262–286. Kumar, A., 2009. Who gambles in the stock market? Journal of Finance 64, 1889–1933. Lee, C., Ready, M., 1991. Inferring trade direction from intraday data. Journal of Finance 46, 733–746. Manaster, S., Rendleman, R.J., 1982.Optionpricesaspredictorsofequilibriumstockprices. Journal of Finance 37, 1043–1057. Mayhew, S., Sarin, A., Shastri, K., 1995. The allocation of informed trading across related markets: An analysis of the impact of changes in equity-option margin requirements. Journal of Finance 50, 1635–1654. Muravyev, D., 2016.Orderflowandexpectedoptionreturns.JournalofFinance71, 673–708. Muravyev, D., Pearson, N. D., Pollet, J. M., 2018. Understanding returns to short selling using option-implied stock borrowing fees. working paper . 32 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 32,
    "page_range": "p.32-33",
    "total_pages": 51,
    "chunk_index": 55,
    "word_count": 247,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.32-33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "related markets: An analysis of the impact of changes in equity-option margin requirements. Journal of Finance 50, 1635–1654. Muravyev, D., 2016.Orderflowandexpectedoptionreturns.JournalofFinance71, 673–708. Muravyev, D., Pearson, N. D., Pollet, J. M., 2018. Understanding returns to short selling using option-implied stock borrowing fees. working paper . 32 Electronic copy available at: https://ssrn.com/abstract=2803724 Newey, W. K., West, K. D., 1987. A simple, positive semi-definite, heteroskedasticity and autocorrelation consistent covariance matrix. Econometrica 55, 703–708. Pan, J., Poteshman, A. M., 2006. The information in option volume for future stock prices. Review of Financial Studies 19, 872–908. Patel, V., Putnin¸ˇs, T. J., Michayluk, D., Foley, S., 2020. Price discovery in stock and options market. Journal of Financial Markets 47, 100524. Ross, S. A., 1976. Options and efficiency. The Quarterly Journal of Economics 90, 75–89. Santa-Clara, P., Saretto, A., 2009. Option strategies: Good deals and margin calls. Journal of Financial Markets 12, 391–417. Stephan, J. A., Whaley, R. E., 1990. Intraday price change and trading volume relations in the stock and stock option markets. Journal of Finance 45, 191–220. Vijh, A. M., 1988. Potential biases from using only trade prices of related securities on different exchanges. Journal of Finance 43, 1049–1055. Xing, Y., Zhang, X., Zhao, R., 2010. What does the individual option volatility smirk tell us about future equity returns? Journal of Financial and Quantitative Analysis 45, 641–662. 33 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 33,
    "page_range": "p.33-34",
    "total_pages": 51,
    "chunk_index": 56,
    "word_count": 228,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.33-34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "from using only trade prices of related securities on different exchanges. Journal of Finance 43, 1049–1055. Xing, Y., Zhang, X., Zhao, R., 2010. What does the individual option volatility smirk tell us about future equity returns? Journal of Financial and Quantitative Analysis 45, 641–662. 33 Electronic copy available at: https://ssrn.com/abstract=2803724 Figure 1: Option trading strategy of an informed investor This figure demonstrates how the trading return of informed investors is associated with the out-of-the- moneyness of options. Out-of-the-moneyness is defined as K/S for calls and 2−K/S for puts, where K is strikepriceandS isunderlyingprice. Black-Scholesoptionpricesaregeneratedwhilesettingtheparameters to S =10, r =0.03, t=20/250, and σ =0.4. Panels (a)–(c) present how the expected trading return (from buying calls or selling puts) of informed investors is associated with the out-of-the-moneyness of options. The informed investors’ signal parameters ∆ and p, defined in Section 2, are set as ∆ = 0.05 and p = 0.3, respectively. Panel(a)setsbid-askspreadtozeroandthemargin(foroptionwriting)toBlack-Scholesprice. Panels (b) and (c) consider CBOE margin requirements as in (4). Panel (b) sets the bid-ask spread as zero, while Panel (c) sets the bid-ask spread as min(exp(−2.17+0.47log(X)+0.0175log(S)),0.01), where X is the Black-Scholes option price, respectively. Panel (d) displays the optimal out-of-the-moneyness, at which the profit is maximized, for different size of potential stock price change ∆ given that p = 0.3, the CBOE margin requirement, the bid-ask spread min(exp(−2.17+0.47log(X)+0.0175log(S)),0.01). (a) Return (no spread, margin=B-S price) (b) Return (no spread, margin=CBOE) (c) Return (spread, margin=CBOE) (d) Optimal out-of-the-moneyness 34 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 34,
    "page_range": "p.34-35",
    "total_pages": 51,
    "chunk_index": 57,
    "word_count": 245,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.34-35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "the profit is maximized, for different size of potential stock price change ∆ given that p = 0.3, the CBOE margin requirement, the bid-ask spread min(exp(−2.17+0.47log(X)+0.0175log(S)),0.01). (a) Return (no spread, margin=B-S price) (b) Return (no spread, margin=CBOE) (c) Return (spread, margin=CBOE) (d) Optimal out-of-the-moneyness 34 Electronic copy available at: https://ssrn.com/abstract=2803724 Figure 2: Cumulative distribution of OTMPC This figure presents the cross-sectional cumulative distribution of monthly OTMPC (rOTMPC). OTMPC vol(OTMPC oi)isdefinedasthemonthlyOTMputtradingvolume(∆ openinterest)dividedby + the monthly OTM option trading volume (∆ open interest) on the same month. For the refined measure, + we only use the OTM options that remain as OTM on the last trading day of each month. (a) OTMPC (b) rOTMPC 35 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 35,
    "page_range": "p.35-36",
    "total_pages": 51,
    "chunk_index": 58,
    "word_count": 118,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.35-36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "vol(OTMPC oi)isdefinedasthemonthlyOTMputtradingvolume(∆ openinterest)dividedby + the monthly OTM option trading volume (∆ open interest) on the same month. For the refined measure, + we only use the OTM options that remain as OTM on the last trading day of each month. (a) OTMPC (b) rOTMPC 35 Electronic copy available at: https://ssrn.com/abstract=2803724 Table 1: Summary statistics of OTMPC ThistablepresentsthesummarystatisticsofoptiontradingvolumeratiosfromJanuary1996throughDecem- ber 2015. OTMPC vol (OTMPC oi) is defined as the monthly OTM put trading volume (∆ open interest) + divided by the monthly OTM option trading volume (∆ open interest) on the same month. rOTMPC is + the refined measure of OTMPC, in which OTM options are counted if they remain as OTM on the last trading day of each month. Panel A shows the time-series average of mean, standard deviation, and median values of the cross-sectional distribution of each option volume ratio. It also presents 1 month, 3 month, 6 month, and 12 month autocorrelation of each option volume ratio. τ-month autocorrelation is calculated by the time-series average of cross-sectional Pearson product-moment correlation between the month t and t+τ. Panel B presents 1 month and 12 month transition matrix of OTMPC vol and OTMPC oi decile portfolio. It shows the probability that stocks in a decile in month t are in the same decile in month t+τ. The numbers are in percentage. Panel C presents correlation matrix among monthly option volume ratios and option market variables, i.e. OS decile, Short interest, ∆CVOL, ∆PVOL, VS, and Skew. The option market variables are further described in Appendix A. A correlation is calculated by the time-series average of cross-sectional Pearson product-moment correlation between measures. Panel A. option ratio measure summary τ-month Autocorrelation Mean Std. Median τ=1 3 6 12 OTMPC vol 0.446 0.254 0.435 0.299 0.197 0.149 0.123 OTMPC oi 0.464 0.276 0.458 0.207 0.153 0.122 0.103 rOTMPC vol 0.467 0.286 0.452 0.250 0.156 0.112 0.094 rOTMPC oi 0.484 0.304 0.479 0.164 0.125 0.098 0.083 PanelB.transitionmatrix-decileportfolioallocations(%) Variables OTMPC vol OTMPC oi rOTMPC vol rOTMPC oi Horizon 1month 12month 1month 12month 1month 12month 1month 12month 1(Bottom) 0.287 0.197 0.266 0.199 0.243 0.196 0.247 0.192 2 0.177 0.136 0.156 0.132 0.143 0.128 0.159 0.124 3 0.151 0.122 0.137 0.118 0.129 0.117 0.129 0.117 4 0.145 0.119 0.130 0.117 0.125 0.115 0.125 0.121 5 0.140 0.125 0.131 0.126 0.126 0.123 0.127 0.123 6 0.137 0.125 0.132 0.127 0.127 0.126 0.133 0.130 7 0.146 0.127 0.136 0.129 0.130 0.130 0.129 0.128 8 0.156 0.134 0.135 0.125 0.133 0.123 0.134 0.124 9 0.174 0.129 0.151 0.126 0.142 0.122 0.146 0.118 10(Top) 0.271 0.167 0.225 0.161 0.207 0.151 0.217 0.151 PanelC.correlationmatrix Variables OTMPCvol OTMPCoi rOTMPCvol rOTMPCoi OSdecile Shortinterest ∆CVOL ∆PVOL VS Skew OTMPCvol - 0.786 0.814 0.666 0.116 0.071 -0.004 0.002 -0.068 -0.048 OTMPCoi - 0.649 0.815 0.123 0.072 0.012 0.017 -0.048 -0.061 rOTMPCvol - 0.831 0.098 0.049 -0.035 -0.021 -0.069 -0.042 rOTMPCoi - 0.108 0.051 -0.017 -0.006 -0.053 -0.054 36 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 51,
    "chunk_index": 59,
    "word_count": 485,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "OSdecile Shortinterest ∆CVOL ∆PVOL VS Skew OTMPCvol - 0.786 0.814 0.666 0.116 0.071 -0.004 0.002 -0.068 -0.048 OTMPCoi - 0.649 0.815 0.123 0.072 0.012 0.017 -0.048 -0.061 rOTMPCvol - 0.831 0.098 0.049 -0.035 -0.021 -0.069 -0.042 rOTMPCoi - 0.108 0.051 -0.017 -0.006 -0.053 -0.054 36 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 51,
    "chunk_index": 60,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "Table 2: Stock return predictability of OTMPC This table reports the results of Fama and MacBeth (1973) regressions of stock return in month t+1 on OTM volume ratios and other control variables in month t. The dependent variable is a raw underlying stock return. The main independent variables are a set of option trading volume ratios: (1) OTMPC vol (OTMPC oi),OTMputtradingvolume(∆ openinterest)dividedbyOTMoptiontradingvolume(∆ open + + interest), (2) rOTMPC vol (rOTMPC oi), OTM put trading volume (∆ open interest) divided by OTM + option trading volume (∆ open interest), where the OTM options are restricted to remain as OTM on the + last trading day of each month, and (3) AITMPC vol (AITMPC oi), AITM put trading volume (∆ open + interest) divided by AITM option trading volume (∆ open interest). The control variables include log(firm + size), log(book-to-marketratio), momentummeasure, illiquiditymeasureofAmihud(2002), laggedmonthly return, OS decile, Short interest, ∆CVOL, ∆PVOL, VS, and Skew. The control variables are further described in Appendix A. t-statistics are shown in parentheses, and are based on Newey and West (1987) adjustedstandarderrorswithfour-monthlags. ***,**,and*representsignificanceatthe1%,5%,and10% levels, respectively. (1) (2) (3) (4) (5) (6) def. ofoptionratio vol oi vol oi vol oi OTMPC -0.0028** -0.0028*** (-2.29) (-2.61) rOTMPC -0.0052*** -0.0052*** (-4.15) (-4.38) AITMPC -0.0008 -0.0007 (-0.65) (-0.72) OSdecile -0.0001 -0.0000 -0.0000 -0.0000 -0.0001 -0.0001 (-0.26) (-0.18) (-0.22) (-0.19) (-0.38) (-0.43) Shortinterest -0.0413*** -0.0414*** -0.0399*** -0.0403*** -0.0426*** -0.0433*** (-3.98) (-4.01) (-3.85) (-3.91) (-3.98) (-4.05) ∆CVOL 0.0133 0.0145 0.0128 0.0137 0.0172 0.0179 (1.06) (1.14) (0.99) (1.02) (1.35) (1.38) ∆PVOL -0.0217 -0.0229 -0.0202 -0.0203 -0.0265* -0.0268* (-1.57) (-1.65) (-1.45) (-1.41) (-1.92) (-1.92) VS 0.0551*** 0.0568*** 0.0555*** 0.0570*** 0.0550*** 0.0567*** (5.56) (5.63) (5.55) (5.64) (5.27) (5.21) Skew -0.0047 -0.0044 -0.0039 -0.0040 -0.0054 -0.0049 (-0.86) (-0.79) (-0.69) (-0.69) (-0.99) (-0.88) LogSize -0.0008 -0.0007 -0.0007 -0.0007 -0.0008 -0.0008 (-1.27) (-1.23) (-1.20) (-1.23) (-1.25) (-1.34) LogBM 0.0004 0.0005 0.0004 0.0005 0.0004 0.0003 (0.64) (0.64) (0.63) (0.65) (0.60) (0.49) Momentum 0.0002 0.0001 0.0006 0.0004 -0.0003 -0.0001 (0.04) (0.03) (0.13) (0.10) (-0.08) (-0.03) Illiquidity -0.0369 -0.0337 -0.0358 -0.0412 -0.0235 -0.0281 (-1.20) (-1.08) (-1.15) (-1.15) (-0.77) (-0.90) Ret(0) -0.0150** -0.0149** -0.0109 -0.0113 -0.0166** -0.0155** (-2.05) (-2.04) (-1.46) (-1.51) (-2.38) (-2.15) Constant 0.0190*** 0.0188*** 0.0197*** 0.0200*** 0.0182*** 0.0187*** (2.66) (2.64) (2.75) (2.80) (2.63) (2.66) AdjustedR2 0.0615 0.0616 0.0618 0.0622 0.0620 0.0617 Observations 254,867 253,235 253,410 250,789 254,586 252,030 37 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 51,
    "chunk_index": 61,
    "word_count": 382,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "(-1.15) (-1.15) (-0.77) (-0.90) Ret(0) -0.0150** -0.0149** -0.0109 -0.0113 -0.0166** -0.0155** (-2.05) (-2.04) (-1.46) (-1.51) (-2.38) (-2.15) Constant 0.0190*** 0.0188*** 0.0197*** 0.0200*** 0.0182*** 0.0187*** (2.66) (2.64) (2.75) (2.80) (2.63) (2.66) AdjustedR2 0.0615 0.0616 0.0618 0.0622 0.0620 0.0617 Observations 254,867 253,235 253,410 250,789 254,586 252,030 37 Electronic copy available at: https://ssrn.com/abstract=2803724 Table 3: Persistence of stock return predictability of OTMPC This table presents the results of Fama and MacBeth (1973) regressions of monthly stock return on months (t+i), fromt+1tot+3, onmonthlyOTMPC(rOTMPC)inmontht, andothercontrolvariablest+i−1. The dependent variable is a raw underlying stock return. The main independent variable is OTMPC vol (OTMPC oi),OTMputtradingvolume(∆ openinterest)dividedbyOTMoptiontradingvolume(∆ open + + interest). For the refined measure (rOTMPC), we only use the OTM options that remain as OTM on the last trading day of each month. The control variables include log(firm size), log(book-to-market ratio), momentummeasure,illiquiditymeasureofAmihud(2002),laggedmonthlyreturn,OSdecile,Shortinterest, ∆CVOL,∆PVOL,VS,andSkew. ThecontrolvariablesarefurtherdescribedinAppendixA.t-statisticsare shown in parentheses, and are based on Newey and West (1987) adjusted standard errors with four-month lags. ***, **, and * represent significance at the 1%, 5%, and 10% levels, respectively. (1) (2) (3) (4) OTMPC vol OTMPC oi rOTMPC vol rOTMPC oi estimates estimates estimates estimates Month (t-stat) (t-stat) (t-stat) (t-stat) +1 -0.0030** -0.0033*** -0.0056*** -0.0057*** (-2.27) (-2.88) (-4.01) (-4.50) +2 -0.0001 0.0008 -0.0019* -0.0016* (-0.06) (0.87) (-1.67) (-1.77) +3 0.0011 0.0006 0.0008 0.0001 (0.86) (0.55) (0.67) (0.15) Observations 235,059 231,872 231,872 226,395 38 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 38,
    "page_range": "p.38-39",
    "total_pages": 51,
    "chunk_index": 62,
    "word_count": 227,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.38-39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "vol rOTMPC oi estimates estimates estimates estimates Month (t-stat) (t-stat) (t-stat) (t-stat) +1 -0.0030** -0.0033*** -0.0056*** -0.0057*** (-2.27) (-2.88) (-4.01) (-4.50) +2 -0.0001 0.0008 -0.0019* -0.0016* (-0.06) (0.87) (-1.67) (-1.77) +3 0.0011 0.0006 0.0008 0.0001 (0.86) (0.55) (0.67) (0.15) Observations 235,059 231,872 231,872 226,395 38 Electronic copy available at: https://ssrn.com/abstract=2803724 Table 4: OTMPC and large stock price changes This table reports the results of logistic and Fama and MacBeth (1973) regressions of the variables related to the magnitude of underlying stock returns in month t+1 on monthly refined OTMPC and other control variables in month t. The following sets of dependent variables are employed: (1) large price increase (resp. decrease) dummy, whose value is one if the return in month t+1 is greater (resp. less) than 10% (resp. -10%), and zero otherwise; and (2) the ratio of 10% OTM calls (resp. OTM puts) pay-off to the current stock price, whose value is max(ret −0.1, 0) (resp. (max(−0.1−ret , 0))). The main independent t+1 t+1 variablesaremonthlydemeanedandnormalrOTMPC.rOTMPC vol(rOTMPC oi)isdefinedasOTMput trading volume (∆ open interest) divided by OTM option trading volume (∆ open interest). Demeaned + + rOTMPC is rOTMPC minus the cross-sectional mean of rOTMPC. For the refined measure, we only use the OTM options that remain as OTM on the last trading day of each month. The control variables includelog(firmsize),log(book-to-marketratio),momentummeasure,illiquiditymeasureofAmihud(2002), lagged monthly return, OS decile, Short interest, ∆CVOL, ∆PVOL, VS, and Skew. The control variables are further described in Appendix A. t-statistics are shown in parentheses. For Model 5–8, t-statistics are based on Newey and West (1987) adjusted standard errors with four-month lags. ***, **, and * represent significance at the 1%, 5%, and 10% levels, respectively. (1) (2) (3) (4) (5) (6) (7) (8) Dep. variables Largeincrease Largedecrease Callpay-off Putpay-off (ret >10%) (ret <−10%) max(ret −0.1,0) max(−0.1−ret ,0) t+1 t+1 t+1 t+1 DemeanedrOTMPC vol -0.0794*** 0.108*** (-3.87) (4.81) DemeanedrOTMPC oi -0.0637*** 0.124*** (-3.31) (5.94) rOTMPC vol -0.0021*** 0.0008** (-3.67) (2.02) rOTMPC oi -0.0017*** 0.0010*** (-3.47) (2.69) AdjustedR2 0.022 0.022 0.037 0.038 0.0524 0.0526 0.0712 0.0720 Observations 253,410 250,789 253,410 250,789 253,410 250,789 253,410 250,789 Controls Yes Yes Yes Yes Yes Yes Yes Yes Regressions Logit Logit Fama-Macbeth Fama-Macbeth 39 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 51,
    "chunk_index": 63,
    "word_count": 364,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "rOTMPC vol -0.0021*** 0.0008** (-3.67) (2.02) rOTMPC oi -0.0017*** 0.0010*** (-3.47) (2.69) AdjustedR2 0.022 0.022 0.037 0.038 0.0524 0.0526 0.0712 0.0720 Observations 253,410 250,789 253,410 250,789 253,410 250,789 253,410 250,789 Controls Yes Yes Yes Yes Yes Yes Yes Yes Regressions Logit Logit Fama-Macbeth Fama-Macbeth 39 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 51,
    "chunk_index": 64,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "sisylanA oiloftroP :5 elbaT dna)WE(dethgiew-lauqeswohstI .oiloftropelicedCPMTOdenfierfoahplarotcaf-ruofdnanruterssecxeylhtnomstroperelbatsihT lov CPMTOr.CPMTOrhtnomtsalehtnodesabdeknareraskcotsehT .soiloftropelicedCPMTOrfosnruter)WV(dethgiew-eulav .)tseretni nepo ∆( emulov gnidart noitpo MTO yb dedivid )tseretni nepo ∆( emulov gnidart tup MTO sa denfied si )io CPMTOr( + + CPMTOr .htnom hcae fo yad gnidart tsal eht no MTO sa niamer taht snoitpo MTO eht esu ylno ew ,erusaem denfier eht roF ,eliced SO .e.i ,selbairav tekram noitpo no CPMTOr fo noisserger lanoitces-ssorc suoenaropmetnoc eht fo laudiser eht si laudiseR ecnamrofrep launna dna ylhtnom eht yalpsid swor eerht tsal eht ,ledom hcae roF .wekS dna ,SV ,LOVP∆ ,LOVC∆ ,tseretni trohS .sesehtnerap ni nwohs era scitsitats-t .egatnecrep ni deyalpsid era srebmun llA .)01−1( soiloftrop emertxe fo ygetarts trohs-gnol fo .ylevitcepser ,slevel %01 dna ,%5 ,%1 eht ta ecnacfiingis tneserper * dna ,** ,*** )21( )11( )01( )9( )8( )7( )6( )5( )4( )3( )2( )1( ioCPMTOr lovCPMTOr ioCPMTOr lovCPMTOr elbairaVgnitroS laudiseR laudiseR htnom1 htnom1 htnom1 htnom1 sdoirepgnicnalabeR rotcafruoF rotcafruoF rotcafruoF rotcafruoF rotcafruoF rotcafruoF ssecxE ssecxE rotcafruoF rotcafruoF ssecxE ssecxE :ahplA :ahplA :ahplA :ahplA :ahplA :ahplA :nruteR :nruteR :ahplA :ahplA :nruteR :nruteR eliceD WV WE WV WE WV WE WV WE WV WE WV WE **13.0 **43.0 ***24.0 ***73.0 ***64.0 ***15.0 ***32.1 ***73.1 ***44.0 ***15.0 ***91.1 ***63.1 )mottoB(1 )10.2( )24.2( )28.2( )26.2( )33.3( )34.3( )1.4( )20.4( )70.3( )82.3( )78.3( )49.3( **43.0 **73.0 **4.0 **23.0 **83.0 **4.0 ***30.1 ***62.1 ***94.0 **24.0 ***22.1 ***3.1 2 )3.2( )63.2( )55.2( )99.1( )20.2( )62.2( )92.3( )84.3( )41.3( )75.2( )61.4( )17.3( 81.0 *72.0 12.0 *3.0 *72.0 *42.0 ***59.0 ***50.1 2.0 *52.0 ***78.0 ***60.1 3 )3.1( )98.1( )34.1( )29.1( )38.1( )56.1( )12.3( )50.3( )72.1( )7.1( )77.2( )89.2( 71.0 1.0 41.0 90.0 41.0 60.0 ***28.0 **58.0 1.0 90.0 **67.0 **78.0 4 )42.1( )87.0( )79.0( )76.0( )21.1( )54.0( )7.2( )34.2( )87.0( )6.0( )65.2( )44.2( 60.0 20.0 31.0 60.0 20.0 10.0- **7.0 **18.0 71.0 50.0- ***78.0 **57.0 5 )34.0( )11.0( )11.1( )4.0( )12.0( )90.0-( )83.2( )3.2( )53.1( )73.0-( )38.2( )81.2( 80.0 10.0- 40.0- 20.0- 61.0 40.0 ***58.0 **98.0 50.0- 20.0- **26.0 **48.0 6 )67.0( )80.0-( )93.0-( )41.0-( )34.1( )23.0( )97.2( )35.2( )93.0-( )81.0-( )41.2( )24.2( 61.0- 20.0 71.0- 11.0- 61.0- 70.0- *95.0 **97.0 80.0- 80.0- **86.0 **67.0 7 )55.1-( )71.0( )85.1-( )48.0-( )4.1-( )65.0-( )29.1( )3.2( )58.0-( )56.0-( )22.2( )22.2( 0 80.0- 20.0 80.0- 30.0- 1.0- **67.0 **47.0 30.0 30.0- ***8.0 **68.0 8 )20.0( )16.0-( )71.0( )56.0-( )42.0-( )38.0-( )53.2( )71.2( )32.0( )32.0-( )26.2( )45.2( 61.0- *22.0- *52.0- 21.0- 0 1.0- ***58.0 **28.0 *52.0- 61.0- **26.0 **37.0 9 )72.1-( )38.1-( )68.1-( )69.0-( )40.0-( )77.0-( )87.2( )93.2( )48.1-( )33.1-( )79.1( )91.2( **82.0- **82.0- **72.0- ***23.0- ***14.0- ***83.0- 54.0 35.0 **13.0- ***73.0- *45.0 *65.0 )poT(01 )73.2-( )92.2-( )3.2-( )16.2-( )23.3-( )31.3-( )15.1( )6.1( )53.2-( )59.2-( )48.1( )86.1( ***95.0 ***26.0 ***96.0 ***96.0 ***68.0 ***9.0 ***87.0 ***58.0 ***57.0 ***88.0 ***56.0 ***18.0 01-1 )61.3( )55.4( )37.3( )5( )42.5( )1.6( )66.4( )77.5( )49.3( )25.5( )3.3( )10.5( 60.7 74.7 92.8 33.8 43.01 67.01 73.9 61.01 79.8 95.01 47.7 86.9 01-1dezilaunnA 40 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 51,
    "chunk_index": 65,
    "word_count": 480,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": ")15.1( )6.1( )53.2-( )59.2-( )48.1( )86.1( ***95.0 ***26.0 ***96.0 ***96.0 ***68.0 ***9.0 ***87.0 ***58.0 ***57.0 ***88.0 ***56.0 ***18.0 01-1 )61.3( )55.4( )37.3( )5( )42.5( )1.6( )66.4( )77.5( )49.3( )25.5( )3.3( )10.5( 60.7 74.7 92.8 33.8 43.01 67.01 73.9 61.01 79.8 95.01 47.7 86.9 01-1dezilaunnA 40 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 51,
    "chunk_index": 66,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "Table 6: Subsample Period Analysis This table reports the results of Fama and MacBeth (1973) regression of underlying stock return on month t+1 on refined OTM volume measures and other control variables on month t for different sub-periods. The sample period is 1996–2005 for models 1 and 2, and 2007–2015 for models 3 and 4. rOTMPC vol (rOTMPC oi) is defined as OTM put trading volume (∆ open interest) divided by total OTM option + trading volume (∆ open interest). For the refined measure, we only use the OTM options that remain as + OTMonthelasttradingdayofeachmonth. Eachregressionincludesthelog(firmsize), log(book-to-market ratio), momentum measure, Amihud (2002) illiquidity measure, lagged monthly return, OS decile, Short interest, ∆CVOL, ∆PVOL, VS, and Skew. The control variables are further described in Appendix A. t-statisticsareshowninparenthesesandarebasedonNeweyandWest(1987)adjustedstandarderrorswith four-month lags. ***, **, and * represent significance at the 1%, 5%, and 10% levels, respectively. (1) (2) (3) (4) Samples Year(1996,2006) Year(1996,2006) Year(2007,2015) Year(2007,2015) rOTMPC vol -0.0059*** -0.0043** (-3.79) (-2.13) rOTMPC oi -0.0060*** -0.0042** (-3.86) (-2.30) OSdecile 0.0001 0.0001 -0.0002 -0.0001 (0.17) (0.17) (-0.73) (-0.66) Shortinterest -0.0537*** -0.0543*** -0.0224** -0.0227** (-3.35) (-3.41) (-2.06) (-2.10) ∆CVOL 0.0387** 0.0417** -0.0199 -0.0216 (2.10) (2.13) (-1.30) (-1.47) ∆PVOL -0.0366* -0.0386* 0.0005 0.0027 (-1.69) (-1.71) (0.03) (0.18) VS 0.0515*** 0.0521*** 0.0605*** 0.0632*** (3.34) (3.34) (5.17) (5.39) Skew -0.0081 -0.0087 0.0014 0.0018 (-1.24) (-1.29) (0.15) (0.19) LogSize -0.0009 -0.0009 -0.0005 -0.0006 (-0.92) (-0.90) (-0.83) (-0.91) BM 0.0021*** 0.0022*** -0.0017 -0.0017 (2.75) (2.78) (-1.50) (-1.52) Momentum 0.0009 0.0008 0.0001 -0.0001 (0.20) (0.17) (0.01) (-0.01) Illiquidity -0.0129 -0.0021 -0.0647 -0.0904* (-0.28) (-0.04) (-1.60) (-1.84) Ret(0) -0.0209** -0.0216** 0.0017 0.0017 (-2.22) (-2.30) (0.14) (0.15) Constant 0.0256** 0.0260** 0.0121 0.0124 (2.46) (2.47) (1.32) (1.37) AdjustedR2 0.0659 0.0665 0.0566 0.0567 Observations 108,566 106,782 144,844 144,007 41 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 51,
    "chunk_index": 67,
    "word_count": 287,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "0.0008 0.0001 -0.0001 (0.20) (0.17) (0.01) (-0.01) Illiquidity -0.0129 -0.0021 -0.0647 -0.0904* (-0.28) (-0.04) (-1.60) (-1.84) Ret(0) -0.0209** -0.0216** 0.0017 0.0017 (-2.22) (-2.30) (0.14) (0.15) Constant 0.0256** 0.0260** 0.0121 0.0124 (2.46) (2.47) (1.32) (1.37) AdjustedR2 0.0659 0.0665 0.0566 0.0567 Observations 108,566 106,782 144,844 144,007 41 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 51,
    "chunk_index": 68,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "Table 7: Predictability of OTMPC around earnings surprises This table reports the regression results of earnings surprises on refined OTMPC. The dependent variables areSUE andCAR(0,5). SUE isthestandardunexplainedearningscalculatedbasedonIBESreported AF AF analyst forecasts and actual EPS. CAR(0,5) is the cumulative benchmark-adjusted return in the trading day window (t,t+5) centered at the earnings announcement date t. Value-weighted return of size and book-to-market quintile matched stocks is used as benchmark. The main independent variable is rOTMPC. rOTMPC vol (rOTMPC oi) is defined as OTM put trading volume (∆ open interest) divided by total + OTM option trading volume (∆ open interest). For the refined measure, we only use the OTM options + that remain as OTM on the last trading day of each month. All regressions include OS decile, Short interest, ∆CVOL, ∆PVOL, VS, and Skew. Model 1–4 include the log(firm size), log(book-to-market ratio), momentum measure, Amihud (2002) illiquidity measure, and lagged monthly return of the corresponding firm or stock as control variables. The control variables are further described in Appendix A. t-statistics are shown in parentheses, and are based on Newey and West (1987) adjusted standard errors with four-month lags. ***, **, and * represent significance at the 1%, 5%, and 10% levels, respectively. (1) (2) (3) (4) (5) (6) (7) (8) Variables SUE SUE SUE SUE CAR(0,5) CAR(0,5) CAR(0,5) CAR(0,5) AF AF AF AF rOTMPCvol -0.000850*** -0.000572*** -0.00273** -0.00549*** (-3.36) (-2.72) (-2.31) (-4.30) rOTMPCoi -0.000816*** -0.000544*** -0.00256** -0.00480*** (-3.59) (-3.08) (-2.25) (-3.93) OSdecile 0.0000127 -0.000112*** 0.0000108 -0.000114*** -0.000709*** -0.00112*** -0.000706*** -0.00112*** (0.23) (-3.34) (0.19) (-3.35) (-5.25) (-5.71) (-5.18) (-5.62) Shortinterest -0.00782** -0.00993*** -0.00783** -0.00992*** -0.0325*** -0.0311** -0.0330*** -0.0318** (-2.55) (-2.88) (-2.55) (-2.89) (-3.94) (-2.47) (-4.00) (-2.51) ∆CVOL -0.00254 0.00113 -0.00300 0.000930 -0.0181 -0.0284* -0.0170 -0.0264 (-0.75) (0.24) (-0.88) (0.19) (-1.18) (-1.70) (-1.09) (-1.55) ∆PVOL 0.000396 -0.00339 0.000941 -0.00310 0.0114 0.0173 0.0115 0.0170 (0.16) (-1.21) (0.37) (-1.07) (0.81) (1.13) (0.80) (1.10) VS 0.0146* 0.00818 0.0145* 0.00813 -0.0205 -0.0154 -0.0222 -0.0179 (1.94) (1.48) (1.92) (1.46) (-1.15) (-0.70) (-1.24) (-0.80) Skew -0.00101 -0.00115 -0.00110 -0.00121 -0.0211*** 0.00455 -0.0204*** 0.00515 (-0.81) (-0.91) (-0.87) (-0.94) (-3.56) (0.64) (-3.38) (0.72) Constant -0.00504*** -0.0163*** -0.00546*** -0.0165*** 0.0119 0.0104 0.00994 0.00960 (-2.68) (-5.20) (-2.75) (-5.12) (1.26) (0.90) (0.98) (0.77) AdjustedR2 68,936 68,936 68,246 68,246 70,219 70,219 69,512 69,512 Observations 0.008 0.306 0.008 0.305 0.004 0.024 0.004 0.024 Firmfixedeffect No Yes No Yes No Yes No Yes Timefixedeffect Yes Yes Yes Yes Yes Yes Yes Yes StockChar. Controls Yes Yes Yes Yes No No No No 42 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 51,
    "chunk_index": 69,
    "word_count": 411,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "68,936 68,246 68,246 70,219 70,219 69,512 69,512 Observations 0.008 0.306 0.008 0.305 0.004 0.024 0.004 0.024 Firmfixedeffect No Yes No Yes No Yes No Yes Timefixedeffect Yes Yes Yes Yes Yes Yes Yes Yes StockChar. Controls Yes Yes Yes Yes No No No No 42 Electronic copy available at: https://ssrn.com/abstract=2803724 Table 8: Predictability of OTMPC on M&A target events This table compares refined OTMPC between M&A target companies and matched companies for 8467 M&A cases from 1996 through 2015. Matched stocks are located in the same Fama-French 49 industries and size quintiles. M&A announcement takes place in month t. The table displays the mean of rOTMPC for target and matched firms, as well as the difference and its t-statistics in months ranging from t−8 to t+2. rOTMPC vol(rOTMPC oi)isdefinedasOTMput∆openinterest(tradingvolume)dividedbyOTM option∆openinterest(tradingvolume). Fortherefinedmeasure, weonlyusetheOTMoptionsthatremain as OTM on the last trading day of each month. t-statistics of difference are shown in parentheses. rOTMPC vol rOTMPC oi Month Diff. t-stat Diff. t-stat Target Matched Target Matched t-8 0.461 0.46 0.001 (0.319) 0.482 0.48 0.001 (0.324) t-7 0.457 0.461 -0.004 (-1.296) 0.477 0.481 -0.004 (-1.1) t-6 0.457 0.459 -0.001 (-0.416) 0.477 0.48 -0.003 (-0.903) t-5 0.451 0.461 -0.009 (-3.089) 0.477 0.481 -0.005 (-1.382) t-4 0.452 0.458 -0.006 (-1.881) 0.469 0.477 -0.008 (-2.363) t-3 0.448 0.458 -0.009 (-3.036) 0.471 0.478 -0.008 (-2.347) t-2 0.431 0.452 -0.021 (-7.061) 0.455 0.474 -0.019 (-5.801) t-1 0.426 0.45 -0.024 (-7.971) 0.452 0.471 -0.02 (-6.034) t 0.482 0.455 0.027 (8.686) 0.507 0.477 0.03 (9.142) t+1 0.474 0.455 0.018 (5.805) 0.491 0.476 0.015 (4.497) t+2 0.478 0.458 0.021 (6.454) 0.498 0.478 0.02 (5.784) 43 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 51,
    "chunk_index": 70,
    "word_count": 267,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "0.431 0.452 -0.021 (-7.061) 0.455 0.474 -0.019 (-5.801) t-1 0.426 0.45 -0.024 (-7.971) 0.452 0.471 -0.02 (-6.034) t 0.482 0.455 0.027 (8.686) 0.507 0.477 0.03 (9.142) t+1 0.474 0.455 0.018 (5.805) 0.491 0.476 0.015 (4.497) t+2 0.478 0.458 0.021 (6.454) 0.498 0.478 0.02 (5.784) 43 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 51,
    "chunk_index": 71,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "Appendix Variable definitions and more results Table A1: Variable definitions Thistableprovidesabriefdescriptionofthevariablesusedinthisstudy. Variablesaresortedinalphabetical order. Variable name Description ∆ open interest Monthly open interest increment. We first find the monthly sum of daily changes in + open interest for each option contract in the month. We then compute a net “increase” in open interest of each contract. OTMPC vol (Sum of OTM puts trading volume) / (Sum of OTM options trading volume), for which OTM options satisfy 0.02 <option delta≤ 0.375 for calls and −0 : 375 <option delta≤ −0 : 02 for puts. Sum is monthly aggregate of the daily trading volume, that satisfy the moneyness condition on the day, in the month. OTMPC oi (Sum of OTM puts ∆ open interest) / (Sum of OTM options ∆ open interest), for + + which OTM options satisfy 0.02 <option delta≤ 0.375 for calls and −0.375 <option delta≤ −0.02 for puts. Sum is monthly aggregate of the daily ∆ open interest, that + satisfy the moneyness condition on the day, in the month. rOTMPC vol (Sum of OTM puts trading volume) / (Sum of OTM options trading volume), for which OTM options satisfy 0.02 <option delta≤ 0.375 for calls and −0 : 375 <option delta≤ −0 : 02 for puts. Sum is monthly aggregate of the daily trading volume, that satisfy the moneyness condition on the day, in the month. We exclude the options that fall into NTM or ITM on the last trading day of each month. rOTMPC oi (Sum of OTM puts ∆ open interest) / (Sum of OTM options ∆ open interest), for + + which OTM options satisfy 0.02 <option delta≤ 0.375 for calls and −0.375 <option delta≤ −0.02 for puts. Sum is monthly aggregate of the daily ∆ open interest, that + satisfy the moneyness condition on the day, in the month. We exclude the options that fall into NTM or ITM on the last trading day of each month. AITMPC (Sum of puts trading volume (∆ open interest)) / (Sum of options trading volume + (∆ open interest)), for which OTM options satisfy 0.5 <option delta≤ 0.98 for calls + and−0.98<optiondelta≤−0.5forputs. Sumismonthlyaggregateofthedaily∆ open + interest (volume). OS decile OS is the option volume to stock volume ratio as in Johnson and So (2012). OS decile is collected monthly. 1st (10th) decile contains options with the lowest (highest) OS. Skew The difference between the implied volatilities of OTM puts and ATM calls in Xing et al. (2010). VS Volatility spread, defined as the aggregated difference between call and put implied volatilities for same maturity and strike price, in Cremers and Weinbaum (2010). ∆CVOL Monthly change in the implied volatility of at-the-money call with time to maturity of 30 calendar days. ∆PVOL Monthly change in the implied volatility of at-the-money put with time to maturity of 30 calendar days. Short interest Supplementary Compustat short interest. 44 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 51,
    "chunk_index": 72,
    "word_count": 483,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "Weinbaum (2010). ∆CVOL Monthly change in the implied volatility of at-the-money call with time to maturity of 30 calendar days. ∆PVOL Monthly change in the implied volatility of at-the-money put with time to maturity of 30 calendar days. Short interest Supplementary Compustat short interest. 44 Electronic copy available at: https://ssrn.com/abstract=2803724 Table A1: Variable definitions (cont.) Thistableprovidesabriefdescriptionofthevariablesusedinthisstudy. Variablesaresortedinalphabetical order. Variable name Description CAR(0,5) The cumulative benchmark-adjusted return in (0,5) trading day window around earn- ings announcement dates. Value-weighted return of size and book-to-market quintile matched stocks is used as benchmark. Illiquidity The ratio of absolute daily stock return to daily dollar trading volume, averaged over the prior six months. Log BM Naturallogarithmofbooktomarketratio,i.e.,bookequityforthefiscalyearendingin calendar year t−1 divided by the market equity at the end of December of t−1. Both book and market equity is calculated based on Fama and French (1993). Log size Natural logarithm of firm size, i.e., the number of shares outstanding times the closing price. MAX The maximum daily return over the past one month. Momentum The previous six month cumulative return. SUE ThestandardunexplainedearningsbasedonIBESreportedanalystforecastsandactual AF EPS, calculated as actual EPS minus most recent consensus EPS divided by its share price. SUE The standard unexplained earnings based on last quarters earnings, calculated as EPS ER of this quarter minus EPS of last quarter divided by its share price. Monthly lag return The monthly raw return of underlying stocks, one month lagged to dependent variable. 45 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 45,
    "page_range": "p.45-46",
    "total_pages": 51,
    "chunk_index": 73,
    "word_count": 240,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.45-46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "price. SUE The standard unexplained earnings based on last quarters earnings, calculated as EPS ER of this quarter minus EPS of last quarter divided by its share price. Monthly lag return The monthly raw return of underlying stocks, one month lagged to dependent variable. 45 Electronic copy available at: https://ssrn.com/abstract=2803724 Table A2: Cross-sectional regression of OTMPC This table reports the results of Fama and MacBeth (1973) regressions of OTMPC in month t on option market variables and short interest of the underlying stock in month t or t−1. The dependent variable is OTMPC (rOTMPC), defined as OTM put trading volume (∆ open interest) divided by OTM option + trading volume (∆ open interest). For the refined measure, we only use the OTM options that remain as + OTM on the last trading day of each month. The independent variables include OS decile, Short interest, ∆CVOL,∆PVOL,VS,andSkew. ThecontrolvariablesarefurtherdescribedinAppendixA.t-statisticsare shown in parentheses, and are based on Newey and West (1987) adjusted standard errors with four-month lags. ***, **, and * represent significance at the 1%, 5%, and 10% levels, respectively. (1) (2) (3) (4) (5) (6) (7) (8) Dependentvariable OTMPCvol OTMPCvol OTMPCoi OTMPCoi rOTMPCvol rOTMPCvol rOTMPCoi rOTMPCoi Independentvariables t t-1 t t-1 t t-1 t t-1 OSdecile 0.0083*** 0.0057*** 0.0094*** 0.0072*** 0.0080*** 0.0050*** 0.0093*** 0.0065*** (13.95) (11.95) (14.09) (14.31) (12.49) (9.57) (12.97) (12.35) Shortinterest 0.2322*** 0.2470*** 0.2869*** 0.2963*** 0.1325*** 0.1688*** 0.1628*** 0.2026*** (8.02) (8.86) (9.48) (10.45) (4.22) (5.62) (5.53) (7.19) ∆CVOL -0.0151 -0.0753** -0.0370 -0.0030 -0.2907*** -0.0884** -0.3162*** -0.0386 (-0.39) (-2.29) (-1.25) (-0.09) (-6.92) (-2.36) (-8.70) (-0.99) ∆PVOL 0.0039 -0.0219 0.1163*** -0.0420 0.1115** -0.0181 0.2305*** -0.0175 (0.11) (-0.73) (3.67) (-1.26) (2.50) (-0.50) (5.85) (-0.45) VS -0.5933*** -0.3695*** -0.4224*** -0.2759*** -0.7326*** -0.3652*** -0.5763*** -0.2652*** (-7.64) (-6.66) (-5.97) (-5.23) (-9.43) (-6.22) (-8.42) (-4.78) Skew -0.1259*** -0.1541*** -0.1774*** -0.2056*** -0.1413*** -0.1368*** -0.1884*** -0.1925*** (-5.29) (-7.02) (-7.44) (-8.61) (-4.95) (-5.46) (-6.83) (-7.45) Constant 0.3935*** 0.4117*** 0.4077*** 0.4240*** 0.4214*** 0.4376*** 0.4339*** 0.4497*** (57.70) (72.14) (65.03) (81.22) (48.74) (56.71) (54.67) (65.70) R2 0.0372 0.0275 0.0357 0.0276 0.0327 0.0218 0.0311 0.0222 AdjustedR2 0.0307 0.0209 0.0291 0.0210 0.0261 0.0151 0.0243 0.0153 Observations 239,436 239,436 237,195 237,195 237,203 237,203 233,566 233,566 46 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 51,
    "chunk_index": 74,
    "word_count": 355,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "Constant 0.3935*** 0.4117*** 0.4077*** 0.4240*** 0.4214*** 0.4376*** 0.4339*** 0.4497*** (57.70) (72.14) (65.03) (81.22) (48.74) (56.71) (54.67) (65.70) R2 0.0372 0.0275 0.0357 0.0276 0.0327 0.0218 0.0311 0.0222 AdjustedR2 0.0307 0.0209 0.0291 0.0210 0.0261 0.0151 0.0243 0.0153 Observations 239,436 239,436 237,195 237,195 237,203 237,203 233,566 233,566 46 Electronic copy available at: https://ssrn.com/abstract=2803724 Table A3: OTMPC and Skew for lottery stocks This table reports OTMPC (rOTMPC) and Skew of portfolios based on the maximum daily return over the past one month (MAX) following Bali et al. (2011). It shows equal-weighted OTMPC (rOTMPC) and Skew of MAX decile portfolios. OTMPC vol (OTMPC oi) is defined as OTM put trading volume (∆ open + interest)dividedbyOTMoptiontradingvolume(∆ openinterest). Fortherefinedmeasure(rOTMPC),we + only use the OTM options that remain as OTM on the last trading day of each month. Skew is the implied volatilityskew,i.e. thedifferencebetweentheimpliedvolatilitiesofOTMputsandATMcallsfollowingXing et al. (2010). For each model, the last row display the difference of option measures for Top and Bottom decile portfolios (10−1). t-statistics are shown in parentheses. ***, **, and * represent significance at the 1%, 5%, and 10% levels, respectively. (1) (2) (3) (4) (5) MAXDecile OTMPC vol OTMPC oi rOTMPC vol rOTMPC oi Skew 1(Bottom) 0.432 0.448 0.456 0.472 0.103 2 0.436 0.451 0.456 0.472 0.092 3 0.446 0.462 0.468 0.484 0.089 4 0.449 0.465 0.468 0.484 0.088 5 0.458 0.474 0.477 0.493 0.086 6 0.455 0.472 0.475 0.490 0.085 7 0.458 0.474 0.476 0.492 0.084 8 0.458 0.475 0.476 0.492 0.084 9 0.465 0.480 0.482 0.497 0.083 10(Top) 0.477 0.491 0.494 0.507 0.085 10-1 0.044*** 0.043*** 0.039*** 0.035*** -0.018*** (19.76) (17.65) (15.16) (13.03) (-23.97) 47 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 51,
    "chunk_index": 75,
    "word_count": 269,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "0.477 0.493 0.086 6 0.455 0.472 0.475 0.490 0.085 7 0.458 0.474 0.476 0.492 0.084 8 0.458 0.475 0.476 0.492 0.084 9 0.465 0.480 0.482 0.497 0.083 10(Top) 0.477 0.491 0.494 0.507 0.085 10-1 0.044*** 0.043*** 0.039*** 0.035*** -0.018*** (19.76) (17.65) (15.16) (13.03) (-23.97) 47 Electronic copy available at: https://ssrn.com/abstract=2803724 Online Appendix Additional tables 48 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 48,
    "page_range": "p.48-49",
    "total_pages": 51,
    "chunk_index": 76,
    "word_count": 60,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.48-49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "0.458 0.474 0.476 0.492 0.084 8 0.458 0.475 0.476 0.492 0.084 9 0.465 0.480 0.482 0.497 0.083 10(Top) 0.477 0.491 0.494 0.507 0.085 10-1 0.044*** 0.043*** 0.039*** 0.035*** -0.018*** (19.76) (17.65) (15.16) (13.03) (-23.97) 47 Electronic copy available at: https://ssrn.com/abstract=2803724 Online Appendix Additional tables 48 Electronic copy available at: https://ssrn.com/abstract=2803724 oitar tekram-ot-koob dna ezis mrfi fo scitsitats yrammuS :1AO elbaT smrfi eht fo oitar eulav tekram-ot-koob dna ,noitazilatipac tekram latot ,.e.i ,ezis mrfi fo scitsitats yrammus eht stneserp elbat sihT .yduts siht ni doirep elpmas 5102–6991 eht gnirud ,ylevitcepser ,esabatad PSRC dna elpmas ruo ni oitartekram-ot-kooB )srallodnoillimni(ezismriF PSRC elpmaS PSRC elpmaS smrfifo# raeY naideM .ved .dtS naeM naideM .ved .dtS naeM naideM .ved .dtS naeM naideM .ved .dtS naeM 55.0 07.0 96.0 83.0 45.0 94.0 26.98 64.450,4 53.578 80.787 41.027,7 72.799,2 875,1 6991 15.0 78.0 66.0 93.0 78.0 15.0 58.401 81.300,5 36.999 48.047 86.231,9 63.831,3 209,1 7991 74.0 75.0 6.0 73.0 05.0 64.0 10.221 05.659,6 29.813,1 87.718 57.141,21 68.508,3 401,2 8991 55.0 97.0 37.0 04.0 25.0 25.0 47.711 00.900,01 98.856,1 84.918 55.191,71 03.266,4 101,2 9991 95.0 68.0 87.0 53.0 06.0 05.0 6.631 66.838,31 97.251,2 91.241,1 93.389,32 64.371,6 310,2 0002 86.0 90.2 80.1 93.0 27.0 65.0 47.221 52.176,51 60.593,2 07.312,1 39.959,72 54.413,7 528,1 1002 56.0 82.1 39.0 24.0 75.0 65.0 22.251 71.847,31 02.612,2 52.541,1 11.513,32 72.371,6 367,1 2002 7.0 90.1 69.0 35.0 26.0 76.0 77.541 55.061,11 42.659,1 95.910,1 18.933,81 54.002,5 137,1 3002 45.0 26.0 86.0 34.0 44.0 45.0 33.942 36.470,31 07.684,2 42.312,1 08.123,02 91.409,5 938,1 4002 74.0 44.0 65.0 04.0 83.0 84.0 14.323 11.403,41 30.948,2 10.904,1 80.155,12 43.233,6 349,1 5002 5.0 54.0 75.0 14.0 63.0 84.0 73.243 09.952,41 23.930,3 67.293,1 63.328,02 22.693,6 720,2 6002 84.0 93.0 55.0 04.0 63.0 84.0 74.204 39.028,51 29.024,3 01.584,1 81.143,22 00.467,6 341,2 7002 55.0 76.0 66.0 34.0 64.0 45.0 47.963 21.238,61 16.516,3 23.225,1 65.055,32 34.591,7 580,2 8002 18.0 28.1 62.1 46.0 21.1 78.0 1.142 30.448,21 19.545,2 32.530,1 49.661,81 80.131,5 859,1 9002 47.0 50.1 1 85.0 86.0 37.0 53.392 17.843,31 99.169,2 98.951,1 55.410,81 72.794,5 910,2 0102 46.0 96.0 87.0 25.0 74.0 16.0 70.604 45.782,51 37.695,3 44.763,1 09.311,02 23.023,6 380,2 1102 17.0 79.0 39.0 65.0 95.0 07.0 70.714 75.994,61 11.357,3 50.773,1 18.735,12 67.474,6 350,2 2102 76.0 9.0 48.0 55.0 15.0 76.0 3.294 50.888,91 80.093,4 08.833,1 38.248,42 41.598,6 451,2 3102 35.0 66.0 56.0 54.0 73.0 35.0 24.337 60.756,22 77.619,5 76.897,1 65.062,72 09.337,8 941,2 4102 25.0 97.0 86.0 24.0 14.0 25.0 14.697 53.869,52 91.768,6 65.211,2 23.087,13 10.085,01 239,1 5102 49 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 49,
    "page_range": "p.49",
    "total_pages": 51,
    "chunk_index": 77,
    "word_count": 405,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "350,2 2102 76.0 9.0 48.0 55.0 15.0 76.0 3.294 50.888,91 80.093,4 08.833,1 38.248,42 41.598,6 451,2 3102 35.0 66.0 56.0 54.0 73.0 35.0 24.337 60.756,22 77.619,5 76.897,1 65.062,72 09.337,8 941,2 4102 25.0 97.0 86.0 24.0 14.0 25.0 14.697 53.869,52 91.768,6 65.211,2 23.087,13 10.085,01 239,1 5102 49 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 51,
    "chunk_index": 78,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "Table OA2: OTMPC and large stock price changes This table reports the results of logistic and Fama and MacBeth (1973) regressions of the variables related to the magnitude of underlying stock returns in month t+1 on monthly refined OTMPC and other control variables in month t. The following sets of dependent variables are employed: (1) large price increase (resp. decrease) dummy, whose value is one if the return in month t+1 is greater (resp. less) than 10% (resp. -10%), and zero otherwise; and (2) the ratio of 10% OTM calls (resp. OTM puts) pay-off to the current stock price, whose value is max(ret −0.1, 0) (resp. (max(−0.1−ret , 0))). The main independent t+1 t+1 variables are monthly demeaned and normal OTMPC. OTMPC vol (OTMPC oi) is defined as OTM put trading volume (∆ open interest) divided by OTM option trading volume (∆ open interest). Demeaned + + OTMPCisOTMPCminusthecross-sectionalmeanofOTMPC.Thecontrolvariablesincludelog(firmsize), log(book-to-marketratio),momentummeasure,illiquiditymeasureofAmihud(2002),laggedmonthlyreturn, OS decile, Short interest, ∆CVOL, ∆PVOL, VS, and Skew. The control variables are further described in Appendix A. t-statistics are shown in parentheses. For Model 5–8, t-statistics are based on Newey and West (1987) adjusted standard errors with four-month lags. ***, **, and * represent significance at the 1%, 5%, and 10% levels, respectively. (1) (2) (3) (4) (5) (6) (7) (8) Dep. variables Large increase Large decrease Call pay-off Put pay-off (ret >10%) (ret <−10%) max(ret −0.1, 0) max(−0.1−ret , 0) t+1 t+1 t+1 t+1 Demeaned OTMPC vol -0.0131 0.0192 (-0.59) (0.79) Demeaned OTMPC oi 0.00881 0.0511** (0.43) (2.29) OTMPC vol -0.0017*** 0.0002 (-3.24) (0.62) OTMPC oi -0.0012** 0.0008** (-2.35) (2.45) Adjusted R2 0.022 0.022 0.037 0.037 0.0518 0.0519 0.0706 0.0713 Observations 255,216 253,548 255,216 253,548 255,216 255,216 255,216 255,216 Controls Yes Yes Yes Yes Yes Yes Yes Yes Regressions Logit Logit Fama-Macbeth Fama-Macbeth 50 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 51,
    "chunk_index": 79,
    "word_count": 300,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "vol -0.0017*** 0.0002 (-3.24) (0.62) OTMPC oi -0.0012** 0.0008** (-2.35) (2.45) Adjusted R2 0.022 0.022 0.037 0.037 0.0518 0.0519 0.0706 0.0713 Observations 255,216 253,548 255,216 253,548 255,216 255,216 255,216 255,216 Controls Yes Yes Yes Yes Yes Yes Yes Yes Regressions Logit Logit Fama-Macbeth Fama-Macbeth 50 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 51,
    "page_range": "p.51",
    "total_pages": 51,
    "chunk_index": 80,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.51)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "Table OA3: OTMPC and earnings surprises This table reports the regression results of earnings surprise on OTMPC. The dependent variables are SUE and CAR(0,5). SUE is the standard unexplained earnings calculated based on IBES reported AF AF analyst forecasts and actual EPS. CAR(i,j) is the cumulative benchmark-adjusted return in the trading day window (t + i,t + j) centered at the earnings announcement date t. Value-weighted return of size and book-to-market quintile matched stocks is used as benchmark. The main independent variables are monthly OTMPC. OTMPC vol (OTMPC oi) is defined as OTM put trading volume (∆ open interest) + divided by total OTM option trading volume (∆ open interest). All regressions include OS decile, Short + interest, ∆CVOL, ∆PVOL, VS, and Skew. Model 1–4 include the log(firm size), log(book-to-market ratio), momentum measure, Amihud (2002) illiquidity measure, and lagged monthly return of the corresponding firm or stock as control variables. The control variables are further described in Appendix A. t-statistics are shown in parentheses, and are based on Newey and West (1987) adjusted standard errors with four-month lags. ***, **, and * represent significance at the 1%, 5%, and 10% levels, respectively. (1) (2) (3) (4) (5) (6) (7) (8) Variables SUE SUE SUE SUE CAR(0,5) CAR(0,5) CAR(0,5) CAR(0,5) AF AF AF AF OTMPCvol -0.000914*** -0.000643*** 0.000451 -0.00343** (-3.53) (-3.63) (0.35) (-2.51) OTMPCoi -0.000873*** -0.000701*** -0.000941 -0.00397*** (-3.80) (-4.22) (-0.78) (-3.09) OSdecile 0.0000158 -0.000108*** 0.0000149 -0.000109*** -0.000777*** -0.00118*** -0.000764*** -0.00116*** (0.28) (-3.20) (0.27) (-3.20) (-5.98) (-6.20) (-5.85) (-6.04) Shortinterest -0.00778** -0.00978*** -0.00786** -0.00982*** -0.0330*** -0.0288** -0.0329*** -0.0299** (-2.55) (-2.84) (-2.57) (-2.85) (-4.08) (-2.40) (-4.07) (-2.48) ∆CVOL -0.00270 0.000960 -0.00294 0.000728 -0.0170 -0.0197 -0.0168 -0.0187 (-0.84) (0.21) (-0.90) (0.16) (-1.20) (-1.29) (-1.18) (-1.21) ∆PVOL 0.000480 -0.00318 0.000712 -0.00292 0.0106 0.00950 0.0113 0.00973 (0.20) (-1.26) (0.29) (-1.14) (0.80) (0.67) (0.85) (0.68) VS 0.0146** 0.00855 0.0145* 0.00841 -0.0183 -0.0165 -0.0204 -0.0198 (1.98) (1.49) (1.95) (1.46) (-1.14) (-0.83) (-1.27) (-1.00) Skew -0.000814 -0.000917 -0.000924 -0.000956 -0.0200*** 0.00598 -0.0199*** 0.00582 (-0.67) (-0.75) (-0.76) (-0.78) (-3.66) (0.92) (-3.61) (0.89) Constant -0.00507*** -0.0164*** -0.00523*** -0.0164*** 0.0122 0.0115 0.0108 0.0113 (-2.70) (-5.22) (-2.74) (-5.19) (1.38) (1.08) (1.22) (1.06) AdjustedR2 69,369 69,369 68,939 68,939 74,917 74,917 74,417 74,417 Observations 0.008 0.305 0.008 0.305 0.004 0.025 0.004 0.025 Firmfixedeffect No Yes No Yes No Yes No Yes Timefixedeffect Yes Yes Yes Yes Yes Yes Yes Yes StockChar. Controls Yes Yes Yes Yes No No No No 51 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 51,
    "page_range": "p.51",
    "total_pages": 51,
    "chunk_index": 81,
    "word_count": 402,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.51)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  },
  {
    "text": "69,369 68,939 68,939 74,917 74,917 74,417 74,417 Observations 0.008 0.305 0.008 0.305 0.004 0.025 0.004 0.025 Firmfixedeffect No Yes No Yes No Yes No Yes Timefixedeffect Yes Yes Yes Yes Yes Yes Yes Yes StockChar. Controls Yes Yes Yes Yes No No No No 51 Electronic copy available at: https://ssrn.com/abstract=2803724",
    "title": "Informed Trading of Out - of - the - Money Options and Market Efficiency",
    "source_type": "pdf",
    "document_id": "aa6d0c55ae2a",
    "source_file": "Informed Trading of Out-of-the-Money Options and Market Efficiency.pdf",
    "section": "References",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 51,
    "chunk_index": 82,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210314165215+09'00'",
    "duration": null
  }
]