[
  {
    "text": "INTEREST RECEIVED BY BANKS DURING THE FINANCIAL CRISIS: LIBOR VS HYPOTHETICAL SOFR LOANS Urban Jermann Working Paper 29614 http://www.nber.org/papers/w29614 NATIONAL BUREAU OF ECONOMIC RESEARCH 1050 Massachusetts Avenue Cambridge, MA 02138 December 2021 I am grateful for comments from Darrell Duffie, Andrei Magasiner, Michael Roberts and Michael Schwert. The views expressed herein are those of the author and do not necessarily reflect the views of the National Bureau of Economic Research. NBER working papers are circulated for discussion and comment purposes. They have not been peer-reviewed or been subject to the review by the NBER Board of Directors that accompanies official NBER publications. © 2021 by Urban Jermann. All rights reserved. Short sections of text, not to exceed two paragraphs, may be quoted without explicit permission provided that full credit, including © notice, is given to the source. Interest Received by Banks during the Financial Crisis: LIBOR vs Hypothetical SOFR Loans Urban Jermann NBER Working Paper No. 29614 December 2021 JEL No. E43,G21,G28 ABSTRACT The credit sensitivity of LIBOR helped lenders during the financial crisis. SOFR is not credit- sensitive and would not have provided that support. The cumulative additional interest from LIBOR during the crisis is estimated to be between 1% to 2% of the notional amount of outstanding loans, depending on the tenor and type of SOFR rate used. The amount of LIBOR business loans owned by banks could have been as high as about 2trn, and the overall additional interest income banks received thanks to LIBOR could have been as high as 30bn dollars. The analysis also shows that a compounded SOFR reduces insurance relative to a term SOFR. Urban Jermann Finance Department The Wharton School of the University of Pennsylvania 3620 Locust Walk Philadelphia, PA 19104 and NBER jermann@wharton.upenn.edu",
    "title": "Interest Received by Banks during the Financial Crisis: LIBOR vs Hypothetical SOFR Loans",
    "source_type": "pdf",
    "document_id": "e7a1b5b5f996",
    "source_file": "INTEREST RECEIVED BY BANKS DURING THE FINANCIAL CRISIS LIBOR vs Hypothetical SOFR_Jermann - December 2021.pdf",
    "section": "NBER WORKING PAPER SERIES",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 19,
    "chunk_index": 0,
    "word_count": 292,
    "author": "Urban Jermann",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "NBER WORKING PAPER SERIES (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211221095037-05'00'",
    "duration": null
  },
  {
    "text": "income banks received thanks to LIBOR could have been as high as 30bn dollars. The analysis also shows that a compounded SOFR reduces insurance relative to a term SOFR. Urban Jermann Finance Department The Wharton School of the University of Pennsylvania 3620 Locust Walk Philadelphia, PA 19104 and NBER jermann@wharton.upenn.edu Interest Received by Banks during the Financial Crisis: LIBOR vs Hypothetical SOFR Loans Urban Jermann (cid:3) Wharton School of the University of Pennsylvania and NBER December 21, 2021 Abstract The credit sensitivity of LIBOR helped lenders during the (cid:133)nancial crisis. SOFR is not credit-sensitive and would not have provided that support. The cumulative additional interest from LIBOR during the crisis is estimated to be between 1% to 2% ofthenotionalamountofoutstandingloans, dependingonthetenorandtypeofSOFR rate used. The amount of LIBOR business loans owned by banks could have been as high as about 2trn, and the overall additional interest income banks received thanks to LIBOR could have been as high as 30bn dollars. The analysis also shows that a compounded SOFR reduces insurance relative to a term SOFR. Keywords: LIBOR, SOFR, (cid:133)nancial crisis. JEL: G21, G28, E43. 1 Introduction LIBOR increased relative to risk-free rates during the (cid:133)nancial crises. Lenders with out- standing loans indexed to LIBOR received additional income relative to what a risk-free rate like SOFR would have paid. This additional income hedged banks(cid:146)increased funding costs and more generally provided support in a time of large losses. As USD LIBOR, and other IBORs, are replaced by reference rates that mostly do not include a term bank credit premium, it is important to understandthe potential consequences of sucha transition. This paper presents estimates of how much the credit sensitivity of LIBOR helped lenders during the (cid:133)nancial crisis. IamgratefulforcommentsfromDarrellDu¢ e,AndreiMagasiner,MichaelRobertsandMichaelSchwert. (cid:3) Email: jermann@wharton.upenn.edu. 1",
    "title": "Interest Received by Banks during the Financial Crisis: LIBOR vs Hypothetical SOFR Loans",
    "source_type": "pdf",
    "document_id": "e7a1b5b5f996",
    "source_file": "INTEREST RECEIVED BY BANKS DURING THE FINANCIAL CRISIS LIBOR vs Hypothetical SOFR_Jermann - December 2021.pdf",
    "section": "NBER WORKING PAPER SERIES",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 19,
    "chunk_index": 1,
    "word_count": 289,
    "author": "Urban Jermann",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "NBER WORKING PAPER SERIES (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211221095037-05'00'",
    "duration": null
  },
  {
    "text": "IBORs, are replaced by reference rates that mostly do not include a term bank credit premium, it is important to understandthe potential consequences of sucha transition. This paper presents estimates of how much the credit sensitivity of LIBOR helped lenders during the (cid:133)nancial crisis. IamgratefulforcommentsfromDarrellDu¢ e,AndreiMagasiner,MichaelRobertsandMichaelSchwert. (cid:3) Email: jermann@wharton.upenn.edu. 1",
    "title": "Interest Received by Banks during the Financial Crisis: LIBOR vs Hypothetical SOFR Loans",
    "source_type": "pdf",
    "document_id": "e7a1b5b5f996",
    "source_file": "INTEREST RECEIVED BY BANKS DURING THE FINANCIAL CRISIS LIBOR vs Hypothetical SOFR_Jermann - December 2021.pdf",
    "section": "NBER WORKING PAPER SERIES",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 19,
    "chunk_index": 2,
    "word_count": 50,
    "author": "Urban Jermann",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "NBER WORKING PAPER SERIES (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211221095037-05'00'",
    "duration": null
  },
  {
    "text": "In 2017, the Financial Conduct Authority (FCA) announced that by the end of 2021 market participants should have replaced LIBOR by an alternative reference rate (Bailey, 2017). LIBOR is phased out as a reference rate because the wholesale bank funding markets underlyingitarenotactiveenoughtosupportatransactions-baseddeterminationofLIBOR. The Secured Overnight Financing Rate (SOFR) has been recommended as the alternative to USD LIBOR by the Alternative Reference Rates Committee (ARRC), the group of market participants convened by U.S. regulators to guide the transition away from LIBOR. At the end 2021, SOFR has replaced LIBOR for the majority of new (cid:133)nancial contracts. The lack of credit sensitivity in SOFR is recognized as a potential disadvantage for bank loans to businesses. Bloomberg(cid:146)s Short-Term Bank Yield Index (BSBY) has been developed as an alternative to SOFR. Like LIBOR, BSBY includes a term credit premium. Regulators have been critical of BSBY believing that it would share LIBOR(cid:146)s lack of robustness. It remains to be seen how widely BSBY or other credit-sensitive rates such as AMERIBOR or AXI will be used. For users who prefer a forward-looking term rate to compounding SOFR daily over one month or three months, term SOFR rates based on CME futures have become available in the second half of 2021. It remains to be seen how widely term SOFR rates will be used. In this paper, I consider the counterfactual that business loans would have been indexed to a SOFR-based reference rate during the (cid:133)nancial crisis. For the period from July 2007 to June 2009, which broadly covers the (cid:133)nancial crisis, 1-month and 3-month LIBOR paid signi(cid:133)cantly more interest than hypothetical SOFR rates based on Overnight Treasury Repo or Overnight Index Swap rates. I estimate that only a small fraction of this di⁄erence would have been priced into SOFR loans. Based on that, I (cid:133)nd that the cumulative additional interest from LIBOR was about 1% to 2% of the notional amount of outstanding loans, depending on the tenor and type of SOFR rate used. I (cid:133)nd that the amount of LIBOR business loans owned by banks could have been as high as about 2trn dollars, and that the overall additional interest income banks received thanks to LIBOR could have been as high as 30bn dollars. The analysis also shows that a compounded SOFR would have worsened the lack of insurance relative to term SOFR. This is due to the fact that emergency interest rate cuts during crisis periods a⁄ect loan payments faster with compounded rates, because payments are based on more recently determined rates than term rates. This identi(cid:133)es an another drawback of using compounded SOFR, in addition to the inconvenience of not knowing the rate until shortly before interest payments are due. An additional contribution of the paper is to provide an estimate of the risk premium that would have been added to a SOFR loan relative to a LIBOR loan. LIBOR rates have 2",
    "title": "Interest Received by Banks during the Financial Crisis: LIBOR vs Hypothetical SOFR Loans",
    "source_type": "pdf",
    "document_id": "e7a1b5b5f996",
    "source_file": "INTEREST RECEIVED BY BANKS DURING THE FINANCIAL CRISIS LIBOR vs Hypothetical SOFR_Jermann - December 2021.pdf",
    "section": "NBER WORKING PAPER SERIES",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 19,
    "chunk_index": 3,
    "word_count": 480,
    "author": "Urban Jermann",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "NBER WORKING PAPER SERIES (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211221095037-05'00'",
    "duration": null
  },
  {
    "text": "in addition to the inconvenience of not knowing the rate until shortly before interest payments are due. An additional contribution of the paper is to provide an estimate of the risk premium that would have been added to a SOFR loan relative to a LIBOR loan. LIBOR rates have 2",
    "title": "Interest Received by Banks during the Financial Crisis: LIBOR vs Hypothetical SOFR Loans",
    "source_type": "pdf",
    "document_id": "e7a1b5b5f996",
    "source_file": "INTEREST RECEIVED BY BANKS DURING THE FINANCIAL CRISIS LIBOR vs Hypothetical SOFR_Jermann - December 2021.pdf",
    "section": "NBER WORKING PAPER SERIES",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 19,
    "chunk_index": 4,
    "word_count": 50,
    "author": "Urban Jermann",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "NBER WORKING PAPER SERIES (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211221095037-05'00'",
    "duration": null
  },
  {
    "text": "mostly exceeded overnight repo rates, and a SOFR loan would therefore require a larger spread on top of the benchmark to compensate for the expected di⁄erence between the two. In addition to that, the absence of credit sensitivity in SOFR requires a premium relative to LIBOR to compensate for the lack of insurance. Based on basis swap quotes and spot prices, I estimate the implied risk premium leading up to the (cid:133)nancial crisis to be about 4.5 bps in annualized terms. This arguably low number suggests that LIBOR o⁄ered banks an e¢ cient way to hedge funding risk. In related work, Jermann (2019), I study the lack of credit sensitivity of a LIBOR re- placementwithinadynamicgeneral equilibriummodel. Theempirical resultspresentedhere are consistent with the results of that analysis. Namely, replacing LIBOR with a non-credit- sensitive rate forindexingloans couldhave signi(cid:133)cant adverse consequences forbankbalance sheets during periods of (cid:133)nancial distress. Berndt, Du¢ e and Zhu (2020) construct an index of the cost of unsecured funding for banks that can be used to introduce credit sensitivity alongside a SOFR index. Kuo, Skeie and Vickery (2018) measure the impact of LIBOR manipulation. They (cid:133)nd that LIBOR broadly tracks alternative measures of bank funding costs during 2007-09, except for the two-week period after Lehman bankruptcy where LI- BOR was below alternative measures by 20-30 basis points. Du¢ e and Stein (2015) review LIBOR manipulation and challenges for transiting away from LIBOR. Klingler and Syrstad (2021) study how the new benchmark rates in the US, UK and Europe vary with respect to regulatory constraints, reporting dates, and volumes of government debt outstanding. In the rest of the paper, I start by describing the empirical approach. This is followed by the presentation of the estimated additional interest from LIBOR and the associated additional interest income on outstanding loans. A discussion section concludes. 2 Additional interest from LIBOR The thought-experience is that there is a given amount of loans outstanding at the beginning of an unexpected crisis that lasts for a given time period. Over this period, the loans receive interest indexed to LIBOR. If the interest would have been determined by SOFR, what would the di⁄erence have been? At the time of a loan commitment, it is typically expected that LIBOR would be some- what higher than SOFR over the life of the loan. Therefore, a SOFR loan would include a somewhat higher spread on top of the benchmark index. I estimate this adjustment with a combination of derivative prices and averages of spot prices. SOFR is an overnight rate, LIBOR loans typically use one-month or three-month (term) rates. It is expected that SOFR loans would either use a compounded SOFR rate over 3",
    "title": "Interest Received by Banks during the Financial Crisis: LIBOR vs Hypothetical SOFR Loans",
    "source_type": "pdf",
    "document_id": "e7a1b5b5f996",
    "source_file": "INTEREST RECEIVED BY BANKS DURING THE FINANCIAL CRISIS LIBOR vs Hypothetical SOFR_Jermann - December 2021.pdf",
    "section": "NBER WORKING PAPER SERIES",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 19,
    "chunk_index": 5,
    "word_count": 445,
    "author": "Urban Jermann",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "NBER WORKING PAPER SERIES (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211221095037-05'00'",
    "duration": null
  },
  {
    "text": "on top of the benchmark index. I estimate this adjustment with a combination of derivative prices and averages of spot prices. SOFR is an overnight rate, LIBOR loans typically use one-month or three-month (term) rates. It is expected that SOFR loans would either use a compounded SOFR rate over 3",
    "title": "Interest Received by Banks during the Financial Crisis: LIBOR vs Hypothetical SOFR Loans",
    "source_type": "pdf",
    "document_id": "e7a1b5b5f996",
    "source_file": "INTEREST RECEIVED BY BANKS DURING THE FINANCIAL CRISIS LIBOR vs Hypothetical SOFR_Jermann - December 2021.pdf",
    "section": "NBER WORKING PAPER SERIES",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 19,
    "chunk_index": 6,
    "word_count": 50,
    "author": "Urban Jermann",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "NBER WORKING PAPER SERIES (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211221095037-05'00'",
    "duration": null
  },
  {
    "text": "periods of one or three months, or a term SOFR rate. I consider both options. 2.1 Realized spread The additional interest from LIBOR relative to SOFR is computed in the following way. Consider the spread between one-month or three-month LIBOR and the overnight treasury repo rate compounded over the same period as the LIBOR rates, s = L O : t t t (cid:0) L is the LIBOR rate determined at date t with the interest payment due one or three t months later. For SOFR, Reuters(cid:146)overnight treasury repo rate is used. The overnight rate is compounded over one-month or three-months periods.1 Assume the crisis starts at date t and ends at t . The cumulative spread over the crisis period is computed as the simple 0 1 average N t1 s = s ; 0;1 t 365 (cid:18) (cid:19) X t=t0 appropriatelydeannualizedwithN, thenumberofdaysinthecrisisperiod. LIBORratesare corrected for day count convention by 365=360. For a given average spread, the cumulative spread obviously increases in the length of the crisis N. The crisis period is taken as the 2 years between 7/1/2007 and 6/30/2009, so the cumulative spread equals approximately twice the average (annualized) spread. 2.2 Priced and expected spread From the realized spread, s , I substract the spread adjustment that would have been priced t into a SOFR loan. A market-based measure of this adjustment could be obtained from basis swaps that exchange LIBOR payments for SOFR payments over the maturity of the loan. No quotes are available for basis swaps indexed to overnight repo rates for the pre-crisis period. Quotes are available for a very similar contract, namely Federal Funds/LIBOR basis swaps. These swaps exchange three-month LIBOR for the E⁄ective Federal Funds (EFF) rate averaged over the matching three-month period. The quote is expressed as a (cid:133)xed 1In particular, the compounded rate is O = 365 t+N (cid:0) 1 1+ O j d 1 ; t (cid:18) N (cid:19) (cid:2) j=t 360 !(cid:0) ! Y where N equals either 30 or 91, and Od is the overnight rate at date j. j 4",
    "title": "Interest Received by Banks during the Financial Crisis: LIBOR vs Hypothetical SOFR Loans",
    "source_type": "pdf",
    "document_id": "e7a1b5b5f996",
    "source_file": "INTEREST RECEIVED BY BANKS DURING THE FINANCIAL CRISIS LIBOR vs Hypothetical SOFR_Jermann - December 2021.pdf",
    "section": "NBER WORKING PAPER SERIES",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 19,
    "chunk_index": 7,
    "word_count": 344,
    "author": "Urban Jermann",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "NBER WORKING PAPER SERIES (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211221095037-05'00'",
    "duration": null
  },
  {
    "text": "expressed as a (cid:133)xed 1In particular, the compounded rate is O = 365 t+N (cid:0) 1 1+ O j d 1 ; t (cid:18) N (cid:19) (cid:2) j=t 360 !(cid:0) ! Y where N equals either 30 or 91, and Od is the overnight rate at date j. j 4",
    "title": "Interest Received by Banks during the Financial Crisis: LIBOR vs Hypothetical SOFR Loans",
    "source_type": "pdf",
    "document_id": "e7a1b5b5f996",
    "source_file": "INTEREST RECEIVED BY BANKS DURING THE FINANCIAL CRISIS LIBOR vs Hypothetical SOFR_Jermann - December 2021.pdf",
    "section": "NBER WORKING PAPER SERIES",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 19,
    "chunk_index": 8,
    "word_count": 50,
    "author": "Urban Jermann",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "NBER WORKING PAPER SERIES (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211221095037-05'00'",
    "duration": null
  },
  {
    "text": "add-on to the EFF leg. This corresponds to the adjustment a lender would make to convert a LIBOR loan into a loan indexed to an average of the EFF rate. The adjustment takes into account the forecast of the di⁄erence in the coupons as well as the relative riskiness of the two legs. In particular, if market participants expect LIBOR to increase relative to EFF during a crisis period, receiving the LIBOR leg would be more valuable and this would increase the quoted price of the swap. I use (cid:133)ve-year basis swap quotes averaged over the three years before the crisis. This corresponds approximately to a broad portfolio of loans outstanding during the crisis. To improve on this adjustment, I make a correction for the small di⁄erence in level be- tween EFF and overnight repo rates. This is computed as the di⁄erence in the averages of these two overnight rates over the same three-year period; speci(cid:133)cally the three-month aver- age of the EFF and SOFR compounded over three-month. To avoid using prices determined after the start of the crisis, I drop the last three month of data. Combining the two gives the following spread adjustment to SOFR to make a SOFR loan equivalent to a LIBOR loan: SOFR spread adjustment = FF/LIBOR Basis Sw + average( EFF - OR) 16:8 = 14:3+2:5; this is in annualized basis points (bps). I can decompose this price adjustment into two components: the expected spread and the risk premium. The expected spread, estimated as the average over the three years prior to the crisis, is 12:2 and this implies a risk premium of 4:5 bps (based on unrounded values). 2.3 Other tenors and term SOFR For the one-month interest period, no quotes for matching basis swaps are available. As an alternative, I estimate the expected spread based on the pre-crisis average of the realized LIBOR-SOFR spreads for the three years leading up to of the crisis. I add to this expected spread the risk premium estimated for the three-month interest period. With risk premiums typically increasing with maturity, this is likely to somewhat overestimate the adjustment. On the other hand, the risk premium for 3-month LIBOR minus overnight repo would probably be moderately larger than the risk premium for 3-month LIBOR minus EFF. As an approximation to a hypothetical term SOFR, I consider Overnight Index Swap (OIS) rates with one-month and three-month maturities. As the spread adjustment, I use the average of the spread for the three years before the beginning of the crisis plus the risk premium computed as just explained. 5",
    "title": "Interest Received by Banks during the Financial Crisis: LIBOR vs Hypothetical SOFR Loans",
    "source_type": "pdf",
    "document_id": "e7a1b5b5f996",
    "source_file": "INTEREST RECEIVED BY BANKS DURING THE FINANCIAL CRISIS LIBOR vs Hypothetical SOFR_Jermann - December 2021.pdf",
    "section": "NBER WORKING PAPER SERIES",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 19,
    "chunk_index": 9,
    "word_count": 429,
    "author": "Urban Jermann",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "NBER WORKING PAPER SERIES (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211221095037-05'00'",
    "duration": null
  },
  {
    "text": "As an approximation to a hypothetical term SOFR, I consider Overnight Index Swap (OIS) rates with one-month and three-month maturities. As the spread adjustment, I use the average of the spread for the three years before the beginning of the crisis plus the risk premium computed as just explained. 5",
    "title": "Interest Received by Banks during the Financial Crisis: LIBOR vs Hypothetical SOFR Loans",
    "source_type": "pdf",
    "document_id": "e7a1b5b5f996",
    "source_file": "INTEREST RECEIVED BY BANKS DURING THE FINANCIAL CRISIS LIBOR vs Hypothetical SOFR_Jermann - December 2021.pdf",
    "section": "NBER WORKING PAPER SERIES",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 19,
    "chunk_index": 10,
    "word_count": 50,
    "author": "Urban Jermann",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "NBER WORKING PAPER SERIES (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211221095037-05'00'",
    "duration": null
  },
  {
    "text": "LIBOR/SOFR Spreads Realized Priced Expected Additional Compounded SOFR 1-month 1:41 0:23 1:08 3-month 2:39 0:33 0:24 2:05 Term SOFR 1-month 1:15 0:17 0:90 3-month 1:82 0:19 1:54 Table 1: CumulativePercentageSpreadsofLIBORoverSOFRfortheCrisis, 7/2007 - 6/2009. \"Compounded SOFR\" is based on Reuters Treasury Overnight Repo rates. \"Term SOFR\" is based on OIS rates. The Priced Spread is derived from FF/LIBOR basis swap quotes with a 5-year maturity, averaged over the 3 years before the crisis. The Expected Spread is computed as the average of the realized spreads in the 3 years prior to the crisis (dropping the last month or 3 months before the crisis for the compounded rates which were only determined afterthestartingdateofthecrisis). TheAdditionalSpreadistheRealizedSpread minus the Priced Spread for 3-month Compounded SOFR, for the other cases it is the Realized Spread minus the Expected Spread minus the risk premium from the 3-month Compounded SOFR. The reported spreads are computed for a two-year period, which corresponds to the length of the crisis period. Table 1 reports estimates of the interest based on LIBOR relative to a hypothetical SOFR loan in terms of a percentage ever the crisis period. For instance, for a loan with a 100 dollar notional amount, three-month LIBOR paid 2.39 dollars more than a hypothetical compounded SOFR index over the crisis period. A SOFR loan would have included an additional 0.33 dollars in (cid:133)xed spread payments above the benchmark rate compared to a loan indexed to LIBOR. Taken together, the LIBOR loan paid 2.05 dollars more than the SOFR loan over the crisis. This additional 2.05 dollars can be considered an insurance payout banks received thanks to indexing loans with LIBOR as opposed to compounded SOFR. The cost for this insurance was 0.09 dollars, which is the risk premium in the spread adjustment (4.5 bps per year) over the two-year crisis period. Figure 1 displays the time series of the realized spreads, s . As is widely known, LIBOR t rates spiked dramatically relative to risk-free rates during the crisis periods. As shown in the Table 1, the additional spread with compounded SOFR is larger than with term SOFR. That is, with a compounded SOFR rate, interest payments would have been lower during the crisis than with term SOFR. Figure 2 makes it clear why this was the case: the compounded rate incorporates surprise rate cuts during a crisis faster than a term rate. For instance, from April to September 2008 the overnight repo rate was at a relatively 6",
    "title": "Interest Received by Banks during the Financial Crisis: LIBOR vs Hypothetical SOFR Loans",
    "source_type": "pdf",
    "document_id": "e7a1b5b5f996",
    "source_file": "INTEREST RECEIVED BY BANKS DURING THE FINANCIAL CRISIS LIBOR vs Hypothetical SOFR_Jermann - December 2021.pdf",
    "section": "NBER WORKING PAPER SERIES",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 19,
    "chunk_index": 11,
    "word_count": 410,
    "author": "Urban Jermann",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "NBER WORKING PAPER SERIES (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211221095037-05'00'",
    "duration": null
  },
  {
    "text": "been lower during the crisis than with term SOFR. Figure 2 makes it clear why this was the case: the compounded rate incorporates surprise rate cuts during a crisis faster than a term rate. For instance, from April to September 2008 the overnight repo rate was at a relatively 6 Spread of LIBOR over Overnight Treasury Repo (compounded) 5 3 month 1 month 4 3 2 1 0 1 Jan05 Jan06 Jan07 Jan08 Jan09 Figure 1: Realized spreads (di⁄erences in percent) between LIBOR and Compounded Overnight Treasury Repo rates for 1-month and 3-month terms. The crisis period cov- ers 7.2007 to 6.2009. The average of the pre-crisis spreads is used to compute the expected spreads reported in Table 1. 7",
    "title": "Interest Received by Banks during the Financial Crisis: LIBOR vs Hypothetical SOFR Loans",
    "source_type": "pdf",
    "document_id": "e7a1b5b5f996",
    "source_file": "INTEREST RECEIVED BY BANKS DURING THE FINANCIAL CRISIS LIBOR vs Hypothetical SOFR_Jermann - December 2021.pdf",
    "section": "NBER WORKING PAPER SERIES",
    "page_number": 9,
    "page_range": "p.9-10",
    "total_pages": 19,
    "chunk_index": 12,
    "word_count": 120,
    "author": "Urban Jermann",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "NBER WORKING PAPER SERIES (p.9-10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211221095037-05'00'",
    "duration": null
  },
  {
    "text": "Jan06 Jan07 Jan08 Jan09 Figure 1: Realized spreads (di⁄erences in percent) between LIBOR and Compounded Overnight Treasury Repo rates for 1-month and 3-month terms. The crisis period cov- ers 7.2007 to 6.2009. The average of the pre-crisis spreads is used to compute the expected spreads reported in Table 1. 7 constant 2%. This 2% was also the federal funds target during that period. Due to the rapidly deteriorating conditions in (cid:133)nancial markets, the Federal Reserve lowered its target federal funds rate between October and December from 2% to below 25 basis points. The overnightreporatecloselytrackedthisdecline. CompoundedSOFR,whichaveragesoverthe next3-monthperiod, wasprogressivelymorea⁄ectedintheweeksbeforeOctoberbytherate cuts. Asshowninthe(cid:133)gure, compoundedSOFRdeclinedsmoothlyaheadoftheabruptdrop in overnight rates starting in October. More generally, as shown in the (cid:133)gure, compounded SOFR was below the daily repo rate for almost the entire crisis period during which the Fed lowered its target from 5.25 to 0.25-0%. Because rate cuts in emergency situations are mostlyunanticipated, forwardlookingtermratessuchasLIBOR(ortermSOFRrate)donot forecast this decline, and interest payments on term rates would only respond three months later. One would expect future crises of this type to result in unanticipated rapid cuts in short-term interest rates, and in such situations, interest payments based on compounded SOFR would decline faster than payments based on term rates. From that perspective, a compounded SOFR exacerbates the loss of insurance for banks from eliminating the credit sensitivity of the reference rate. In other words, the SOFR-based reference rate is not credit- sensitive, and in addition, a compounded overnight index immediately incorporates sharp rate cuts in a crisis. Figure 3 shows that \"Term SOFR\" approximated by OIS rates was relatively stable around 2% from April to September 2008, and so was the 3-month LIBOR rate. Neither of these two term rates did anticipate in a signi(cid:133)cant way the increased (cid:133)nancial turmoil requiring rate cuts in October. A \"Term SOFR\" rate would therefore have declined later then a compounded SOFR rate. 8",
    "title": "Interest Received by Banks during the Financial Crisis: LIBOR vs Hypothetical SOFR Loans",
    "source_type": "pdf",
    "document_id": "e7a1b5b5f996",
    "source_file": "INTEREST RECEIVED BY BANKS DURING THE FINANCIAL CRISIS LIBOR vs Hypothetical SOFR_Jermann - December 2021.pdf",
    "section": "NBER WORKING PAPER SERIES",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 19,
    "chunk_index": 13,
    "word_count": 310,
    "author": "Urban Jermann",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "NBER WORKING PAPER SERIES (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211221095037-05'00'",
    "duration": null
  },
  {
    "text": "around 2% from April to September 2008, and so was the 3-month LIBOR rate. Neither of these two term rates did anticipate in a signi(cid:133)cant way the increased (cid:133)nancial turmoil requiring rate cuts in October. A \"Term SOFR\" rate would therefore have declined later then a compounded SOFR rate. 8 3 month LIBOR and Overnight Repo (daily and 3 month compounded) 6 ON repo ON repo compounded 3 month LIBOR 5 4 3 2 1 0 Jul07 Oct07 Jan08 Apr08 Jul08 Oct08 Jan09 Apr09 Figure 2: Interest rates during the crisis. The (cid:133)gure illustrates that with a reference rate based on a compounded overnight rate, surprise rate cuts result in faster declines in interest income than with a term reference rate. 9 3 month LIBOR and OIS rates (\"Term SOFR\") 6 OIS LIBOR 5 4 3 2 1 0 Jul07 Oct07 Jan08 Apr08 Jul08 Oct08 Jan09 Apr09 Figure 3: 3-month term rates during the crisis. 10",
    "title": "Interest Received by Banks during the Financial Crisis: LIBOR vs Hypothetical SOFR Loans",
    "source_type": "pdf",
    "document_id": "e7a1b5b5f996",
    "source_file": "INTEREST RECEIVED BY BANKS DURING THE FINANCIAL CRISIS LIBOR vs Hypothetical SOFR_Jermann - December 2021.pdf",
    "section": "NBER WORKING PAPER SERIES",
    "page_number": 11,
    "page_range": "p.11-13",
    "total_pages": 19,
    "chunk_index": 14,
    "word_count": 156,
    "author": "Urban Jermann",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "NBER WORKING PAPER SERIES (p.11-13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211221095037-05'00'",
    "duration": null
  },
  {
    "text": "rate cuts result in faster declines in interest income than with a term reference rate. 9 3 month LIBOR and OIS rates (\"Term SOFR\") 6 OIS LIBOR 5 4 3 2 1 0 Jul07 Oct07 Jan08 Apr08 Jul08 Oct08 Jan09 Apr09 Figure 3: 3-month term rates during the crisis. 10 3 Outstanding loans and additional interest income This section estimates the amount of loans owned by banks during the (cid:133)nancial crisis. As a back-of-the-envelope calculation, it is assumed that all loans owned by banks during the crisis were based on commitments from before the crisis. This is a coarse approximation of reality, but has the bene(cid:133)t of transparency. One could consider re(cid:133)nements to include dynamic adjustments within the two-year crisis period. Unfortunately, the information con- tent of the available data is limited for such a dynamic approach. For instance, only net (cid:135)ows are observed and it is not clear whether increases in loans outstanding are from prior commitments or new commitments. These issues are considered in the discussion section. 7/2007-6/2009 LIBOR Tenor (1M/3M) Bank held trn % % % Syndicated loans 1.2 97 45/55 55 Corporate business loans (bilat.) 2.1 40 45/55 35 Noncorporate business loans 1.2 40 50/50 85 CRE/Comm. mortgages 3.7 40 10/90 46 Table 2: Outstanding Business Loans. Aggregate amounts are averages over the two-year period based on the Shared National Credit (SNC) Program for syndicatedloansandtheFed(cid:146)sFinancialAccountsfortheothercategories; Tables L.103, L.104, L.217-L.221. Estimates of the LIBOR proportions and tenors are based on Financial Stability Board (2014). The bank held share for syndicated loans is estimated based on studies using SNC, namely Aramonte et al (2019), Bord and Santos (2012), and Irani et al (2019). For the other categories, bank heldcorrespondstothedepositoryinstitutionamountsintheFinancialAccounts. I consider four types of business loans: Syndicated loans, bilateral corporate and non- corporate loans, and commercial mortgages. Amounts outstanding and properties of these types of loans are summarized in Table 1. Amounts are either from the Financial Accounts or, for syndicated loans, the Shared National Credit (SNC) Program. Total amounts out- standing of each of these categories exceed 1trn, with bank held amounts between a low of 35% for corporate business loans and a high of 85% for noncorporate business loans. Es- sentially all syndicated loans use LIBOR, while for the other types LIBOR shares are about 40%. Overall, three-month rates are somewhat more popular than one-month rates. These numbers are based on the information reported in Financial Stability Board (2014), which is partially based on \"input from market participants.\" There are some six-month terms 11",
    "title": "Interest Received by Banks during the Financial Crisis: LIBOR vs Hypothetical SOFR Loans",
    "source_type": "pdf",
    "document_id": "e7a1b5b5f996",
    "source_file": "INTEREST RECEIVED BY BANKS DURING THE FINANCIAL CRISIS LIBOR vs Hypothetical SOFR_Jermann - December 2021.pdf",
    "section": "NBER WORKING PAPER SERIES",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 19,
    "chunk_index": 15,
    "word_count": 418,
    "author": "Urban Jermann",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "NBER WORKING PAPER SERIES (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211221095037-05'00'",
    "duration": null
  },
  {
    "text": "use LIBOR, while for the other types LIBOR shares are about 40%. Overall, three-month rates are somewhat more popular than one-month rates. These numbers are based on the information reported in Financial Stability Board (2014), which is partially based on \"input from market participants.\" There are some six-month terms 11",
    "title": "Interest Received by Banks during the Financial Crisis: LIBOR vs Hypothetical SOFR Loans",
    "source_type": "pdf",
    "document_id": "e7a1b5b5f996",
    "source_file": "INTEREST RECEIVED BY BANKS DURING THE FINANCIAL CRISIS LIBOR vs Hypothetical SOFR_Jermann - December 2021.pdf",
    "section": "NBER WORKING PAPER SERIES",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 19,
    "chunk_index": 16,
    "word_count": 50,
    "author": "Urban Jermann",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "NBER WORKING PAPER SERIES (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211221095037-05'00'",
    "duration": null
  },
  {
    "text": "for syndicated loans and corporate business loans. I am not directly including that in my calculations. Instead, for the estimates in Table 2, I have slightly increased the three-month share to account for that. The Financial Accounts report loans separately for depository institutions, these values are used for the bank held proportions. For syndicated loans, I combine information from Aramonte et al (2019), Bord and Santos (2012), and Irani et al (2019). For syndicated loans, nonbank investors include, most prominently, collateralized loan obligations (CLOs) and investment management (cid:133)rms. As documented by Liu and Schmidt-Eisenlohr (2019), banks are also signi(cid:133)cant investors in CLOs; this is not taken into account here. Bank-owned LIBOR loans Additional interest 7/2007-6/2009 \"Comp. SOFR\" \"Term SOFR\" trn bn bn Syndicated loans 0:64 10:3 8:0 Corporate business loans (bilat.) 0:29 4:7 3:7 Noncorporate business loans 0:41 6:4 5:0 CRE/Comm. mortgages 0:68 10:7 8:3 Total 2:02 32:1 25:0 Table 3: Additional interest on bank-owned LIBOR loans. Loan amounts and additional interest is computed based on the values reported in Table 1 and 2. In particular, LIBOR loan amounts owned by banks implied by Table 2 are multiplied by the additional spreads reported in Table 1. TheadditionalinterestincomebanksreceivedfromLIBORrelativetohypotheticalSOFR loans is reported in Table 3. The values are computed based on the interest rate spreads reported in Table 1 combined with the loan amounts in Table 2. As shown in Table 3, additional LIBOR interest amounts to approximately 30bn dollars. The additional LIBOR interest with compounded SOFR would be about 20% larger than with term SOFR. Bank valuations bottomed out on March 6, 2009. On that day, the Fortune 500 top 20 commercial banks from 2007 had a combined market capitalization of 204bn dollars (see Appendix for details). From this perspective, the 30bn in interest income due to the credit sensitivity of LIBOR is not a trivial amount. 12",
    "title": "Interest Received by Banks during the Financial Crisis: LIBOR vs Hypothetical SOFR Loans",
    "source_type": "pdf",
    "document_id": "e7a1b5b5f996",
    "source_file": "INTEREST RECEIVED BY BANKS DURING THE FINANCIAL CRISIS LIBOR vs Hypothetical SOFR_Jermann - December 2021.pdf",
    "section": "NBER WORKING PAPER SERIES",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 19,
    "chunk_index": 17,
    "word_count": 307,
    "author": "Urban Jermann",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "NBER WORKING PAPER SERIES (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211221095037-05'00'",
    "duration": null
  },
  {
    "text": "out on March 6, 2009. On that day, the Fortune 500 top 20 commercial banks from 2007 had a combined market capitalization of 204bn dollars (see Appendix for details). From this perspective, the 30bn in interest income due to the credit sensitivity of LIBOR is not a trivial amount. 12",
    "title": "Interest Received by Banks during the Financial Crisis: LIBOR vs Hypothetical SOFR Loans",
    "source_type": "pdf",
    "document_id": "e7a1b5b5f996",
    "source_file": "INTEREST RECEIVED BY BANKS DURING THE FINANCIAL CRISIS LIBOR vs Hypothetical SOFR_Jermann - December 2021.pdf",
    "section": "NBER WORKING PAPER SERIES",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 19,
    "chunk_index": 18,
    "word_count": 50,
    "author": "Urban Jermann",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "NBER WORKING PAPER SERIES (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211221095037-05'00'",
    "duration": null
  },
  {
    "text": "4 Discussion For estimating additional interest income from LIBOR on outstanding loans, it is assumed that all loans owned by banks during the crisis were based on commitments from before the crisis. This section discusses some of the issues with this assumption. Explicitly accounting for maturing and re(cid:133)nanced loans would lower my estimates. On the other hand, SOFR indexing would have made it even more attractive for borrowers to draw down existing commitments, which could have increased my estimates. Explicitly accounting for loans maturing during the crisis would lower the amount of outstanding loans. If loans are re(cid:133)nanced, then one would expect SOFR loans to be issued at similar conditions as LIBOR loans and the additional interest from LIBOR would be lower. Borrowers have the ability to re(cid:133)nance loans. Bank loans are typically one-sided commit- ments fromthe banks. As loans are re(cid:133)nanced, one would expect SOFRloans to be issued at similar conditions as LIBOR loans and this would lower the additional interest from LIBOR. However, company-speci(cid:133)c credit spreads added to the reference rate were higher during the crisis, reducing the incentive to re(cid:133)nance. To the extent that borrowers draw down existing credit commitments during the crisis, thisincreasestheoutstandingamountsbasedonpre-crisispricing. Mycalculationsimplicitly assumethatanynewoutstandingloansduringthecrisisarebasedonpre-crisiscommitments. That is unlikely to be entirely correct. However, the SNCProgram(2020) data suggests that asigni(cid:133)cantshareofexistingcommitmentsweredrawndownbynon-(cid:133)nancialborrowersdur- ing the (cid:133)nancial crises. As shown in Table 4, the share of outstanding loans in committed loans was 36% for 2007, for 2009, this ratio stood at 54%. In addition, the total commit- ted credit in 2009 is barely higher than in 2008. Both of these facts suggest that banks experienced large drawdowns on their credit commitments during the crisis. Other evidence consistent with this view is presented by Ivashina and Scharfstein (2010) and Berrospide and Meisenzahl (2015). $ billions Committed Outstanding Out/Committed 2007 2;275 835 0:36 2008 2;789 1;208 0:43 2009 2;881 1;563 0:54 Table 4: Committed and outstanding syndicated loans. Data is from the Shared National Credit (SNC) Program (2020) and covers credits with mini- mum loan commitments of $20 million or more shared by two or more regulated 13",
    "title": "Interest Received by Banks during the Financial Crisis: LIBOR vs Hypothetical SOFR Loans",
    "source_type": "pdf",
    "document_id": "e7a1b5b5f996",
    "source_file": "INTEREST RECEIVED BY BANKS DURING THE FINANCIAL CRISIS LIBOR vs Hypothetical SOFR_Jermann - December 2021.pdf",
    "section": "NBER WORKING PAPER SERIES",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 19,
    "chunk_index": 19,
    "word_count": 345,
    "author": "Urban Jermann",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "NBER WORKING PAPER SERIES (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211221095037-05'00'",
    "duration": null
  },
  {
    "text": "Out/Committed 2007 2;275 835 0:36 2008 2;789 1;208 0:43 2009 2;881 1;563 0:54 Table 4: Committed and outstanding syndicated loans. Data is from the Shared National Credit (SNC) Program (2020) and covers credits with mini- mum loan commitments of $20 million or more shared by two or more regulated 13 (cid:133)nancial institutions (banks). The discussion of these three points suggests that my estimate of the additional interest income could be considered as an upper bound. However, another consideration are the po- tential additional drawdowns on loan commitments during the (cid:133)nancial crises if loans would have been priced with SOFR. With LIBOR at times several percentage points above my hypothetical SOFR rates, it would then have been more advantageous to draw on existing loan commitments. As shown in Table 4, commitments for syndicated loans exceeded out- standing loans by at least 1trn throughout the crisis. Therefore, there was a lot of room for additional drawdowns. These additional drawdowns would have not only increased my estimate of the outstanding loans during the crisis but banks would have been forced to seek funding for these commitments at a very challenging time, and this could have further increased their marginal funding costs. 14",
    "title": "Interest Received by Banks during the Financial Crisis: LIBOR vs Hypothetical SOFR Loans",
    "source_type": "pdf",
    "document_id": "e7a1b5b5f996",
    "source_file": "INTEREST RECEIVED BY BANKS DURING THE FINANCIAL CRISIS LIBOR vs Hypothetical SOFR_Jermann - December 2021.pdf",
    "section": "NBER WORKING PAPER SERIES",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 19,
    "chunk_index": 20,
    "word_count": 199,
    "author": "Urban Jermann",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "NBER WORKING PAPER SERIES (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211221095037-05'00'",
    "duration": null
  },
  {
    "text": "of room for additional drawdowns. These additional drawdowns would have not only increased my estimate of the outstanding loans during the crisis but banks would have been forced to seek funding for these commitments at a very challenging time, and this could have further increased their marginal funding costs. 14",
    "title": "Interest Received by Banks during the Financial Crisis: LIBOR vs Hypothetical SOFR Loans",
    "source_type": "pdf",
    "document_id": "e7a1b5b5f996",
    "source_file": "INTEREST RECEIVED BY BANKS DURING THE FINANCIAL CRISIS LIBOR vs Hypothetical SOFR_Jermann - December 2021.pdf",
    "section": "References",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 19,
    "chunk_index": 21,
    "word_count": 50,
    "author": "Urban Jermann",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211221095037-05'00'",
    "duration": null
  },
  {
    "text": "Aramonte, Sirio, Seung Jung Lee, and Viktors Stebunovs, 2019, \"Risk taking and low longer-term interest rates: Evidence from the U.S. syndicated term loan market\", Journal of Banking & Finance, forthcoming. ARRC, 2020a, \"Frequently Asked Questions Version: June 2, 2020\", https://www.newyorkfed.org/arrc/publications. ARRC, 2020b, \"ARRC Announces Recommendation of a Spread Adjustment Methodology for Cash Products\", April 8, 2020, https://www.newyorkfed.org/medialibrary/Microsites/arrc/(cid:133)les/2020 /ARRC_Spread_Adjustment_Methodology.pdf. Bailey, Andrew, 2017, \"The future of LIBOR\", Speech by Andrew Bailey, Chief Executive of the FCA, https://www.fca.org.uk/news/speeches/the-future-of-libor. Berndt, Antje and Du¢ e, James Darrell and Zhu, Yichao, 2020, \"Across-the-Curve Credit Spread Indices\", Stanford University Graduate School of Business Research Paper No. 3884 Berrospide, Jose M., and Ralf R. Meisenzahl, 2015, \"The Real E⁄ects of Credit Line Draw- downs\", Finance and Economic Discussion Series 2015-007. Board of Governors of the Federal Reserve System (U.S.). http://dx.doi.org/10.17016/FEDS.2015.007. Du¢ e, Darrell and Jeremy C. Stein, 2015, \"Reforming LIBOR and Other Financial Market Benchmarks\", Journal of Economic Perspectives, Volume 29, Number 2, 191(cid:150)212.(cid:145) Financial Stability Board, 2014, \"Market Participants Group on Reforming Interest Rate Benchmarks,\" Final Report, March 2014, pages 311-316. Irani , Rustom M., Rajkamal Iyer, Ralf R. Meisenzahl, and Jose-Luis Peydro, 2019, \"The Rise of Shadow Banking:Evidence from Capital Regulation\", working paper. Bord, Vitaly M. and Joªo A. C. Santos, 2012, \"The Rise of the Originate-to-Distribute Model and the Role of Banks in Financial Intermediation\", FRBNY Economic Policy Re- view, Volume 18, Number 2 July Ivashina, Victoria and David S. Scharfstein, 2010, \"Bank Lending during the Financial Crisis of 2008\", Journal of Financial Economics Vol. 97(3), pp. 319-338. Jermann, Urban, 2019, \"Is SOFR better than LIBOR?\", Wharton School University of Pennsylvania, unpublished manuscript. 15",
    "title": "Interest Received by Banks during the Financial Crisis: LIBOR vs Hypothetical SOFR Loans",
    "source_type": "pdf",
    "document_id": "e7a1b5b5f996",
    "source_file": "INTEREST RECEIVED BY BANKS DURING THE FINANCIAL CRISIS LIBOR vs Hypothetical SOFR_Jermann - December 2021.pdf",
    "section": "References",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 19,
    "chunk_index": 22,
    "word_count": 269,
    "author": "Urban Jermann",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211221095037-05'00'",
    "duration": null
  },
  {
    "text": "Intermediation\", FRBNY Economic Policy Re- view, Volume 18, Number 2 July Ivashina, Victoria and David S. Scharfstein, 2010, \"Bank Lending during the Financial Crisis of 2008\", Journal of Financial Economics Vol. 97(3), pp. 319-338. Jermann, Urban, 2019, \"Is SOFR better than LIBOR?\", Wharton School University of Pennsylvania, unpublished manuscript. 15 Klingler,SvenandOlavSyrstad,2021,\"LifeafterLIBOR\",JournalofFinancialEconomics, Volume 141, Issue 2, August 2021, Pages 783-801. Kuo, Dennis, David Skeie, and James Vickery, 2018, \"A Comparison of Libor to Other Measures of Bank Borrowing Costs\", unpublished manuscript. Liu, Emily and Tim Schmidt-Eisenlohr, 2019, \"Who Owns U.S. CLO Securities?\", FRBNY FEDS Notes, July 19, 2019. SharedNational CreditProgram, 2020, \"1stand3rdQuarter2019Reviews\", January2020. 16",
    "title": "Interest Received by Banks during the Financial Crisis: LIBOR vs Hypothetical SOFR Loans",
    "source_type": "pdf",
    "document_id": "e7a1b5b5f996",
    "source_file": "INTEREST RECEIVED BY BANKS DURING THE FINANCIAL CRISIS LIBOR vs Hypothetical SOFR_Jermann - December 2021.pdf",
    "section": "References",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 19,
    "chunk_index": 23,
    "word_count": 103,
    "author": "Urban Jermann",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211221095037-05'00'",
    "duration": null
  },
  {
    "text": "Issue 2, August 2021, Pages 783-801. Kuo, Dennis, David Skeie, and James Vickery, 2018, \"A Comparison of Libor to Other Measures of Bank Borrowing Costs\", unpublished manuscript. Liu, Emily and Tim Schmidt-Eisenlohr, 2019, \"Who Owns U.S. CLO Securities?\", FRBNY FEDS Notes, July 19, 2019. SharedNational CreditProgram, 2020, \"1stand3rdQuarter2019Reviews\", January2020. 16",
    "title": "Interest Received by Banks during the Financial Crisis: LIBOR vs Hypothetical SOFR Loans",
    "source_type": "pdf",
    "document_id": "e7a1b5b5f996",
    "source_file": "INTEREST RECEIVED BY BANKS DURING THE FINANCIAL CRISIS LIBOR vs Hypothetical SOFR_Jermann - December 2021.pdf",
    "section": "Appendix",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 19,
    "chunk_index": 24,
    "word_count": 50,
    "author": "Urban Jermann",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Appendix (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20211221095037-05'00'",
    "duration": null
  }
]