[
  {
    "text": "Is There Money to be Made Investing in Options? A Historical Perspective James S. Doran Bank of America Assistant Professor of Finance Department of Finance Florida State University Andy J. Fodor Department of Finance Florida State University April 28th , 2008 JEL : G11, G12, G13 Keywords: Portfolio Returns, Option Strategies, Option Pricing Acknowledgments: The authors acknowledge the helpful comments and suggestions of James Ang, Gary Benesh, Jim Carson, Yingmei Cheng, Jeff Clark, Steve Figlewski, Robert Hamernik, Dave Humphrey, John Inci, Bong-Soo Lee, Ehud Ronn, Dave Peterson, Colby Wright, and participants at the FSU Seminar. Additionally, the authors would like to thank the anonymous referee and the editor, Bob Webb, who have helped improve the paper significantly. Communications Author: James S. Doran Address: Department of Finance College of Business Florida State University Tallahassee, FL. 32306 Tel.: (850) 644-7868 (Office) FAX: (850) 644-4225 (Office) E-mail: jsdoran@cob.fsu.edu",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 35,
    "chunk_index": 0,
    "word_count": 145,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "Additionally, the authors would like to thank the anonymous referee and the editor, Bob Webb, who have helped improve the paper significantly. Communications Author: James S. Doran Address: Department of Finance College of Business Florida State University Tallahassee, FL. 32306 Tel.: (850) 644-7868 (Office) FAX: (850) 644-4225 (Office) E-mail: jsdoran@cob.fsu.edu This paper examines the historical performance of 12 portfolios that include S&P 100/500 index options. Each option portfolio is formed using options with different maturities and moneyness, while incorporating bid-ask spreads, transaction costs, and margin requirements. Raw and risk-adjusted returns of option portfolios are compared to a benchmark portfolio that is only long the underlying asset. This allows the marginal impact of including options in the portfolio to be examined. The analysis reveals that including options in the portfolio most often results in underperformance relative to the benchmark portfolio. However, a portfolio that incorporates written options can outperform the benchmark on a raw and risk-adjusted basis. This result is dependent on restricting option investment relative to the maximum allowable margin. While positive and significant risk-adjusted performance is observed for some option portfolios, greater risk tolerance relative to the long index benchmark portfolio is required. 2",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Abstract",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 35,
    "chunk_index": 1,
    "word_count": 195,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "options can outperform the benchmark on a raw and risk-adjusted basis. This result is dependent on restricting option investment relative to the maximum allowable margin. While positive and significant risk-adjusted performance is observed for some option portfolios, greater risk tolerance relative to the long index benchmark portfolio is required. 2",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 35,
    "chunk_index": 2,
    "word_count": 50,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "Index options are actively traded by market participants who utilize their non-linear payoff features. Options allow investors to hedge downside exposure as well as lock in potential profits. Since the seminal work of Black and Scholes (1973), extensive research has been performed concerning the theoretical and empirical properties of option prices, leading to a diverse and rich literature.1 From a practical standpoint, the use of options by individual investors has received little attention. Harvey and Whaley (1992) and Figlewski (1989) examine the arbitrage properties of option prices and conclude transaction costs faced by investors limit potential arbitrage opportunities present due to mispricing. However, these works ignore the role of options as a potential portfolio enhancing investment. Explicitly, what effect does holding or writing index options have as a complement to a portfolio that is already long the underlying asset? The purpose of this paper is to examine historical risk and return characteristics of portfolios which are long the underlying index while also employing various option strategies. The focus of this paper is an individual investor who is distinct from institutional investors. The individual investor has limited net worth, and faces the burden of higher transaction costs related to bid-ask spreads, margin requirements, and overall relative trade size. Lakonishok, Lee, Pearson, and Poteshman (2007) show individual investors do enter option positions. This suggests finding profitable option strategies is important, but it is not clear whether any strategies consistently provide marginal benefits to a portfolio which is already long the underlying asset. The results are designed to provide alternatives to a long index portfolio given the investor’s level of risk aversion. For example, writing naked option positions requires the investor to be less risk averse than does writing covered positions. The results presented provide two new insights. First, we quantify the benefit or cost of holding options as additional investments in an existing long portfolio. Second, by solving for the 1 Major theoretical extensions have included the incorporation of stochastic volatility in models, Hull and White (1987) and Heston (1993); the inclusion of jumps, Bates (1996); and double jump models, Duffie, Pan, and Singleton (2000). Empirical works such as Bakshi, Cao, and Chen (1997) have examined the fit and hedging implications of these models. 3",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 35,
    "chunk_index": 3,
    "word_count": 373,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "included the incorporation of stochastic volatility in models, Hull and White (1987) and Heston (1993); the inclusion of jumps, Bates (1996); and double jump models, Duffie, Pan, and Singleton (2000). Empirical works such as Bakshi, Cao, and Chen (1997) have examined the fit and hedging implications of these models. 3",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 35,
    "chunk_index": 4,
    "word_count": 50,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "risk aversion coefficients of each portfolio we can match investors’ risk tolerances to appropriate option strategies. We focus on the most common and popular option strategies. These strategies are implemented for a variety of holding periods using different option moneyness and maturity combinations. The performance of these twelve basic option strategies is examined over 10-year and 22-year holding periods. The strategies take positions in three- and six-month options on the S&P 100 and one-year options on the S&P 500. Strategies range from speculative, such as writing naked positions, to conservative, such as writing covered calls or buying protective puts. To analyze the marginal benefit or cost of investing in options, portfolios are constructed by investing a given amount in option positions on a monthly basis. This monthly amount is a portion of the investor’s monthly income used for investing purposes. When options expire, any payoff to the position is subsequently reinvested in the underlying asset. Constructing the portfolio in this fashion allows for a direct comparison of the risk-return characteristics of portfolios employing option strategies relative to the long index benchmark portfolio. This is distinct from the works of Liu and Pan (2003) and Driessen and Maenhout (2007), who solve for optimal option portfolio weights over different levels of investor risk aversion. In our case, the portfolio weight remains fixed, allowing us to relate levels of risk aversion to the risk of a given option portfolio. Strategies are examined over periods characterized by high and low volatility as well as varying levels of market performance. The results reveal that consistently supplementing a long portfolio in the underlying asset with investment using a single option strategy underperforms the benchmark portfolio in most cases. Primarily, strategies which outperform the benchmark portfolio involve writing put options. This is consistent with the findings of Coval and Shumway (2001), Bakshi and Kapadia (2003), and Doran (2007), who conclude short-term put options are expensive due to investors’ aversion to volatility and jump risk. Our results imply volatility and jump risk premiums are also present in long-term put option prices. The use of put options plays an important role in portfolio returns. Written put positions can be used to leverage other portions of the portfolio to investors’ benefit. 4",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 35,
    "chunk_index": 5,
    "word_count": 372,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "to volatility and jump risk. Our results imply volatility and jump risk premiums are also present in long-term put option prices. The use of put options plays an important role in portfolio returns. Written put positions can be used to leverage other portions of the portfolio to investors’ benefit. 4",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 35,
    "chunk_index": 6,
    "word_count": 50,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "While our work here is similar in scope to that of Santa-Clara and Saretto (2006), the conclusions are distinct. The results provide alternative evidence suggesting that even in the presence of transaction costs and margin calls, including options in a portfolio can be profitable. In particular, the synthetic stock portfolio highlights how augmenting a long portfolio in the underlying asset with options can enhance traditional risk-adjusted performance. However, excessive option leverage can lead to significant underperformance. The rest of the article is organized as follows. In the next section we address portfolio formation. The following section describes the data and methodology. The results are detailed next, and the final section concludes. Option Portfolios Portfolio Formation Twelve distinct strategies are implemented for two holding periods, using different option moneyness and maturity combinations. Using these strategies we form portfolios designed to be directly comparable to a benchmark portfolio that is only long the underlying asset. If options are in-the-money (ITM) at expiration, proceeds are invested in the underlying asset rather than reinvested in additional options. Reinvesting proceeds in options is impractical since it is almost certain the options would expire out-of-the- money (OTM) at some point. The investor makes monthly investments with one of 12 strategies throughout the holding period. This is designed to mimic the actions of a typical investor who makes a monthly contribution to a 401K or IRA plan. The following three steps outline portfolio formation when long option strategies are used. 1.) At the beginning of each month whole option contracts (the right to buy or sell 100 shares) are purchased with the monthly installment. 2 2.) Leftover cash is invested in risk-free asset. 2 Alternatively, the full monthly investment could have been used to purchase options, resulting in the purchase of partial option contracts. However, it is not possible to buy fractions of option contracts. Allowing the use of partial contracts does not change the results or conclusions presented. 5",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 35,
    "chunk_index": 7,
    "word_count": 323,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "in risk-free asset. 2 Alternatively, the full monthly investment could have been used to purchase options, resulting in the purchase of partial option contracts. However, it is not possible to buy fractions of option contracts. Allowing the use of partial contracts does not change the results or conclusions presented. 5",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 35,
    "chunk_index": 8,
    "word_count": 50,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "3.) At expiration, if options finish ITM, proceeds are invested in the underlying asset. If options finish OTM no proceeds are collected, and no additional underlying shares are purchased. Options are always held until expiration. All underlying shares purchased are held until the terminal date of the portfolio. For strategies involving multiple long option positions, options are purchased so the number of contracts for each position is equal. For example, when constructing a straddle position an equal number of call and put option contracts will be purchased. When written option positions are included in the portfolio, the investment procedure is slightly different. The following four steps outline portfolio formation for written option strategies. 1.) At the beginning of each month whole option contracts are written subject to margin requirements. 2.) Underlying shares are purchased using proceeds from writing options, the monthly installment, and cash invested in the risk-free asset in the prior month less money set aside for the initial margin. 3.) Leftover cash is invested in risk-free asset. 4.) At expiration, if options written are OTM, no action is taken. If options are in-the- money, underlying shares are sold to cover losses. The major difference between writing options and purchasing options is the timing of underlying asset purchases. When options are written, any additional underlying shares are purchased immediately. When options are purchased, if options are ITM at expiration, additional underlying shares are purchased with the proceeds collected. The number of option contracts written is determined according to margin requirements listed by the Chicago Board Option Exchange (CBOE). The margin requirement for written put and call index options is 100% of option proceeds plus 15% of the index value minus any OTM amount. For example, writing one ATM put contract for $15 on an index with a value of $500 requires margin of at least $9,000. If at anytime the margin account falls below the maintenance margin, underlying shares are sold to cover the short fall. For our portfolios a maximum of 10% of the maximum available margin is used when options are written. Using this trading rule falls well within the margin requirements set forth by the Federal Reserve Board and the CBOE. This restriction 6",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 35,
    "chunk_index": 9,
    "word_count": 368,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "underlying shares are sold to cover the short fall. For our portfolios a maximum of 10% of the maximum available margin is used when options are written. Using this trading rule falls well within the margin requirements set forth by the Federal Reserve Board and the CBOE. This restriction 6",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 35,
    "chunk_index": 10,
    "word_count": 50,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "limits “option leverage”, the percentage portfolio composed of options. This value is selected so the investor can write a position that is moderately risky, but conservative relative to the maximum number of contracts which could be written.3 To examine the impact of changes in option leverage on portfolio risk and return characteristics, we implement the synthetic stock strategy using a range of margin restrictions. For strategies involving both long and written option positions, the number of contracts purchased for the long position is equal to the number of contracts written. Further, the number of contracts written is restricted by our margin requirement, which is stricter than the margin requirement of the CBOE. If options finish ITM, proceeds are used to buy additional underlying index shares. Underlying shares are sold to cover any losses realized when written contracts are ITM at expiration or when margin calls occur. The benchmark portfolio is formed by using the monthly cash installment to purchase additional shares of the underlying index and investing leftover cash in the risk- free asset. The marginal effect of purchasing and writing options can be evaluated by comparing the number of underlying shares held in each portfolio at the end of the holding period. A portfolio holding more underlying shares at the terminal date has a higher overall value, reflecting higher returns. By forming portfolios using this general framework, the marginal impact of entering option positions can be assessed. The representative investor has $1,000 2004 dollars to invest with the chosen strategy at the beginning of each month.4 This value is a reasonable estimate for the monthly investment of an investor with annual median income ranging from $70,000 to $130,000. Option Strategies The 12 strategies implemented are listed as “basic strategies” by the CBOE. Examining the 12 basic strategies provides intuition for understanding risk and return characteristics of more complex positions. Single option strategies examined include the long call and 3 The ability to sell naked positions is dependent on the trading platform used. Some brokers require that the short position is completely covered with cash, others allow complete exposure up to the margin requirement set by the Federal Reserve Board. 4 The monthly investment in 1984, using CPI adjusted dollars, was $550. In 1996, the monthly investment value is $831. 7",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 35,
    "chunk_index": 11,
    "word_count": 381,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "platform used. Some brokers require that the short position is completely covered with cash, others allow complete exposure up to the margin requirement set by the Federal Reserve Board. 4 The monthly investment in 1984, using CPI adjusted dollars, was $550. In 1996, the monthly investment value is $831. 7",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 35,
    "chunk_index": 12,
    "word_count": 50,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "put, written call and put, covered call and protective put. Each strategy is executed for three levels of moneyness: OTM, ITM, at-the-money (ATM). Strategies examined requiring multiple option positions include bull and bear spreads, straddle, strangle, and butterfly strategies as well as synthetic stock positions.5 Two alternatives to the synthetic stock position are also examined. One takes a long position in ATM call options and writes OTM put options, and the other takes a long position in OTM call options and writes OTM put options. While these are not technically synthetic positions since the strike prices of the call and put options employed are not equal, the intent of these positions is similar. Risk across option portfolios varies greatly. For example, writing a naked position in put (call) options can result in substantial losses if large negative (positive) movements in the price of the underlying asset occur. However, hedged positions such as the covered call or protective put can lead to decreased risk relative to the benchmark portfolio. When evaluating relative performance it will be important to consider risk exposure across strategies. Data Option data is collected from two sources. For the period January 1984 through December 1995 data for S&P 100 options is collected from the Berkeley Option Database (BODB). For the period January 1996 through April 2006 data for S&P 100 and S&P 500 options is collected from Optionmetrics. Since relatively few long-term S&P 100 options are traded, S&P 500 options are used to examine long-term strategies. The rate of return earned on the risk-free asset is the three-month, six-month, or one-year nominal rate of return earned on U.S. Treasury bills from the Federal Reserve website. Price and dividend data for the S&P 100 and S&P 500 are from CRSP. The use of different underlying indices is necessary due to the lack of long expiration S&P 100 options and limited data for S&P 500 options over the 22-year period. 5 The bull (bear) portfolio takes long positions in ATM call (put) options and writes OTM call (put) options. The straddle (strangle) portfolio takes long positions in both ATM (OTM) put and call options. The butterfly portfolio takes long positions in ITM and OTM call options and writes ATM call options. 8",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 35,
    "chunk_index": 13,
    "word_count": 373,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "bull (bear) portfolio takes long positions in ATM call (put) options and writes OTM call (put) options. The straddle (strangle) portfolio takes long positions in both ATM (OTM) put and call options. The butterfly portfolio takes long positions in ITM and OTM call options and writes ATM call options. 8",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 35,
    "chunk_index": 14,
    "word_count": 50,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "To find the appropriate option, a two-way sort is performed, matching on desired maturity and then on moneyness. Options are selected with time to expiration nearest to three months, six months, and one year. Options are selected with moneyness nearest to ATM, and OTM and ITM based on the following criteria. For calls (puts), the option with strike price nearest one standard deviation less (greater) than the current index price is designated as ITM. Similarly, for calls (puts), the option with strike price nearest one standard deviation greater (less) than the current index price is designated as OTM. Index prices for the previous five years are used to calculate standard deviations. The average annual standard deviation of the S&P 500 index over the sample period is 17%. This translates to a three-month standard deviation of 8.5%, and a six- month standard deviation of 12%. Consequently, for the three- and six-month samples respectively, options with strike-to-spot ratios nearest .92 and .88 (1.08 and 1.12) are selected as ITM (OTM) for call options and OTM (ITM) for put options. Within the BODB sample, both ITM put and call options are not always available. When this occurs, put-call parity is used to calculate a theoretical option price. Due to data limitations, the analysis for one-year options is restricted to 1996 through 2006. There is little variation in maturities within the three-month option sample since an option expiring in three months is always available. An option expiring in six months is not always available, causing greater variation in maturities in the six-month sample. This results in clustering of option expirations occurs within the six-month sample, typically in December, March, June, and September. For the one-year sample, only options with maturities of greater than one year are included. This restriction is made so the effect of long-term option positions on portfolio returns can be examined. Since S&P 500 long-term equity anticipation securities (LEAPS) expire in June and December, days to expiration for options in the twelve month sample vary from a high of 537 calendar days to a low of 380 calendar days. Estimation and Results Implementation 9",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 35,
    "chunk_index": 15,
    "word_count": 353,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "positions on portfolio returns can be examined. Since S&P 500 long-term equity anticipation securities (LEAPS) expire in June and December, days to expiration for options in the twelve month sample vary from a high of 537 calendar days to a low of 380 calendar days. Estimation and Results Implementation 9",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 35,
    "chunk_index": 16,
    "word_count": 50,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "The 12 strategies are implemented using three separate trading cost structures. For the first structure, MP, all options transactions are executed at the midpoint of the closing bid and offer prices on the given day. The second structure, BA, accounts for the bid-ask spread, by buying (selling) options at the closing ask (bid) price. Mean values and standard deviations of bid-ask spreads across moneyness and option maturities are presented in Table 1. As reported, using the BA method may lead to significantly higher option prices. Short-term OTM options have the highest percentage and most variable bid-ask spreads, consistent with the findings of George and Longstaff (1993). While the BA method highlights the impact bid-ask spreads may have on option returns, this effect must be considered a worst case scenario, as most transactions occur within the spread. To reflect all potential transaction costs, the third trading schedule, TC, incorporates trading commissions as well as bid-ask spreads. The cost of trading is given by a fairly expensive commission schedule outlined below.6 Dollar Amount of Trade Commission Rate < $2,500 $20 + $.02 x Dollar Amount $2,500-$10,000 $45 + $.01 x Dollar Amount > $10,000 $120 + $.0025 x Dollar Amount The transaction cost associated with buying the underlying asset is $25 or $0.025 per share purchased or sold, whichever is greater. Transaction costs are subtracted from leftover funds to be invested in the risk-free asset. If leftover funds are not sufficient to cover the fee, one fewer option contract or underlying share is purchased. For tractability we assume the underlying index can be purchased. Since it is possible to buy options on exchange traded funds (ETFs) such as SPDRs, the results here are quite applicable. Any dividends received on the index are added to left over cash. For the 10- and 22-year periods, the investor begins with $50,000 and $33,000, respectively, to invest in either an option portfolio or the benchmark portfolio.7 When options are written, part of this value is set aside as cash for the margin account. Given these initial starting values and monthly cash installments, option leverage, defined as the 6 Commission rates are found on page 193 of “Options, Futures, and Other Derivatives” published in 2006. 7 These amounts are equivalent after accounting for inflation. 10",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 35,
    "chunk_index": 17,
    "word_count": 378,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "is set aside as cash for the margin account. Given these initial starting values and monthly cash installments, option leverage, defined as the 6 Commission rates are found on page 193 of “Options, Futures, and Other Derivatives” published in 2006. 7 These amounts are equivalent after accounting for inflation. 10",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 35,
    "chunk_index": 18,
    "word_count": 50,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "ratio of the value of option shares to the value of underlying shares, ranges from 10% to 25%. Portfolio Returns Single Option Strategies Results for single option strategies are reported in Table 2. Panels A and B report annualized average monthly returns and confidence intervals for the 10-year and 22-year holding periods respectively. Returns are calculated as monthly percentage change in portfolio value, (cid:1844) (cid:3404) (cid:4666)(cid:3023)(cid:3295)(cid:2879)(cid:3023)(cid:3295)(cid:3127)(cid:3117)(cid:2879)(cid:3010)(cid:3295)(cid:4667) (1) (cid:3047) (cid:3023)(cid:3295)(cid:3127)(cid:3117) Where R is the return in month t, V is the value of the portfolio at the end of month t, t t and I is the cash installment in month t. 95% confidence intervals for portfolio returns are t calculated by bootstrapping under trading condition TC. Monthly returns are sampled with replacement for the 10- and 22-year period 1,000 times to estimate a standard error for construction of confidence intervals around measured mean sample returns. Bootstrapping is performed due to non-normality of option returns which causes portfolio returns to exhibit moderate skewness and kurtosis. The results provide several key insights. First, writing put options generates greater raw returns than taking equivalent long positions. This result persists regardless of time to expiration of options used or period examined. Writing call options generates higher returns than taking long positions for three-month options, while the reverse is typically true for options with longer times to expiration. Second, incorporating bid-ask spreads leads to a reduction of returns ranging from 10 to 70 basis points. Including transaction costs results in another 10 to 100 basis point reduction in returns, for a total 30 to 130 basis point. Third, portfolios involving written options outperform the benchmark portfolio even after considering transaction costs. These results are consistent with the findings of Coval and Shumway (2001), Bakshi and Kapadia (2003), and others who find evidence consistent with a negative volatility risk premium. By comparison, most portfolios employing long option strategies tend to underperform the benchmark portfolio. This finding corroborates the results of Figlewski (1989), Harvey and Whaley (1992), and 11",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 35,
    "chunk_index": 19,
    "word_count": 332,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "findings of Coval and Shumway (2001), Bakshi and Kapadia (2003), and others who find evidence consistent with a negative volatility risk premium. By comparison, most portfolios employing long option strategies tend to underperform the benchmark portfolio. This finding corroborates the results of Figlewski (1989), Harvey and Whaley (1992), and 11",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 35,
    "chunk_index": 20,
    "word_count": 50,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "Santa-Clara and Saretto (2006). The exceptions are long call portfolios over the 10-year holding period and the long six-month ATM call portfolio over the 22-year holding period. For these portfolios, significant returns were earned during the bull period of January 1996 through April 2000. These returns were reduced, but not entirely eliminated, in the bear period of April 2000 through December 2003. Table 2 also presents results for the covered call and protective put portfolios. There is a clear benefit to writing short-term covered call positions, and a clear cost to buying protective put positions. For the covered call (protective put) portfolio, the number of options written (purchased) is equal to the number of underlying shares held in the portfolio. In these cases no additional margin is required. Consistent with the BXM index, the short-term ATM covered call portfolio outperforms the benchmark portfolio.8 Portfolio values through time for the three-month covered call, three-month protective put, and benchmark portfolios over the 10-year holding period are presented in Figure 1. The final portfolio value of the covered call portfolio exceeds that of the benchmark portfolio by over $26,000, a difference of 11%. This strategy is most gainfully executed using short-term options. Covered call portfolios using six-month and one-year options have annualized returns 1.6% and 2.1% less than their three-month counterpart respectively. These results are expected since the position is a synthetic written put, and the written put portfolio was shown to outperform the benchmark portfolio in Table 2. The returns to protective put portfolios are always below those of the benchmark portfolio. This result is also expected since a protective put is a synthetic long call, and the long call portfolio underperforms the benchmark portfolio. However, the protective put portfolio underperforms the long call portfolio because, as shown by Bates (2000), buying put options is expensive relative to buying call options. Multiple Option Strategies Table 3 reports results for strategies involving multiple option positions. The success of these strategies clearly depends on the options’ time to expiration. For 8 Ibbotson Associates examined the returns to the BXM in the paper “Passive Options-Based Investment Strategies: The Case of the CBOE S&P 500 Buy Write Index.” From June 1988 through December 2005 the BXM index outperformed the S&P 500 by 1.7%. The results are comparable to the 10-year ATM covered call portfolio without transaction costs. 12",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 35,
    "chunk_index": 21,
    "word_count": 392,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "to the BXM in the paper “Passive Options-Based Investment Strategies: The Case of the CBOE S&P 500 Buy Write Index.” From June 1988 through December 2005 the BXM index outperformed the S&P 500 by 1.7%. The results are comparable to the 10-year ATM covered call portfolio without transaction costs. 12",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 35,
    "chunk_index": 22,
    "word_count": 50,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "example, the butterfly portfolio clearly performs best using short-term options. Transaction costs severely affect the profitability of this strategy, reducing returns from 8.7% to 6.6%. The straddle and strangle strategies are more profitable when longer-term options are used. Over the 10-year holding period, both the one-year straddle and one- year strangle portfolios significantly outperform the benchmark portfolio even after accounting for transaction costs. However, returns are highly variable, reflected in wider confidence intervals relative to portfolios using shorter-term options. The bull spread outperforms the benchmark portfolio using both long- and short-term options. The findings suggest multiple option strategies can be profitable. Table 3 also presents returns for synthetic stock portfolios. A synthetic stock position is created to mimic the payoff to the underlying asset by purchasing ATM call options and writing ATM put options. Two alternatives strategies to the ATM synthetic stock position are also tested. The first purchases ATM call options and writes OTM put options. The second purchases OTM call options and writes OTM put options. These are not technically synthetic stock positions since the strike prices of call and put options are not equal, but they are similar in intent. The results for these three portfolios are quite revealing and unique. Returns to long-term synthetic stock portfolios exceed those of the benchmark portfolio by as much as 15% after considering transaction costs. Higher returns are realized through writing expensive put options, while taking a long levered position in call options. Returns to synthetic stock portfolios are substantial, highlighted by the one-year OTM portfolio over the 10-year holding period. Note the substantial increase in the range of confidence intervals when one-year options are used rather than shorter-term options. This is directly attributable to clustering of option expirations. Figure 2 presents ATM synthetic stock portfolio values across different option maturities through time. While portfolio returns are impressive they are also highly variable. This can be observed in Figure 1 by comparing the variability of portfolio values through time for the three-month ATM synthetic positions to the benchmark, covered call, and protective put portfolios. Due to the relatively high variability observed for synthetic stock portfolios, it is necessary to assess whether these portfolios outperform the benchmark portfolio on a risk-adjusted basis. The results for synthetic stock portfolios should not be surprising since they simply take a levered long market 13",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 35,
    "chunk_index": 23,
    "word_count": 390,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "and protective put portfolios. Due to the relatively high variability observed for synthetic stock portfolios, it is necessary to assess whether these portfolios outperform the benchmark portfolio on a risk-adjusted basis. The results for synthetic stock portfolios should not be surprising since they simply take a levered long market 13",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 35,
    "chunk_index": 24,
    "word_count": 50,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "position. This is equivalent to holding a high beta portfolio. However, unlike a high beta portfolio, writing OTM put options generates high returns in part due to Rubinstein’s notion of “crashophobia”. Impact of Margin Requirements To assess the impact of option leverage, three-month synthetic stock portfolios are constructed using five different percentage of the maximum allowable margin. These range from 10% of the maximum allowable margin to allowing use of the full margin. Table 4 presents annualized monthly returns and standard deviations, as well as the frequencies of margin calls for the portfolios. In Panel A, results are presented for the 10-year holding period. As option leverage increases, standard deviations of portfolio returns and frequencies of margin calls increase. Returns also increase with option leverage until the full amount of margin is used. In this case the portfolio loses all value, suggesting a critical point exists beyond which increased option leverage exposes the portfolio to large negative realizations which cannot be justified by higher returns. Panel B presents results for the 22-year holding period. A similar pattern is observed, but the negative impact of the increased option leverage is present at lower levels. In particular, using 75% of the available margin results in a negative return over the holding period due to the crash of October 1987. These losses were a result of taking a large written position in puts. In the 100% option leverage case, the impact of the crash was much more significant, resulting in loss of all portfolio value. Overall the results reveal that the effect of changing option leverage is mostly monotonic; as option leverage increases so do returns, standard deviations, and the frequency of margin calls. However, in our case, there is a significant jump in risk when over 50% of the available margin in used resulting in a worst case scenario of complete loss of portfolio value. Figure 3 further highlights the impact of option leverage by presenting ATM synthetic stock portfolio values through time using 10%, 50%, and 100% of maximum allowable margin. Risk-Adjusted Returns 14",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 35,
    "chunk_index": 25,
    "word_count": 343,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "over 50% of the available margin in used resulting in a worst case scenario of complete loss of portfolio value. Figure 3 further highlights the impact of option leverage by presenting ATM synthetic stock portfolio values through time using 10%, 50%, and 100% of maximum allowable margin. Risk-Adjusted Returns 14",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 35,
    "chunk_index": 26,
    "word_count": 50,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "To properly assess the performance of option portfolios, it is necessary to construct risk- adjusted return measures. Three traditional measures are employed: Jensen’s alpha, the Sharpe ratio, and the Treynor ratio. The Sharpe ratio is calculated using trading method TC as portfolio returns, R, i minus the annualized risk-free rate, r, divided by the standard deviation of portfolio f returns, σ. i R −r SR = i f (2) i σ i Calculating Jensen’s alpha and the Treynor ratio requires first calculating the portfolio’s option beta. An option’s beta is calculated as (cid:2010) (cid:1568) (cid:3083)(cid:3016)/(cid:3016)(cid:3020)(cid:3295) (cid:3404) (cid:3020)(cid:3295)Δ (3) (cid:3016),(cid:3047) (cid:2930) (cid:3083)(cid:3020)/(cid:3020) (cid:3016)(cid:3295) (cid:3016)(cid:3295) where Δ is the delta of the option at the beginning of month t and S and O are prices of t the underlying index and option respectively. Since options are purchased on a monthly basis, a time series of option betas,β , are generated. In addition to time varying betas, O,t the weight of option positions in the portfolio,ψ, changes through time.9 Weighted average portfolio betas over the sample period, are calculated as 1 T β = ∑⎡ψβ +(1−ψ)β ⎤ (4) i,t ⎣ t O,t t S,t⎦ T t=1 whereβ is the beta of the underlying asset, and T is the total number of months in the S,t sample. For all portfolios,β =1 since the underlying asset is the index. S,t The Treynor ratio is equivalent to the Sharpe ratio only excess returns are divided by the portfolio beta, β. i 9 Values for beta and portfolio weights are available upon request. 15",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 35,
    "chunk_index": 27,
    "word_count": 257,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "of months in the S,t sample. For all portfolios,β =1 since the underlying asset is the index. S,t The Treynor ratio is equivalent to the Sharpe ratio only excess returns are divided by the portfolio beta, β. i 9 Values for beta and portfolio weights are available upon request. 15 R −r TR = i f (5) i β i Jensen’s alpha is calculated as the difference between realized and expected returns. Expected returns are calculated as the risk-free rate plus the product of the portfolio’s beta and excess return on the index. Jα = R − ( r +β(R −r )) (6) i i f i m f whereR is the return on the market. Bootstrapped p-values are calculated under the null m hypothesis that Jensen’s alpha = 0. Given the non-linear payoff feature of options, it is unclear if the traditional measures employed adequately capture the risk associated with including options in a portfolio that is already long the underlying asset. Due to this concern, we calculate the manipulation-proof performance measure presented in Ingersoll et al. (2007). As shown in Ingersoll et al. (2007) the previously presented traditional measures can be manipulated or may not provide reliable estimates of relative performance. Also, the traditional measures are designed with normally or log-normally distributed returns in mind. Since option returns have been shown to be highly skewed, it is important to test the robustness of our findings with a measure which does not make restrictive return distribution assumptions. The manipulation-proof performance measure, MPPM, is calculated as (cid:2869)(cid:2879)(cid:3096) (cid:1839)(cid:1842)(cid:1842)(cid:1839) (cid:3404) (cid:2869) (cid:1864)(cid:1866)(cid:4678) (cid:2869) ∑(cid:3021) (cid:3428) (cid:2869)(cid:2878)(cid:3019)(cid:3284),(cid:3295)(cid:3432) (cid:4679) (7) (cid:3047)(cid:2880)(cid:2869) (cid:4666)(cid:2869)(cid:2879)(cid:3096)(cid:4667)(cid:2940)(cid:3047) (cid:3021) (cid:4666)(cid:2869)(cid:2878)(cid:3045)(cid:3281),(cid:3295) ρ , a proxy for investor risk aversion, is calculated as 16",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 35,
    "chunk_index": 28,
    "word_count": 283,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "robustness of our findings with a measure which does not make restrictive return distribution assumptions. The manipulation-proof performance measure, MPPM, is calculated as (cid:2869)(cid:2879)(cid:3096) (cid:1839)(cid:1842)(cid:1842)(cid:1839) (cid:3404) (cid:2869) (cid:1864)(cid:1866)(cid:4678) (cid:2869) ∑(cid:3021) (cid:3428) (cid:2869)(cid:2878)(cid:3019)(cid:3284),(cid:3295)(cid:3432) (cid:4679) (7) (cid:3047)(cid:2880)(cid:2869) (cid:4666)(cid:2869)(cid:2879)(cid:3096)(cid:4667)(cid:2940)(cid:3047) (cid:3021) (cid:4666)(cid:2869)(cid:2878)(cid:3045)(cid:3281),(cid:3295) ρ , a proxy for investor risk aversion, is calculated as 16",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 35,
    "chunk_index": 29,
    "word_count": 50,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "ln⎡ ⎣ E(1+r%b )⎤ ⎦ −ln(1+r f ) ρ= (8) Var⎡ ⎣ ln(1+r%b )⎤ ⎦ where r%b is the return on the benchmark portfolio. To assess statistical significance, t- statistics are calculated using standard errors of MPPM estimates. Table 5 presents values for risk-adjusted performance measures using the TC method over the 10-year holding period. If each of the four risk-adjusted performance measures for a portfolio exceed (are less than) those of the benchmark portfolio, the strategy is considered to generate positive (negative) abnormal returns. In agreement with previously presented results and prior literature, many portfolios have risk-adjusted performance worse than the benchmark portfolio. However, some portfolios exhibit risk- adjusted performance which exceeds that of the benchmark portfolio. When three-month options are used, written put portfolios for all moneyness levels, as well as ATM and OTM written call portfolios, exhibit positive abnormal performance. The ATM covered call and ATM synthetic stock portfolios also outperform the benchmark portfolio for each of the four risk-adjusted performance measures. When six-month options are used, the ATM and OTM written put portfolios as well as the ATM and OTM written call portfolios outperform the benchmark portfolio for each of the four performance measures. Two of the three synthetic stock portfolios, the bull portfolio, and long ATM and ITM call portfolios also exhibit positive abnormal performance. Jensen’s alpha and the MPPM for the ATM synthetic stock portfolio are both significantly different for those of the benchmark portfolio. This can be explained by investors’ high levels of risk aversion to market crashes being reflected in long-term put prices. The abnormal performance of synthetic stock portfolios results from combining the profitability of long call and written put positions which both exhibit returns in excess of the benchmark. Writing put options allows for buying more call options, leading to increased profitability without an equivalent increase in risk. When one-year options are used, each of the three synthetic stock portfolios, long OTM and ATM call portfolios, written put portfolios at all moneyness levels, as well as the bull, strangle, and straddle portfolios outperform the benchmark portfolio. Synthetic stock portfolios using ATM and OTM options are the only portfolios where performance 17",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 35,
    "chunk_index": 30,
    "word_count": 361,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "are used, each of the three synthetic stock portfolios, long OTM and ATM call portfolios, written put portfolios at all moneyness levels, as well as the bull, strangle, and straddle portfolios outperform the benchmark portfolio. Synthetic stock portfolios using ATM and OTM options are the only portfolios where performance 17",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 35,
    "chunk_index": 31,
    "word_count": 50,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "differences are statistically significant. This is again the result of writing profitable put options which allows more call options to be purchased. Relative Risk Aversion The findings suggest marginal benefits to holding and writing options are present for some strategies. However, to assess whether these are appropriate strategies for an individual investor who typically holds a long position in the underlying asset, it is necessary to infer levels of risk aversion for this investor. We also must consider how including options in the portfolio impacts the investor’s relative risk aversion. Unlike the works of Liu and Pan (2003), and Driessen and Maenhout (2007), we do not solve for optimal weights in portfolios that combine options and the underlying asset given levels of risk aversion. Instead, the weights remain fixed, and we solve for risk aversion coefficients. This allows for direct comparison of risk aversion parameters across portfolios. Also, results are less dependent on the form of the utility function since any error in model specification will have a similar affect on the risk aversion coefficients of all portfolios. Our intent is not to solve explicitly for levels of risk aversion, but to demonstrate ranges of investor risk aversion which make investment with various option strategies appropriate. As shown in Harvey and Siddique (2000), investors price skewness in returns, carrying a risk premium of almost 4% per year. Since options exhibit greater skewness than equities, the three-moment CAPM derived in Kraus and Litzenberger (1976) is used to account for skewness in returns. The equilibrium rate of return can be expressed as, E(R ) = R +bβ +b Ω (9) i f 1 i 2 i whereβ is the beta of the portfolio and Ω is the systematic skewness of the portfolio. Systematic skewness captures any asymmetry in portfolio return distributions. b , and b 1 2 can be thought of as market prices of portfolio standard deviation reduction and 18",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 35,
    "chunk_index": 32,
    "word_count": 319,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "f 1 i 2 i whereβ is the beta of the portfolio and Ω is the systematic skewness of the portfolio. Systematic skewness captures any asymmetry in portfolio return distributions. b , and b 1 2 can be thought of as market prices of portfolio standard deviation reduction and 18 systematic skewness reduction, respectively. Assuming a power utility function as in Kraus and Litzenberger (1976), b and b are equal to10 1 2 ∂R γR−γ−1σ2 b = iσ = m m (10) 1 ∂σ m γ(γ+1)R−γ−2σ2 γ(γ+1)(−γ−2)R−γ−3ξ i R−γ+ m m + m m m 2 6 ∂R −γ(γ+1)R−γ−2ξ b = i σ = m m (11) 2 ∂3ξ m ⎡ γ(γ+1)R−γ−2σ2 γ(γ+1)(−γ−2)R−γ−3ξ ⎤ i 2 R−γ+ m m + m m ⎢ ⎥ m 2 6 ⎣ ⎦ whereγis the coefficient of relative risk aversion, R(R )is the return on portfolio i (the i m market), σ(σ) is the standard deviation of returns for portfolio i, and ξ(ξ ) is the raw i m i m skewness of portfolio i. It is assumed investors are maximizing expected returns, not expected wealth, and are concerned with the first three moments of returns, ignoring higher moments. Minimizing Sum of Squared Errors We estimate γ for each portfolio in two ways. First, we estimateβ%and Ω% for each portfolio, then minimize the sum of daily squared differences between actual returns,R ˆ , and estimated returns, R% , in each month t such that, T 2 [ ] SSE = min∑ e (12) i,t γ t=1 where ~ ~ ~ R = R +b β+b Ω (13) i,t f,t 1,t i 2,t i ~ ˆ e =(R −R ) (14) i,t i,t i,t R1−γ −1 10 This result comes from the Taylor series expansion of power utility, U(R) = 1−γ 19",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 35,
    "chunk_index": 33,
    "word_count": 297,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "e (12) i,t γ t=1 where ~ ~ ~ R = R +b β+b Ω (13) i,t f,t 1,t i 2,t i ~ ˆ e =(R −R ) (14) i,t i,t i,t R1−γ −1 10 This result comes from the Taylor series expansion of power utility, U(R) = 1−γ 19",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 35,
    "chunk_index": 34,
    "word_count": 50,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "and cov(R,R ) β% = i m (15) i var(R ) m (R −R)(R −R )2 Ω% = i i m m (16) i (R −R )3 m m ~ (cid:2870) Where E(cid:3427)e (cid:3431) (cid:3404) 0 and E(cid:3427)e(cid:2870) (cid:3431) (cid:3404) (R ˆ −R ) . To allow for comparison across varying (cid:2919),(cid:2930) (cid:2919),(cid:2930) i,t i,t levels of risk aversion, minimization is performed for the benchmark portfolio as well as eleven one-year ATM option portfolios.11 The results are presented with skewness restricted to zero (ξ=0), as well as using estimated skewness over the period. This will demonstrate the relative premium investors place on skewness, given the estimated parameter Ω% . As Ω% decreases, the effect of skewness on the risk aversion parameters also decreases. Table 6 Panel A presents estimated risk aversion parameters. The risk aversion parameter for the benchmark portfolio is 2.89 when skewness is restricted to zero, and 3.87 when skewness is unrestricted. This implies investors who consider skewness are more risk averse. For option portfolios, when skewness is restricted to zero, risk aversion parameters are always less than the benchmark portfolio risk aversion parameter. This implies including options in portfolios requires increased risk tolerance. When incorporating skewness, this result holds, with certain strategies such as the synthetic stock, strangle, butterfly, and long call requiring even greater risk tolerance. To further explore this issue, risk aversion coefficients are estimated for the five three-month synthetic stock portfolios using different percentage of maximum allowable margin. This analysis captures the impact of increasing the weight of options in the portfolio on risk aversion parameters. Three-month synthetic stock portfolios are examined because they tend to exhibit negatively skewed returns, similar to those of the benchmark portfolio. We begin with 10% of the maximum allowable margin, and increase option leverage up to a maximum of 100%. Results are presented in Table 6 Panel B. 11 The naked call position is not included in this analysis because the portfolio takes a long position in the underlying asset, making it similar in payoff to the covered call. 20",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 35,
    "chunk_index": 35,
    "word_count": 342,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "and increase option leverage up to a maximum of 100%. Results are presented in Table 6 Panel B. 11 The naked call position is not included in this analysis because the portfolio takes a long position in the underlying asset, making it similar in payoff to the covered call. 20",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 35,
    "chunk_index": 36,
    "word_count": 50,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "When ξ is restricted to zero, risk aversion coefficients increase with option m leverage up to the 50% level, and decrease thereafter. Surprisingly the results imply a more risk averse investor would prefer the large increase in option leverage from 10% to 50%. When ξ is unrestricted, risk aversion coefficients decrease with increased option m leverage. This highlights the importance of incorporating skewness when examining portfolios that include options. While the synthetic stock portfolio generates significantly higher returns than the benchmark portfolio, investment in this portfolio at any option leverage requires increased risk tolerance. GMM Estimation The second approach does not restrict β%and Ω% as in equations (15) and (16), allowing for potential measurement error in both variables. The possibility of measurement errors biases coefficients to zero. To alleviate the attenuation problem, we estimateγ,β%and Ω% jointly in a GMM framework. An added issue in the estimation is the calculation of (cid:1844) ,(cid:2026) , and (cid:2022) . Rather than fixing these values to historical levels, we (cid:3040) (cid:3040) (cid:3040) allow for intertemporal variation across months by using daily returns aggregated to monthly levels. Unlike the first approach where the model is calibrated by minimizing the difference between actual and expected returns, the GMM estimation minimizes the following for each portfolio, (cid:1836) (cid:3404) (cid:1859)(cid:4666)(cid:2030)(cid:4667) (cid:1314)(cid:1849)(cid:4666)(cid:2030)(cid:4667) (cid:1859)(cid:4666)(cid:2030)(cid:4667) (17) (cid:3036) (cid:3036),(cid:3021) (cid:3036),(cid:3021) (cid:3036),(cid:3021) where (cid:1859)(cid:4666)(cid:2030)(cid:4667) (cid:2869) ∑(cid:3021) (cid:1858)(cid:4666)(cid:2030)(cid:4667) and (cid:1849) is the optimal positive-definite symmetric weighting (cid:3021) (cid:3047)(cid:2880)(cid:2869) (cid:3036),(cid:3047) (cid:3021) (cid:3021) matrix equal to the inverse of (cid:1831)(cid:4670)(cid:1858)(cid:4666)(cid:2030)(cid:4667)(cid:4593) (cid:1858)(cid:4666)(cid:2030)(cid:4667) (cid:4671) as given in Hansen (1982). The (cid:3036),(cid:3047) (cid:3036),(cid:3047) parameter vector (cid:1858)(cid:4666)(cid:2030)(cid:4667), which contains unknown elements (cid:2011), β%, and Ω% , is defined as, (cid:1857) (cid:3036),(cid:3047) (cid:1741) (cid:1744) (cid:1857) (cid:1854) (cid:3036),(cid:3047) (cid:2869) (cid:1742) (cid:1745) (cid:1858)(cid:4666)(cid:2030)(cid:4667) (cid:1857) (cid:1854) (18) (cid:3036),(cid:3047)(cid:1742) (cid:3036),(cid:3047) (cid:2870) (cid:1745) (cid:1742) ~ (cid:2870)(cid:1745) (cid:1857)(cid:2870) (cid:3398)(R ˆ −R ) (cid:1743) (cid:3036),(cid:3047) i,t i,t (cid:1746) 21",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 35,
    "chunk_index": 37,
    "word_count": 301,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "The (cid:3036),(cid:3047) (cid:3036),(cid:3047) parameter vector (cid:1858)(cid:4666)(cid:2030)(cid:4667), which contains unknown elements (cid:2011), β%, and Ω% , is defined as, (cid:1857) (cid:3036),(cid:3047) (cid:1741) (cid:1744) (cid:1857) (cid:1854) (cid:3036),(cid:3047) (cid:2869) (cid:1742) (cid:1745) (cid:1858)(cid:4666)(cid:2030)(cid:4667) (cid:1857) (cid:1854) (18) (cid:3036),(cid:3047)(cid:1742) (cid:3036),(cid:3047) (cid:2870) (cid:1745) (cid:1742) ~ (cid:2870)(cid:1745) (cid:1857)(cid:2870) (cid:3398)(R ˆ −R ) (cid:1743) (cid:3036),(cid:3047) i,t i,t (cid:1746) 21",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 35,
    "chunk_index": 38,
    "word_count": 50,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "Solving (cid:2011), β%, and Ω% , requires setting (cid:1831)(cid:3427)(cid:1858)(cid:4666)(cid:2030)(cid:4667) (cid:3431) (cid:3404) 0. This is accomplished through (cid:3036),(cid:3047) minimizing equation 16 over t monthly observations for the 11 option portfolios and the five three-month synthetic stock portfolios. Table 6 presents GMM estimation results. Ω% is higher for all portfolios with the exception of the covered call and protective put. 11 out of the 16 portfolios have Ω% which are significantly different from prior estimation. By comparison only the four synthetic stock portfolios with option leverage above 10% have significantly differentβ%. This suggests some measurement error is present in the first estimation. The conclusions from GMM estimation are similar to those observed when using the more restrictive calibration approach. Risk aversion coefficients for all the portfolios are lower than the risk aversion coefficient for the benchmark portfolio. This is consistent with the prior estimation and conclusions. To test goodness of fit, we examine the difference between the restricted, where Ω% and β% are set equal to equations (15) and (16), and the unrestricted models, which estimates (cid:2011), β%, and Ω% jointly. The difference between the models is distributed (cid:2031)(cid:2870). Differences between the restricted and unrestricted model are not significant at the 5% level for any portfolio. This is not surprising given the short time horizon over which estimation was conducted. The finding of no significant difference between the models supports the conclusion that investing in options requires greater risk tolerance. Conclusion Using a tractable portfolio approach we present results demonstrating some unique benefits and costs of options. The results do not contradict the findings of Figlewski (1989, 1994), Harvey and Whaley (1992), and Santa-Clara and Saretto (2006), who conclude that options are expense. We focus on the marginal impact of buying or writing options as a supplement to a long position in the underlying asset. This is distinct from examining the risk-return characteristics of options alone. The inclusion of options within a portfolio is expensive, most often resulting in poor performance relative to the benchmark portfolio. However, there are some portfolios 22",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 35,
    "chunk_index": 39,
    "word_count": 340,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "writing options as a supplement to a long position in the underlying asset. This is distinct from examining the risk-return characteristics of options alone. The inclusion of options within a portfolio is expensive, most often resulting in poor performance relative to the benchmark portfolio. However, there are some portfolios 22 which incorporate options that outperform the benchmark portfolio. This finding appears to be a function of two factors. First, and consistent with prior findings, writing put options generates high returns. These returns are compensation for bearing investors’ aversion to volatility risk. Second, the use of leverage enhances portfolio returns, so long as options do not constitute an excessive percentage of overall portfolio value. Too much leverage, as all evidence in theory and practice has shown, can result in significant losses. Risk-adjusted performance measures provide further insight to the risk-return characteristics of the various option positions. Traditional risk-adjusted performance measures as well as the manipulation-proof measure presented in Ingersoll (2007) are used to evaluate option portfolio performance relative to the benchmark portfolio. Many synthetic stock portfolios significantly outperform the benchmark portfolio on a risk- adjusted basis, while most other option portfolios underperform. Primarily, other portfolios exhibiting positive abnormal performance write options. As expected, we find investing in options requires increased risk tolerance for all strategies. Thus, while leveraging a portfolio with options may increase returns, the investor must be willing to accept higher volatility and skewness. 23",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "Introduction",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 35,
    "chunk_index": 40,
    "word_count": 236,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "most other option portfolios underperform. Primarily, other portfolios exhibiting positive abnormal performance write options. As expected, we find investing in options requires increased risk tolerance for all strategies. Thus, while leveraging a portfolio with options may increase returns, the investor must be willing to accept higher volatility and skewness. 23",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "References:",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 35,
    "chunk_index": 41,
    "word_count": 50,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References: (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "1. Bakshi, G., C. Cao, and Z. Chen, 1997, “Empirical Performance of Alternative Option Pricing Models.” Journal of Finacne, 52, 2003-2049. 2. Bakshi, G., and N. Kapadia, 2003, “Delta-hedged Gains and the Negative Volatility Risk Premium,” Review of Financial Studies, 16, 527-566. 3. Bates, D., 1996, “Jumps and Stochastic Volatility: Exchange Rate Processes Implicit in Deutsche Mark Options,” Review of Financial Studies, 9, 69-107. 4. Bates, D., 2000, “Post ‘87 Crash Fears in S&P 500 Future Options,” Journal of Econometrics, 94, 181-238. 5. Black, F., and M. Scholes, 1973, “The Pricing of Options and Corporate Liabilities,” Journal of Political Economy, 81, 637-654. 6. Chance, D., 1989, An Introduction to Options and Futures. (The Dryden Press, Chicago). 7. Coval, J. and T. Shumway, 2001, “Expected Option Returns,” Journal of Finance, 56, 983-1009. 8. Davidson, A. C., and D. V. Hinkley, 1997 Bootstrap Methods and Their Application. (Cambridge University Press, Cambridge, U.K.). 9. Doran, J. 2007, “The Influence of Tracking Error on Volatility Premium Estimation.” Journal of Risk, Volume 9, No. 3, 1-36. 10. Driessen, J. and P. Maenhout, 2007, “An Empirical Portfolio Perspective On Option Pricing Anomalies,” Review of Finance 11(4):561-603 11. Duffie, D., J. Pan, and K. Singleton, 2000, “Transform Analysis and Asset Pricing for Affine Jump Diffusions,” Econometrica, 68(6), 1343-1376. 12. Figlewski, S., 1994, “How to Lose Money in Derivatives,” Journal of Derivatives, 2, 75-82. 13. Figlewski, S., 1989, “Option Arbitrage in Imperfect Markets,” Journal of Finance, 44, 1289-1311. 14. George, T.J., and F.A. Longstaff, 1993, “Bid-ask Spreads and Trading Activity in the S&P 100 Index Option Market,” Journal of Financial and Quantitative Analysis, 28, 381-397. 24",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "References:",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 35,
    "chunk_index": 42,
    "word_count": 268,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References: (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "Money in Derivatives,” Journal of Derivatives, 2, 75-82. 13. Figlewski, S., 1989, “Option Arbitrage in Imperfect Markets,” Journal of Finance, 44, 1289-1311. 14. George, T.J., and F.A. Longstaff, 1993, “Bid-ask Spreads and Trading Activity in the S&P 100 Index Option Market,” Journal of Financial and Quantitative Analysis, 28, 381-397. 24 15. Harvey, C., and R. Whaley, 1992, “Market Volatility Prediction and the Efficiency of the S&P 100 Index Option Market,” Journal of Financial Economics, 31, 43-73. 16. Heston, S., 1993, “A Closed-Form Solution of Options with Stochastic Volatility with Applications to Bond and Currency Options,” Review of Financial Studies, 6, 327-343. 17. Hull, J., 2006, Options, Futures, and Other Derivatives. (Prentice Hall, New Jersey). 18. Hull, J., and A. White, 1987, “The Price of Options on Assets with Stochastic Volatilities,” Journal of Finance, 42, 281-300. 19. Ingersoll, J., Spiegel, M., Goetzmann, and I. Welch, “Portfolio Performance Manipulation and Manipulation-proof Performance Measures,” Review of Financial Studies, 20, 1503-1546. 20. Lakonishok, J., I. Lee, N. Pearson, and A. Poteshman, 2007, “Option Market Activity,” Review of Financial Studies, 20, 813-857. 21. Liu, J. and J. Pan, 2003, “Dynamic Derivative Strategies,” Journal of Financial Economics, 69, 401-430. 22. Pan, J., 2002, “The Jump-Risk Premia Implicit in Options: Evidence from an Integrated Time-Series Study,” Journal of Financial Economics, 63, 3-50. 23. Rubinstein, M., 1994, “Implied Binomial Trees,” Journal of Finance, 49, 771-818. 24. Santa-Clara, P., and A. Saretto, 2006, “Option Strategies: Good Deals and Margin Calls,” UCLA Working Paper. 25",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "References:",
    "page_number": 25,
    "page_range": "p.25-26",
    "total_pages": 35,
    "chunk_index": 43,
    "word_count": 245,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References: (p.25-26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "J., 2002, “The Jump-Risk Premia Implicit in Options: Evidence from an Integrated Time-Series Study,” Journal of Financial Economics, 63, 3-50. 23. Rubinstein, M., 1994, “Implied Binomial Trees,” Journal of Finance, 49, 771-818. 24. Santa-Clara, P., and A. Saretto, 2006, “Option Strategies: Good Deals and Margin Calls,” UCLA Working Paper. 25 Table 1: Bid-Ask Spreads Average percentage bid-ask spreads are presented for call and put options with times to expiration of three months, six months, and one year. Results are reported for three moneyness levels: at-the-money (ATM), in-the-money (ITM), and out-of-the-money (OTM). Averages are calculated over the period January 1984 through April 2006 for three- and six-month options on the S&P 100. For one-year options on the S&P 500, the sample period is January 1996 through April 2006. ATM ITM OTM Call Put Call Put Call Put 3 Month Mean 5.8% 6.3% 3.3% 3.6% 21.3% 10.6% StD 2.5% 2.4% 1.4% 1.3% 30.6% 5.8% ρ -1.8% 2.1% -4.9% -1.9% 3.6% 7.4% 6 Month Mean 5.1% 5.4% 2.6% 3.0% 12.0% 8.7% StD 2.4% 2.2% 1.2% 1.1% 10.5% 4.0% ρ 0.5% 2.4% -3.9% -2.7% -4.5% 7.1% 1 Year Mean 3.7% 2.6% 1.7% 1.3% 8.8% 8.1% StD 1.2% 1.0% 0.5% 0.4% 3.3% 5.0% ρ 9.8% -15.3% -14.8% -24.2% -9.0% -5.4% 26",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "References:",
    "page_number": 26,
    "page_range": "p.26-27",
    "total_pages": 35,
    "chunk_index": 44,
    "word_count": 206,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References: (p.26-27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "-1.9% 3.6% 7.4% 6 Month Mean 5.1% 5.4% 2.6% 3.0% 12.0% 8.7% StD 2.4% 2.2% 1.2% 1.1% 10.5% 4.0% ρ 0.5% 2.4% -3.9% -2.7% -4.5% 7.1% 1 Year Mean 3.7% 2.6% 1.7% 1.3% 8.8% 8.1% StD 1.2% 1.0% 0.5% 0.4% 3.3% 5.0% ρ 9.8% -15.3% -14.8% -24.2% -9.0% -5.4% 26 Table 2: Single Option Portfolio Returns Table 2 presents returns over the 10 and 22-year holding periods for six single option portfolios: long call (LC), long put (LP), written call (WC), written put (WP), covered call (CC), and protective put (PP). Each portfolio is constructed using options in three moneyness categories denoted with subscripts: at-the-money (A), in-the- money (I), and out-of-the-money (O). The option with strike price nearest the current index price is considered at-the-money. For call (put) options, the option with strike price nearest one standard deviation greater (less) than the current index price is considered out-of-the-money (in-the-money). For call (put) options, the option with strike price nearest one standard deviation less (greater) than the current index price is considered in-the-money (out-of-the-money). Returns are calculated assuming no transaction costs (RET ), incorporating bid-ask spreads (RET ), and incorporated bid-ask spreads as well as transaction costs (RET ). Bootstrapped MP BA TC confidence intervals for returns (CI), are calculated incorporating bid-ask spreads as well as transaction costs. In Panel A, results are presented for three-month, six- month, and one-year options over the 10-year holding period. In Panel B, results are presented for three-month, six-month options over the 22-year holding period. Panel A: 10-Year Holding Period Three-Month Six-Month One-Year RET RET RET CI RET RET RET CI RET RET RET CI MP BA TC MP BA TC MP BA TC LC 7.7% 7.6% 6.6% [4.4%,8.8%] 8.5% 8.2% 8.2% [6.0%,10.5%] 11.8% 11.7% 11.2% [8.6%,13.8%] A LC 8.6% 8.6% 7.7% [5.5%,9.9%] 8.8% 8.6% 8.2% [6.0%,10.5%] 9.2% 9.2% 8.7% [6.5%,11.0%] I LC 8.4% 7.7% 7.1% [4.6%,9.5%] 7.3% 7.1% 6.7% [4.4%,8.9%] 16.1% 15.8% 15.2% [11.6%,18.9%] O LP 3.5% 3.2% 3.0% [1.0%,5.1%] 3.5% 3.2% 2.9% [1.6%,4.2%] 4.7% 4.5% 4.0% [1.9%,6.1%] A LP 5.0% 4.8% 4.5% [2.4%,6.5%] 4.2% 4.0% 3.8% [2.5%,5.2%] 4.8% 4.8% 4.8% [2.7%,6.8%] I LP 1.3% 1.0% 0.7% [-1.2%,2.7%] 2.9% 2.7% 2.4% [1.1%,3.8%] 0.6% 0.4% 0.2% [-1.7%,2.2%] O WC 9.1% 8.9% 8.3% [6.4%,10.3%] 9.8% 9.4% 8.7% [6.7%,10.8%] 7.4% 7.2% 6.9% [4.9%,8.9%] A WC 8.8% 8.4% 7.7% [5.5%,9.9%] 10.0% 9.6% 8.7% [6.1%,11.3%] 8.3% 8.3% 7.8% [5.8%,9.9%] I WC 8.6% 8.5% 8.2% [6.2%,10.1%] 8.8% 8.7% 8.3% [6.3%,10.2%] 7.4% 7.2% 7.1% [5.2%,9.0%] O WP 11.2% 10.5% 10.5% [8.2%,12.7%] 11.0% 10.7% 10.2% [7.5%,12.9%] 9.5% 9.4% 9.1% [7.2%,11.0%] A WP 12.2% 11.1% 11.1% [8.6%,13.6%] 11.8% 11.3% 10.4% [6.4%,14.3%] 10.8% 10.8% 10.3% [8.2%,12.4%] I WP 9.8% 9.3% 9.3% [7.2%,11.4%] 9.4% 9.2% 8.8% [6.6%,11.0%] 9.2% 9.1% 8.9% [7.0%,10.8%] O CC 9.6% 9.2% 8.5% [6.3%,10.6%] 8.0% 7.8% 7.1% [5.0%,9.3%] 7.5% 7.4% 6.7% [4.3%,9.1%] A CC 9.4% 8.7% 7.7% [4.9%,10.4%] 8.8% 8.5% 7.6% [5.0%,10.2%] 9.9% 9.8% 9.0% [5.8%,12.2%] I CC 8.2% 8.0% 7.8% [5.8%,9.8%] 7.7% 7.6% 7.0% [5.0%,9.0%] 7.1% 7.0% 6.4% [4.4%,8.4%] O PP 4.1% 3.9% 3.7% [1.6%,5.9%] 3.6% 3.3% 2.7% [0.3%,5.1%] 5.8% 5.8% 5.2% [3.1%,7.4%] A PP -1.4% -1.6% -2.1% [-5.2%,0.9%] 0.2% -0.2% -1.1% [-4.4%,2.2%] 4.3% 4.1% 3.5% [0.6%,6.4%] I PP 5.3% 5.1% 4.5% [2.5%,6.5%] 6.3% 6.2% 5.6% [3.6%,7.7%] 6.0% 5.9% 5.3% [3.5%,7.2%] O 27",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "References:",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 35,
    "chunk_index": 45,
    "word_count": 532,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References: (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "7.0% [5.0%,9.0%] 7.1% 7.0% 6.4% [4.4%,8.4%] O PP 4.1% 3.9% 3.7% [1.6%,5.9%] 3.6% 3.3% 2.7% [0.3%,5.1%] 5.8% 5.8% 5.2% [3.1%,7.4%] A PP -1.4% -1.6% -2.1% [-5.2%,0.9%] 0.2% -0.2% -1.1% [-4.4%,2.2%] 4.3% 4.1% 3.5% [0.6%,6.4%] I PP 5.3% 5.1% 4.5% [2.5%,6.5%] 6.3% 6.2% 5.6% [3.6%,7.7%] 6.0% 5.9% 5.3% [3.5%,7.2%] O 27 Table 2 Cont. Panel B: 22 Year Holding Period Three-Month Six-Month RET RET RET CI RET RET RET CI MP BA TC MP BA TC LC 11.1% 10.8% 10.4% [9.0%,11.8%] 11.4% 11.3% 10.9% [9.5%,12.3%] A LC 10.5% 10.5% 10.0% [8.6%,11.3%] 10.6% 10.5% 10.0% [8.7%,11.3%] I LC 11.3% 10.6% 10.1% [8.7%,11.6%] 10.7% 10.3% 10.1% [8.7%,11.5%] O LP 6.4% 6.2% 5.9% [4.7%,7.2%] 6.4% 6.3% 6.0% [4.7%,7.3%] A LP 8.6% 8.5% 8.1% [6.9%,9.4%] 7.6% 7.6% 7.4% [6.1%,8.6%] I LP 6.0% 5.8% 5.6% [4.3%,7.0%] 6.3% 6.1% 5.9% [4.6%,7.2%] O WC 10.1% 9.9% 9.5% [8.3%,10.6%] 9.1% 8.7% 8.2% [6.9%,9.4%] A WC 10.0% 9.6% 9.0% [7.6%,10.3%] 10.3% 9.8% 9.0% [7.4%,10.6%] I WC 10.7% 10.5% 10.2% [9.0%,11.4%] 10.2% 9.9% 9.6% [8.4%,10.7%] O WP 13.4% 13.2% 12.8% [11.5%,14.2%] 14.1% 13.8% 13.5% [12.0%,15.0%] A WP 14.3% 13.9% 13.4% [11.9%,14.9%] 15.2% 14.8% 14.3% [12.3%,16.3%] I WP 11.9% 11.8% 11.5% [10.2%,12.8%] 12.7% 12.5% 12.2% [10.9%,13.5%] O CC 10.5% 10.1% 9.6% [8.4%,10.8%] 9.0% 8.7% 8.1% [6.9%,9.3%] A CC 11.0% 10.3% 9.4% [7.7%,11.0%] 9.9% 9.5% 8.7% [7.2%,10.1%] I CC 11.0% 10.8% 10.5% [9.3%,11.7%] 10.1% 9.9% 9.4% [8.2%,10.6%] O PP 5.9% 5.6% 5.3% [3.8%,6.8%] 6.6% 6.4% 5.8% [4.4%,7.3%] A PP 2.2% 1.8% 1.7% [-0.5%,3.8%] 5.7% 5.6% 5.1% [2.2%,8.0%] I PP 7.9% 7.6% 7.2% [5.8%,8.7%] 7.9% 7.7% 7.2% [5.9%,8.5%] O 28",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "References:",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 35,
    "chunk_index": 46,
    "word_count": 256,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References: (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "11.0% 10.3% 9.4% [7.7%,11.0%] 9.9% 9.5% 8.7% [7.2%,10.1%] I CC 11.0% 10.8% 10.5% [9.3%,11.7%] 10.1% 9.9% 9.4% [8.2%,10.6%] O PP 5.9% 5.6% 5.3% [3.8%,6.8%] 6.6% 6.4% 5.8% [4.4%,7.3%] A PP 2.2% 1.8% 1.7% [-0.5%,3.8%] 5.7% 5.6% 5.1% [2.2%,8.0%] I PP 7.9% 7.6% 7.2% [5.8%,8.7%] 7.9% 7.7% 7.2% [5.9%,8.5%] O 28",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "References:",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 35,
    "chunk_index": 47,
    "word_count": 50,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References: (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "Table 3: Multiple Option Portfolio Returns Table 2 presents returns over the 10 and 22-year holding periods for six multiple option portfolios: straddle (STD), strangle (STG), butterfly (BTF), bull (BULL), bear (BEAR), and synthetic (SS). For synthetic stock portfolios moneyness categories are denoted with subscripts: at-the-money (A) and out-of-the-money (O). The moneyness of call options used are denoted first, followed by the moneyness of put options. The option with strike price nearest the current index price is considered at- the-money. For call options, the option with strike price nearest one standard deviation greater than the current index price is considered out-of-the-money. For put options, the option with strike price nearest one standard deviation less than the current index price is considered out-of-the-money. Returns are calculated assuming no transaction costs (RET ), incorporating bid-ask spreads (RET ), and incorporated bid-ask spreads as well as transaction costs (RET ). Bootstrapped confidence MP BA TC intervals for returns (CI), are calculated incorporating bid-ask spreads as well as transaction costs. In Panel A, results are presented for three-month, six-month, and one- year options over the 10-year holding period. In Panel B, results are presented for three-month, six-month options over the 22-year holding period. Panel A: 10-Year Holding Period Three-Month Six-Month One-Year RET RET RET CI RET RET RET CI RET RET RET CI MP BA TC MP BA TC MP BA TC STD 5.5% 5.2% 4.7% [2.6%,6.8%] 6.3% 6.1% 5.4% [3.3%,7.5%] 10.3% 10.2% 9.5% [7.2%,11.8%] STG 3.2% 3.0% 2.8% [0.6%,4.9%] 4.7% 4.4% 3.2% [1.0%,5.4%] 14.0% 13.6% 13.4% [10.3%,17.3%] BTF 8.7% 7.6% 6.6% [4.5%,8.8%] 7.8% 6.6% 6.1% [3.9%,8.4%] 2.5% 2.1% 2.0% [0.0%,4.1%] BULL 8.0% 7.5% 7.3% [5.1%,9.6%] 8.9% 8.6% 8.2% [6.0%,10.4%] 10.5% 10.1% 9.8% [7.5%,12.1%] BEAR 4.4% 3.7% 3.7% [1.6%,5.8%] 4.0% 3.5% 3.1% [1.2%,5.0%] 6.9% 6.5% 6.0% [3.8%,8.2%] SS 12.9% 12.1% 12.0% [9.5%,14.7%] 15.0% 14.4% 13.8% [11.0%,16.5%] 21.5% 20.9% 20.1% [16.1%,24.0%] AA SS 10.1% 9.6% 8.7% [6.3%,11.1%] 10.6% 10.1% 10.1% [7.6%,12.5%] 16.2% 14.5% 13.9% [11.2%,16.5%] AO SS 13.0% 11.9% 11.2% [8.5%,14.0%] 11.9% 11.1% 10.8% [8.0%,13.6%] 24.8% 24.7% 23.7% [19.1%,28.4%] OO Panel B: 22-Year Holding Period Three-Month Six-Month RET RET RET CI RET RET RET CI MP BA TC MP BA TC STD 9.5% 9.2% 8.7% [7.3%,10.1%] 10.0% 9.6% 9.4% [8.0%,10.7%] STG 8.7% 8.3% 8.1% [6.7%,9.5%] 9.0% 8.7% 8.1% [6.7%,9.5%] BTF 10.3% 9.6% 9.2% [7.9%,10.5%] 8.9% 8.3% 7.8% [6.4%,9.1%] BULL 11.4% 10.8% 10.6% [9.2%,11.9%] 12.0% 11.4% 11.1% [9.7%,12.4%] BEAR 7.5% 7.0% 6.3% [5.0%,7.5%] 7.7% 7.0% 6.1% [4.8%,7.4%] SS 14.7% 14.2% 13.7% [12.3%,15.3%] 14.4% 14.1% 13.8% [12.3%,15.2%] AA SS 12.4% 12.3% 11.8% [10.4%,13.2%] 13.1% 12.8% 12.4% [11.0%,13.8%] AO SS 15.5% 14.3% 14.0% [12.5%,15.6%] 14.0% 13.3% 13.0% [11.6%,14.5%] OO 29",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "References:",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 35,
    "chunk_index": 48,
    "word_count": 432,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References: (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "[6.4%,9.1%] BULL 11.4% 10.8% 10.6% [9.2%,11.9%] 12.0% 11.4% 11.1% [9.7%,12.4%] BEAR 7.5% 7.0% 6.3% [5.0%,7.5%] 7.7% 7.0% 6.1% [4.8%,7.4%] SS 14.7% 14.2% 13.7% [12.3%,15.3%] 14.4% 14.1% 13.8% [12.3%,15.2%] AA SS 12.4% 12.3% 11.8% [10.4%,13.2%] 13.1% 12.8% 12.4% [11.0%,13.8%] AO SS 15.5% 14.3% 14.0% [12.5%,15.6%] 14.0% 13.3% 13.0% [11.6%,14.5%] OO 29 Table 4: Option Leverage and Margin Calls Table 4 presents annualized returns, standard deviations (SD), and percentage of months where margin calls occur for ATM synthetic stock portfolios using five different percentages on maximum allowable margin. % Margin Used is defined as the percentage of maximum allowable margin used when writing put options. 100% of the margin used is the maximum margin allowed according to CBOE margin requirements. The % Margin Call is the percentage of months when margin calls occur over the holding period. A margin call occurs if the margin account cash balance is below the maintenance margin. % Margin Used 10-Year Holding Period 10% 25% 50% 75% 100% RET 12.0% 13.6% 22.2% 36.1% N/A TC SD 17.9% 21.7% 34.8% 44.7% 92.4% % Margin Call 12.0% 15.2% 16.0% 21.6% 69.0% 22-Year Holding Period 10% 25% 50% 75% 100% RET 13.7% 19.6% 29.8% -8.2% N/A TC SD 17.4% 21.1% 33.3% 106.1% 109.7% % Margin Call 15.0% 21.3% 24.3% 48.7% 60.4% 30",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "References:",
    "page_number": 30,
    "page_range": "p.30-31",
    "total_pages": 35,
    "chunk_index": 49,
    "word_count": 212,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References: (p.30-31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "12.0% 13.6% 22.2% 36.1% N/A TC SD 17.9% 21.7% 34.8% 44.7% 92.4% % Margin Call 12.0% 15.2% 16.0% 21.6% 69.0% 22-Year Holding Period 10% 25% 50% 75% 100% RET 13.7% 19.6% 29.8% -8.2% N/A TC SD 17.4% 21.1% 33.3% 106.1% 109.7% % Margin Call 15.0% 21.3% 24.3% 48.7% 60.4% 30 Table 5: Risk-Adjusted Performance Table 4 presents Jensen’s alpha, Sharpe and Treynor ratios and the manipulation-proof performance measure (MPPM) of Ingersoll et al. (2007) for 12 strategies: long call (LC), long put (LP), written call (WC), written put (WP), covered call (CC), protective put (PP), straddle (STD), strangle (STG), butterfly (BTF), bull (BULL), bear (BEAR), and synthetic stock (SS). Each single option portfolio is constructed using options in three moneyness categories denoted with subscripts: at-the-money (A), in-the-money (I), and out-of-the-money (O). For synthetic stock portfolios moneyness categories for call and put options are denoted with subscripts. The moneyness of call options used are denoted first, followed by the moneyness of put options. The option with strike price nearest the current index price is considered at-the-money. For call (put) options, the option with strike price nearest one standard deviation greater (less) than the current index price is considered out-of-the-money (in-the-money). For call (put) options, the option with strike price nearest one standard deviation less (greater) than the current index price is considered in-the-money (out-of-the-money). Performance measure construction is outlined in the text. Portfolio returns are ranked by Jensen’s alpha for each option maturity. All measures are calculated using the 10-year holding period. For three- and six-month options the sample period is January 1984 through April 2006. For one-year options the sample period is January 1996 through April 2006. Three-Month Six-Month One-Year Jensen Sharpe Treynor MPPM Jensen Sharpe Treynor MPPM Jensen Sharpe Treynor MPPM CC 2.0% 0.148 0.076 2.2% SS 3.7% ** 0.409 0.040 6.38% ** SS 9.4% ** 0.386 0.080 11.60% * A AA OO WP 1.7% 0.255 0.036 4.1% WC 1.5% 0.183 0.044 2.74% SS 6.6% ** 0.378 0.063 9.35% * A A AA WC 1.5% 0.170 0.048 2.4% WC 1.0% 0.184 0.035 2.55% LC 4.5% * 0.271 0.066 5.87% A O O WP 1.3% 0.221 0.032 4.0% SS 0.8% 0.246 0.028 3.52% STG 3.5% * 0.238 0.059 4.65% I AO SS 1.3% 0.278 0.030 5.1% WP 0.7% 0.150 0.029 2.44% LC 2.0% 0.255 0.045 3.90% AA A A WP 1.1% 0.214 0.033 3.2% WC 0.6% 0.093 0.033 1.28% WP 1.6% 0.261 0.042 3.49% O I I WC 0.9% 0.166 0.034 2.3% WP 0.6% 0.169 0.029 2.52% BULL 1.1% 0.223 0.039 2.96% O O WC 0.8% 0.095 0.039 1.2% LC 0.2% 0.154 0.025 2.19% STD 0.9% 0.204 0.037 2.65% I I CC 0.6% 0.034 0.073 -0.2% BULL 0.1% 0.149 0.024 2.11% WP 0.8% 0.240 0.036 2.85% I O CC 0.6% 0.128 0.031 1.9% LC 0.0% 0.148 0.023 2.10% WP 0.8% 0.235 0.035 2.85% O A A SP - 0.139 0.023 1.9% SP - 0.139 0.023 1.87% SS 0.7% 0.357 0.031 6.07% 100 100 AO BTF -0.3% 0.066 0.018 0.7% CC -0.6% 0.066 0.016 0.99% LC 0.0% 0.173 0.028 2.02% A I SS -0.5% 0.200 0.021 3.6% CC -0.6% 0.043 0.015 0.37% SP - 0.184 0.028 1.99% OO I 500 LC -0.5% 0.125 0.019 1.7% CC -0.7% 0.082 0.015 1.21% WC 0.0% 0.128 0.027 1.13% I O I SS -0.7% 0.149 0.018 2.2% SS -0.9% 0.156 0.019 3.15% CC -0.4% 0.050 0.022 -1.48% AO OO I BULL -1.1% 0.096 0.014 1.2% BTF -1.4% 0.027 0.006 -0.01% WC -0.7% 0.111 0.020 0.86% O LC -2.0% 0.054 0.007 0.5% LC -1.9% 0.052 0.008 0.44% WC -0.9% 0.085 0.017 0.41% A O A LC -2.4% 0.055 0.007 0.5% PP -1.9% 0.012 0.002 -0.22% CC -1.4% 0.056 0.011 -0.08% O O O PP -2.6% ** -0.053 -0.012 -1.3% * STD -2.3% * 0.000 0.000 -0.40% CC -1.4% 0.032 9.000 -0.87% O A LP -2.6% ** -0.056 -0.012 -1.3% * LP -3.1% ** -0.093 -0.019 -1.74% ** BEAR -1.5% 0.025 0.006 -0.58% I I PP -2.8% ** -0.106 -0.040 -2.2% ** BEAR -4.0% ** -0.141 -0.026 -2.46% ** PP -2.4% * 0.008 0.002 -0.70% A O STD -3.1% ** -0.048 -0.008 -1.2% * WP -4.0% ** -0.002 0.000 -2.46% PP -2.6% * -0.020 -0.004 -1.37% I A BEAR -3.1% ** -0.107 -0.029 -2.1% ** LP -4.2% ** -0.157 -0.029 -2.70% ** LP -2.9% ** -0.041 -0.009 -1.60% A I LP -3.7% ** -0.145 -0.037 -2.7% ** LP -4.7% ** -0.183 -0.036 -3.25% ** LP -3.4% ** -0.086 -0.020 -2.33% A O A STG -5.0% ** -0.164 -0.028 -3.1% ** STG -4.7% ** -0.140 -0.023 -2.81% ** PP -5.2% ** -0.138 -0.041 -4.86% I LP -5.7% ** -0.295 -0.087 -4.9% ** PP -5.0% ** -0.168 -0.038 -3.63% ** LP -6.8% ** -0.328 -0.080 -5.90% ** O A O PP -9.1% ** -0.401 -1.157 -9.7% ** PP -9.8% ** -0.338 -0.175 -9.68% ** BTF -12.3% ** -0.432 -0.919 -14.01% ** I I ** and * indicate significance at the 1% and 5% levels respectively 31",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "References:",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 35,
    "chunk_index": 50,
    "word_count": 827,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References: (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "-0.168 -0.038 -3.63% ** LP -6.8% ** -0.328 -0.080 -5.90% ** O A O PP -9.1% ** -0.401 -1.157 -9.7% ** PP -9.8% ** -0.338 -0.175 -9.68% ** BTF -12.3% ** -0.432 -0.919 -14.01% ** I I ** and * indicate significance at the 1% and 5% levels respectively 31",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "References:",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 35,
    "chunk_index": 51,
    "word_count": 50,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References: (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "Table 6: Risk Aversion Parameters Table 6 Panel A presents annual returns, standard deviations (SD), skewness, and risk aversion coefficients, γ, for 11 ATM portfolios: long index (INDEX), long call (LC), long put (LP), written put (WP), covered call (CC), protective put (PP), straddle (STD), strangle (STG), butterfly (BTF), bull (BULL), bear (BEAR), and synthetic stock (SS). Panel B reports results for ATM synthetic stock portfolios using five different percentages of maximum allowable margin. β and Ω are calculated from equations (15) and (16), respectively. The risk aversion coefficient is calculated from the minimization of equation 12. SE is the standard error of the risk aversion estimate. Results are presented in three ways. The first restricts skewness to zero (ξ=0), the second imposes no restriction, and the third employs GMM to estimate the γ, β and Ω. Panel A: Single and Multiple Option Portfolios INDEX LC CC WP PP LP STD STG BTF BULL BEAR SS A A A A A AA RET 7.7% 11.2% 6.7% 9.1% 5.2% 4.0% 9.5% 13.4% 2.0% 9.8% 6.0% 20.1% TC SD 15.0% 20.0% 20.0% 15.8% 17.1% 16.1% 18.2% 27.1% 27.3% 18.0% 17.0% 31.0% Skewness -0.604 2.647 -1.047 -0.852 0.289 -0.155 1.329 6.115 5.253 0.617 0.370 5.375 β 1.043 0.902 0.990 0.968 0.912 0.985 1.011 0.955 1.005 0.907 1.091 Ω 0.944 1.217 1.096 1.041 0.987 0.928 0.766 1.142 1.032 0.964 0.905 ξ=0 γ 2.89 1.36 1.74 2.08 0.41 0.86 1.92 0.62 -2.74 1.78 0.94 1.22 SE (0.16) (0.30) (0.29) (0.27) (0.36) (0.29) (0.14) (0.19) (0.24) (0.20) (0.27) (0.12) SSE 6.48 6.84 7.45 6.92 6.49 6.18 6.49 6.56 6.40 6.81 6.25 7.76 ξ≠0 γ 3.87 1.18 3.41 3.01 0.37 1.03 2.04 0.12 -5.46 2.22 1.10 -1.86 SE (0.24) (0.35) (0.40) (0.29) (0.36) (0.33) (0.19) (0.22) (0.38) (0.30) (0.38) (0.24) SSE 5.99 6.79 7.25 6.15 6.48 6.14 6.31 6.02 6.57 6.71 6.00 7.04 GMM β 1.10 0.92 1.00 0.95 0.91 1.04 1.09 0.87 1.07 0.90 1.20 Ω 1.55 0.99 1.10 0.94 1.22 1.49 1.75 2.68 1.68 1.27 2.40 γ 2.08 3.35 3.60 1.07 1.13 2.06 2.16 0.33 2.13 1.12 2.33 SE (1.09) (0.90) (1.00) (0.93) (0.90) (1.03) (1.07) (0.87) (1.05) (0.89) (1.19) SSE 5.13 4.39 4.21 4.27 4.40 4.90 5.37 5.69 5.05 4.53 6.46 Panel B: SS Portfolios by Margin Used AA 10% 25% 50% 75% 100% RETTC 12.0% 13.6% 22.2% 36.1% N/A SD 17.9% 21.7% 34.8% 44.7% 92.4% Skewness -0.110 -0.349 0.657 0.301 -0.985 β 1.080 1.173 1.263 1.169 1.234 Ω 1.949 3.082 5.003 9.195 12.207 ξ=0 γ 2.62 2.79 2.86 2.51 2.10 SE (0.21) (0.09) (0.21) (0.26) (0.23) SSE 3.86 4.64 6.95 9.16 9.58 ξ≠0 γ 2.10 1.69 1.70 1.78 0.02 SE (0.14) (0.22) (0.46) (0.49) (0.45) SSE 3.48 5.74 6.14 8.58 9.35 GMM β 1.45 1.50 1.59 1.68 2.13 Ω 2.68 5.15 9.35 13.99 24.60 γ 2.10 1.83 1.80 0.28 -1.59 SE (0.27) (0.10) (0.15) (0.17) (0.20) SSE 2.77 3.16 4.94 6.40 8.30 32",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "References:",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 35,
    "chunk_index": 52,
    "word_count": 480,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References: (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "γ 2.10 1.69 1.70 1.78 0.02 SE (0.14) (0.22) (0.46) (0.49) (0.45) SSE 3.48 5.74 6.14 8.58 9.35 GMM β 1.45 1.50 1.59 1.68 2.13 Ω 2.68 5.15 9.35 13.99 24.60 γ 2.10 1.83 1.80 0.28 -1.59 SE (0.27) (0.10) (0.15) (0.17) (0.20) SSE 2.77 3.16 4.94 6.40 8.30 32 Figure 1: Option Portfolio Returns Through Time Figure 1 presents the dollar value of portfolios ($000), accounting for bid-ask spreads as well as transaction costs, for the S&P 100 and three option portfolios: a synthetic stock portfolio taking long positions in ATM calls and writing ATM puts, an ATM protective put portfolio, and an ATM covered call portfolio. Three- month options are used over the 10-year holding period. The initial value of the portfolios is $50,000. 33 Figure 2: Synthetic Stock Portfolio Returns by Time to Maturity Figure 2 presents the dollar value of portfolios ($000), accounting for bid-ask spreads as well as transaction costs, for the S&P 100 and three ATM synthetic stock portfolios: synthetic stock portfolio using three-month options, synthetic stock portfolio using six-month options, and synthetic stock portfolio using one- year options. Values are presented over the 10-year holding period with beginning portfolio values of $50,000. $600 $500 $400 $300 $200 $100 $ eulaV S&P 500 SS 3 month SS 6 month SS 1‐year Date 34",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "References:",
    "page_number": 33,
    "page_range": "p.33-35",
    "total_pages": 35,
    "chunk_index": 53,
    "word_count": 219,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References: (p.33-35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  },
  {
    "text": "three-month options, synthetic stock portfolio using six-month options, and synthetic stock portfolio using one- year options. Values are presented over the 10-year holding period with beginning portfolio values of $50,000. $600 $500 $400 $300 $200 $100 $ eulaV S&P 500 SS 3 month SS 6 month SS 1‐year Date 34 Figure 3: Synthetic Stock Portfolio Returns by Option Leverage Figure 3 presents the dollar value of portfolios ($000), accounting for bid-ask spreads as well as transaction costs, for the S&P 100 and three-month ATM synthetic stock portfolios using three alternative margin requirements: full cash coverage using only monthly cash installments, using up to 50% of maximum available margin, and using up to 100% of maximum available margin. Values are presented over the 22-year holding period with beginning portfolio values of $50,000. The value of the 100% margin portfolio becomes negative in December 1987. Monthly contributions to the portfolio are used to pay down debt until July 1997 when the portfolio value becomes positive and normal investment resumes. $10000 $8000 $6000 $4000 $2000 $000 $(51,444.74) ‐$2000 35 eulaV Zero Margin Used 50% Margin Used 100% Margin Used Date",
    "title": "Is There Money to be Made Investing in Options",
    "source_type": "pdf",
    "document_id": "61d9d0689d76",
    "source_file": "Is There Money to Be Made Investing in Options A Historical Perspective..pdf",
    "section": "References:",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 35,
    "chunk_index": 54,
    "word_count": 187,
    "author": "Andy Fodor",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References: (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080714114016-04'00'",
    "duration": null
  }
]