[
  {
    "text": "Just How Much Do Individual Investors Lose by Trading? Brad M. Barber Graduate School of Management University of California, Davis Davis, CA 95616 (530) 752-0512 bmbarber@ucdavis.edu www.gsm.ucdavis.edu/~bmbarber Yi-Tsung Lee Department of Accounting National Chengchi University Taipei, Taiwan (886-2) 2939-3091 # 81027 actytl@nccu.edu.tw Yu-Jane Liu Department of Finance Guanghua School, Peking University, China and Department of Finance, National Chengchi University Taipei, Taiwan (886-2) 2939-3091 # 81123 finyjl@nccu.edu.tw Terrance Odean1 Haas School of Business University of California, Berkeley Berkeley, CA 94720 (510) 642-6767 odean@haas.berkeley.edu faculty.haas.berkeley.edu/odean May 2007 1 We are grateful to the Taiwan Stock Exchange for providing the data used in this study. Michael Bowers provided excellent computing support. Barber appreciates the National Science Council of Taiwan for underwriting a visit to Taipei, where Timothy Lin (Yuanta Core Pacific Securities) and Keh Hsiao Lin (Taiwan Securities) organized excellent overviews of their trading operations. We appreciate the comments of Ken French, Charles Jones, Owen Lamont, Mark Kritzberg, Victor W. Liu and seminar participants at UC Berkeley School of Law, UC-Davis, University of Illinois, the Indian School of Business, National Chengchi University, University of North Carolina, University of Texas, Yale University, the Wharton 2004 Household Finance Conference, American Finance Association 2006 Boston Meetings, the Taiwan Financial Supervisory Commission, and the 12th Conference on the Theory and Practice of Securities and Financial Markets (Taiwan). Terrance Odean is grateful for the financial support of the National Science Foundation (Grant 0222107). EEleleccttrroonnicic ccooppyy aavvaailialabblele aatt:: hhttttpps::////ssssrrnn..ccoomm//aabbssttrraacctt==552299006622",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 30,
    "chunk_index": 0,
    "word_count": 240,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "2004 Household Finance Conference, American Finance Association 2006 Boston Meetings, the Taiwan Financial Supervisory Commission, and the 12th Conference on the Theory and Practice of Securities and Financial Markets (Taiwan). Terrance Odean is grateful for the financial support of the National Science Foundation (Grant 0222107). EEleleccttrroonnicic ccooppyy aavvaailialabblele aatt:: hhttttpps::////ssssrrnn..ccoomm//aabbssttrraacctt==552299006622 Just How Much Do Individual Investors Lose by Trading? Abstract We document that individual investor trading results in systematic and, more importantly, economically large losses. Using a complete trading history of all investors in Taiwan, we document that the aggregate portfolio of individual investors suffers an annual performance penalty of 3.8 percentage points. Individual investor losses are equivalent to 2.2 percent of Taiwan’s GDP or 2.8 percent of total personal income – nearly as much as the total private expenditure on clothing and footwear in Taiwan. Using orders underlying trade, we document that virtually all of individual trading losses can be traced to their aggressive orders; passive orders placed by individuals are profitable at short horizons and suffer modest losses at longer horizons. In contrast, institutions enjoy an annual performance boost of 1.5 percentage points (after commissions and taxes, but before other costs) and both the aggressive and passive trades of institutions are profitable. Foreign institutional investors garner nearly half of the institutional profits. Finally, the introduction of a legal lottery in Taiwan in 2002 coincided with a 25 percent reduction in turnover on the Taiwan Stock Exchange. EEleleccttrroonnicic ccooppyy aavvaailialabblele aatt:: hhttttpps::////ssssrrnn..ccoomm//aabbssttrraacctt==552299006622",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2-3",
    "total_pages": 30,
    "chunk_index": 1,
    "word_count": 243,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2-3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "and both the aggressive and passive trades of institutions are profitable. Foreign institutional investors garner nearly half of the institutional profits. Finally, the introduction of a legal lottery in Taiwan in 2002 coincided with a 25 percent reduction in turnover on the Taiwan Stock Exchange. EEleleccttrroonnicic ccooppyy aavvaailialabblele aatt:: hhttttpps::////ssssrrnn..ccoomm//aabbssttrraacctt==552299006622 Financial advisors recommend that individual investors refrain from frequent trading. Investors should buy and hold diversified portfolios, such as low cost mutual funds. If skill contributes to investment returns, individual investors are obviously at a disadvantage when trading against professionals. What is less clear is just how much do individual investors lose by trading? In this paper, we document that trading in financial markets leads to economically large losses for individual investors and virtually all of the losses of individual investors can be traced to their aggressive (rather than passive) orders. To do so, we use a unique and remarkably complete dataset, which contains the entire transaction data, underlying order data, and the identity of each trader in the Taiwan stock market – the World’s twelfth largest financial market. With these data, we provide a comprehensive accounting of the gains and losses from trade during the period 1995 to 1999. Our data allow us to identify trades made by individuals and by institutions, which fall into one of four categories (corporations, dealers, foreigners, or mutual funds). To analyze who gains and loses from trade, we construct portfolios that mimic the purchases and sales of each investor group. If stocks bought by an investor group reliably outperform those that they sell, the group benefits from trade. In addition, using the orders underlying each trade, we are able to examine whether gains and losses can be attributed to aggressive or passive orders. Our empirical analysis presents a clear portrait of who benefits from trade: Individuals lose, institutions win. While individual investors incur substantial losses, each of the four institutional groups that we analyze – corporations, dealers, foreigners, and mutual funds – gain from trade. Though we analyze horizons up to one year following a trade, our empirical analyses indicate that most of the losses by individuals (and gains by institutions) accrue within a few weeks of trade and reach an asymptote at a horizon of six months. Several prior studies provide evidence that individual investors lose from trade, 1 while institutions profit.2 Relative to prior research, the combination of a comprehensive dataset (all 1 For studies of the performance of individual investors, see Schlarbaum, Lewellen, and Lease (1978a, 1978b), Odean (1999), Barber and Odean (2000, 2001), Grinblatt and Keloharju (2000), Goetzmann and Kumar (2005), and Linnainmaa (2003a, 2003b). Recent research suggests some trades by individual investors are systematically profitable. Ivkovich and Weisbenner (2004) document the local holdings of individual investors perform well, while Ivkovich, Sialm, and Weisbenner (2004) document individuals with concentrated portfolios perform well. Coval, Hirshleifer and Shumway (2003) provide evidence that some individual investors are systematically better than others. Other related work includes Lee, Shleifer, and Thaler (1991), Sias and Starks (1997), Bartov, Radhakrishnan, and Krinsky (2000), Chakravarty (2001), and Poteshman and Serbin (2003). 1 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 30,
    "chunk_index": 2,
    "word_count": 520,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "portfolios perform well. Coval, Hirshleifer and Shumway (2003) provide evidence that some individual investors are systematically better than others. Other related work includes Lee, Shleifer, and Thaler (1991), Sias and Starks (1997), Bartov, Radhakrishnan, and Krinsky (2000), Chakravarty (2001), and Poteshman and Serbin (2003). 1 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 30,
    "chunk_index": 3,
    "word_count": 50,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "trades for an entire market) and the empirical methods we employ provide more convincing evidence that individuals lose from trade. The comprehensiveness of our dataset allows us to go beyond the mere documentation of trading losses and make two important contributions relative to prior research. First, we document the losses incurred by individual investors are economically large. We estimate the total losses to individual investors to be $NT 935 billion ($US 32 billion) during our sample period or $NT 187 billion annually ($US 6.4 billion). (The average exchange rate that prevailed during our sample period was $NT 29.6 per $US 1 with a low of 24.5 and a high of 34.7 $NT/$US.) This is equivalent to a staggering 2.2 percent of Taiwan’s gross domestic product or roughly 33, 85, and 170 percent of total private expenditures on transportation/communication, clothing/footwear, and fuel/power (respectively). Put differently, it is a 3.8 percentage point annual reduction in the return on the aggregate portfolio of individual investors. These losses can be broken down into four categories: trading losses (27 percent), commissions (32 percent), transaction taxes (34 percent), and market-timing losses (7 percent). The trading and market timing losses of individual investors represent gains for institutional investors. The institutional gains are eroded, but not eliminated by the commissions and transaction taxes that they pay. We estimate that aggregate portfolio of institutional investors enjoys annual abnormal returns of 1.5 percentage points after commissions and transaction taxes (but before any fees the institutions might charge their retail customers). When profits are tracked over six months, foreigners earn nearly half of all institutional profits; at shorter horizons, foreigners earn one fourth of all institutional profits. The profits of foreigners represent an unambiguous wealth transfer from Taiwanese individual investors to foreigners. Whether the remaining institutional profits represent a wealth transfer depends on who benefits when domestic institutions profit. 2 For studies of mutual fund performance, see Carhart (1997), Chan, Jegadeesh, and Wermers (2000), Coval and Moskowitz (2001), Daniel, Grinblatt, Titman, and Wermers (1997), Grinblatt and Titman (1989, 1993), and Wermers (2000). For studies of pension fund performance, see Ferson and Khang (2002), Lakonishok, Shleifer, and Vishny (1992), Coggin, Fabozzi, and Rahman (1993), Christopherson, Ferson, and Glassman (1998), Delguercio and Tkac (2002), Coggin and Trzcinka (2000), Ikenberry, Shockley, and Womack (1998). In analyses of hedge funds, Ackermann, McEnally, and Ravenscraft (1999), Brown, Goetzmann, and Ibbotson (1999), Liang (1999), and Agrawal and Naik (2000) provide evidence of superior returns, though Amin and Kat (2003) argue that hedge fund performance results may be attributable to the skewed nature of hedge fund payoffs, which when appropriately accounted for, renders hedge fund performance unremarkable. 2 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 30,
    "chunk_index": 4,
    "word_count": 445,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "Liang (1999), and Agrawal and Naik (2000) provide evidence of superior returns, though Amin and Kat (2003) argue that hedge fund performance results may be attributable to the skewed nature of hedge fund payoffs, which when appropriately accounted for, renders hedge fund performance unremarkable. 2 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 30,
    "chunk_index": 5,
    "word_count": 50,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "A distinguishing feature of our dataset is data on the orders underlying each trade. This feature of our dataset leads to the second main contribution of our study: Virtually all of the losses incurred by individuals can be traced to their aggressive orders. In contrast, institutions profit from both their passive and aggressive trades.3 (All orders on the Taiwan Stock Exchange are limit orders. We define aggressive limit orders to be buy limit orders with high prices and sell limit orders with low prices—both relative to unfilled orders at the last market clearing; we define passive limit orders to be buy limit orders with low prices and sell limit orders with high prices. 64 percent of all trades emanate from aggressive orders.) At short horizons (up to one month), the majority of institutional gains can be traced to passive trades. The profits associated with passive trades are realized quickly, as institutions provide liquidity to aggressive, but apparently uninformed, investors. The profits associated with the aggressive trades of institutions, which are likely motivated by an informational advantage, are realized over longer horizons. The remainder of the paper is organized as follows. Our data, the Taiwan market, and empirical methods are described in detail in Section I. We present our main results in Section II, where we estimate the magnitude of losses and trace these losses to aggressive and passive orders underlying trade. In Section III, we discuss the economic significance of the gains and losses. In Section IV, we discuss possible reasons why Taiwanese investors trade actively. We make concluding remarks in Section V. I. Background, Data, and Methods I.A. Taiwan Market Rules The TSE operates in a consolidated limit order book environment where only limit orders are accepted. During the regular trading session, from 9:00 a.m. to noon during our sample period, buy and sell orders interact to determine the executed price subject to applicable automatching rules. During our sample period, trades can be matched one to two times every 90 seconds throughout the trading day. Orders are executed in strict price and time priority. Although market orders are not permitted, traders can submit an aggressive price-limit order to obtain matching priority. During our study period, there is a daily price limit of seven percent in each direction and a trade-by-trade intraday price limit of two ticks from the previous trade price. 3 Parlour (1998), Foucault (1999) and Handa, Schwartz and Tiwari (2003) explore the choice between demanding liquidity with market or marketable limit orders and supplying liquidity with limit orders that cannot be immediately executed. Griffiths et al. (2000) find that aggressive buys are more likely than sells to be motivated by information. 3 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 30,
    "chunk_index": 6,
    "word_count": 450,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "and Tiwari (2003) explore the choice between demanding liquidity with market or marketable limit orders and supplying liquidity with limit orders that cannot be immediately executed. Griffiths et al. (2000) find that aggressive buys are more likely than sells to be motivated by information. 3 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 30,
    "chunk_index": 7,
    "word_count": 50,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "The TSE caps commissions at 0.1425 percent of the value of a trade. Some brokers offer lower commissions for larger traders, though we are unable to document the prevalence of these price concessions. Taiwan also imposes a transaction tax on stock sales of 0.3 percent. Capital gains (both realized and unrealized) are not taxed, while cash dividends are taxed at ordinary income tax rates for domestic investors and at 20 percent for foreign investors. Corporate income is taxed at a maximum rate of 25 percent, while personal income is taxed at a maximum rate of 40 percent. I.B. Trades Data and Descriptive Statistics We have acquired the complete transaction history of all traders on the TSE from January 1, 1995, through December 31, 1999. The trade data include the date and time of the transaction, a stock identifier, order type (buy or sell), transaction price, number of shares, and the identity of the trader. The trader code allows us to broadly categorize traders as individuals, corporations, dealers, foreign investors, and mutual funds. The majority of investors (by value and number) are individual investors. Corporations include Taiwan corporations and government-owned firms (e.g., in December 2000 the government-owned Post, Banking, and Insurance Services held over $NT 213 billion in Taiwanese stock). Dealers include Taiwanese financial institutions such as Fubon Securities, Pacific Securities, and Grand Cathay Securities. Foreign investors are primarily foreign banks, insurance companies, securities firms, and mutual funds. During our sample period, the largest foreign investors are Fidelity Investments, Scudder Kemper, and Schroder Investment Management. Mutual funds are domestic mutual funds, the largest being ABN- AMRO Asset Management with $NT 82 billion invested in Taiwanese stocks in December 2000. We present basic descriptive statistics on the market during the 1995 to 1999 period in Table 1. In contrast to the U.S., which enjoyed an unprecedented bull market in the late 1990s, Taiwan experienced average annual return of 6.9%. The main index for the Taiwan market (the TAIEX – a value-weighted index of all listed securities) enjoyed gains of over thirty percent in 1996 and 1999 and losses of over twenty percent in 1995 and 1998. Our sample period also includes the period of the Asian Financial crisis, which began in May 1997 with a massive sell-off of the Thai Baht. The stock market is important in Taiwan. The number of firms listing in Taiwan grew at average annual rate of over 7 percent between 1995 and 1999. (This growth continues to date, with 700 firms listed on the TSE at the end of 2004.) The market value of the TSE nearly doubled from 1995 to 1999 – growing from $NT 5.2 trillion ($US 198 billion) in 1995 to over $NT 10 trillion 4 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 30,
    "chunk_index": 8,
    "word_count": 457,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "growth continues to date, with 700 firms listed on the TSE at the end of 2004.) The market value of the TSE nearly doubled from 1995 to 1999 – growing from $NT 5.2 trillion ($US 198 billion) in 1995 to over $NT 10 trillion 4 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 30,
    "chunk_index": 9,
    "word_count": 50,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "($US 313 billion) in 1999. In 1994, the ratio of external capital (i.e., stock market valuation corrected for inside ownership) to GDP in Taiwan was 0.88 and was the sixth highest of 49 countries analyzed by La Porta et al. (1997); Taiwan’s ratio was slightly higher than the ratios for Japan and the U.S., but somewhat lower than the ratios for the U.K., Hong Kong, and Singapore. At the end of 1999, the Taiwan market ranked as the 12th largest financial market in the world (by market capitalization), though it was only slightly greater than two percent of the total U.S. market. Turnover in the TSE is remarkably high – averaging almost 300 percent annually during our sample period. (We calculate turnover as ½ the sum of buys and sells in each year divided by the average daily market cap for the year.) In contrast, annual turnover on the New York Stock Exchange (NYSE) averaged 97 percent annually from 2000 through 2003. The high turnover rates observed in Taiwan, though unusual, are not unique to Taiwan. During our sample period, the annual turnover rate was 511 percent in China and 181 percent in Korea (peaking at 345 percent in 1999).4 Day trading is also prevalent in Taiwan (see last column of Table 1). We define day trading as the purchase and sale of the same stock on the same day by an investor. Over our sample period, day trading accounted for 23 percent of the total dollar value of trading volume. (See Barber, Lee, Liu, and Odean (2004) for a detailed analysis of day trading on the TSE.) We restrict our analysis to ordinary common stocks. In Table 2, we present the total value of buys and sells of stocks for each investor group by year. Individual investors account for roughly 90 percent of all trading volume and place trades that are roughly half the size of those made by institutions (corporations, dealers, foreigners, and mutual funds). Each of the remaining groups accounts for less than five percent of total trading volume. During our five-year sample period, there were approximately 3.9 million individual investors, 24,000 corporations, 83 dealers, 1,600 foreigners, and 289 mutual funds that traded on the TSE. Equities are an important asset class for Taiwanese. According to the 2000 Taiwan Stock Exchange Factbook (table 24), individual investors accounted for between 56 and 59 percent of total stock ownership during our sample period. Taiwan corporations owned between 17 and 23 percent of all stocks, while foreigners owned between 7 and 9 percent. At the end of 2000, 4 Turnover data for China are from table 30 of Gao (2002). Turnover data for Korea are from the Taiwan Financial Supervision Commission. 5 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 30,
    "chunk_index": 10,
    "word_count": 457,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "between 17 and 23 percent of all stocks, while foreigners owned between 7 and 9 percent. At the end of 2000, 4 Turnover data for China are from table 30 of Gao (2002). Turnover data for Korea are from the Taiwan Financial Supervision Commission. 5 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 30,
    "chunk_index": 11,
    "word_count": 50,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "Taiwan’s population reached 22.2 million; 6.8 million Taiwanese (31 percent) placed orders through a brokerage account.5 Stocks are broadly held in Taiwan and are an important asset class for many households in Taiwan. Each year, the Taiwan Ministry of Finance collects the asset holdings for all households with taxable and nontaxable income). We analyze these data over the period 1997 to 2002. On average, about half of reporting households own equities (ranging from 49 to 56 percent). For those who own equity, the majority (70 percent) of these equity holdings are public equities. Less than one percent of equities are held through mutual funds, while the remaining equities are privately held stock.6 We present in Table 3 the ratio of equity value to total assets and to total assets excluding real estate. For all households owning equity, equities average 24 percent of total assets and 45 percent of non-real-estate assets. We further partition households into quartiles based on net worth and separately report results for households with negative net worth (about 3 percent of households report negative net worth). Though the wealthy no doubt own the majority of equities, the less well off have substantial portions of their assets invested in equities. By comparison, less wealthy investors in the U.S. tend to have a somewhat lower proportion of their assets invested in equities than do wealthier investors (Polkovnichenko, 2005). One possible reason why less wealthy Taiwanese households participate so actively in the stock market is that the market provides an opportunity to gamble. We discuss this possibility further in Section IV. I.C. Aggressive and Passive Trades In addition to trade data, we have all orders (both filled and unfilled) that underlie trades. Using these order data, we categorize each trade as aggressive or passive based on the order underlying the trade. This categorization involves three steps. First, for each stock, we construct a time series of clearing prices, the lowest unfilled sell limit order price, and the highest unfilled buy limit order price. These data are compiled by the TSE (the market display data) and are presented to market participants in real time. Second, we categorize all orders as aggressive or passive by comparing order prices to the most recent unfilled limit order prices. Orders to buy with prices in excess of the most recent unfilled sell limit order are categorized as aggressive; those with prices below the most recent unfilled buy limit order are categorized as passive; those with an order price 5 The data of Taiwan’s population are from the Directorate-General of Budget, Accounting and Statistics, Executive Yuan, Taiwan. We report 6.8 million Taiwanese open accounts using the order data from Taiwan stock exchange. The number of opened accounts is 12.3 millions. (Data are from the website of the Taiwan stock exchange). 6 Data are from Major Indicators of Securities & Futures Market, Financial Supervisory Commission, Executive Yuan, Taiwan and Annual Statistical Data, Taiwan Stock Exchange; http://www.tse.com.tw/en/statistics/statistics_list.php?tm=07&stm=025 6 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 30,
    "chunk_index": 12,
    "word_count": 495,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "exchange. The number of opened accounts is 12.3 millions. (Data are from the website of the Taiwan stock exchange). 6 Data are from Major Indicators of Securities & Futures Market, Financial Supervisory Commission, Executive Yuan, Taiwan and Annual Statistical Data, Taiwan Stock Exchange; http://www.tse.com.tw/en/statistics/statistics_list.php?tm=07&stm=025 6 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 30,
    "chunk_index": 13,
    "word_count": 50,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "between the two unfilled limit order prices are categorized as indeterminant. There is an analogous algorithm for sells. Third, we match all orders to trades. This matching allows us to determine whether a trade emanated from a passive or aggressive order. Using this algorithm, we categorize 90 percent of all trades as passive or aggressive.7 The majority of executed trades – 64 percent – emanate from aggressive orders. Overall, individuals are slightly more aggressive than institutions (64.9 percent vs. 64.2 percent of trades emanate from aggressive orders). However, there is considerable variation in the aggressiveness of institutions. Corporations are the most passive group of traders (52.2 percent aggressive), while foreigners are the most aggressive group (68.4 percent aggressive). (Linnainmaa (2003b) documents that individuals and institutions in Finland use roughly similar proportions of market orders—48.4 for individuals and 50.9 percent for institutions). I.D. Dollar Profits In our main analysis, we calculate a time-series of daily trading profits earned by each investor group. We focus on dollar profits rather than abnormal returns so as to precisely calculate the trading gains and losses between investor groups. Abnormal returns might be artificially high if returns earned are high on days with low trading volume. In contrast, the calculation of dollar profits provides a precise accounting for the gains from trade, since the dollar profits are precisely equal to zero when summed across investor groups. We test the robustness of our results by analyzing abnormal returns as described later in this section. To calculate daily dollar profits, we first aggregate all trades made by investor group, stock, and day. We then construct two portfolios for each investor group: one that mimics the net daily purchases and one that mimics the net daily sales. To focus on trading that occurs between groups, we only analyze net trades. For example, if individuals buy 1,100 shares of Micron and sell 1,000 shares of Micron on January 15, 1995, we would add 100 shares of Micron to the individual investor buy portfolio on January 15, 1995, while no Micron shares would be added to the individual investor sell portfolio on that day. The purchase price is recorded as the difference between the total value of buys and the total value of sells divided by the net shares bought. Shares are included in the portfolio for a fixed horizon; we consider horizons of 1, 10, 25, and 140 trading days. Shares are marked to market daily. The daily dollar profits for the buy portfolio are 7 The indeterminant category also includes trades that we are unable to match to an order. We discussed this issue with the TSE and they suspect data entry errors in the order records is the source of the problem. Though annoying, this type of data error should not introduce any bias into our results. 7 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 30,
    "chunk_index": 14,
    "word_count": 475,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "unable to match to an order. We discussed this issue with the TSE and they suspect data entry errors in the order records is the source of the problem. Though annoying, this type of data error should not introduce any bias into our results. 7 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 30,
    "chunk_index": 15,
    "word_count": 50,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "calculated net of market gains as the total value of the buy portfolio at the close of trading on day t- 1 multiplied by the spread between the return on the buy portfolio and the market on day t. There is an analogous calculation for the sell portfolio. Ultimately, our statistical tests use a time-series of daily dollar profits from January 1995 to December 1999. Thus, it is assumed that each day represents an independent observation of the total profits earned by a particular group. To control for the low levels of autocorrelation in profits observed at a one-day horizon, we use a Newey- West procedure to correct the estimated standard errors using an assumed lag length of six days.8 I.E. Return Calculations To test the robustness of our dollar profit calculations, we also calculate monthly abnormal returns on the buy portfolio, sell portfolio, and buy less sell portfolio for all investor partitions. Consider, for example, the portfolio that mimics the buys of individual investors. We first calculate the daily returns on this portfolio (again, assuming a holding period of 1, 10, 25, or 140 days). Daily returns are compounded within a month to yield a time-series of 60 monthly returns for the individual investor buy portfolio. Statistical tests are based on the monthly time-series of the portfolio return and abnormal returns from a four-factor model; results are qualitatively similar if we use market-adjusted returns or the intercept from a one-factor model with the market risk premium as the sole factor. For example, we calculate the abnormal return on the corporate investor buy portfolio as the intercept from the following four-factor model: (Rcorp −R ) =α +β (R −R )+s SMB +h HML +w WML +ε (1) t ft j j mt ft j t j t j t jt where R is the monthly return on T-Bills,9 R is the monthly return on a value-weighted Taiwan ft mt market index, SMB is the return on a value-weighted portfolio of small stocks minus the return on t a value-weighted portfolio of big stocks, HML is the return on a value-weighted portfolio of high t book-to-market stocks minus the return on a value-weighted portfolio of low book-to-market stocks, and WML is the return on a value-weighted portfolio of stocks with high recent returns t minus the return on a value-weighted portfolio of stocks with low recent returns. The construction of the size and book-to-market portfolios is identical to that in Fama and French (1993). The WML return is constructed based on a six-month formation period and a six-month holding period. The 8 There is a small, but reliably positive autocorrelation of total profits at one day horizon (ranging from 6.3 percent to 14.2 percent). No autocorrelations beyond one day are reliably different from zero. To test the robustness of our profit results, we also calculate monthly returns on the buy and sell portfolios. Monthly portfolio returns for all investor partitions have no reliable serial dependence. 9 We use the series of one-month deposit rates of the First Commercial Bank as the risk-free rate. This interest rate series is taken from Financial Statistics Monthly, Taiwan District, R.O.C., and is compiled by the Central Bank of China. 8 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 30,
    "chunk_index": 16,
    "word_count": 540,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "no reliable serial dependence. 9 We use the series of one-month deposit rates of the First Commercial Bank as the risk-free rate. This interest rate series is taken from Financial Statistics Monthly, Taiwan District, R.O.C., and is compiled by the Central Bank of China. 8 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 30,
    "chunk_index": 17,
    "word_count": 50,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "regression yields parameter estimates of α ,β ,s ,h and w for regression j. The error term in j j j j j the regression isε . jt II. Results II.A. Event-Time Results To provide an overview of our results, we first present the results of an event-time analysis, where day 0 represents the day of a trade. Consider the buys of individual investors. We begin by aggregating all purchases by individual investors by stock and day. We then calculate the mean market-adjusted abnormal return on event day τ (MA) (weighted by the value of stocks bought). τ There is a similar calculation for the sales of individuals. Finally, we calculate the cumulative (market-adjusted) abnormal return on stocks bought less the cumulative (market-adjusted) abnormal return on stocks sold as: T CAR =∑(MAbuy −MAsell). (2) T τ τ τ=1 There is an analogous calculation for the purchases and sales of institutional investors. The results of this analysis are presented in Figure 1, panel A. Consider first the results for institutions. Institutions appear to gain from trade, though the gains from trading reach an asymptote at approximately six months (140 trading days). After one month (roughly 23 trading days), the stocks bought by institutions outperform those sold by roughly 80 basis points. After six months, stocks bought outperform those sold by roughly 150 basis points. In contrast, stocks sold by individuals outperform those bought. The magnitude of the difference is smaller than for institutions since most trades by individuals are with other individuals and do not contribute to the difference in performance between stocks sold and stocks bought. The large gains by institutions map into small losses by individuals merely because individuals represent such a large proportion of all trades. After one month, stocks bought by individuals lag those sold by roughly 10 basis points. After six months, the difference grows to roughly 20 basis points. Another way of viewing the gains to institutions (and losses to individuals) is to calculate cumulative abnormal returns based on whether institutions are net buyers (or sellers) of a stock. Thus, the mean market-adjusted abnormal return on event day τ (MA) is identical to that described τ before, except for the weighting scheme. For example, a stock enters the institutional buy portfolio 9 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 30,
    "chunk_index": 18,
    "word_count": 382,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "based on whether institutions are net buyers (or sellers) of a stock. Thus, the mean market-adjusted abnormal return on event day τ (MA) is identical to that described τ before, except for the weighting scheme. For example, a stock enters the institutional buy portfolio 9 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 30,
    "chunk_index": 19,
    "word_count": 50,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "on a particular day only if institutions are net buyers of the stock, and the buy portfolio is weighted by the net purchases of institutional investors (i.e., the value of buys less the value of sells). There is an analogous calculation for the sale portfolio. The results of this analysis are presented in Figure 1, panel B. Stocks that are net bought by institutions outperform those that are net sold by 4 percentage points after 140 trading days. Of course, the performance of individual investors is now the mirror image of institutions. This method magnifies the return differences described above, since we now focus on stocks where individuals are trading with institutions. Though these results provide a powerful visual representation of our primary results, we do not draw inferences from this event time analysis because of the well-known problems associated with constructing a well-specified test of the null hypothesis that abnormal returns are zero using long-run event-time returns. We base our statistical tests on the daily time-series of dollar profits and the monthly time-series of portfolio returns earned on stocks bought (or sold) by each of the investor groups that we analyze. (See Lyon, Barber, and Tsai (1999) and Mitchell and Stafford (2000)) These statistical tests rely on the reasonable assumption, which we empirically verify, that daily profits (or monthly returns) are serially independent. II.B. Dollar Profits In Table 4, we present our main results on the dollar profits (and losses) from trade for each investor group. We present the profits from the buy portfolio, sell portfolio, and total profits from all trades. Of course, in aggregate the dollar profits from trade are precisely zero. We also present total profits that can be traced to aggressive and passive orders. Individual investors incur losses that grow from mean daily losses of $NT 35.3 million after one day to $NT 178.7 million after 140 trading days (Table 4, Column 1). At each horizon, the losses are highly significant with test-statistics ranging from -4.68 to -13.42. Stocks bought by individuals lose money at horizons of one day and 10 days, but their losses on purchases are indistinguishable from zero at the longer horizons of 25 and 140 trading days (Table 4, Column 2). In contrast, stocks sold by individuals subsequently perform well at all horizons, resulting in trading losses to individuals. 10 In general, taxes and the disposition effect (the propensity to hold losers and sell winners) might affect investors’ selling decisions, but not purchase decisions. 10 Stocks bought and stocks sold by individuals (or by institutions) can both perform well if market gains are concentrated in high volume stocks. In the U.S., Gervais, Kaniel, and Mingelgrin (2001) document that high- volume stocks subsequently earn high returns. 10 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 30,
    "chunk_index": 20,
    "word_count": 460,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "not purchase decisions. 10 Stocks bought and stocks sold by individuals (or by institutions) can both perform well if market gains are concentrated in high volume stocks. In the U.S., Gervais, Kaniel, and Mingelgrin (2001) document that high- volume stocks subsequently earn high returns. 10 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 30,
    "chunk_index": 21,
    "word_count": 50,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "Taiwanese investors do not face capital gains taxes, but do exhibit a strong disposition effect (Barber, Lee, Liu, and Odean, 2007). It is possible that the disposition effect contributes to the poor sales decisions of Taiwanese individual investors. Institutions, as a group, earn profits that are identical to the losses of individuals. Furthermore, each of the institutional subcategories (Corporations, Dealers, Foreigners, and Mutual Funds) earn reliably positive overall trading profits with the exception of corporations at a horizon of 140 trading days.11 The results of our abnormal return and dollar profit calculations raise the obvious question of whether these gains grow at longer horizons. We also analyze holding periods of one year. The dollar profits remain reliably positive for institutions and reliably negative for individuals. The average daily institutional gains from trade (and individual losses) are virtually identical at the one year and six month horizon (see also Figure 1). To test the robustness of these results, we calculate the average daily institutional gross profits for each calendar year from 1995 to 1999. In each year, mean daily institutional profits are positive (reliably so in four of the five sample years). Furthermore, when we sum daily profits within each month, institutions profit in 44 out of 60 months during our sample period. II.C. Tracing Profits to Passive and Aggressive Trades The fourth and fifth columns of numbers in Table 4 present the total profits that can be traced to passive and aggressive trades. The last two columns of the table present the associated test statistics. Summing the profits of aggressive and passive trades does not precisely equal the total profits from all trades, since we are unable to categorize all trades. Consider first the passive trades. Both individuals and institutions profit in the short-run from their passive trades. However, as we increase the horizon over which the trading profits are evaluated from one day to 140 trading days, the profitability of the passive trades of individual investors erodes and is indistinguishable from zero at 25 and 140 trading days. In contrast, the passive profits of institutions remain reliably positive at all horizons. 11 The profits of stocks bought (and sold) by each of the four institutional subcategories do not sum to the profits for all institutions because we only analyze net purchases (or sales) for each stock within a subcategory or across all institutions. However, total profits (profits of buy portfolio less sell portfolio) for each of the four institutional subcategories sum to the total profits for all institutions. 11 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 30,
    "chunk_index": 22,
    "word_count": 425,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "institutions because we only analyze net purchases (or sales) for each stock within a subcategory or across all institutions. However, total profits (profits of buy portfolio less sell portfolio) for each of the four institutional subcategories sum to the total profits for all institutions. 11 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 30,
    "chunk_index": 23,
    "word_count": 50,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "When an investor places a passive order, he is essentially offering to provide liquidity to market participants who demand it. Our results indicate that though individuals initially profit by providing liquidity to market participants, these profits erode perhaps because those to which individuals provide liquidity have information about the future prospects of a stock. While some individuals undoubtedly unwind these positions for a profit, in aggregate, individuals hold positions initiated with liquidity providing trades until initial profits are lost. In contrast, institutions are much better at sustaining profits through the provision of liquidity. The pattern of profits for aggressive orders is quite different. Individual investors lose large sums immediately on their aggressive orders. Apparently, individual investors are demanding liquidity when they have no information about the future prospects of a stock. This observation is quite consistent with models that assume investors are overconfident and, as a result, trade too aggressively and to their detriment. In striking contrast, institutions immediately profit from their aggressive trades and these profits grow dramatically at longer horizon – perhaps as the information that institutions possess about the prospects for a stock are more widely appreciated by market participants. In summary, virtually all of individual trading losses can be traced to their aggressive trades. On the other hand, institutions profit from both their passive and aggressive trades. II.D. Results by Firm Size Investors can earn trading profits by exploiting information asymmetries or by selling liquidity to those who are impatient to trade. Both information asymmetry and the cost of liquidity are likely to be greater for smaller firms. Thus a simple way to test whether the losses that we document increase as information asymmetries and the cost of liquidity increase is to partition our sample on the basis of firm size. In each month, we rank firms on the basis of market capitalization. The largest firms that represent 70 percent of total market value are defined as large firms, while remaining firms are defined as small. Though the market capitalization that defines a firm as large varies from month to month, the average cutoff during our sample period is $NT 24 billion. In the average month, 72 firms are defined as large. Having defined large (and small) firms, we construct buy and sell portfolios based on the trades of large (and small) firms. 12 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 30,
    "chunk_index": 24,
    "word_count": 393,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "to month, the average cutoff during our sample period is $NT 24 billion. In the average month, 72 firms are defined as large. Having defined large (and small) firms, we construct buy and sell portfolios based on the trades of large (and small) firms. 12 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 30,
    "chunk_index": 25,
    "word_count": 50,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "The mean daily dollar profits by firm size are presented in Table 5.12 The qualitative patterns for all trades, passive trades, and aggressive trades are similar for large firms and small firms. By construction, large firms represent 70 percent of total market capitalization. Institutional trading is more concentrated in large firms (64 percent of all institutional trades are in large firms) than individual trading (58 percent). At horizons of 1, 10, and 25 trading days, roughly half of the individual losses can be traced to their trading in large stocks. At the longer horizon of 140 trading days, approximately 60 percent of their losses can be traced to trading in large stocks. Thus, individual investors lose on both their trades in large and small stocks, though their losses per dollar traded, particularly at short horizons, are greater for small stocks. II.E. Portfolio Returns Dollar profits are calculated assuming only an adjustment for market gains. To test the robustness of our results, we also analyze the mean monthly abnormal returns on the buy portfolio, sell portfolio, and buy minus sell portfolio. As was done for daily dollar profits, the buy and sell portfolios are based on the net daily purchases and net daily sales of each investor group. In Table 6, we present the monthly abnormal return measures (four-factor intercepts) for each investor group. Consistent with our prior evidence, the results provide strong evidence that institutions earn positive abnormal returns, while individuals earn negative abnormal returns. In general, the monthly abnormal returns decrease with holding horizon.13 For example, the abnormal return of the buy-sell portfolio (Table 6, Column 1) for all trades shrinks from 10.97 percent per month at one trading day (t=19.92) to 0.76 percent per month at 140 trading days (t=5.77). The abnormal return results are qualitatively similar to the profit calculations presented in Table 4. Market- adjusted returns and alphas from a single factor model are very similar to the results presented in this table. Thus, style or risk adjustment has virtually no effect on our results. II.F. Market-timing To this point, we have focused on the security selection ability of institutions and individuals. By calculating trading gains net of any market return, we have excluded any profits 12 Adding the profits of small firms and large firms does not precisely equal the profits from all trades in Table 4 because we are missing firm size data for some stocks (e.g., in the month after an initial public offering). 13 Abnormal returns tend to decrease with horizon while profits increase with horizon. This is so because the total number of positions held in the buy (or sell) portfolio at longer horizons is much greater than the total number of positions held at shorter horizons and the ratio of total profits to portfolio value decreases. For example, at a one day horizon, the buy portfolio will contain only stocks bought in the last day, while at a 140 day horizon the buy portfolio will contain stocks bought over the last 140 trading days (with an average holding period of 70 days if trading is uniformly distributed over time). 13 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 30,
    "chunk_index": 26,
    "word_count": 525,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "portfolio will contain only stocks bought in the last day, while at a 140 day horizon the buy portfolio will contain stocks bought over the last 140 trading days (with an average holding period of 70 days if trading is uniformly distributed over time). 13 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 30,
    "chunk_index": 27,
    "word_count": 50,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "from market-timing. We estimate market-timing losses as follows. On each day, we sum the total value of stock purchases and the total value of stock sales for each investor group. We then take the difference of these two sums. If individuals were net buyers of stock (i.e., the total value of buys exceeds the total value of sales), we construct a long portfolio that invests a dollar amount equal to their net long position in the market portfolio and a short portfolio that invests an equal amount in the riskfree asset. Our calculation of dollar profits is analogous to that for security selection, with one exception. From the realized dollar gain on the long portfolio, we subtract the expected gain, which is calculated using beginning-of-day portfolio value, the Capital Asset Pricing Model, and the beta of the long portfolio during the five-year sample period (R +β⎡R −R ⎤). Essentially, we are comparing the dollar gain of the long portfolio to the ft i ⎣ mt ft⎦ dollar gain of a portfolio that had a fixed investment in the market and the riskfree asset over the five-year sample period. There is an analogous calculation of the dollar profit for the short portfolio. The total gains from market-timing are the sum of the gains on the long and short portfolio. At horizons of 10, 25, and 140 days, we estimate the market-timing losses of individual investors to be $NT 9.9, $NT 18.9, and $NT 46.4 million with associated t-statistics of 2.09, 1.93, and 1.63 (respectively).14 III. Economic Significance One of our main objectives is assessing the economic significance of the losses incurred by individual investors. In this section, we document that individual investor trading losses are equivalent to 2.2 percent of Taiwan’s GDP or 2.8 percent of total personal income – nearly as much as the total private expenditure on clothing and footwear in Taiwan. The aggregate portfolio of individual investors suffers an annual performance penalty of 3.8 percentage points. In contrast, institutions enjoy an annual performance boost of 1.5 percentage points (after commissions and taxes, but before other costs). From 1995 to 1999, individual lose $NT 935 billion from their trading in stocks. Losses can be traced to (1) gross trading losses ($NT 249 billion), (2) commissions ($NT 302 billion), (3) transaction taxes ($NT 319 billion), and (4) market timing losses ($NT 65 billion).15 These losses 14 These test statistics rely on the assumption that daily market timing profits are serially independent. Though there is no daily serial dependence for holding periods of 10 and 140 days, there is modest serial dependence at one day for a holding period of 25 days. Consequently, test statistics are calculated using a Newey-West adjustment for serial correlation assuming a lag length of six days (one week). 15 Gross trading losses and market timing losses over the entire sample period are calculated as mean daily losses times 1,397 (the number of trading days during our sample period). Mean daily gross trading losses and market timing losses are $NT 178.7 and $NT 46.4 million (respectively). Commission costs are the total 14 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 30,
    "chunk_index": 28,
    "word_count": 520,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "over the entire sample period are calculated as mean daily losses times 1,397 (the number of trading days during our sample period). Mean daily gross trading losses and market timing losses are $NT 178.7 and $NT 46.4 million (respectively). Commission costs are the total 14 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 30,
    "chunk_index": 29,
    "word_count": 50,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "represent 2.8 percent of total personal income (including income of non-investors) or 2.2 percent of Taiwan’s total gross domestic product during our sample period. We can also perform back-of-the- envelope calculations to estimate the return shortfall suffered by individual investors as 3.8 percent annually.16 While exacerbating the losses of individuals, transactions costs put a sizable dent in the profits of institutions. Nonetheless, the average daily profit net of transaction costs ($NT 126.3) is reliably positive (t=3.58).17 These daily profits translate into an abnormal return net of transaction costs of 1.5 percent annually. Not all institutions fair equally well net of trading costs. We conduct similar calculations for each institutional investor category. Net of transaction costs, the average daily profits of corporations, dealers, foreigners, and mutual funds are ($NT million) -3.1, 5.0, 75.5, and 48.4 (with t-statistics of -0.12, 1.74, 3.90, and 3.04, respectively).18 Do the trading losses of individuals represent a wealth transfer? Losses and costs of trading for individual investors fall into three categories of roughly equal magnitude: taxes, commissions, and trading and market-timing losses. Transaction taxes are a wealth transfer from investors to the government. It seems likely that absent this transfer, the government would impose other taxes of similar magnitude. Commissions are the cost charged by those who provide investors with access to secondary markets. Secondary markets, in which investors who already own securities sell to investors who wish to buy those securities, do not directly raise investment capital for firms. However, secondary markets provide liquidity, price discovery, and regulatory oversight, which ensure primary value of trade (Table 2) times the commission rate of 0.1425%. Transaction taxes are the total value of sales times the transaction tax of 0.30%. 16 Individual investors held roughly 60 percent of all outstanding stock during our sample period. The average market value of all stock during our sample period was $NT 8.1 trillion (Table 1). Thus, trading losses represent roughly a daily performance penalty of 0.37 basis points ($NT 178.7 million daily trading losses divided by the product of $NT 8.1 trillion times 60 percent), while commissions, transaction taxes, and market-timing losses cost investors roughly 0.10 bps, 0.44 bps, and 0.47 bps per day. Annualized, this represents a return shortfall of 3.8 percentage points. 17 Commissions are capped at 0.1425 percent and the transaction tax is 0.30 percent. Over our sample period, institutions bought $NT 12.5 trillion and sold $NT 12.5 trillion of common stock (Table 2). Thus, total commissions and transaction taxes paid during the sample period were $NT 35.6 and $NT 37.5 billion (respectively). This corresponds to mean daily commissions and transaction taxes of $NT 25.5 million and $NT 26.9 million. 18 Seasholes (2000) presents evidence consistent with our findings on foreign investors. Using data on cross- border investments in Korean and Taiwanese stocks, Seasholes (2000) documents that foreigners increase positions prior to positive earnings surprises and decrease investments prior to negative surprises. 15 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 30,
    "chunk_index": 30,
    "word_count": 490,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "26.9 million. 18 Seasholes (2000) presents evidence consistent with our findings on foreign investors. Using data on cross- border investments in Korean and Taiwanese stocks, Seasholes (2000) documents that foreigners increase positions prior to positive earnings surprises and decrease investments prior to negative surprises. 15 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 30,
    "chunk_index": 31,
    "word_count": 50,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "investors of an opportunity to later sell their investments expeditiously and at a reasonable price. It is difficult to say what the value of this service is to individual investors. We can, however, put a price on the service in Taiwan: $NT 216 million a day, or 1.2 percentage points annually. These fees provide a livelihood to employees of the exchange and of brokerage firms as well as profits to their shareholders. Combined trading and market-timing losses constitute a wealth transfer from individual investors to institutional investors. Institutions are agents. Whether the principals represented by institutions ultimately enjoy this performance boost depends on the costs that institutions charge their principals for their portfolio management services. In our sample, the most profitable group of institutional investors is foreign investors who garner 46.2 percent of the trading and market-timing gross profits of institutional investors. Thus, nearly half of the wealth transfer from domestic individuals to institutional investors goes to foreign institutions. Whether the institutional profits of corporations, dealers, and domestic mutual funds represent a wealth transfer depends on many factors. Corporate profits would be arguably enjoyed by corporate shareholders, but only after the wages paid to those who manage the equity portfolios of corporations. Based on our discussions with dealers, their trading operations are primarily a combination of proprietary trading and trading for high net worth individuals. For domestic equity mutual funds we can shed some light on whether those who own mutual funds participate in the trading gains of the funds. Using data between 1995 and 2005, which contains a record of returns for all domestic equity funds in Taiwan, we are able to construct a time-series of monthly mutual fund returns weighted by the beginning-of-period total net asset value (TNA) of funds in each month. These data (from the Securities Investment Trust & Consulting Association of the ROC) are free of survivorship bias. (Dividend data from the Taiwan Economic Journal are used to calculate fund returns.) Thus, the time-series of returns represents the return earned by the average dollar invested in equity mutual funds. To estimate the performance of mutual funds, we estimate an abnormal return using the four-factor model of equation (1). For the 1995 to 2005 sample period, the abnormal return (four-factor intercept) is 0.43 percent per month (t=1.90); during our sample period (1995 to 1999), the four-factor intercept is 0.23 percent per month (t=0.78). Thus, consistent with our evidence that mutual funds profit from trade, the returns of mutual funds are positive (albeit with marginal statistical significance). The positive net returns earned by mutual funds is quite remarkable, since the TNA-weighted expenses of these mutual funds are large – ranging from 2.4 to 3.1 percent annually from 1997 to 2005. While individual 16 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 30,
    "chunk_index": 32,
    "word_count": 461,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "mutual funds are positive (albeit with marginal statistical significance). The positive net returns earned by mutual funds is quite remarkable, since the TNA-weighted expenses of these mutual funds are large – ranging from 2.4 to 3.1 percent annually from 1997 to 2005. While individual 16 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 30,
    "chunk_index": 33,
    "word_count": 50,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "investors could easily have met or beat market rates of return by investing in the average mutual fund, few did so. Less than one percent of equity held by households was held in the form of mutual funds. Individual investors pay an exorbitant price for trading actively. Individual investors could participate in financial markets at low cost by following a simple buy-and- hold strategy. Even if poorly diversified, the average performance of individual investors would be materially improved. Alternatively, individual investors could cheaply diversify and enjoy market rates of returns by investing in equity mutual funds. IV. Reasons to trade Why do individual investors willingly incur such large net trading losses? There are several reasons why uninformed investors might trade: liquidity requirements, rebalancing needs, hedging demands, entertainment (or sensation seeking), and the mistaken belief that they are informed, that is, overconfidence. Turnover in Taiwan during our sample period is nearly 300 percent annually and two to three times that observed in the U.S in recent years. It strikes us as unlikely that the liquidity, rebalancing, and hedging needs of Taiwanese investors are two to three times those of current U.S investors or that these needs warrant a reduction of 3.8 percentage points in the return on the aggregate portfolio of Taiwanese individual investors. We propose, though do not prove, that a combination of overconfidence and the desire to gamble account for much of the active trading and substantial losses of individual investors in Taiwan. Cross-cultural studies of overconfidence report higher levels of overconfidence—by some measures nearly double—in China and Taiwan compared to United States (Yates et al., 1989; Yates et al. 1998). Theoretical models of equity markets predict that overconfident investors will trade to their detriment (Odean (1998), Gervais and Odean (2001), and Caballé and Sákovics (2003), while empirical work (Grinblatt and Keloharju (2006)) links overconfidence and sensation seeking with more active trading. Thus overconfidence could contribute to excessive trading in Taiwan. Another contributing factor may be that Taiwanese investors view trading in the stock market as an opportunity to gamble (Kumar (2006)) or a sensation-seeking activity (Grinblatt and Keloharju (2006)). During our sample period, gambling was illegal in Taiwan. Legalized gambling 17 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 30,
    "chunk_index": 34,
    "word_count": 368,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "excessive trading in Taiwan. Another contributing factor may be that Taiwanese investors view trading in the stock market as an opportunity to gamble (Kumar (2006)) or a sensation-seeking activity (Grinblatt and Keloharju (2006)). During our sample period, gambling was illegal in Taiwan. Legalized gambling 17 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 30,
    "chunk_index": 35,
    "word_count": 50,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "in the form of a government sponsored lottery (the Public Welfare Lottery) was introduced in January 2002. To shed light on whether some of the excessive trading in Taiwan is driven by investors who wish to gamble, we estimate the following regression for the period January 1995 through February 2007. T =α+βT +βR +βT +βT +βL +ε, (3) TSE,t 1 TSE,t−1 2 TSE,t−1 3 HK,t 4 SG,t 5 t t where T is month t percent turnover on the TSE, R is the month t-1 TAIEX index return, TSE,t TSEt-1 T and T are month t percent turnovers on the Hong Kong and Singapore exchanges, and L is HK,t SG,t t an indicator variable set to 0 for months prior to January 2002 and to 1 for January 2002 and subsequent months. The estimated coefficient on the lottery dummy variable (β) is -5.62 (t = -3.69), while the 5 mean of monthly TSE turnover from 1995 through 2001 is 22.6 percent. Thus, controlling for other factors, the introduction of legal gambling in Taiwan reduced turnover on the TSE by about one fourth. To calibrate the reasonableness of this result, we compare lottery losses to stock market trading losses. Average annual lottery sales in Taiwan from 2002 through 2006 were $NT 82.3 billion (National Treasury Agency, Taiwan, http://www.nta.gov.tw/business/roclotto.asp). With a lottery payout rate of approximately 60 percent (ROC Lotto, http://www.roclotto.com.tw), lottery players paid an average net annual cost of about $NT 32.9 billion. In Section III, we estimate trading total losses to Taiwanese individual investors from 1995 to 1999 averaging $NT 187 billion per year. If individual investor trading losses are approximately proportional to trading activity, a 25 percent reduction in trading activity would correspond to a reduction in annual trading losses of about $NT 46.75 billion. Thus the approximate aggregate annual net cost of playing the lottery ($NT 32.9 billion) was somewhat less than the approximate aggregate annual reduction in trading losses subsequent to the introduction of the lottery ($NT 46.75 billion). If, indeed, the Taiwanese derived the same utility of gambling from the lottery that they had previously derived from additional trading, they did so at a lower cost. Equity options began trading on the Taiwan Futures Exchange (TAIFEX) in January 2003; index options began trading in December 2001. Individual investors account for the majority of 18 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 30,
    "chunk_index": 36,
    "word_count": 393,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "the lottery that they had previously derived from additional trading, they did so at a lower cost. Equity options began trading on the Taiwan Futures Exchange (TAIFEX) in January 2003; index options began trading in December 2001. Individual investors account for the majority of 18 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 30,
    "chunk_index": 37,
    "word_count": 50,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "trading in equity options. However, the total volume of trading in options is small relative to trading in common stocks. For example, in 2006 the total dollar value of trading in common stocks was nearly $NT 25 trillion (similar to trading levels during our sample period), while trading in equity options was only 1.2 percent of total this amount (almost $NT 300 billion). When we augment the above regression to include the dollar volume of options trading scaled by the market cap of Taiwan common stocks, the coefficient on options trading variable is negative but not reliably so (-11.9, t=-0.84), while the coefficient on the lottery dummy remains reliably negative (- 4.6, t=-2.41). Individual ownership of stock dropped from the late 1990s (when individual ownership averaged between 56 and 59 percent of stock) to 2006 (when individual ownership of stock was 42 percent). This reduced ownership of stock by individuals, who have higher turnover rates than institutions during our sample period, may also explain the drop in turnover in recent years. Unfortunately, we do not have individual ownership data by month and so are unable to reliably test the relation between individual ownership and overall turnover in the monthly regression framework. V. Conclusion We estimate that Taiwanese individual investors incur trading losses, trading costs, and market timing losses that reduce their aggregate portfolio return by 3.8 percentage points annually. Less comprehensive studies suggest that trading losses and costs for individual investors in the U.S. are about 2 percentage points a year (Barber and Odean (2000, 2001)). (U.S. individual investors trade less actively but run a higher risk of trading with better informed institutional investors.) Countries around the world are increasingly counting on personal investment accounts to fund their citizens’ retirements. Yet most individuals have no training in investments; many hold underdiversified portfolios and routinely make poor trading decisions. Over a savings horizon of twenty or more years, an annual return shortfall of 2 to 3.8 percentage points will result in a tremendous reduction in potential wealth. In Taiwan, the U.S., and elsewhere, investors who are saving to meet long term goals would benefit from effective guidance regarding best investment practices. Until then, the answer to “Just how much do individual investors lose by trading?” remains: Too much! 19 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 30,
    "chunk_index": 38,
    "word_count": 383,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "in potential wealth. In Taiwan, the U.S., and elsewhere, investors who are saving to meet long term goals would benefit from effective guidance regarding best investment practices. Until then, the answer to “Just how much do individual investors lose by trading?” remains: Too much! 19 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 30,
    "chunk_index": 39,
    "word_count": 50,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "Ackermann, Carl, Richard McEnally, and David Ravenscraft, 1999, “The Performance of Hedge Funds: Risk, Return, and Incentives,” Journal of Finance, 54, 833-874. Agrawal, Vikas, and Narayan Y. Naik, 2000, “On Taking the Alternative Route: The Risks, Rewards, and Performance Persistence of Hedge Funds,” Journal of Alternative Investments, 2, 6-23. Amin, Gaurav S., and Harry M. Kat, 2003, “Hedge Fund Performance 1990-2000: Do the “Money Machines” Really Add Value?” Journal of Financial and Quantitative Analysis, 38, 251-274. Barber, Brad M., Yi-Tsung Lee, Yu-Jane Liu, and Terrance Odean, 2004, “Do Individual Day Traders Make Money? Evidence from Taiwan,” working paper, UC-Davis, Davis, CA. Barber, Brad M., Yi-Tsung Lee, Yu-Jane Liu, and Terrance Odean, 2007, “Is the Aggregate Investor Reluctant to Realize Losses?” European Financial Management, forthcoming. Barber, Brad M., and Terrance Odean, 2000, “Trading Is Hazardous to Your Wealth: The Common Stock Investment Performance of Individual Investors,” Journal of Finance, 55(2), 773-806. Barber, Brad M., and Terrance Odean, 2001, “Boys will Be Boys: Gender, Overconfidence, and Common Stock Investment,” Quarterly Journal of Economics, 116, 261-292. Bartov, Eli, Suresh Radhakrishnan, and Itzhak Krinsky, 2000, “Investor Sophistication and Patterns in Stock Returns after Earnings Announcements,” Accounting Review, 75, 43-63. Brown, Stephen J., William N. Goetzmann, and Roger G. Ibbotson, 1999, “Offshore Hedge Funds: Survival and Performance, 1989-95,” Journal of Business, 72, 91-117. Caballé, Jordi, and József Sákovics, 2003, “Speculating Against an Overconfident Market,” Journal of Financial Markets, 6, 199-225. Carhart, Mark M., 1997, “On Persistence in Mutual Fund Performance,” Journal of Finance, 52, 57-82. Chakravarty, Sugato, 2001, “Stealth-trading: Which Traders Trades Move Stock Prices?” Journal of Financial Economics, 61, 289-307. Chan, Hsiu-Lang, Narasimhan Jegadeesh, and Russ Wermers, 2000, “The Value of Active Mutual Fund Management: An Examination of the Stockholdings and Trades of Fund Managers,” Journal of Financial and Quantitative Analysis, 35, 343-368. Christopherson, Jon A., Wayne E. Ferson, and Debra A. Glassman, 1998, “Conditional Measures of Performance and Persistence for Pension Funds,” In: Research in Finance, Vol. 16, JAI Press, Stamford, CT, pp. 1-46. Coggin, T. Daniel, Frank J. Fabozzi, and Shafiqur Rahman, 1993, “The Investment Performance of U.S. Equity Pension Fund Managers: An Empirical Investigation,” Journal of Finance, 48, 1039-1055. Coggin, T. Daniel, and Charles A. Trzcinka, 2000, “A Panel Study of U.S. Equity Pension Fund Manager Style Performance,” Journal of Investing, 9, 6-12. Coval, Joshua D., David Hirshleifer, and Tyler Shumway, 2003, “Can Individual Investors Beat the Market?” unpublished working paper, Harvard Business School, Cambridge, MA. 20 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "References",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 30,
    "chunk_index": 40,
    "word_count": 411,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "and Charles A. Trzcinka, 2000, “A Panel Study of U.S. Equity Pension Fund Manager Style Performance,” Journal of Investing, 9, 6-12. Coval, Joshua D., David Hirshleifer, and Tyler Shumway, 2003, “Can Individual Investors Beat the Market?” unpublished working paper, Harvard Business School, Cambridge, MA. 20 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "References",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 30,
    "chunk_index": 41,
    "word_count": 50,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "Coval, Joshua D., and Tobias J. Moskowitz, 2001, “The Geography of Investment: Informed Trading and Asset Prices,” Journal of Political Economy, 109, 811-841. Daniel, Kent, Mark Grinblatt, Sheridan Titman, and Russ Wermers, 1997, “Measuring Mutual Fund Performance with Characteristic-based Benchmarks,” Journal of Finance, 52, 1035-1058. Delguercio, Diane, and Paula A. Tkac, 2002, “The Determinants of the Flow of Funds of Managed Portfolios: Mutual Funds vs. Pension Funds,” Journal of Financial and Quantitative Analysis, 37, 523-557. Fama, Eugene F., and Kenneth R. French, 1993, “Common Risk Factors in Returns on Stocks and Bonds,” Journal of Financial Economics, 33, 3-56. Ferson, Wayne, and Kenneth Khang, 2002, “Conditional Performance Measurement Using Portfolio Weights: Evidence for Pension Funds,” Journal of Financial Economics, 65, 249-282. Foucault, T., 1999, “Order Flow Composition and Trading Costs in a Dynamic Limit Order Market,” Journal of Financial Markets, 2, 99-134. Gao, Sheldon, 2002, “China Stock Market in a Global Perspective,” Dow Jones Indexes. Gervais, Simon, Ron Kaniel, and Dan H. Mingelgrin, 2001, “The High-volume Return Premium,” Journal of Finance, 56, 877-922. Gervais, Simon, and Terrance Odean, 2001, “Learning to Be Overconfident,” Review of Financial Studies, 14, 1-27. Goetzmann, William N., and Kumar, Alok, 2005, “Why Do Individual Investors Hold Under-Diversified Portfolios? ” Available at SSRN: http://ssrn.com/abstract=627321. Griffiths, M., B. Smith, A. Turnbull, and R. White, 2000, “The Costs and Determinants of Order Aggressiveness,” Journal of Financial Economics, 56, 65-88. Grinblatt, Mark, and Matti Keloharju, 2000, “The Investment Behavior and Performance of Various Investor Types: A Study of Finland’s Unique Data Set,” Journal of Financial Economics, 55, 43-68. Grinblatt, Mark, and Matti Keloharju, 2006, “Sensation Seeking, Overconfidence, and Trading Activity,” NBER working paper 12223. Grinblatt, Mark, and Sheridan Titman, 1989, “Mutual Fund Performance: An Analysis of Quarterly Portfolio Holdings,” Journal of Business, 62, 393-416. Grinblatt, Mark, and Sheridan Titman, 1993, “Performance Measurement without Benchmarks: An Examination of Mutual Fund Returns,” Journal of Business, 66, 47-68. Handa, P., R. Schwartz, and A. Tiwari, 2003, “Quote Setting and Price Formation in an Order Driven Market,” Journal of Financial Markets, 6, 461-489. Ikenberry, David, Richard Shockley, and Kent Womack, 1998, “Why Active Fund Managers Often Underperform the S&P 500: The Impact of Size and Skewness,” Journal of Private Portfolio Management, 1, 13-26. Ivkovich, Zoran, Clemens Sialm, and Scott J. Weisbenner, 2004, “Portfolio Concentration and the Performance of Individual Investors,” Journal of Financial and Quantitative Analysis, forthcoming. 21 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "References",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 30,
    "chunk_index": 42,
    "word_count": 399,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "Fund Managers Often Underperform the S&P 500: The Impact of Size and Skewness,” Journal of Private Portfolio Management, 1, 13-26. Ivkovich, Zoran, Clemens Sialm, and Scott J. Weisbenner, 2004, “Portfolio Concentration and the Performance of Individual Investors,” Journal of Financial and Quantitative Analysis, forthcoming. 21 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "References",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 30,
    "chunk_index": 43,
    "word_count": 50,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "Ivkovich, Zoran, and Scott J. Weisbenner, 2004, “Local Does as Local Is: Information Content of the Geography of Individual Investors’ Common Stock Investments,” Journal of Finance, 60, 267-306. Kumar, Alok, 2006, “Who Gambles in the Stock Market?” AFA 2006 Boston Meetings Paper Available at SSRN: http://ssrn.com/abstract=686022. Lakonishok, Josef, Andrei Shleifer, and Robert Vishny, 1992, “The Structure and Performance of the Money Management Industry,” Brookings Papers on Economic Activity: Microeconomics 1992, 330-391. La Porta, Rafael, Florencio Lopez-de-Silanes, Andrei Shleifer, and Robert W. Vishny, 1997, “Legal Determinants of External Finance,” Journal of Finance, 52, 1131-1150. Lee, Charles M.C., Andrei Shleifer, and Richard H. Thaler, 1991, “Investor Sentiment and the Closed-End Fund Puzzle,” Journal of Finance, 46, 75-109. Liang, Bing, 1999, “On the Performance of Hedge Funds,” Financial Analysts Journal, 55, 72-85. Linnainmaa, Juhani, 2003a, “The Anatomy of Day Traders,” Available at SSRN: http://ssrn.com/abstract=472182. Linnainmaa, Juhani, 2003b, “Who Makes the Limit Order Book? Implications for Contrarian Strategies, Attention-Grabbing Hypothesis, and the Disposition Effect” Available at SSRN: http://ssrn.com/abstract=474222. Lyon, John D., Brad M. Barber, and Chih-Ling Tsai, 1999, “Improved Methods for Tests of Long-run Abnormal Stock Returns,” Journal of Finance, 54, 165-201. Mitchell, Mark L., and Erik Stafford, 2000, “Managerial Decisions and Long-term Stock Price Performance,” Journal of Business, 73, 287-329. Odean, Terrance, 1998, “Volume, Volatility, Price, and Profit When All Traders Are above Average,” Journal of Finance, 53, 1887-1934. Odean, Terrance, 1999, “Do Investors Trade too Much?” American Economic Review, 89, 1279-1298. Parlour, Christine, 1998, “Price Dynamics in Limit Order Markets,” Review of Financial Studies, 11(4), 789- 816. Polkovnichenko, Valery, 2005, “Household Portfolio Diversification: A Case for Rank-Dependent Preference,” Review of Financial Studies, 18, 1467-1502. Poteshman, A.M., and V. Serbin, 2003, “Clearly Irrational Financial Market Behavior: Evidence from the Early Exercise of Exchange Trade Stock Options,” Journal of Finance, 58, 37-70. Schlarbaum, Gary G., Wilbur G. Lewellen, and Ronald C. Lease, 1978a, “The Common-Stock-Portfolio Performance Record of Individual Investors: 1964-70,” Journal of Finance, 33, 429-441. Schlarbaum, Gary G., Wilbur G. Lewellen, and Ronald C. Lease, 1978b, “Realized Returns on Common Stock Investments: The Experience of Individual Investors,” Journal of Business, 51, 299-325. Seasholes, Mark S., 2000, “Smart Foreign Traders in Emerging Markets,” unpublished working paper, UC- Berkeley, Berkeley, CA. Sias, Richard W., and Laura T. Starks, 1997, “Return Autocorrelation and Institutional Investors,” Journal of Financial Economics, 46, 103-131. 22 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "References",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 30,
    "chunk_index": 44,
    "word_count": 391,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "of Individual Investors,” Journal of Business, 51, 299-325. Seasholes, Mark S., 2000, “Smart Foreign Traders in Emerging Markets,” unpublished working paper, UC- Berkeley, Berkeley, CA. Sias, Richard W., and Laura T. Starks, 1997, “Return Autocorrelation and Institutional Investors,” Journal of Financial Economics, 46, 103-131. 22 Electronic copy available at: https://ssrn.com/abstract=529062 Wermers, Russ, 2000, “Mutual Fund Performance: An Empirical Decomposition into Stock-Picking Talent, Style, Transactions Costs, and Expenses,” Journal of Finance, 55, 1655-1694. Yates, J. Frank, Ying Zhu, David L. Ronis, Deng-Feng Wang, Hiromi Shinotsuka, and Masanao Toda, 1989, “Probability Judgment Accuracy: China, Japan, and the United States,” Organizational Behavior and Human Decision Processes, 43, 145-171. Yates, J. Frank, Ju-Whei Lee, Hiromi Shinotsuka, Andrea L. Patalano, and Winston R. Sieck, 1998, “Cross- Cultural Variations in Probability Judgment Accuracy: Beyond General Knowledge Overconfidence,” Organizational Behavior and Human Decision Processes, 74, 89-117. 23 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "References",
    "page_number": 25,
    "page_range": "p.25-26",
    "total_pages": 30,
    "chunk_index": 45,
    "word_count": 145,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.25-26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "United States,” Organizational Behavior and Human Decision Processes, 43, 145-171. Yates, J. Frank, Ju-Whei Lee, Hiromi Shinotsuka, Andrea L. Patalano, and Winston R. Sieck, 1998, “Cross- Cultural Variations in Probability Judgment Accuracy: Beyond General Knowledge Overconfidence,” Organizational Behavior and Human Decision Processes, 74, 89-117. 23 Electronic copy available at: https://ssrn.com/abstract=529062 Table 1: Basic Descriptive Statistics for Taiwan Stock Exchange The market index is a value-weighted index of all stocks traded on the TSE. Mean market cap is calculated as the sum of daily market caps divided by the number of trading days in the year. Turnover is calculated as half the value of buys and sells divided by market cap. Number of traders and number of trades are from the TSE dataset. Day trades are defined as purchases and sales of the same stock on the same day by one investor. Day trade percentage of all trades is based on value of trade; percentages based on number of trades are similar. Mean No. of No. of Day Trade Return Listed Market Cap Turnover Traders Trades as % of All Year % firms (bil TW $) % (000) (000) trades 1995 -27.4 347 5,250 195 1,169 120,115 20.6 1996 33.9 382 6,125 214 1,320 149,197 17.3 1997 18.2 404 9,571 393 2,173 310,926 24.8 1998 -21.6 437 9,620 310 2,816 291,876 25.6 1999 31.6 462 10,095 292 2,934 321,926 21.8 Mean 1995–99 6.9 8,132 294 2,082 238,808 23.1 Table 2: Trade Descriptive Statistics by Trader Type: 1995 to 1999 Data are from the Taiwan Stock Exchange. Total Value of Trade Average Trade Size % of all ($NT billion) ($NT) Trades (by Buys Sells Buys Sells value) Individuals 106,323.4 106,344.1 190,656 191,459 89.5 Corporations 5,078.1 5,334.4 380,900 379,232 4.4 Dealers 1,749.5 1,747.4 424,131 411,109 1.5 Foreigners 2,503.5 2,066.9 350,413 310,439 1.9 Mutual Funds 3,193.7 3,355.3 427,355 359,068 2.8 All Investors 118,848.1 118,848.1 201,524 201,519 100.0 Table 3: Equity to Total Assets for Households Owning Equity Data are from the Taiwan Ministry of Finance. Means are calculated for each year, 1997 to 2002. The table reports the mean across years. Quartile of Household Net Worth Negative (Conditional on Positive Net Worth) Net Worth 1 (Low) 2 3 4 (High) All Equity to Total Assets (%) 17 52 17 14 15 24 Equity to Total Assets Excluding Real Estate (%) 52 62 64 44 38 45 24 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "References",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 30,
    "chunk_index": 46,
    "word_count": 398,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "of Household Net Worth Negative (Conditional on Positive Net Worth) Net Worth 1 (Low) 2 3 4 (High) All Equity to Total Assets (%) 17 52 17 14 15 24 Equity to Total Assets Excluding Real Estate (%) 52 62 64 44 38 45 24 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "References",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 30,
    "chunk_index": 47,
    "word_count": 50,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "Table 4: Mean Daily Dollar Profit from Trade for Various Trading Groups in Taiwan: 1995 to 1999 On each day, the dollar profit from trade is calculated as the dollar gain on the buy portfolio (net of any market gain) less the dollar gain on the sell portfolio (net of any market gain). Portfolios are based on net daily buys (or sells) of each investor group. Buy and sell portfolios are constructed assuming a holding period of 1, 10, 25, and 140 trading days. The table presents the mean daily dollar profit across all trading days. Test statistics are calculated using the time-series of daily dollar profits. Profits are further partitioned based upon whether the order underlying the trade was aggressive or passive (see text for definitions of aggressive and passive). Buys - Sells Buys Sells Buys - Sells Buys - Sells Buys Sells Buys - Sells All All All Passive Aggressive All All All Passive Aggressive Profits ($NT Mil) t-statistic 1 days Corporations 13.9 6.0 -7.9 13.1 0.2 9.32 5.00 -6.47 13.88 0.24 Dealers 3.2 0.4 -2.8 3.3 -0.4 6.28 0.82 -5.53 12.56 -1.11 Foreigners 9.5 5.7 -3.8 5.1 3.5 8.94 6.45 -6.06 13.31 4.91 Mutual Funds 8.4 2.3 -6.2 6.6 1.5 6.61 1.95 -5.48 14.97 1.90 All Institutions 35.3 14.2 -21.1 27.7 5.2 13.42 6.33 -10.16 18.29 3.07 Individuals -35.3 -21.1 14.2 71.5 -100.9 -13.42 -10.16 6.33 12.21 -14.86 10 days Corporations 22.3 8.6 -13.7 18.4 -0.4 4.95 2.22 -3.16 8.05 4.95 Dealers 3.9 4.1 0.2 3.5 0.1 3.47 1.85 0.11 6.20 3.49 Foreigners 14.2 12.9 -1.3 6.4 5.7 4.16 4.08 -0.59 6.58 4.14 Mutual Funds 18.8 15.9 -2.9 11.2 6.1 3.91 3.16 -0.64 7.79 3.85 All Institutions 59.4 33.1 -26.3 39.2 12.0 7.62 4.37 -3.46 12.18 7.54 Individuals -59.4 -26.3 33.1 70.7 -129.2 -7.62 -3.46 4.37 5.03 -7.54 25 days Corporations 23.1 6.8 -16.3 18.9 -2.5 2.91 0.85 -1.83 4.95 -0.59 Dealers 3.2 9.1 5.9 2.8 0.2 1.87 1.78 1.16 3.44 0.14 Foreigners 22.5 26.3 3.8 8.0 11.5 3.36 3.83 0.81 4.71 2.41 Mutual Funds 25.0 31.5 6.5 12.8 11.1 2.98 2.89 0.65 5.00 2.10 All Institutions 74.0 52.6 -21.4 42.2 20.8 5.32 3.25 -1.29 7.88 2.29 Individuals -74.0 -21.4 52.6 34.1 -107.7 -5.32 -1.29 3.25 1.47 -4.26 140 days Corporations 18.9 17.5 -1.4 19.2 -14.0 0.70 0.51 -0.04 1.65 -0.73 Dealers 12.3 40.9 28.6 4.2 8.0 4.09 1.61 1.13 2.25 2.54 Foreigners 84.7 120.5 35.8 21.9 54.2 3.88 3.77 1.82 3.72 3.60 Mutual Funds 62.5 126.3 63.8 22.3 37.2 3.58 2.38 1.24 4.05 3.12 All Institutions 178.7 193.7 15.0 67.3 85.8 4.68 2.57 0.18 4.51 3.22 Individuals -178.7 15.0 193.7 -27.0 -157.6 -4.68 0.18 2.57 -0.35 -1.91 25 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "References",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 30,
    "chunk_index": 48,
    "word_count": 447,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "120.5 35.8 21.9 54.2 3.88 3.77 1.82 3.72 3.60 Mutual Funds 62.5 126.3 63.8 22.3 37.2 3.58 2.38 1.24 4.05 3.12 All Institutions 178.7 193.7 15.0 67.3 85.8 4.68 2.57 0.18 4.51 3.22 Individuals -178.7 15.0 193.7 -27.0 -157.6 -4.68 0.18 2.57 -0.35 -1.91 25 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "References",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 30,
    "chunk_index": 49,
    "word_count": 50,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "Table 5: Trading Profits by Firm Size for Various Trading Groups in Taiwan: 1995 to 1999 On each day, the dollar profit from trade is calculated as the dollar gain on the buy portfolio (net of any market gain) less the dollar gain on the sell portfolio (net of any market gain). Portfolios are based on net daily buys (or sells) of each investor group. Buy and sell portfolios are constructed assuming a holding period of 1, 10, 25, and 140 trading days. The table presents the mean daily dollar profit across all trading days. Test statistics are calculated using the time-series of daily dollar profits. Profits are further partitioned based upon whether the order underlying the trade was aggressive or passive (see text for definitions of aggressive and passive). LARGE FIRMS SMALL FIRMS All Pass. Agg. All Pass. Agg. All Pass. Agg. All Pass. Agg. Profits ($NT Mil) t-stat Profits ($NT Mil) t-stat 1 day 1 day Corporations 6.8 7.5 -0.6 6.99 12.25 -1.17 7.1 5.5 0.8 9.22 11.42 2.07 Dealers 1.2 2.0 -1.0 3.03 10.67 -3.18 1.9 1.2 0.5 8.52 10.53 3.20 Foreigners 6.5 3.8 2.2 7.13 11.29 3.55 3.0 1.3 1.3 9.08 11.97 6.04 Mutual Funds 1.8 3.4 -1.4 1.90 10.98 -2.10 6.4 3.1 2.9 10.55 13.74 7.86 All Institutions 16.5 16.6 -0.4 8.56 16.35 -0.31 18.6 11.1 5.6 15.82 16.38 8.47 Individuals -16.5 52.2 -64.2 -8.56 11.59 -13.55 -18.6 19.5 -36.6 -15.82 9.49 -13.64 10 days 10 days Corporations 9.1 9.3 -1.5 2.61 5.06 -0.87 13.2 9.0 1.1 6.22 8.75 0.88 Dealers 1.7 2.2 -0.4 1.93 4.84 -0.57 2.1 1.3 0.5 3.83 5.02 1.23 Foreigners 10.0 4.9 3.9 3.39 6.06 1.82 4.2 1.4 1.9 3.83 3.66 2.76 Mutual Funds 7.4 5.7 2.0 2.19 5.51 0.86 11.4 5.5 4.2 4.38 6.74 2.67 All Institutions 28.3 22.0 4.3 4.95 9.11 1.05 31.0 17.2 7.7 8.47 11.98 3.35 Individuals -28.3 52.3 -79.0 -4.95 4.62 -7.31 -31.0 18.5 -49.7 -8.47 3.76 -8.97 25 days 25 days Corporations 5.8 7.0 -3.3 0.93 2.04 -1.06 17.4 11.9 0.7 4.91 6.82 0.30 Dealers 2.2 2.1 0.2 1.69 3.25 0.21 1.0 0.7 0.0 1.17 1.56 0.00 Foreigners 16.3 5.6 9.5 2.78 3.81 2.17 6.2 2.4 2.1 3.34 3.90 2.00 Mutual Funds 12.8 6.7 6.9 2.31 3.76 1.86 12.5 6.3 4.5 2.74 4.50 1.65 All Institutions 37.3 21.2 13.7 3.88 5.13 1.97 37.3 21.2 7.4 5.50 8.67 1.74 Individuals -37.3 22.1 -58.0 -3.88 1.21 -3.06 -37.3 12.3 -50.3 -5.50 1.47 -5.02 140 days 140 days Corporations -13.1 0.2 -15.8 -0.65 0.02 -1.36 31.4 18.9 1.3 3.18 3.36 0.13 Dealers 8.5 2.4 6.7 3.34 2.00 2.56 3.1 1.6 0.7 1.96 1.49 0.48 Foreigners 67.1 16.2 47.5 3.28 2.97 3.23 17.5 5.6 6.9 3.90 3.75 2.76 Mutual Funds 41.0 13.3 27.8 3.01 3.47 2.69 19.0 8.7 8.5 1.92 2.52 1.57 All Institutions 103.7 32.0 66.6 3.67 2.71 3.09 71.1 34.8 17.6 4.25 5.16 1.34 Individuals -103.7 -16.4 -95.7 -3.67 -0.28 -1.62 -71.1 -9.7 -57.9 -4.25 -0.35 -1.57 26 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "References",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 30,
    "chunk_index": 50,
    "word_count": 496,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "3.90 3.75 2.76 Mutual Funds 41.0 13.3 27.8 3.01 3.47 2.69 19.0 8.7 8.5 1.92 2.52 1.57 All Institutions 103.7 32.0 66.6 3.67 2.71 3.09 71.1 34.8 17.6 4.25 5.16 1.34 Individuals -103.7 -16.4 -95.7 -3.67 -0.28 -1.62 -71.1 -9.7 -57.9 -4.25 -0.35 -1.57 26 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "References",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 30,
    "chunk_index": 51,
    "word_count": 50,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "Table 6: Percentage Monthly Abnormal Returns for Various Trading Groups in Taiwan: 1995 to 1999 A buy (and sell) portfolio is constructed that mimics the daily net purchases (and sales) of each investor group at holding periods of 1, 10, 25, or 140 trading days. The daily returns on the portfolios are compounded to yield a monthly return series. Abnormal returns are calculated as the intercept from a time-series regression of the portfolio excess return on the market excess return, a firm size factor, a value-growth factor, and a momentum factor (4-factor). Buys - Sells Buys Sells Buys - Sells Buys - Sells Buys Sells Buys - Sells All All All Passive Aggressive All All All Passive Aggressive Monthly Alpha t-stat 1 Days Corporations 6.078 2.560 -3.518 11.682 0.560 10.40 7.52 -9.33 16.38 1.25 Dealers 5.515 1.859 -3.656 12.460 1.035 10.64 4.90 -8.76 15.62 2.11 Foreigners 9.455 5.167 -4.288 15.305 5.920 13.45 10.82 -9.46 21.28 8.11 Mutual Funds 6.576 2.726 -3.850 12.804 2.796 13.49 7.98 -10.07 21.73 5.84 All Institutions 10.969 5.002 -5.968 17.069 4.314 19.92 13.54 -16.62 24.28 9.24 Individuals -10.969 -5.968 5.002 9.046 -14.028 -19.92 -16.62 13.53 12.13 -19.14 10 Days Corporations 2.388 0.776 -1.612 3.941 0.109 5.67 2.35 -4.99 8.47 0.32 Dealers 1.183 0.475 -0.708 3.228 -0.152 4.78 1.52 -2.21 10.06 -0.65 Foreigners 2.288 1.325 -0.963 3.804 1.253 4.45 3.66 -2.45 8.29 2.37 Mutual Funds 2.183 1.299 -0.884 4.094 0.986 4.34 3.41 -2.04 9.19 1.95 All Institutions 3.269 1.394 -1.875 5.197 0.909 8.93 5.23 -5.94 14.26 2.52 Individuals -3.269 -1.875 1.394 2.996 -4.720 -8.93 -5.94 5.23 8.78 -13.61 25 Days Corporations 1.372 0.271 -1.101 1.905 0.193 4.30 0.88 -3.80 6.04 0.65 Dealers 0.308 0.213 -0.095 1.125 -0.251 1.72 0.70 -0.31 5.26 -1.56 Foreigners 1.599 1.154 -0.445 2.158 1.089 3.18 3.47 -1.11 5.49 2.10 Mutual Funds 1.251 0.930 -0.321 2.218 0.731 3.83 2.58 -0.82 7.21 2.23 All Institutions 1.914 0.850 -1.064 2.609 0.747 6.47 3.55 -3.59 11.24 2.56 Individuals -1.914 -1.064 0.850 1.153 -2.193 -6.47 -3.59 3.55 4.88 -8.47 140 Days Corporations 0.486 0.183 -0.303 0.521 0.207 3.02 0.80 -1.46 4.14 1.09 Dealers 0.247 0.233 -0.014 0.475 0.074 3.42 0.78 -0.04 3.58 0.96 Foreigners 0.727 0.799 0.072 0.769 0.620 3.15 2.98 0.31 3.18 3.00 Mutual Funds 0.512 0.575 0.063 0.748 0.387 3.27 1.66 0.18 5.54 2.33 All Institutions 0.757 0.494 -0.263 0.842 0.438 5.77 2.40 -1.12 8.24 3.07 Individuals -0.757 -0.263 0.494 0.296 -0.666 -5.77 -1.12 2.40 2.17 -4.80 27 Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "References",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 30,
    "chunk_index": 52,
    "word_count": 407,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  },
  {
    "text": "0.799 0.072 0.769 0.620 3.15 2.98 0.31 3.18 3.00 Mutual Funds 0.512 0.575 0.063 0.748 0.387 3.27 1.66 0.18 5.54 2.33 All Institutions 0.757 0.494 -0.263 0.842 0.438 5.77 2.40 -1.12 8.24 3.07 Individuals -0.757 -0.263 0.494 0.296 -0.666 -5.77 -1.12 2.40 2.17 -4.80 27 Electronic copy available at: https://ssrn.com/abstract=529062 Figure 1: Cumulative (Market-Adjusted) Abnormal Returns (CARs) in Event Time for Stocks Bought less Stocks Sold by Institutions and Individuals Panel A: CARs are weighted by aggregate value of stocks bought and stocks sold Panel B: CARs are weighted by net value of stocks bought and sold 5.0% 4.0% 3.0% 2.0% 1.0% 0.0% -1.0% -2.0% -3.0% -4.0% -5.0% 0 20 40 60 80 100 120 140 160 180 200 220 240 260 280 Event Day 0 = Day of Trade 28 RAC 1.8% 1.5% 1.3% 1.0% 0.8% 0.5% 0.3% 0.0% -0.3% -0.5% 0 20 40 60 80 100 120 140 160 180 200 220 240 260 280 Event Day 0 = Day of Trade Institutions Individuals RAC Institution Individuals Electronic copy available at: https://ssrn.com/abstract=529062",
    "title": "Just How Much 070531",
    "source_type": "pdf",
    "document_id": "0507fcd80216",
    "source_file": "Just How Much Do Individual Investors Lose By Trading.pdf",
    "section": "References",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 30,
    "chunk_index": 53,
    "word_count": 174,
    "author": "Administrator",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070531170742-07'00'",
    "duration": null
  }
]