[
  {
    "text": "Long memory in retail trading activity ∗ † ‡ § Jinhui Han Xiaolong Li Guiyuan Ma Adrian Patrick Kennedy October 9, 2022 Abstract This work studies the long-range dependence of retail trading in the stock market. Strong evidence is found for the presence of long memory in retail trading activity, and this finding is robust to the choice of retail trade identification criteria and statistical estimators for the memory parameters. Keywords: Long memory; Retail trading; Estimation JEL Codes: C22 ∗Rotman School of Management, University of Toronto, Canada. Email: jinhuizjcu@gmail.com †Department of Statistics and Actuarial Science, The University of Hong Kong. Email: lixl@mail.sustech.edu.cn. ‡School of Economics and Finance, Xi’an Jiaotong University, China. Email: guiyuanma@xjtu.edu.cn §Department of Statistics, The Chinese University of Hong Kong, Hong Kong. Email: adri- ankennedy@link.cuhk.edu.hk Electronic copy available at: https://ssrn.com/abstract=4242634",
    "title": "Long Memory in Retail Trading Activity",
    "source_type": "pdf",
    "document_id": "3ee79a3b1ad4",
    "source_file": "Long Memory in Retail Trading Activity.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 11,
    "chunk_index": 0,
    "word_count": 132,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221009074833Z",
    "duration": null
  },
  {
    "text": "Management, University of Toronto, Canada. Email: jinhuizjcu@gmail.com †Department of Statistics and Actuarial Science, The University of Hong Kong. Email: lixl@mail.sustech.edu.cn. ‡School of Economics and Finance, Xi’an Jiaotong University, China. Email: guiyuanma@xjtu.edu.cn §Department of Statistics, The Chinese University of Hong Kong, Hong Kong. Email: adri- ankennedy@link.cuhk.edu.hk Electronic copy available at: https://ssrn.com/abstract=4242634 1 Introduction Aggregation of heterogeneous agents can lead to long-memory processes describing their aggregate behaviors. Specifically, long-range dependence has been widely witnessed in a variety of financial time series, including stock returns (Granger and Hyung, 2004), trading volatility, and total trading volume (Fleming and Kirby, 2011; Rossi and De Magistris, 2013) in the equity market, as well as the returns and volatility of commodity markets, e.g., the diamond (Chong et al., 2012) and gold (Chong et al., 2020) markets. However, there is hardly any research that empirically demonstrates the presence of long-range dependence in retail trading activity to the best of our knowledge, though Wyart and Bouchaud (2007) qualitatively demonstrated that market participants continually reinforce their expectations in trading, which may lead to a trading trace with memory effect from a behavioral finance perspective. In fact, retail trading has a rather important influence on market equilibrium outcomes. In an extended Kyle model (Kyle, 1985) framework, Collin-Dufresne and Fos (2016) showed that the volatility of price volatility becomes “excessive” if the retail trading volume is high and the price impact of insider trading is low. Han et al. (2022) further revealed that the presence of long memory in retail trading activity would result in excessive price volatility. They also illustrated how the insider trader adopts active information learning and information-based trading strategies to account for long-memory stochastic liquidity. The current paper endeavors to fill the gap in the literature by conducting an empirical study of the memory effects in retail trading of constituent stocks of the S&P 100 index. Retail trading is identified using three different criteria, while the associated memory param- eters are estimated using several different estimators (see Section 2). Our results, presented in Section 3, demonstrate that a strong long-range dependence is present in retail trading activity among all S&P 100 stocks, which is robust to the identification methods and esti- mators used. We then conclude the paper and briefly discuss the corresponding implications in Section 4. 1 Electronic copy available at: https://ssrn.com/abstract=4242634",
    "title": "Long Memory in Retail Trading Activity",
    "source_type": "pdf",
    "document_id": "3ee79a3b1ad4",
    "source_file": "Long Memory in Retail Trading Activity.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 11,
    "chunk_index": 1,
    "word_count": 385,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221009074833Z",
    "duration": null
  },
  {
    "text": "Section 3, demonstrate that a strong long-range dependence is present in retail trading activity among all S&P 100 stocks, which is robust to the identification methods and esti- mators used. We then conclude the paper and briefly discuss the corresponding implications in Section 4. 1 Electronic copy available at: https://ssrn.com/abstract=4242634",
    "title": "Long Memory in Retail Trading Activity",
    "source_type": "pdf",
    "document_id": "3ee79a3b1ad4",
    "source_file": "Long Memory in Retail Trading Activity.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 11,
    "chunk_index": 2,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221009074833Z",
    "duration": null
  },
  {
    "text": "2 Data and methodology 2.1 The data The dataset consists of daily trading volumes for the constituent firms of the S&P 1001 index from the intraday transaction records of the Trade and Quote (TAQ) database for the New York Stock Exchange (NYSE), and information on stock splits from the Center for Research in Security Prices (CRSP). The sampling period is from January 2, 2013, to December 31, 2020, which includes 2014 daily records. To examine the long-range dependence in retail trading, we first need to identify it from the total order flow. In a recent paper, Boehmer et al. (2021) introduced a new and efficient method for isolating retail trades, utilizing the fact that non-institutional retail orders can receive price improvements. In addition, there are also some classical value-based methods in the literature. For example, Lee and Radhakrishna (2000) showed that about 53% of institutional trades are above $20,000 in value, and they thus applied this cutoff to distinguish individual trades from those of institutions; Bhattacharya et al. (2007) further considered a $50,000 value-based cutoff. Our dataset includes one variable for the retail trade volume classified by the algorithm in Boehmer et al. (2021), as well as two variables respectively denoting the institutional trade volume based on the two value-based cutoffs, allowing us to compute the corresponding retail trade volume by subtracting it from the total trade volume. In summary, we altogether employ three different methods for identifying retail trades for stocks in S&P 100 index, and then examine the corresponding memory effects in what follows, so that our conclusion is robust to the identification measures. The daily volume is also adjusted according to the records of stock splits and stock dividends in the CRSP file. Finally, we exclude those daily records where institutional or retail trading data is not available. The summary statistics on retail trading percentages can be found in Appendix 1See https://en.wikipedia.org/wiki/S%26P_100 for a full list of S&P 100 index. 2 Electronic copy available at: https://ssrn.com/abstract=4242634",
    "title": "Long Memory in Retail Trading Activity",
    "source_type": "pdf",
    "document_id": "3ee79a3b1ad4",
    "source_file": "Long Memory in Retail Trading Activity.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 11,
    "chunk_index": 3,
    "word_count": 329,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221009074833Z",
    "duration": null
  },
  {
    "text": "and stock dividends in the CRSP file. Finally, we exclude those daily records where institutional or retail trading data is not available. The summary statistics on retail trading percentages can be found in Appendix 1See https://en.wikipedia.org/wiki/S%26P_100 for a full list of S&P 100 index. 2 Electronic copy available at: https://ssrn.com/abstract=4242634",
    "title": "Long Memory in Retail Trading Activity",
    "source_type": "pdf",
    "document_id": "3ee79a3b1ad4",
    "source_file": "Long Memory in Retail Trading Activity.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 11,
    "chunk_index": 4,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221009074833Z",
    "duration": null
  },
  {
    "text": "A. 2.2 Estimation of memory parameter We first recall some standard definitions of long memory for a process. Denote {x }T as a t t=1 stationary time series with a spectral density f(λ) such that the lag-j auto-covariance γ of j (cid:82)π x satisfies γ = E(x −Ex )(x −Ex ) = cos(jλ)f(λ)dλ. It is assumed that t j 0 0 j 0 −π f(λ) = G(λ)λ−2d, as λ → 0 + with G(λ) being a slowly varying function when λ → 0 , i.e., G(tλ)/G(λ) → 1 for any t, + as λ → 0 . Specifically, when the memory parameter d is positive, i.e., d > 0, the spectral + density function f(λ) increases to infinity as the frequency parameter λ goes to zero, and in this case, x is a long-memory process with the degree of long-range dependence measured by t the memory parameter d. Typical examples of long-memory processes include the popular fractional Brownian motion with a Hurst parameter larger than one half. For a more detailed introduction on long-memory stochastic processes, interested readers are referred to Palma (2007). To robustly examine the memory effect of the retail trade volumes under the proxies described previously, we adopt altogether seven different estimators developed in the litera- ture, including the log-periodogram (GPH) estimator (Robinson, 1995b), the two-step exact localWhittle(ELW2S)estimator(Shimotsu,2010), theexactlocal Whittle (ELW)estimator (Shimotsu and Phillips, 2005), the modified local Whittle (Hou.Perron) estimator (Hou and Perron, 2014), the semi-parametric local Whittle (local.W) estimator (Robinson, 1995a), the local polynomial Whittle (LPWN) estimator (Frederiksen et al., 2012), and the multivariate local Whittle (GSE) estimator (Shimotsu, 2007). Although different estimators may have specific applications in which they excel, they are all applicable to our dataset. 3 Electronic copy available at: https://ssrn.com/abstract=4242634",
    "title": "Long Memory in Retail Trading Activity",
    "source_type": "pdf",
    "document_id": "3ee79a3b1ad4",
    "source_file": "Long Memory in Retail Trading Activity.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 11,
    "chunk_index": 5,
    "word_count": 289,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221009074833Z",
    "duration": null
  },
  {
    "text": "semi-parametric local Whittle (local.W) estimator (Robinson, 1995a), the local polynomial Whittle (LPWN) estimator (Frederiksen et al., 2012), and the multivariate local Whittle (GSE) estimator (Shimotsu, 2007). Although different estimators may have specific applications in which they excel, they are all applicable to our dataset. 3 Electronic copy available at: https://ssrn.com/abstract=4242634",
    "title": "Long Memory in Retail Trading Activity",
    "source_type": "pdf",
    "document_id": "3ee79a3b1ad4",
    "source_file": "Long Memory in Retail Trading Activity.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 11,
    "chunk_index": 6,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221009074833Z",
    "duration": null
  },
  {
    "text": "3 Results Figures 1-3 report the summary statistics of the memory parameters for all stocks in the S&P 100 under three different identification criteria. It is clear that the memory parameters are robustly positive, which indicates the presence of long-range dependence in the retail trade volumes. If we look at the statistics under each identification rule, we find that different estimators give quite consistent estimates such that the “boxes” in each figure are quite close to each other, except that the LPWN estimator tends to overestimate the values compared to others. For instance, under the rule of Boehmer et al. (2021), the mean, median, and inter-quartile range are usually around 0.33, 0.35, and 0.14, respectively; they are about 0.40, 0.41, and 0.10 under the method of Lee and Radhakrishna (2000); and they are roughly 0.37, 0.38, and 0.10undertheapproachofBhattacharyaetal.(2007). Thisnotonlyimpliestheeffectiveness of the estimators adopted, but also supports the robustness of our conclusion to the choice of estimator. If we compare the results vertically presented in Figures 1-3, we can also observe the con- sistency in estimates obtained among different identification criteria. In particular, although the absolute values of retail trade volumes under these rules could be significantly differ- ent (see Table 1), the associated estimated memory parameters do not differ much. This observation further supports the robustness of our conclusion to the choice of identification criteria. The degree of long-range dependence may vary across different stocks, and Table 2 in Ap- pendix B gives the memory parameters of 40 selected stocks in the S&P 100 index. Although we choose to present the estimates in Table 2 under the ELW2S estimator developed by Shi- motsu (2010), we claim that consistent results can be obtained if we change the estimator to any of those mentioned in Section 2.2. Finally, we check the robustness of the presence of long memory with respect to the parameters used in different estimators. We notice that one parameter that is important 4 Electronic copy available at: https://ssrn.com/abstract=4242634",
    "title": "Long Memory in Retail Trading Activity",
    "source_type": "pdf",
    "document_id": "3ee79a3b1ad4",
    "source_file": "Long Memory in Retail Trading Activity.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 11,
    "chunk_index": 7,
    "word_count": 329,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221009074833Z",
    "duration": null
  },
  {
    "text": "can be obtained if we change the estimator to any of those mentioned in Section 2.2. Finally, we check the robustness of the presence of long memory with respect to the parameters used in different estimators. We notice that one parameter that is important 4 Electronic copy available at: https://ssrn.com/abstract=4242634 1.00 0.75 0.50 0.25 0.00 GPH ELW2S ELW Hou.Perron local.W LPWN GSE Estimators eulav label GPH ELW2S ELW Hou.Perron local.W LPWN GSE Figure 1: Estimated memory parameters for each stock in S&P 100 under the identification rule of Boehmer et al. (2021). 0.8 0.6 0.4 0.2 GPH ELW2S ELW Hou.Perron local.W LPWN GSE Estimators eulav label GPH ELW2S ELW Hou.Perron local.W LPWN GSE Figure 2: Estimated memory parameters for each stock in S&P 100 under the $20,000 value- based identification rule of Lee and Radhakrishna (2000). in all seven estimators is the bandwith parameter m that specifies the number of Fourier frequencies, see, e.g., Robinson (1995b) and Shimotsu (2010). A representative illustration is presented in Figure 4 to show that the results are robust to the choice of estimation 5 Electronic copy available at: https://ssrn.com/abstract=4242634",
    "title": "Long Memory in Retail Trading Activity",
    "source_type": "pdf",
    "document_id": "3ee79a3b1ad4",
    "source_file": "Long Memory in Retail Trading Activity.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6-7",
    "total_pages": 11,
    "chunk_index": 8,
    "word_count": 185,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6-7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221009074833Z",
    "duration": null
  },
  {
    "text": "(2000). in all seven estimators is the bandwith parameter m that specifies the number of Fourier frequencies, see, e.g., Robinson (1995b) and Shimotsu (2010). A representative illustration is presented in Figure 4 to show that the results are robust to the choice of estimation 5 Electronic copy available at: https://ssrn.com/abstract=4242634 0.6 0.4 0.2 GPH ELW2S ELW Hou.Perron local.W LPWN GSE Estimators eulav label GPH ELW2S ELW Hou.Perron local.W LPWN GSE Figure 3: Estimated memory parameters for each stock in S&P 100 under the $50,000 value- based identification rule of Bhattacharya et al. (2007). parameters. 4 Conclusion and implications In this paper, we revealed the presence of long-range dependence in retail trading activity. We estimated the memory parameters of retail trade volumes for stocks in the S&P 100 index using a range of statistical estimators under three different identification rules. The evidence of long memory is strong and it is also robust to each scenario. These empirical observations not only contribute to recent studies on retail trading, pioneered by Boehmer et al. (2021), but also have important implications for market equi- librium outcomes. For example, Han et al. (2022) found a new channel through which the long-memory stochastic liquidity could lead to excess price volatility. References Bhattacharya, N., Black, E. L., Christensen, T. E., and Mergenthaler, R. D. (2007). Who trades on pro forma earnings information? The Accounting Review, 82(3):581–619. 6 Electronic copy available at: https://ssrn.com/abstract=4242634",
    "title": "Long Memory in Retail Trading Activity",
    "source_type": "pdf",
    "document_id": "3ee79a3b1ad4",
    "source_file": "Long Memory in Retail Trading Activity.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7-8",
    "total_pages": 11,
    "chunk_index": 9,
    "word_count": 235,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7-8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221009074833Z",
    "duration": null
  },
  {
    "text": "et al. (2022) found a new channel through which the long-memory stochastic liquidity could lead to excess price volatility. References Bhattacharya, N., Black, E. L., Christensen, T. E., and Mergenthaler, R. D. (2007). Who trades on pro forma earnings information? The Accounting Review, 82(3):581–619. 6 Electronic copy available at: https://ssrn.com/abstract=4242634 Boehmer, E., Jones, C. M., Zhang, X., and Zhang, X. (2021). Tracking retail investor activity. Journal of Finance, 76(5):2249–2305. Campbell, J. Y., Ramadorai, T., and Schwartz, A. (2009). Caught on tape: Institutional trading, stock returns, and earnings announcements. Journal of Financial Economics, 92(1):66–91. Chong, T. T., Lu, C., and Chan, W. H. (2012). Long-range dependence in the international diamond market. Economics Letters, 116(3):401–403. Chong, T. T. L., Lu, C., and Chan, W. H. (2020). Long range dependence and structural breaks in the gold markets. The Singapore Economic Review, 65(02):257–273. Collin-Dufresne, P. and Fos, V. (2016). Insider trading, stochastic liquidity, and equilibrium prices. Econometrica, 84(4):1441–1475. Fleming, J. and Kirby, C. (2011). Long memory in volatility and trading volume. Journal of Banking & Finance, 35(7):1714–1726. Frederiksen, P., Nielsen, F. S., and Nielsen, M. Ø. (2012). Local polynomial whittle estima- tion of perturbed fractional processes. Journal of Econometrics, 167(2):426–447. Granger, C. W. and Hyung, N. (2004). Occasional structural breaks and long memory with an application to the S&P 500 absolute stock returns. Journal of Empirical Finance, 11(3):399–421. Han, J., Li, X., Ma, G., and Kennedy, A. P. (2022). Strategic trading with information acquisition and long-memory. Available at SSRN. Hou, J. and Perron, P. (2014). Modified local whittle estimator for long memory processes in the presence of low frequency (and other) contaminations. Journal of Econometrics, 182(2):309–328. Kyle, A.S.(1985). Continuousauctionsandinsidertrading. Econometrica, pages1315–1335. Lee, C. M. and Radhakrishna, B. (2000). Inferring investor behavior: Evidence from TORQ data. Journal of Financial Markets, 3(2):83–111. Palma, W. (2007). Long-memory time series: theory and methods, volume 662. John Wiley & Sons. Robinson, P. M. (1995a). Gaussian semiparametric estimation of long range dependence. Annals of Statistics, pages 1630–1661. Robinson, P. M. (1995b). Log-periodogram regression of time series with long range depen- dence. Annals of Statistics, pages 1048–1072. Rossi, E. and De Magistris, P. S. (2013). Long memory and tail dependence in trading volume and volatility. Journal of Empirical Finance, 22:94–112. Shimotsu, K. (2007). Gaussian semiparametric estimation of multivariate fractionally inte- grated processes. Journal of Econometrics, 137(2):277–310. Shimotsu, K. (2010). Exact local whittle estimation of fractional integration with unknown mean and time trend. Econometric Theory, 26(2):501–540. Shimotsu, K. and Phillips, P. C. (2005). Exact local whittle estimation of fractional integra- tion. Annals of Statistics, 33(4):1890–1933. Wyart, M. and Bouchaud, J.-P. (2007). Self-referential behaviour, overreaction and conven- tions in financial markets. Journal of Economic Behavior & Organization, 63(1):1–24. 7 Electronic copy available at: https://ssrn.com/abstract=4242634",
    "title": "Long Memory in Retail Trading Activity",
    "source_type": "pdf",
    "document_id": "3ee79a3b1ad4",
    "source_file": "Long Memory in Retail Trading Activity.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 11,
    "chunk_index": 10,
    "word_count": 451,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221009074833Z",
    "duration": null
  },
  {
    "text": "Econometric Theory, 26(2):501–540. Shimotsu, K. and Phillips, P. C. (2005). Exact local whittle estimation of fractional integra- tion. Annals of Statistics, 33(4):1890–1933. Wyart, M. and Bouchaud, J.-P. (2007). Self-referential behaviour, overreaction and conven- tions in financial markets. Journal of Economic Behavior & Organization, 63(1):1–24. 7 Electronic copy available at: https://ssrn.com/abstract=4242634",
    "title": "Long Memory in Retail Trading Activity",
    "source_type": "pdf",
    "document_id": "3ee79a3b1ad4",
    "source_file": "Long Memory in Retail Trading Activity.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 11,
    "chunk_index": 11,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221009074833Z",
    "duration": null
  },
  {
    "text": "Appendix A Summary statistics on retail trading per- centages In Table 1, we provide summary statistics of the average retail trading percentages over the sampling period. It turns out that the statistics between the cutoff-based criteria and the price-improvement selection differ significantly. Comparatively speaking, the cutoff method seems to substantially overestimate retail trading volume. This implies the situation that institutions nowadays use algorithmic order splitting, so that their trades fall below the cut- off threshold, making it difficult for the corresponding cutoff-based measures to screen their trades out (Campbell et al., 2009). Meanwhile, it is possible that the price-improvement method sets a too conservative standard that cannot identify all retail trades, so that it underestimates the trading volume. While searching for a potentially more favorable iden- tification approach is beyond the scope of the present paper, we show in the main text that our results are robust to these three methods commonly adopted in the literature. Besides, weobservethattheretailtradingproportionsalsovarysignificantlyacrossdiffer- ent stocks. For instance, under the $50,000 value-based cutoff criterion, the largest average retail trading percentage (86.57%) in the S&P 100 belongs to BK (BNY Mellon) and the smallestone(23.02%)correspondstoGOOG(Alphabet); undertheprice-improvementselec- tion, the maximum (17.02%) and minimum (2.57%) values correspond to TSLA (Tesla) and CHTR (Charter Communications), respectively. This illustrates the relative preferences of institutions and retail investors in portfolio selections across different sectors and industries. Table 1: Summary statistics of the average daily retail trading proportions for stocks in S&P 100 under three different identification measures. Measures⋆ Mean (%) Median (%) Q1 (%) Q3 (%) Min (%) Max (%) Std (%) Retail 7.08 6.66 5.59 8.09 2.57 17.02 2.61 Cutoff 20k 61.31 65.90 57.79 70.31 9.73 77.15 14.73 Cutoff 50k 77.38 79.93 77.47 82.81 23.02 86.57 10.69 ⋆ Throughout the paper, the first measure “Retail” uses the method proposed in Boehmer et al. (2021) to identify retail orders with price improvements. The last two measures “Cutoff 20k” and “Cutoff 50k”respectivelycategorizetheorderswithamountlessthan$20,000and$50,000asretail trades. 8 Electronic copy available at: https://ssrn.com/abstract=4242634",
    "title": "Long Memory in Retail Trading Activity",
    "source_type": "pdf",
    "document_id": "3ee79a3b1ad4",
    "source_file": "Long Memory in Retail Trading Activity.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 11,
    "chunk_index": 12,
    "word_count": 325,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221009074833Z",
    "duration": null
  },
  {
    "text": "14.73 Cutoff 50k 77.38 79.93 77.47 82.81 23.02 86.57 10.69 ⋆ Throughout the paper, the first measure “Retail” uses the method proposed in Boehmer et al. (2021) to identify retail orders with price improvements. The last two measures “Cutoff 20k” and “Cutoff 50k”respectivelycategorizetheorderswithamountlessthan$20,000and$50,000asretail trades. 8 Electronic copy available at: https://ssrn.com/abstract=4242634 Appendix B Supplementary tables and figures Table 2: Memory parameters estimated by the ELW2S estimator in Shimotsu (2010) for retail trade volumes of selected 40 stocks in S&P 100 under three identification methods, i.e, C 20k (Cutoff 20k), C 50k (Cutoff 50k), and Retail (price improvement). AAPL ABBV ABT ACN ADBE AMZN AVGO BAC BRKB CMCSA Retail 0.3399 0.33169 0.3747 0.1592 0.1129 0.4086 0.2595 0.3765 0.2930 0.3228 C 20k 0.5127 0.3916 0.3895 0.3796 0.3569 0.3736 0.5091 0.3840 0.3278 0.3972 C 50k 0.5038 0.3763 0.3881 0.3312 0.3779 0.3831 0.3249 0.3684 0.4935 0.3834 COST CRM CSCO CVX DHR DIS FB GOOG HD INTC Retail 0.3297 0.3008 0.2998 0.6159 0.0336 0.3208 0.3982 0.3132 0.1566 0.3022 C 20k 0.3701 0.3552 0.3459 0.6072 0.2640 0.2389 0.3102 0.3340 0.3722 0.3146 C 50k 0.3648 0.3510 0.3236 0.5742 0.3025 0.1996 0.3173 0.3744 0.3276 0.2741 JNJ JPM KO MA MRK MSFT NFLX NKE NVDA ORCL Retail 0.3122 0.2170 0.3879 0.2703 0.3692 0.3335 0.3230 0.1753 0.4625 0.1600 C 20k 0.4158 0.4070 0.1799 0.5027 0.3649 0.4002 0.4019 0.1083 0.3338 0.3766 C 50k 0.4015 0.3882 0.1655 0.3273 0.3482 0.3703 0.3174 0.0789 0.3053 0.3663 PEP PFE PG PYPL TSLA UNH V VZ WMT XOM Retail 0.3758 0.3595 0.3495 0.0805 0.4111 0.3319 0.3138 0.1597 0.2862 0.4177 C 20k 0.4169 0.4560 0.4769 0.1106 0.4720 0.3036 0.4130 0.3544 0.3629 0.3747 C 50k 0.3987 0.4548 0.4718 0.0959 0.3491 0.2940 0.3136 0.3565 0.3538 0.3655 9 Electronic copy available at: https://ssrn.com/abstract=4242634",
    "title": "Long Memory in Retail Trading Activity",
    "source_type": "pdf",
    "document_id": "3ee79a3b1ad4",
    "source_file": "Long Memory in Retail Trading Activity.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 11,
    "chunk_index": 13,
    "word_count": 282,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221009074833Z",
    "duration": null
  },
  {
    "text": "PFE PG PYPL TSLA UNH V VZ WMT XOM Retail 0.3758 0.3595 0.3495 0.0805 0.4111 0.3319 0.3138 0.1597 0.2862 0.4177 C 20k 0.4169 0.4560 0.4769 0.1106 0.4720 0.3036 0.4130 0.3544 0.3629 0.3747 C 50k 0.3987 0.4548 0.4718 0.0959 0.3491 0.2940 0.3136 0.3565 0.3538 0.3655 9 Electronic copy available at: https://ssrn.com/abstract=4242634 0.6 0.4 0.2 0.0 0 25 50 75 100 Stock retemarap yromeM d =0.6 d =0.7 d =0.8 Figure 4: Robustness check on the estimation parameter m := ⌊(1 + T)δ⌋ for the ELW2S estimator (Shimotsu, 2010) under the price-improvement identification rule (Boehmer et al., 2021), where T is the data length and ⌊·⌋ denotes the floor function. Each integer in the horizontal axis represents a stock in S&P 100 according to its alphabetic order. 10 Electronic copy available at: https://ssrn.com/abstract=4242634",
    "title": "Long Memory in Retail Trading Activity",
    "source_type": "pdf",
    "document_id": "3ee79a3b1ad4",
    "source_file": "Long Memory in Retail Trading Activity.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 11,
    "chunk_index": 14,
    "word_count": 131,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221009074833Z",
    "duration": null
  }
]