[
  {
    "text": "Losing is Optional: Retail Option Trading and Expected Announcement Volatility∗ Tim de Silva Eric C. So Massachusetts Institute of Technology Massachusetts Institute of Technology Sloan School of Management Sloan School of Management Kevin Smith Stanford University Graduate School of Business June 8, 2023 Abstract We document the growth of retail options trading and provide evidence that retail investors are drawn to options by anticipated spikes in volatility. Retail investors purchaseoptionsinaconcentratedfashionbeforeearningsannouncements, particularly those with greater expected abnormal volatility. Comparing across asset markets, we also find retail investors disproportionately trade options over stocks as anticipated announcement volatility increases. In doing so, retail investors display a trio of wealth-depletingbehaviors: theyoverpayforoptionsrelativetorealizedvolatility,incur enormous bid-ask spreads, and sluggishly respond to announcements. These translate to retail losses of 5-to-9% on average, and 10-to-14% for high expected volatility announcements. ∗First draft: January 11, 2022. Corresponding emails: tdesilva@mit.edu; kevinsm@stanford.edu; eso@mit.edu. We thank Svetlana Bryzgalova, John Dinh, Chuck Downing, Allen Hu, David Kim, Jeff Kimsey,CardinMasselink,EbenLazarus,YuraOlshanskiy,MaxRuston,HarmSchutt,DavidThesmar,Ro- drigo Verdi, and seminar participants at Yale University, UT Dallas, MIT Sloan, USC, Tilburg University, University of Amsterdam, University of Utah, the Northern Finance Association Conference, and Quantbot Technologies for helpful comments and suggestions. We thank the Nasdaq Stock Market for generously sharing data used in this paper. Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 65,
    "chunk_index": 0,
    "word_count": 208,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "seminar participants at Yale University, UT Dallas, MIT Sloan, USC, Tilburg University, University of Amsterdam, University of Utah, the Northern Finance Association Conference, and Quantbot Technologies for helpful comments and suggestions. We thank the Nasdaq Stock Market for generously sharing data used in this paper. Electronic copy available at: https://ssrn.com/abstract=4050165 1 Introduction The COVID pandemic coincided with a dramatic rise in retail investor participation in options markets. In 2020 alone, retail investors accounted for more than $250 billion of total single-name option volume. At the time of this writing, the SEC, in conjunction with local jurisdictions, are considering regulations focused on retail investor participation in options markets. These policy considerations crucially depend on how retail investors behave, affect prices, and incur gains and losses in these markets. The objective of this study is to provide timely, large-sample evidence on these considerations. Using recent data on options trades broken down by clientele groups, we address three central questions. First, what drives retail investor participation in options markets cross- sectionally and over time? Second, how does retail demand influence the cross-section of option prices, and how does these factors differ across equity and option markets? Finally, and perhaps most importantly, how do retail investors perform when trading options and who benefits from their mistakes? We show that retail investors are drawn to purchase options prior to earnings announce- ments, particularly those expected to trigger high volatility, where this behavior dispropor- tionately concentrates in options relative to stocks. This behavior is extraordinary because these events create precipitous jumps in price, and so present option writers with large, un- hedgable risk. As a result, retail investors pay hefty premiums for these options relative to realized volatility and incur abnormally high transaction costs. We further show that they sluggishly close their option positions post-announcement even as their prices predictably decay. Taken together, these patterns lead retail investors to suffer double-digit percentage losses when trading options around earnings announcements. Our evidence yields an important insight for researchers and regulatory debates focused onretailinvestorsthroughthelensofequitymarkets. Specifically, ourresultssuggestthatin- ferences regarding retail investors’ sophistication, contribution to price discovery, and wealth dynamics are likely incomplete when confined to equity markets. Prior research shows that Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 65,
    "chunk_index": 1,
    "word_count": 367,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "when trading options around earnings announcements. Our evidence yields an important insight for researchers and regulatory debates focused onretailinvestorsthroughthelensofequitymarkets. Specifically, ourresultssuggestthatin- ferences regarding retail investors’ sophistication, contribution to price discovery, and wealth dynamics are likely incomplete when confined to equity markets. Prior research shows that Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 65,
    "chunk_index": 2,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "retail investors earn excess stock returns around earnings announcements on average, con- sistent with retail investors providing liquidity and benefiting from private information re- garding firms’ earnings (e.g., Kaniel, Liu, Saar, and Titman 2012; Kelley and Tetlock 2013; Barrot, Kaniel, and Sraer 2016; Boehmer, Jones, Zhang, and Zhang 2021). In contrast, our results indicate that retail traders demand liquidity and seemingly lack private information when trading in options around earnings announcements, suffering large losses as a result. Given past evidence that investors are more prone to behavioral mistakes in complex settings (Hirshleifer 2001; Gao, Hu, Kelly, Peng, and Zhu 2022) and learn to avoid these mistakes only with experience (Seru, Shumway, and Stoffman 2010; Linnainmaa 2011), thedifferenceinretailbehavioracrossmarketslikelyreflectsthecomplexitytotrading in options relative to stocks and the expanding set of retail investors that trade options. Our main analyses use a recent dataset from the Nasdaq Stock Market that details buying and selling volumes at the contract-day level for options traded on Nasdaq and OMX PHLX exchanges. These data account for approximately 25% of market-wide option volume over our 2010-2021 sample window. A key feature of the Nasdaq data is that it allows us to observe whether a trade originated from retail, professional customers, market makers, firms, or broker/dealers (see Section 2 for details). To conduct cross-market comparisons, we merge this data with estimated retail net trading behavior in equity markets. To motivate our focus on retail behavior around earnings announcements, we begin by documenting several empirical facts present in our sample: 1. The extent of retail trading in options has grown substantially over time, increasing more than ten-fold over the past decade in terms of dollar volume traded. 2. For all clientele groups, option trading activity concentrates around firms’ quarterly earnings announcements relative to non-announcement periods. 3. Retailinvestorsandmarketmakersarethemostactiveclientelegroupsaroundearnings announcements, with market makers largely offsetting positions by retail investors. These patterns indicate that retail trade is likely an increasingly important determinant of both retail traders’ wealth and option prices, particularly around earnings announcements. 2 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 65,
    "chunk_index": 3,
    "word_count": 335,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "firms’ quarterly earnings announcements relative to non-announcement periods. 3. Retailinvestorsandmarketmakersarethemostactiveclientelegroupsaroundearnings announcements, with market makers largely offsetting positions by retail investors. These patterns indicate that retail trade is likely an increasingly important determinant of both retail traders’ wealth and option prices, particularly around earnings announcements. 2 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 65,
    "chunk_index": 4,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "Our main tests explore the link between retail option demand and the extent of expected announcement volatility (EAV). These tests are motivated by prior evidence that retail tends to gravitate towards firms with more media coverage (e.g., Barber and Odean 2008) and that the media is more likely to cover earnings announcements with larger anticipated spikes in volatility (e.g., Noh, So, and Verdi 2021). Combined with theories and evidence of investors’ preference for volatile assets (e.g., Baker, Bradley, and Wurgler 2011; Barberis and Xiong 2012), we predict retail investor option demand increases with the amount of volatility expected at the announcement. We show retail investors indeed purchase options in a concentrated fashion ahead of announcements with higher EAV. We measure EAV using the term-structure of implied volatilityacrossoption-maturitydates(PatellandWolfson1979;Dubinsky,Johannes,Kaeck, and Seeger 2019). However, to mitigate concerns that our results are mechanically driven by the use of equilibrium prices to predict quantities, we also proxy for EAV using a firm’s largest absolute return over recent quarterly earnings announcements. This approach is based on the idea that investors and the media use historical announcement volatility to forecast volatility around subsequent announcements and that extreme past events have an especially strong impact on investors’ beliefs (Bali, Cakici, and Whitelaw 2011). Using both approaches, we show retail investors take large net long positions in the days immediately prior to high EAV announcements. Moreover, as EAV rises, overall retail trading behavior increases in options relative to stocks. This pattern concentrates in firms with pre-announcement media coverage, suggesting attention effects strongly contribute to pre-announcementretailoptiondemand. Totheextentthatretaildemandwasinsteaddriven by a preference for lottery-like payoffs (e.g., Han and Kumar 2013; Boyer and Vorkink 2014), we would expect their purchases to be focused in options with lottery-like return profiles, i.e., out-of-the-money options with short maturities. On the contrary, ahead of high EAV announcements, retail investors primarily purchase at-the-money options, and are equally likely to buy long- and short-dated options. 3 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 65,
    "chunk_index": 5,
    "word_count": 322,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "we would expect their purchases to be focused in options with lottery-like return profiles, i.e., out-of-the-money options with short maturities. On the contrary, ahead of high EAV announcements, retail investors primarily purchase at-the-money options, and are equally likely to buy long- and short-dated options. 3 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 65,
    "chunk_index": 6,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "Lakonishok, Lee, Pearson, and Poteshman (2007) and Mahani and Poteshman (2008) use proprietary datasets similar to ours from the 1990s to explore the option strategies that investorgroupsfollow. Lakonishoketal.(2007)showthatindividualinvestorstendtobenet- short options but use options to speculate on growth stocks (i.e., firms with high market-to- book ratios). Mahani and Poteshman (2008) find these investors similarly purchase options in growth stocks before earnings announcements, but that this behavior does not appear to be driven by attention effects. Our study differs by showing that retail investors are drawn to options by anticipated spikes in volatility around these announcements, and that their option purchases sharply increase not only on an absolute basis, but also relative to their purchases in stocks. These findings, which became even more prominent during the COVID pandemic, complement the evidence in Barber, Huang, Odean, and Schwarz (2021) that recent generations of retail investors behave differently than those documented in studies from the 1990s. Retail’s focus on high EAV announcements is especially notable because the unhedgable risk that option writers face peaks around these events, which are expected to create large price jumps. Since most retail option demand ahead of high EAV announcements is ab- sorbed by a single clientele group, market makers, demand-based option pricing theory pre- dicts market makers are likely to charge exceptionally high premiums to accommodate this retail demand (Garleanu, Pedersen, and Poteshman 2009). Consistent with this theory, we find that retail investors’ option demands generate large price impact prior to high EAV earnings announcements. For announcements in the top quintile of retail option purchases, option-implied variances escalate by roughly 40% more in the days immediately prior to the announcement dates compared to announcements with no such purchases. Wenextconducttwosetsofteststhatillustratehowretail’sproclivitytowardspurchasing options prior to high EAV announcements depletes their wealth. In the first, we showcase three factors that shape the dynamics of retail investor performance around earnings an- nouncements. In the second, we take a novel, aggregate approach that tracks retail positions 4 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 65,
    "chunk_index": 7,
    "word_count": 328,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "such purchases. Wenextconducttwosetsofteststhatillustratehowretail’sproclivitytowardspurchasing options prior to high EAV announcements depletes their wealth. In the first, we showcase three factors that shape the dynamics of retail investor performance around earnings an- nouncements. In the second, we take a novel, aggregate approach that tracks retail positions 4 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 65,
    "chunk_index": 8,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "in event-time to directly quantify how these factors combine to impact retail wealth. The first of three factors contributing to retail investment performance is that options earn significantly negative returns during earnings announcements, particularly those with high EAV. For these tests, we focus on at-the-money straddle returns because they allow us to study retail investors’ pricing of volatility separately from retail investors’ ability to predict directional price moves in the stock market. We find these straddles underperform on high EAV announcement dates relative to low EAV announcement dates by a whopping 11%, on average (t-statistic = 19.55). This suggests retail investors deplete their wealth by buying options ahead of anticipated spikes in volatility but, in doing so, overpay for these options relative to realized volatility. A second factor contributing to retail investors’ performance is that they trade options with enormous bid-ask spreads, which predictably concentrate ahead of high EAV announce- ments. We conservatively estimate the transaction costs that retail traders incur by assum- ing they hold all options they purchase until maturity, and thus only pay half of the bid-ask spread. Among high EAV announcements, we find retail investors lose an average additional 9% of their investment due to this half-spread. These findings complement evidence in Bryz- galova, Pavlova, and Sikorskaya (2022) that option market makers appear to earn substantial profits by trading against retail order flow. The third factor we document is that retail investors compound their losses by continuing to hold onto their option positions post-announcement as their prices continue to decay. We find this appears to be driven in part by a disposition effect, in which retail investors fail to close underperforming positions. An implication of retail investors maintaining an abnormal net long option position is that option market makers continue to bear inventory risk in the post-announcement period. Thus, theories of demand pressure (e.g., Garleanu et al. 2009) predict straddle prices should remain elevated rather than falling immediately in concert with the decline in expected volatility. Consistent with retail holdings influencing option prices, we show that straddles continue to underperform over the two weeks following high 5 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 65,
    "chunk_index": 9,
    "word_count": 356,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "pressure (e.g., Garleanu et al. 2009) predict straddle prices should remain elevated rather than falling immediately in concert with the decline in expected volatility. Consistent with retail holdings influencing option prices, we show that straddles continue to underperform over the two weeks following high 5 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 65,
    "chunk_index": 10,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "relative to low EAV announcements by an additional 9% (t-statistic = 8.26). Using randomly generated pseudo-earnings-announcement dates, we show that our main findings concentrate specifically around earnings announcements rather than in non-announcement periods. These results indicate that earnings announcements are a key driver of retail participation in options markets and thus that event-time tests are crucial for understanding the behavioral biases that contribute to retail losses in options markets. Ourfinaltestsleveragethegranularityofourdatatomoredirectlytrackwealthdynamics in event-time relative to earnings announcements. We conduct these tests by cumulating positions for each clientele type and estimating their sensitivities to realized changes in price. As a complement to our straddle return tests, these tests provide a more precise picture of the wealth dynamics of retail investors after accounting for their concentrated positions in options ahead of high EAV announcements as well as conservative assumptions about the transaction costs they incur. Retail investors deplete their wealth on average by trading ahead of earnings announce- ments, but particularly so for the subsample of high EAV announcements. After accounting for bid-ask spreads and making conservative assumptions about the price improvement they receive, we estimate that retail investors lose 5-to-9% of option investments around earnings announcements on average, and 10-to-14% for high EAV announcements. Taken together, our estimates indicate that retail investors lost approximately $3 billion on option invest- ments during our sample window. Market makers are the primary beneficiaries of these patterns, particularly in recent years coinciding with the COVID pandemic, resulting in large capital flows from retail to market makers. Importantly, the percentage losses we document are not only large on an absolute basis, but also large relative to the losses that retail investors incur trading options on the typical day. For instance, Bauer, Cosemans, and Eichholtz (2009) show that retail investors in the Netherlands lose an average of 1.81% per month on their option positions. Coupled with our findings, these results suggest retail’s option trading is exceptionally costly around high 6 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 65,
    "chunk_index": 11,
    "word_count": 327,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "on the typical day. For instance, Bauer, Cosemans, and Eichholtz (2009) show that retail investors in the Netherlands lose an average of 1.81% per month on their option positions. Coupled with our findings, these results suggest retail’s option trading is exceptionally costly around high 6 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 65,
    "chunk_index": 12,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "EAV announcements. Our findings are particularly relevant in light of increased regulatory scrutiny of retail trading in options markets. Whether and how to respond to the growth of retail options trading hinges upon understanding both their drivers and consequences. Thus, a key con- tribution of our paper is in showing that retail investors’ options demands are driven by expected announcement volatility and that their demands have a first-order impact on mar- ket prices and wealth dynamics, in ways that are distinct from equity markets. We highlight that retail investors generate losses in options markets for three distinct reasons: they over- pay for options relative to realized volatility, trade in options with large bid-ask spreads, and continue to hold options post-announcement as their prices predictably decay. A second key insight of our paper is that the asset pricing implications of retail demand are notably different in both magnitude and form in options relative to stocks. In terms of magnitude, the inability of option market makers to hedge announcement risks results in the asset-pricing implications of retail demand being an order of magnitude larger in op- tions ( 15X) relative to the earnings announcement premium in stock markets (e.g., Barber, ∼ De George, Lehavy, and Trueman 2013), which is commonly attributed to retail demand pressure (e.g., Noh et al. 2021). In terms of form, we show the impact of retail demand on option prices has a long tail spanning the two weeks post-announcements. This is because retail investors not only buy options ahead of earnings announcements with high expected abnormal volatility, but also appear slow to close out their positions post-announcement. Finally, our study contributes by underscoring that inferences regarding retail investors’ sophistication, contribution to price discovery, and wealth dynamics are likely incomplete when confined to equity markets. Our evidence that retail investors are contrarian is consis- tentwithevidencefromequitymarkets(e.g.,Kanieletal.2012;Barrotetal.2016). However, unlike that literature, which emphasizes how retail investors profit from providing market liquidity and increase market stability, we find the contrarian nature of retail investors in options markets generates wealth losses and equilibrium price distortions (as in Foucault, 7 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 65,
    "chunk_index": 13,
    "word_count": 351,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "are contrarian is consis- tentwithevidencefromequitymarkets(e.g.,Kanieletal.2012;Barrotetal.2016). However, unlike that literature, which emphasizes how retail investors profit from providing market liquidity and increase market stability, we find the contrarian nature of retail investors in options markets generates wealth losses and equilibrium price distortions (as in Foucault, 7 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 65,
    "chunk_index": 14,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "Sraer, and Thesmar 2011). 2 Data Description and Descriptive Results 2.1 Data and Sample Construction We begin our sample construction with the Nasdaq Options Trade Outline (NOTO) and the PHLX Options Trade Outline (PHOTO) End-of-Day files provided to us by the Nasdaq Stock Exchange.1 To our knowledge, we are the first to use these data to academically study options markets, but Lakonishok et al. (2007) use a similar, proprietary dataset from the 1990s. For each option traded on the Nasdaq Options Market (NOM) or Nasdaq PHLX (PHLX), these data provide the daily number of opening buys, opening sells, closing buys, and closing sells by five different categories of traders: customers, professional customers, market makers, broker/dealers, and firms. Opening buys (sells) refer to trades in which the trader initiates a new long (short) position in the particular option, while closing sells (buys) refer to trades in which the trader settles a previously established long (short) option position. These data cover all electronic trades that occur on the NOM and PHLX and also contain the daily low, high, open, and last trade prices for each option. An important feature of these data is the breakdown of daily option trades into the five clientele groups, which we now describe in more detail. The “professional customer” category captures persons and entities that are not broker/dealers and place more than 390 orders in listed options on average per day during a calendar month for their own beneficial accounts, where 390 corresponds to one trade per minute during trading hours. This category would include institutional investors that actively trade options, such as quantitative hedge funds. Our primary category of interest is “non-professional customer”, which captures customers of the exchange trading on behalf of their own accounts that are not active enough to be classified as professional customers.2 1Formoredetailonthesedataoutsideofwhatisprovidedinthissection,seehttps://data.nasdaq.com/ databases/NOTO/documentation and https://data.nasdaq.com/databases/PHOTO/documentation. 2ChoyandWei(2012)studiestheextentofretailtradingactivityusingarelateddatasetfromtheCBOE 8 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 65,
    "chunk_index": 15,
    "word_count": 312,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "trade options, such as quantitative hedge funds. Our primary category of interest is “non-professional customer”, which captures customers of the exchange trading on behalf of their own accounts that are not active enough to be classified as professional customers.2 1Formoredetailonthesedataoutsideofwhatisprovidedinthissection,seehttps://data.nasdaq.com/ databases/NOTO/documentation and https://data.nasdaq.com/databases/PHOTO/documentation. 2ChoyandWei(2012)studiestheextentofretailtradingactivityusingarelateddatasetfromtheCBOE 8 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 65,
    "chunk_index": 16,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "We measure the trading activity of retail investors using the non-professional customers category, which includes all options trades by retail investors. This measure is an imperfect proxy because it may also capture trades by small sophisticated non-retail investors and should thus be seen as complementary to other measures (e.g., Bryzgalova et al. 2022). However, our conversations with the data provider indicate that the presence of non-retail trades in the non-professional customer group is likely quite small. Nevertheless, in the presence of such measurement error, our descriptive results on the extent of retail trading activity (e.g., dollar volume) are likely overstated, while the extent of behavioral tendencies that we ascribe to retail investors are likely understated. Because we are primarily interested in the latter, we view the use of this measure as a proxy for retail investors’ option trading as conservative. The remaining three clientele groups are market makers, broker/dealers, and firms. The “market maker” category captures registered/designated market makers on NOM and/or PHLX, which are required to maintain two-sided quotes during market hours for the options each entity is registered to trade. The “broker/dealer” category captures institutions that may serve as market makers without formal registration, in addition to brokers trading on behalf of institutional clients. Finally, the “firm” category captures entities that do not fall into the prior four categories, such as proprietary trading desks at an investment bank.3 We next collect the largest possible set of earnings announcements for US publicly traded firms between January 1st, 2010 and February 28th, 2021, which is the time period of our Nasdaq data.4 We construct this set of earnings announcements by merging the Compustat over a 6-month window in 2006, and examines its link to stock returns but not option returns. 3The designation of a given option trade across clienteles is done on a trade-by-trade basis. This means that a given entity could show up under two clientele designations if, for example, it traded some options on behalf of clients but also traded on behalf of its own book. The entity is required to flag its order capacity according to who the order is for, which Nasdaq and PHLX use to prioritize and route orders. Unlike in equity markets, where retail order flow is internalized off-exchange, retail order flow in options is sent for execution on the exchanges, where it may fulfilled by a pre-arranged counterparty similar to payment for order flow in equity markets. 4Inanearlierdraftofthispaper, weconductedouranalysisusingasamplethatendedinDecember31st, 2019. Our results are qualitatively and quantitatively similar when using that sample, suggesting the spike in retail options during 2020 and 2021 does not entirely drive our results. 9 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 65,
    "chunk_index": 17,
    "word_count": 440,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "fulfilled by a pre-arranged counterparty similar to payment for order flow in equity markets. 4Inanearlierdraftofthispaper, weconductedouranalysisusingasamplethatendedinDecember31st, 2019. Our results are qualitatively and quantitatively similar when using that sample, suggesting the spike in retail options during 2020 and 2021 does not entirely drive our results. 9 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 65,
    "chunk_index": 18,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "QuarterlyFundamentalsfilewiththeThomsonReutersIBESdetailedEPSfileandtheCRSP Daily Stock File. We determine announcement dates following DellaVigna and Pollet (2009) and Johnson and So (2018), taking into account the time at which an announcement occurs. We denote t 0 as the date in which earnings announcement occurs, which corresponds to = the day of the announcement for pre-open and market-hours announcements and the day after the announcement for after-close announcements. Throughout, we use the notation t τ to refer to the day that occurs τ trading days after the earnings announcement. = Following Dubinsky et al. (2019), we filter our sample to those announcements that have traded options in OptionMetrics, had a trailing dividend yield below 2%, and whose stock traded above $5 in the prior quarter. We also require announcements to have sufficient price data to calculate straddle returns as defined below. Finally, we merge this set of announcements to our Nasdaq data through the ticker of the underlying, which results in a final sample of 32,758 quarterly earnings announcements spanning 2010-2021. We compute a series of other variables from CRSP, Compustat, OptionMetrics, Nasdaq, and Factiva.com for this final sample of announcements that we use in our analyses, which we discuss below. In Figure 1, we provide evidence on the coverage of our Nasdaq data for the underlyings in our sample. Panel A plots the average ratio of trading volume and open interest per un- derlying observed in our Nasdaq data relative to the total volume and open interest observed for that underlying in OptionMetrics.5 The results show these data capture somewhere be- tween 20-30% of total options trading volume and 25-30% of open interest, suggesting they provide a reasonable characterization of aggregate option market activity. 2.2 Measures of Trader Positions Our primary tests examine the dynamics of holdings by clientele and their implications for returns. We track holdings for each earnings announcement by the daily change in the net option position of each clientele group, defined as follows: 5We define trading volume in our Nasdaq data as the sum of opening buys, opening sells, closing buys, and closing sells. Open interest for each option contract is provided directly. 10 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 65,
    "chunk_index": 19,
    "word_count": 359,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "daily change in the net option position of each clientele group, defined as follows: 5We define trading volume in our Nasdaq data as the sum of opening buys, opening sells, closing buys, and closing sells. Open interest for each option contract is provided directly. 10 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 65,
    "chunk_index": 20,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "∆Trader Position 100 Trader Opening Buys Trader Closing Buys (1) t = ∗[ t+ t Trader Opening Sells Trader Closing Sells , − t− t] where trader buys and sells are summed across all options available on Nasdaq for a given announcement.6 Wescalebuysandsellsby100toaccountforthefactthatanoptioncontract consists of 100 options, each corresponding to one share of the underlying. We do not weight options by maturity or moneyness for simplicity.7 Throughout, we denote changes in this variable between t and t as ∆Trader Position , which captures net trader buying from 1 2 t1,t2 market close at t to market close at t . To measure each clientele’s exposure to changes in 1 2 option prices, we cumulate these changes in net option positions to arrive at the net option position for each clientele group: t Trader Position ∆Trader Position , (2) t =∑ s s=t where t represents the first day that a given option appears in our sample. Although both these variables vary at the firm-quarter-day level, we drop firm-quarter subscripts for simplicity and focus on t, which refers to the day on which we measure po- sitions relative to the earnings announcement at t 0. To capture the option demand of = retail investors that is specific to earnings announcements, in the remainder of the paper we calculate our measures of trader positions in (1) and (2) across all options that expire at least 10 days after the earnings announcement.8 As a benchmark, we also consider retail trade in the stock market in some of our analyses. To do so, we construct measures of the amount of retail buying and selling in the underlying stock. Using TAQ data, we identify retail marketable trades following Boehmer et al. (2021). 6Throughoutouranalysis, weaggregateopeningbuys, closingbuys, openingsells, andclosingsellsofthe same option contract across NOM and PHLX. 7In untabulated results, we find that our inferences are unchanged when delta-weighting positions as in Lakonishok et al. (2007). 8Wedothistoavoidpotentialmeasurementissuesaroundoptionexpiration,asourdatadoesnotcontain information on option positions closed due to expiration. 11 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 65,
    "chunk_index": 21,
    "word_count": 333,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "Boehmer et al. (2021). 6Throughoutouranalysis, weaggregateopeningbuys, closingbuys, openingsells, andclosingsellsofthe same option contract across NOM and PHLX. 7In untabulated results, we find that our inferences are unchanged when delta-weighting positions as in Lakonishok et al. (2007). 8Wedothistoavoidpotentialmeasurementissuesaroundoptionexpiration,asourdatadoesnotcontain information on option positions closed due to expiration. 11 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 65,
    "chunk_index": 22,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "We then calculate the total number of shares bought and sold by retail investors in the underlyingstockondayt, whichwedenotebyRetail Equity Buys andRetail Equity Sells , it it respectively. 2.3 Descriptive Results on Pre-Announcement on Trading Activity In this section, we provide three descriptive results on option market trading activity by clientele groups that motivate our subsequent analyses of retail options trading around earnings announcements. Panel B of Figure 1 shows our first result: the extent of retail trading activity in option markets has increased markedly over time. Retail dollar option trading increased over ten-fold from approximately $20 billion in 2010 to approximately $240 billion in 2020. Given our sample coverage has remained relatively constant over time, this finding is consistent with discussion in the mainstream press that infers a recent increase in retail options trading from the increasing number of small-lot traders.9 The rise in retail option volume tracks the rise in overall market volume while also underscoring the growth in capital invested by retail customers, particularly in recent years coinciding with the COVID pandemic. Figure 2 illustrates our second descriptive result: option trading activity is heavily con- centrated around earnings announcements. In Panel A, we plot the average option dollar trading volume across all announcements in our sample at different trading days relative to the earnings announcement day, t 0. The results show a steep rise in overall option market = trading concentrated around firms’ earnings announcement dates. Trading volume spikes to two- or three-times normal levels in the days immediately surrounding the announcement. Panel B also shows the amount of pre-announcement option trading, defined over t 5 to = − t 2, has increased markedly in recent years for all clientele groups. =− Our final motivating descriptive result is that retail investors and market makers are the most active clientele groups around earnings announcements. We illustrate this in Figure 3 9See https://www.ft.com/content/b330e091-2a59-4527-b958-9213731a526c for an example. 12 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 65,
    "chunk_index": 23,
    "word_count": 322,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "2, has increased markedly in recent years for all clientele groups. =− Our final motivating descriptive result is that retail investors and market makers are the most active clientele groups around earnings announcements. We illustrate this in Figure 3 9See https://www.ft.com/content/b330e091-2a59-4527-b958-9213731a526c for an example. 12 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 65,
    "chunk_index": 24,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "by plotting our the average change in each clientele group’s position in (1) relative to the earnings announcement day, t 0. Panel A shows retail traders tend to open option positions = in the days prior to EAs, which are primarily absorbed by market makers. In contrast, Panel B shows the activity of professional customers, broker/dealers, and firms is relatively minor. Consequently, market makers are the primary bearers of the inventory risk posed by the announcement-specific option demand of retail investors. This role of market makers as liquidity providers and option writers is central to the mechanism through which we later argue retail demand impacts option prices. In Table 1, we provide summary statistics on our measures of trader positions in (1) and (2). Panel A shows the retail clientele group buys an average of 5,045 options between t 5 and t 2 prior to earnings announcements, which are offset primarily by market = − = − makers, consistent with Figure 3. Panel B shows this difference in trading behavior generates heterogeneity in announcement exposure across clientele groups: retail investors tend to be net long, while market makers, firms, and broker/dealers tend to be net short. Both panels illustrate substantial variation in pre-announcement trading behavior across the announce- ments in our sample, which is the variation in option market activity we seek to understand in our main tests. Taken together, these results suggest that the bulk of options trading activity is con- centrated around earnings announcements and mostly occurs between retail investors and marketmakers. Giventhesefindings, wecenterthetimingofoursubsequentanalysesaround earnings announcements and focus on the determinants and equilibrium consequences of re- tail investors’ options demand. As an additional way to gauge the importance of retail option trade prior to EAs, we also compare the magnitude of their positions in options relative to those in the stock market. We compute the following two measures, where buys and sells are measured from days 5 − to 2 relative to each EA: − 13 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 65,
    "chunk_index": 25,
    "word_count": 333,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "trade prior to EAs, we also compare the magnitude of their positions in options relative to those in the stock market. We compute the following two measures, where buys and sells are measured from days 5 − to 2 relative to each EA: − 13 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 65,
    "chunk_index": 26,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "∑ ∣∆ ito ∣∗∆Retail Position ito o Unsigned OS Ratio =100× ; (3) it Retail Equity Buys +Retail Equity Sells it it ∑ ∆ ito ∗(Retail Opening Buys ito +Retail Opening Buys ito ) OS Call Buy Ratio =100× o∈Calls . (4) it Retail Equity Buys it Intuitively,Unsigned OS Ratio capturestheamountofunsignedretailvolumeinoptions it relative to stocks. We examine this metric as a simple way to compare the overall amount of retail trade in the two markets. On the other hand, OS Call Buy Ratio focuses on retail it call purchases relative to stock purchases, placing them in comparable units by weighting call purchases by their respective option delta ∆ . This metric allows us to focus specifically on ito retail investors’ purchasing behavior in options relative to stocks. We focus on call purchases because they can be directly compared to retails’ purchases in the equity market, and in light of the evidence we will provide that retail focuses their purchases in calls (see Panel A of Table 4). However, we obtain similar results when applying alternative means to comparing retail activity in stocks vs. options, such as netting purchases against sales or considering retail’s positions across both calls and puts. Figure 4 plots these two metrics around EAs. It shows that both metrics spike just prior to and then drop soon after EAs. This indicates that, not only are retail traders trading more in options prior to EAs, but their trading behavior shifts across markets from stock to options. This shift suggests that the forces that drive retail option purchases prior to EAs are either considerably stronger than and/or distinct from those that drive retail stock purchases. Moreover, it indicates that existing theories on what drives retail trade in the stock market may not be able to fully explain retail trader behavior in options prior to EAs. 14 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 65,
    "chunk_index": 27,
    "word_count": 312,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "are either considerably stronger than and/or distinct from those that drive retail stock purchases. Moreover, it indicates that existing theories on what drives retail trade in the stock market may not be able to fully explain retail trader behavior in options prior to EAs. 14 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 65,
    "chunk_index": 28,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "3 Pre-Announcement Retail Demand 3.1 Expected Announcement Volatility and Retail Demand Our first main result is that retail option purchases concentrate ahead of announce- ments with high expected volatility, which we abbreviate with EAV (expected announcement volatility). Our primary proxy for EAV relies on the market prices of options to back out these expectations. This metric uses the difference between the level of volatility implied by short- and long-horizon options and is defined as: IV IV t,30− t,60 AbnormalIV , (5) t = 1 1 − 30 60 where IV is the Black-Scholes implied volatility from the OptionMetrics Standardized Op- t,τ tion Price Files of an option with τ days to maturity at t and t is measured in event-time with respect to earnings announcements. Intuitively, when investors expect earnings to cre- ate greater return variation, the short-term implied variance rises relative to the long-term implied variance because the event reflects a greater proportion of a short-term option’s remaining lifetime (Smith and So 2020). Formally, if stock prices follow a log-normal diffu- sion process with log-normal jumps at t 0, AbnormalIV measures precisely the expected = t squared jump on the EA date under the risk-neutral measure (Dubinsky et al. 2019). Because AbnormalIV is derived from the market prices of options, retail demand may t be mechanically associated with AbnormalIV through market clearing. As Ni, Pan, and t Poteshman (2008) show, demand for options has price impact prior to EAs, suggesting retail demand likely raises short-term implied volatility due to short-term options having a higher gamma and thus posing more unhedgeable risk for market makers. This greater price impact may influence AbnormalIV , which introduces concerns about reverse causality. To t mitigate these concerns, we exploit the fact that, as shown in Figure 3, retail trades are most prominent starting 3 days prior to the EA and examine AbnormalIV measured 5 days prior to the announcement, denoted as AbnormalIV . By design, AbnormalIV is measured −5 −5 15 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 65,
    "chunk_index": 29,
    "word_count": 333,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "concerns, we exploit the fact that, as shown in Figure 3, retail trades are most prominent starting 3 days prior to the EA and examine AbnormalIV measured 5 days prior to the announcement, denoted as AbnormalIV . By design, AbnormalIV is measured −5 −5 15 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 65,
    "chunk_index": 30,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "prior to the window over which we measure retail investors’ pre-announcement trading. Figure5plotsaveragepre-announcementchangesineachclientelegroup’spositionsacross quintiles of AbnormalIV in Panel A and the corresponding levels of their positions in Panel −5 B. The results in Panel A show that pre-announcement retail trading from t 5 to t 2 = − = − monotonicallyincreaseswithAbnormalIV andreflectsbuyingbehaviorinallbutthelowest −5 quintile. We also see in Panel A that market makers are net sellers of options in all quintiles, consistent with their role in writing options. Firms are the only other clientele that tends to buy options ahead of high EAV announcements, but this buying behavior is low relative to their buying in the low EAV quintiles (unlike that of retail investors). Panel B of Figure 5 focuses on the level of each clientele’s pre-announcement positions, rather than changes. The results show that the level of retail positions also increases mono- tonically across quintiles of AbnormalIV . Retail investors are actually net short options −5 in the bottom quintile. This result may be initially surprising, but it is consistent with the evidence in Lakonishok et al. (2007) that the average non-market-maker position is nega- tive. Anecdotally, these short positions appear consistent with the use of cash covered puts and covered calls to generate income on positions in cash or the underlying.10 Panel B also shows that retail is the only clientele group with statistically significant net long positions immediately prior to high EAV announcements. Columns (1) and (3) of Panel A of Table 2 show that retail demand is significantly increasinginEAVasmeasuredbyAbnormalIV , aftercontrollingforpotentialconfounders. −5 Economically, the coefficient on AbnormalIV in column (3) indicates that a one standard −5 deviation increase in AbnormalIV translates into roughly 2,300 more options bought by −5 retail investors immediately prior to the announcement.11 Moreover, as shown in Panel B, thisincreaseinretailinvestors’positionsismostlydrivenbyretailinvestorsopeningnewlong 10See, for example, descriptions on Charles Schwab, Fidelity, or Robinhood. 11In our Internet Appendix, we show the probability of retail buying also increases monotonically with EAV.TheuseofabinaryvariabletocaptureincreasesalsohelpsmitigateconcernsthathighEAVannounce- ments have mechanically higher trading activity due to greater availability of options. 16 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 65,
    "chunk_index": 31,
    "word_count": 341,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "as shown in Panel B, thisincreaseinretailinvestors’positionsismostlydrivenbyretailinvestorsopeningnewlong 10See, for example, descriptions on Charles Schwab, Fidelity, or Robinhood. 11In our Internet Appendix, we show the probability of retail buying also increases monotonically with EAV.TheuseofabinaryvariabletocaptureincreasesalsohelpsmitigateconcernsthathighEAVannounce- ments have mechanically higher trading activity due to greater availability of options. 16 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 65,
    "chunk_index": 32,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "options positions prior to the announcement rather than closing existing short positions.12 In our Internet Appendix, we show the relation between EAV and retail demand is specific to earnings announcements and is not present in non-announcement periods, suggesting EAV does not reflect a static firm characteristic that consistently draws retail attention. Panel C of Figure 5 plots coefficients similar to column (5) of Panel A in Table 2 for each year in our sample window, where each regression coefficient is scaled by the average absolute pre-announcement retail position change in each year.13 The annual coefficients show that retail investor demands have become increasingly sensitive to variation in EAV. Retail investor sensitivity to EAV peaks in recent years coinciding with the COVID-19 pandemic and the secular rise in retail participation in options. To verify that these results are not mechanically driven by the impact of retail demand on prices, columns (2) and (4) of Table 2 incorporate an additional proxy for EAV: the largest absolutereturnatanEAinpast5years, whichwerefertoasMAX . Thisproxyisfounded EA upon the notion that traders and the media may base their expectations of the significance of the announcement on the price movements surrounding past EAs – and hence price behavior around past announcements drives attention at future announcement dates. We compute the maximum EA return to capture anticipated volatility (as opposed to, e.g., historical volatility around EAs) following Bali et al. (2011), who examine an analogous metric in the equity market (the maximum stock return in the past month) and provide empirical support for the notion that investor beliefs about future returns are strongly influenced by the extremes, as opposed to the average, of past outcomes. 12OurInternetAppendixshowstherelationbetweenEAVandretailinvestors’optionbuyingoccursonthe theintensivemargin,whereretailshiftstheiroptionspositionsawayfromlowertohighEAVannouncements. This suggests retail investors do not appear offset their positions in high EAV announcements by holding diversifying positions in other options. 13This scaling is done to address the fact that retail trading volume has increased over time. The upward trend in the plot is robust to various scaling choices. 17 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 65,
    "chunk_index": 33,
    "word_count": 331,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "not appear offset their positions in high EAV announcements by holding diversifying positions in other options. 13This scaling is done to address the fact that retail trading volume has increased over time. The upward trend in the plot is robust to various scaling choices. 17 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 65,
    "chunk_index": 34,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "WenextturntostudyingthemechanismthatdrivesthestrongrelationbetweenEAVand retail option demand. In this section, we provide evidence supporting the role of attention- based theories in explaining this pattern in retail option demand. Prior research emphasizes the role of media coverage in capturing retail investors’ atten- tion and subsequently affecting their trading decisions (e.g., Barber and Odean 2008; Da, Engelberg, and Gao 2011; Barber et al. 2021). Motivated by this evidence, Panel A of Ta- ble 3 examines the relation between EAV and media coverage. We capture news coverage using the number of news articles published in the WSJ, Washington Post, USA Today, and New York Times, as in Niessner and So (2018). The results show that both of our proxies for EAV are associated with higher news coverage pre-announcement, in addition to coverage during and after the earnings announcement. Specifically, a one standard deviation increase in EAV coincides with an increase in the number of news articles published by 22% during t 5, 2 , 20% during t 1,1 , and 16% during t 2,5 . This finding is consistent with ∈ [− − ] ∈ [ ] ∈ [ ] priorevidencethatannouncementswithnovelinformationattractmoremediacoverage(e.g., Noh et al. 2021). The heightened news coverage prior to high EAV announcements documented in Panel A likely increases their salience in the minds of retail investors. Theories of rational (Sims 2003; Gabaix 2014) and behavioral attention allocation (Bordalo, Gennaioli, and Shleifer 2012) predict that this should, in turn, increase retail investors’ propensity to trade around these announcements. InPanelBofTable3, weshowthisincreasedmediacoverageindeedplaysacrucialrolein shaping the relation between EAV and the trading behavior of retail investors. The results in columns (1) and (2) show the relation between EAV and retail investor demand increases by a factor of around four for a one-standard deviation increase in news coverage. Columns (3) and (4) further emphasize this: the amount of buying in top quintile high EAV announce- ments is an order of magnitude larger in the subsample of announcements with positive 18 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "3.2 The Role of Retail Investor Attention",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 65,
    "chunk_index": 35,
    "word_count": 325,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 The Role of Retail Investor Attention (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "a factor of around four for a one-standard deviation increase in news coverage. Columns (3) and (4) further emphasize this: the amount of buying in top quintile high EAV announce- ments is an order of magnitude larger in the subsample of announcements with positive 18 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "3.2 The Role of Retail Investor Attention",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 65,
    "chunk_index": 36,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 The Role of Retail Investor Attention (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "pre-announcement media coverage. Collectively, these findings suggest that retail investor attention, spurred through media coverage, contributes strongly to their pre-announcement option demand. These findings complement a substantial literature that highlights retail investors respond to the realization of attention-grabbing news, by highlighting that retail buying is also driven by the anticipation of attention-grabbing news. 3.3 Alternative Mechanisms for the Link between EAV and Retail Demand Our results thus far support an attention-based explanation for the relation between EAV and retail investor option demands. In this section, we consider two alternative classes of explanations: (i) preference-based explanations, in which retail investors prefer trading options around higher EAV announcements because they find the payoff profile attractive, and (ii) a rational use of options to hedge against or to speculate on information regarding the volatility of future returns. We begin by considering the first category: preference-based explanations. Two popular theories of investor preferences in behavioral finance are prospect theory (Barberis, Huang, and Santos 2005) and theories of motivated reasoning (Brunnermeier and Parker 2005), both of which generate a preference for positively-skewed (i.e, lottery-like) payoffs. These theories are supported by empirical evidence showing that retail investors exhibit this preference in equity markets (see e.g., Han and Kumar (2013)). Given option return skewness might conceivably rise prior to high EAV announcements, this mechanism could in principle also explain our results. Several facts suggest that our results are not fully explained by a preference for skew- ness. First, Boyer and Vorkink (2014) demonstrate that option return skewness strongly declines in implied volatility for OTM options and is close to constant in implied volatility for ITM options (see their Figure 2), suggesting option skewness is lower around high EAV announcements. Secondly, Panel A of Table 4 shows pre-announcement option purchases by retail investors concentrate in at-the-money call options. Finally, Panel B shows that retail 19 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "3.2 The Role of Retail Investor Attention",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 65,
    "chunk_index": 37,
    "word_count": 312,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 The Role of Retail Investor Attention (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "constant in implied volatility for ITM options (see their Figure 2), suggesting option skewness is lower around high EAV announcements. Secondly, Panel A of Table 4 shows pre-announcement option purchases by retail investors concentrate in at-the-money call options. Finally, Panel B shows that retail 19 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "3.2 The Role of Retail Investor Attention",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 65,
    "chunk_index": 38,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 The Role of Retail Investor Attention (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "demand is roughly evenly distributed across options with less than one month and more than two months to maturity. Because at-the-money and relatively long-dated options have the largest volatility exposure but significantly less exposure to skewness, these results suggest our findings are not likely to be driven by a preference for lottery-like payoffs. An alternative preference-based explanation for why EAV is positively related to retail option demand is that retail investors exhibit a preference for volatility. In models of realiza- tion utility, this preference arises because the ability to immediately realize gains and delay losses generates option-like payoffs to investing in an asset, resulting in a value function that increases in the volatility of the underlying asset (Barberis and Xiong 2012; Ingersoll and Jin 2013). A testable implication of this theory is that retail investors should buy more longer-dated options, as they allow for longer delaying of losses. We find some evidence of retail investors buying longer-dated options in Panel B of Table 4. Although this explanation alone cannot explain the importance of news documented in the prior section, we view our findings as providing evidence consistent with theories of realization utility, though a specific focus on the role played by realization utility is beyond the scope of the paper. Movingtothesecondcategoryofalternativeexplanations,inrationalmodelsoftradethat feature derivatives, these derivatives can be used either (i) to hedge the risk exposure, such as variance risk or directional stock exposure that results from positions in the underlying stock, and (ii) to speculate on private information regarding the future return variance (e.g. Leland 1980; Buraschi and Jiltsov 2006; Smith 2019). We next provide evidence that these motives are unlikely to explain the link between EAV and retail option demand. The reason that purchasing options is useful for hedging in these models is that they protect investors’ equity positions against extreme moves in the stock price. Put options hedge the tail risk associated with long positions, while call options hedge the tail risk associated with short positions in the underlying stock. Thus, given retail investors are more likelyto be longrather thanshortthe stockdue toshort-sale constraints, ifthey usedoptions for hedging, we would expect them to purchase put options. However, Panel A in Table 4 20 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "3.2 The Role of Retail Investor Attention",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 65,
    "chunk_index": 39,
    "word_count": 369,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 The Role of Retail Investor Attention (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "options hedge the tail risk associated with short positions in the underlying stock. Thus, given retail investors are more likelyto be longrather thanshortthe stockdue toshort-sale constraints, ifthey usedoptions for hedging, we would expect them to purchase put options. However, Panel A in Table 4 20 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "3.2 The Role of Retail Investor Attention",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 65,
    "chunk_index": 40,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 The Role of Retail Investor Attention (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "shows that the link between EAV and retail demand concentrates in call options rather than put options. A second piece of evidence that casts doubt on retail investors using options to hedge is Panel C of Table 4, which shows that EAV is negatively associated with the holdings of other groups of traders as these traders absorb the spike in retail demand. The fact that the positive relation between EAV and clienteles’ net positions is absent for professional customers,firms,andbroker-dealerssuggestsretailinvestorsarecontrarianandhavedifferent motivations to trade than other clientele groups. In contrast, if retail investors were using optionstohedge,wewouldexpectsimilartradingbehavioramongalternativeclientelegroups (e.g. professional customers), who likely have correlated prices of risk. Although retail investors do not appear to be using options to hedge prior to high EAV announcements, they could be rationally using them to speculate based on private informa- tion. Indeed, past evidence lends some credibility to the notion that retail purchases may reflect rational trade on private information regarding volatility in options. For example, Ni et al. (2008) show that total option demand by non-market-makers (which includes retail investors) predicts future stock return volatility, which they attribute to informed volatil- ity trading. Additionally, Kaniel et al. (2012) shows that retail trade in the stock market appears to be informed prior to earnings announcements. However, for this to explain why retail traders systematically purchase options prior to high EAV announcements, these op- tions would have to be, on average, under-priced by market makers, and retail traders would have to recognize this. At face value, this appears unlikely given the relative sophistication of these two investor groups. Moreover, in later tests, we provide evidence that this is unlikely the case, as options earn significantly negative returns following high EAV announcements. 3.4 EAV and Retail Trade in Options Relative to Stocks We next illustrate that, as EAV rises, retail’s activity in the option market prior to earn- ings announcements grows not only on an absolute basis, but also relative to their activity 21 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "3.2 The Role of Retail Investor Attention",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 65,
    "chunk_index": 41,
    "word_count": 330,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 The Role of Retail Investor Attention (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "high EAV announcements. 3.4 EAV and Retail Trade in Options Relative to Stocks We next illustrate that, as EAV rises, retail’s activity in the option market prior to earn- ings announcements grows not only on an absolute basis, but also relative to their activity 21 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "3.2 The Role of Retail Investor Attention",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 65,
    "chunk_index": 42,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 The Role of Retail Investor Attention (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "in the stock market. To demonstrate this, we again apply the measures of relative trade in stock versions options, Unsigned OS Ratio and OS Call Buy Ratio , that we defined in (3) it it and (4). In Table 5, we regress these measures onto our metrics of EAV. Across both of our measures of EAV, we find that retail’s overall activity and purchasing activity increase in the option relative to the stock market. This shift in retail trade from the stock to the option market further distinguishes our results from the existing literature showing attention-grabbing events induce retail traders to purchase stocks (e.g., Barber and Odean 2008). While this literature links historical volatility to retail stock purchases, the evidence in Table 5 suggests that the anticipation of future volatility drives these traders to take option positions. Among the explanations we consider for retails’ option purchasing, this evidence is most consistent with retail traders exhibiting a preference for volatility. The reason is that the embedded leverage in options greatly amplifies the volatility exposure they provide relative to stocks. Furthermore, while attention can explain why retail would purchase securities in both the stock and option markets prior to high EAV announcements, it cannot explain why retail traders would take larger positions in options. 3.5 Pre-Announcement Retail Price Pressure Existing evidence on retail trading in equity markets has found retail investors can be contrarian, trading in opposite directions as other traders (e.g., Kaniel et al. 2012). Our evidence in the prior section suggests a similar pattern holds in option markets. However, this literature in equity markets also emphasizes that retail traders earn a premium from supplying liquidity, which in turn enhances market stability (e.g., Barrot et al. 2016). In this section, we provide evidence suggesting this latter result does not extend to options market (as in Foucault et al. 2011). To provide evidence that retail investors demand, rather than supply, liquidity prior to high EAV announcements, we next study their impact on option prices. We base our 22 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "3.2 The Role of Retail Investor Attention",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 65,
    "chunk_index": 43,
    "word_count": 341,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 The Role of Retail Investor Attention (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "evidence suggesting this latter result does not extend to options market (as in Foucault et al. 2011). To provide evidence that retail investors demand, rather than supply, liquidity prior to high EAV announcements, we next study their impact on option prices. We base our 22 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "3.2 The Role of Retail Investor Attention",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 65,
    "chunk_index": 44,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 The Role of Retail Investor Attention (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "predictions on the demand-based option pricing theory from Garleanu et al. (2009). In the presence of market incompleteness that prevents perfect replication of options using the underlying stock, this theory predicts demand from end-users (i.e. retail investors in our setting) that must be fulfilled by market makers will directly impact option prices. According to this theory, the size of end-users’ price impact increases with the difficulty marketmakersfaceinhedgingtheoption. Asaresult, thistheorypredictsthatretailtraders’ purchases should have potent price impact leading up to earnings announcements. Retail investors form their option positions primarily by trading with market makers, which causes marketmakerstoalsoholdconcentratedpositionsandthusbearinventoryrisksthroughhigh EAV earnings announcements. Moreover, these announcements lead to discrete changes in the underlying stock prices (Lee and Mykland 2008). These jumps make it impossible for marketmakerstofullyhedgetheiroptionexposureusingtheunderlyingstock,forcingmarket makers to take on heightened risk when holding options through these announcements. To assess retail’s impact on option prices pre-announcement, we examine the relation between retail buying during t 5, 2 and AbnormalIV , controlling for AbnormalIV . ∈[− − ] −1 −5 The logic of this approach is as follows. Recall AbnormalIV captures the expected abnor- −5 mal return variance on the announcement date calculated using option prices 5 days before the announcement, i.e., prior to when retail traders tend to enter the market. Absent de- mandeffects, AbnormalIV would, onaverage, remainconstantfromday 5today 2, asthe t − − amount of volatility expected on the announcement date should not systematically change over time. Thus, an on-average change in AbnormalIV over these days should capture the t price impact of investor demand.14 Formally, this approach relies on the following identify- ing assumption: shocks to retail demand during t 5, 2 that are independent of option ∈ [− − ] 14Note this approach has two advantages relative to examining, e.g., option returns. First, it places optionsacrossannouncements,whichvaryinmoneynessandmaturities,incommonunits–impliedvariances – rendering their price changes comparable. Second, since AbnormalIV is calculated as the (weighted) t difference in the implied variances of short- and long-term options, it essentially controls for changes in the prices of long-term options. This helps to isolate retail price impact from any news regarding post- announcement diffusive volatility that arrives during days [−5,−2], since such news will affect the implied variances of both short- and long-term options. 23 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "3.2 The Role of Retail Investor Attention",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 65,
    "chunk_index": 45,
    "word_count": 370,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 The Role of Retail Investor Attention (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "essentially controls for changes in the prices of long-term options. This helps to isolate retail price impact from any news regarding post- announcement diffusive volatility that arrives during days [−5,−2], since such news will affect the implied variances of both short- and long-term options. 23 Electronic copy available at: https://ssrn.com/abstract=4050165 prices are orthogonal to price-independent demand shocks of other investors. We view this as a reasonable assumption given that retail investors demands are primarily absorbed by market makers, who are mostly passive providers of liquidity (as in the model of Garleanu et al. 2009). OurresultsinTable6suggestretaildemandindeedhasalargeimpactonoptionprices, as it is positively associated with AbnormalIV controlling for AbnormalIV . Economically, −1 −5 ourestimatesimplythatoptionpricesarearound40%higherintermsofimpliedvariancesat t 1 for an announcement with top-quintile retail buying relative to another announcement =− with no retail buying but identical EAV (measured using AbnormalIV ). As a result, −5 it appears that equilibrium prices adjust in response to the demand pressure from retail investors in order to compensate market makers for holding these positions through high EAV announcements. 4 Three Factors that Influence Retail Investment Performance Overthenexttwosectionsofourpaper, weconducttwosetsofteststhatjointlyillustrate howretail’sproclivitytowardspurchasingoptionspriortohighEAVannouncementsdepletes their wealth. In Section 4, we provide evidence on three factors contributing to the dynamics of retail investor performance around earnings announcements. In Section 5, we take an aggregate approach that tracks retail positions in event-time to directly quantify how these factors combine to impact retail wealth. 4.1 EAV and Post-Announcement Option Returns OurresultsinTable6suggestretailtradersmaybereducingpriceefficiencywhentrading prior to announcements by inflating prices. However, past evidence shows that retail traders earn positive trading profits in equity markets around earnings announcements (e.g., Kaniel et al. 2012; Kelley and Tetlock 2013). Thus, it is conceivable that retail traders are drawn to buy options prior to high EAV announcements not only because they draw their attention, 24 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "3.2 The Role of Retail Investor Attention",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 65,
    "chunk_index": 46,
    "word_count": 295,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 The Role of Retail Investor Attention (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "traders earn positive trading profits in equity markets around earnings announcements (e.g., Kaniel et al. 2012; Kelley and Tetlock 2013). Thus, it is conceivable that retail traders are drawn to buy options prior to high EAV announcements not only because they draw their attention, 24 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "3.2 The Role of Retail Investor Attention",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 65,
    "chunk_index": 47,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 The Role of Retail Investor Attention (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "but also because they recognize such options are systematically underpriced. In this case, their price impact would bring the implied variance closer to the actual level of this variance, raising price efficiency. If this were the case, we would expect to see that options earn non- negative returns following high EAV announcements. Alternatively, retail traders may purchase options prior to high EAV announcements for behavioral reasons, such as the attention-based explanation for which we provide support in Section 3.2. In this case, we would expect to see that options earn negative returns following high EAV announcements, for two non-exclusive reasons. First, if retail traders do not have private information on future volatility, the price pressure they create prior to these announcements will gradually reverse after they establish their positions, generating negative returns. The reason is that after the announcements, both the quantity of options held by market makers declines as retail investors close their positions and the quantity of risk per option declines due to the resolution of uncertainty. Jointly, these patterns imply the total unhedgeable risk faced by market makers decreases post-announcement, which (in the model of Garleanu et al. 2009) implies a correction in option prices. The second reason options could earn negative returns in the event that retail investors do not have private information is that the market may have incorrect expectations with respect to the magnitude of the price moves certain announcements will create. In this case, when sorting announcements on EAV, short-term options in the upper quintiles are more likely to be those where the market has overshot the true announcement volatility. Hence, these options will have negative expected returns. The evidence in Goyal and Saretto (2009) that the implied volatility premium negatively forecasts option returns provides support for this possibility. To provide insight into the impact that retail option trade has on price efficiency and to motivate our subsequent analysis of how this trade impacts retail’s wealth, we next examine the relation between EAV and post-announcement option returns. To be precise, we examine the predictive power of two measures: (i) AbnormalIV , which captures EAV alone, and (ii) −5 25 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "3.2 The Role of Retail Investor Attention",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 65,
    "chunk_index": 48,
    "word_count": 361,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 The Role of Retail Investor Attention (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "to motivate our subsequent analysis of how this trade impacts retail’s wealth, we next examine the relation between EAV and post-announcement option returns. To be precise, we examine the predictive power of two measures: (i) AbnormalIV , which captures EAV alone, and (ii) −5 25 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "3.2 The Role of Retail Investor Attention",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 65,
    "chunk_index": 49,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 The Role of Retail Investor Attention (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "AbnormalIV , which captures the combination of EAV and the price pressure that retail −1 traders create: AbnormalIV AbnormalIV AbnormalIV AbnormalIV . −1 = −5+ −1− −5 ·„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„‚„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„¶ ·„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„‚„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„„¶ EAV retailpricepressure For each announcement, we select one straddle by choosing a call and put pair of the same strike and maturity. We choose the closest-to-the-money pair, defined based on the ratio of the forward to strike price, among all pairs that expire most closely after 13 days past the earnings announcement. We select 13 days in order to study returns over the two weeks following the announcement date and add an additional 3 days to mitigate concerns about microstructure effects near expiration (Carr and Wu 2009). We then compute the returns to selling a straddle at time t as Call Price Put Price Call Price Put Price SRET 1 t+ t− t−1− t−1 , (6) t =− ∗[ ] Call Price Put Price t−1+ t−1 where Call Price and Put Price correspond to midpoints of the best bid and ask exchange t t quotes at market close on day t from OptionMetrics.15 By looking at straddles, we isolate the pricing of volatility from any directional pricing effects in the underlying (e.g., Coval and Shumway 2001).16 Additionally, we complement this approach by examining returns on the specific options in which retail transacts in Section 5. Panels A and B of Table 7 show results from quarterly portfolio sorts on AbnormalIV , −1 using lagged quarterly breakpoints. We find straddles for high EAV announcements under- perform straddles for low EAV announcements by a whopping average return of 11% per announcement (t-stat = 19.44) on the announcement day and an additional 9% (t-stat = 15On days where quotes are missing in OptionMetrics, we assume the option price is unchanged. Duarte, Jones, and Wang (2019) highlight big microstructure biases in option prices, resulting in errors in returns to option strategies of 50bps per day. However, the biases they find are almost non-existent for ATM straddles (thefocusofourreturnpredictabilitytests),whiletheyaremuchlargerforOTMunhedgedoptionstrategies. 16Although retail demand prior to high EAV announcements is concentrated in calls, the model from Garleanu et al. (2009) implies demand for calls impacts both the prices of both calls and puts (and thus straddles) because put-call parity holds. 26 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "3.2 The Role of Retail Investor Attention",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 65,
    "chunk_index": 50,
    "word_count": 377,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 The Role of Retail Investor Attention (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "non-existent for ATM straddles (thefocusofourreturnpredictabilitytests),whiletheyaremuchlargerforOTMunhedgedoptionstrategies. 16Although retail demand prior to high EAV announcements is concentrated in calls, the model from Garleanu et al. (2009) implies demand for calls impacts both the prices of both calls and puts (and thus straddles) because put-call parity holds. 26 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "3.2 The Role of Retail Investor Attention",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 65,
    "chunk_index": 51,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 The Role of Retail Investor Attention (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "8.31) over the 10 days after the announcement, with little skewness or kurtosis. This sub- stantial negative return on the announcement and the continuation post-announcement (i.e., the absence of a reversal) indicates that retail traders do not appear to have private infor- mation when purchasing options ahead of high EAV announcements. Instead, it suggests retail investors purchase options that are overpriced relative to realized volatility.17 In Panel C, we perform quarterly Fama-MacBeth regressions. To assess whether the post announcement returns in Panels A and B simply represent overpricing in high EAV an- nouncements or are driven in part by retail demand pressure, we compare the return predic- tive power of AbnormalIV and AbnormalIV . Columns (3) and (7) show AbnormalIV −5 −1 −5 is a strong predictor of announcement-day and post-announcement straddle returns, after controlling for other important option return predictors. However, columns (4) and (8) show AbnormalIV is a significantly more potent predictor of returns, as it absorbs the −1 predictive power of AbnormalIV . Since the primary difference between these measures is −5 that AbnormalIV more accurately accounts for retail demand pressure, these results retail −1 demand pressure has a non-trivial influence on option prices. Notably, the regressions in Panel C include several controls based on prior work on that explores the predictability of option returns. First, this work suggests that option returns may capture a premium for systematic variance risk (Leland 1980; Barth and So 2014; Smith 2019). We thus continue to control for the proxies for this risk on the earnings date that we applied in the previous section. Second, we again control for the measure of the lotteryness of an option’s payoff from Boyer and Vorkink (2014), calculated for the straddles under consideration. Looking across the columns in Panel A, we see that adding controls strengthens the relation between EAV and straddle returns, further highlighting how a preference for skewness or hedging demand cannot entirely explain our results and thus should be seen as complementary drivers of option prices.18 17InourInternetAppendix,weshowthisreturnpredictabilityisnotpresentaroundpseudo-announcements and generalizes to all earnings announcements in OptionMetrics outside of those in our Nasdaq sample. 18In our Internet Appendix, we show our return predictability is independent of option liquidity and is complementary to that documented by Boyer and Vorkink (2014). 27 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "3.2 The Role of Retail Investor Attention",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 65,
    "chunk_index": 52,
    "word_count": 381,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 The Role of Retail Investor Attention (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "of option prices.18 17InourInternetAppendix,weshowthisreturnpredictabilityisnotpresentaroundpseudo-announcements and generalizes to all earnings announcements in OptionMetrics outside of those in our Nasdaq sample. 18In our Internet Appendix, we show our return predictability is independent of option liquidity and is complementary to that documented by Boyer and Vorkink (2014). 27 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "3.2 The Role of Retail Investor Attention",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 65,
    "chunk_index": 53,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 The Role of Retail Investor Attention (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "A second factor that impacts retail investor performance is the large bid-ask spreads they incur when opening their positions. This result is driven by the fact that single-name equity options in general have high bid-ask spreads (Muravyev and Pearson 2020), but also because these spreads are abnormally large prior to high EAV announcements. To illustrate this result, we approximate the bid-ask spread retail investors incur when buying options between t 5 and t 2, as in Table 2. Throughout, we make conservative =− =− assumptions about these transaction costs to ensure we have a lower bound on their impor- tance. In particular, we assume such an investor holds the option to maturity, implying the investor only incurs half of the bid-ask spread (the “half-spread”). Let Half-Spread denote iqot the half-spread (in % of midpoint) from OptionMetrics for an option o written on firm i on event-day t relative to the earnings announcement in quarter q. We compute our estimate of the half-spread incurred by retail investors by buying options before firm i’s announcement in quarter q as the following weighted average: −2 Half-Spread Incurred by Retail ω1 ω2 Half-Spread , (7) iq =∑ iqo ∑ iqot iqot o t=−5 where the outer summation occurs over all available options o in our sample and the weights (which both sum to one) in the summation are: Retail Position ∆Retail Position ω1 ∣ iqo−1∣ , ω2 ∣ iqot∣ . iqo = ∑o∣ Retail Position iqo−1∣ iqot = ∑ − t= 2 5∣ ∆Retail Position iqot∣ Our calculation of the half-spread incurred by retail investors in (7) captures the fact that the bid-ask spreads incurred by retail investors depend both on the particular options they buy and the day on which they buy them. By weighting the half-spread on a particular option based on the amount retail trades on a given day, ω1 , our calculation gives greater iqot weight to days on which retail investors trade more. The weights when summing across 28 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "4.2 Pre-Announcement Transaction Costs",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 65,
    "chunk_index": 54,
    "word_count": 335,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.2 Pre-Announcement Transaction Costs (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "on which they buy them. By weighting the half-spread on a particular option based on the amount retail trades on a given day, ω1 , our calculation gives greater iqot weight to days on which retail investors trade more. The weights when summing across 28 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "4.2 Pre-Announcement Transaction Costs",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 65,
    "chunk_index": 55,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.2 Pre-Announcement Transaction Costs (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "options, ω2 , give larger weight to options in which retail has more exposure. iqo Figure 6 illustrates the spreads that retail face and how these spreads vary with EAV, measured using AbnormalIV . Panel A shows retail investors pay a large amount of trans- −1 action costs in dollars prior to all announcements, but that these costs are close to 50% greater prior to high than low EAV announcements. In Panel B, we examine the transaction costs incurred by retail investors in percentage of the midpoint. This panel demonstrates that the typical percentage half spreads that retail traders incur are on the order of 8%. Collectively, both panels demonstrate that spreads prior to announcements increase with top-quintile EAV to roughly 9%, which compounds the losses retail investors face. 4.3 Holding onto Positions Post-Announcement The third factor we document that influences the loss of wealth by retail investors around highEAVannouncementsistheirtendencytoholdontotheoptionpositionstheyopenprior tohighEAVannouncements. InTable8, weexaminetheextenttowhichpost-announcement retail positions one week after the announcement are predictable using our measures of EAV. Columns (1) and (4) in Panel A show that retail traders continue to hold on to the positions one week after the announcement, on t 5, that they opened prior to high EAV = announcements. Given the evidence in Table 7 that options continue to earn large negative expected returns over the two weeks following high EAV announcements, this behavior is likely to further deplete retail investors’ wealth. A natural explanation for this finding is that retail investors hold on to options to hedge against large stock prices moves that might follow high AbnormalIV announcements. This −1 explanation is unlikely valid for two reasons. First, in Figure 7, we plot the average event- time idiosyncraticvolatilityin top andbottomquintiles ofEAVin Panel Aand thedifference between the two in Panel B. Figure 7 shows there is no meaningful difference in idiosyncratic volatility between high and low EAV announcements aside from on the announcement day. This finding suggests it is unlikely that retail investors continue to hold their positions to 29 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "4.2 Pre-Announcement Transaction Costs",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 65,
    "chunk_index": 56,
    "word_count": 338,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.2 Pre-Announcement Transaction Costs (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "between the two in Panel B. Figure 7 shows there is no meaningful difference in idiosyncratic volatility between high and low EAV announcements aside from on the announcement day. This finding suggests it is unlikely that retail investors continue to hold their positions to 29 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "4.2 Pre-Announcement Transaction Costs",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 65,
    "chunk_index": 57,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.2 Pre-Announcement Transaction Costs (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "hedge, as the quantity of this risk does not appear to differ across low and high EAV an- nouncements. Secondly, Panel B of Table 8 shows other traders behave differently from retail investors post-announcement. A notable finding is the reduction in positions from firms, who also buy options pre-announcement (Figure 5). This suggests that hedging motives, such as a desire to hedge the incorporation of earnings news post-announcement, are unlikely to drive the sustained post-announcement demand of retail investors. An alternative explanation for this finding is that it reflects portfolio inertia, similar to that documented in retail investors’ equity portfolio choices (e.g., Calvet, Campbell, and Sodini 2009; Choukhmane and de Silva 2022). However, this explanation is unlikely in our setting given retail investors appear to intentionally open these options prior to earnings with the goal of being exposed to the earnings price move. Additionally, the large negative average return to being long volatility as documented in Table 7 is difficult to reconcile with reasonably-sized portfolio adjustment costs. We hypothesize two remaining forces that could drive retail investors’ persistent option holdings. First, retail traders may hold option positions to maturity in order to avoid the transaction costs (i.e., bid-ask spread) associated with closing out these positions. Second, given the negative returns to straddles around high EAV announcements documented in the previous section, retail traders lose on average around these announcements. In the presence of such losses, retail investors may fail to sell due to a disposition effect, which could occur due to convexity of investors’ value functions in the loss domain (Kahneman and Tversky 1979; Barber and Odean 2008) or the negative realization utility from selling (Barberis and Xiong 2012; Ingersoll and Jin 2013). In the remaining columns of Table 8 Panel A, we empirically explore these two potential explanations. Beginning with the disposition effect, we examine how retail traders’ P&L on the announcement date influences their proclivity to hold onto their option positions. We adoptananalogousapproachtoGenesoveandMayer(2001)andexamineretailtraders’losses at t 0, defined as max 0, Retail P&L where Retail P&L is calculated by aggregating = ( − 0) 0 30 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "4.2 Pre-Announcement Transaction Costs",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 65,
    "chunk_index": 58,
    "word_count": 352,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.2 Pre-Announcement Transaction Costs (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "disposition effect, we examine how retail traders’ P&L on the announcement date influences their proclivity to hold onto their option positions. We adoptananalogousapproachtoGenesoveandMayer(2001)andexamineretailtraders’losses at t 0, defined as max 0, Retail P&L where Retail P&L is calculated by aggregating = ( − 0) 0 30 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "4.2 Pre-Announcement Transaction Costs",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 65,
    "chunk_index": 59,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.2 Pre-Announcement Transaction Costs (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "the product of Retail’s position in each option at t 1 multiplied by the change in each = − option price from t 1 to t 0. To test for the disposition effect, we focus on the interaction =− = between max 0, Retail P&L and our metrics of EAV. This interaction captures whether ( − 0) retail investors are more likely to continue holding option positions following high EAV announcements when these announcements subject them to large losses. Consistent with the disposition effect driving retail traders’ proclivity to maintain their option positions, we find that they hold on to a greater proportion of their options around high EAV announcements when they experience losses on the announcement date. Quanti- tatively, columns (2) and (5) of Panel A show that a one standard deviation increase in the losses experienced by retail investors doubles the relation between EAV and retail investors’ post-announcement positions. Columns (3) and (6) show retail investors appear to respond to transaction costs, but notably this response is about one-fifth as large as their response to prior losses. In sum, these results suggest the post-announcement trading behavior of retail investors appears to be primarily influenced by a disposition effect, even after controlling for the effect of transaction costs, consistent with behavioral motives driving their trading decisions. 5 Tracking Wealth Dynamics around Earnings Announcements Our final tests take an aggregated approach that leverages the granularity of our data to more directly track wealth dynamics in event-time relative to earnings announcements. As a complement to our straddle return tests, these tests provide a more precise picture of the wealth dynamics of retail investors after accounting for their concentrated positions in options ahead of high EAV announcements as well as conservative assumptions about the transaction costs they incur. 31 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "4.2 Pre-Announcement Transaction Costs",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 65,
    "chunk_index": 60,
    "word_count": 302,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.2 Pre-Announcement Transaction Costs (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "complement to our straddle return tests, these tests provide a more precise picture of the wealth dynamics of retail investors after accounting for their concentrated positions in options ahead of high EAV announcements as well as conservative assumptions about the transaction costs they incur. 31 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "4.2 Pre-Announcement Transaction Costs",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 65,
    "chunk_index": 61,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.2 Pre-Announcement Transaction Costs (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "In Appendix B, we show that the P&L of each trader on day, t, summed across options, i, can be approximated as follows: Trader P&L Trader Position Option Price Option Price . (8) t ≈∑ it−1∗( it− it−1) i Calculating the P&L of each clientele group using (8) requires three key assumptions. First, it requires that we observe all of the options positions of each trader. Since this assumption clearly fails as traders trade options on other exchanges than Nasdaq, we choose to scale the P&L of each trader by the average dollar trading volume on Nasdaq one month before the announcement. By estimating P&L as a multiple of observed trading volume, we hope to take into account variation in Nasdaq sample coverage that would pollute an unnormalized measure in dollars. Second, when implementing (8) empirically, we use the last traded price of each option from Nasdaq. Thus, we make the assumption that all traders rebalance at market close, as we do not observe intra-day trading in our data.19 The final simplifying assumption needed for (8) is that there are no bid-ask spreads. By ignoring bid-ask spreads in this initial calculation, (8) under-estimates the P&L to mar- ket makers and over-estimates of the P&L to other traders. In Section 5.3, we relax this assumption and consider varying levels of transaction costs. 5.2 Trader Profitability across Announcements In Panel A of Figure 8, we plot the average P&L of each clientele group between market close on t 1 and market close at t 10, the same time period over which we examine = − = straddle returns, across five quintiles of our measure of EAV, AbnormalIV . The results −1 show retail investors’ P&L decreases monotonically across the quintiles of EAV, with re- tail investors losing a statistically significant amount in the highest EAV announcements. 19InourInternetAppendix,weshowourmainresultinFigure8PanelAisrobusttousingopeningprices or the average of daily low and high prices, instead of closing prices. 32 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "5.1 Approximating Trader Profit and Loss",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 65,
    "chunk_index": 62,
    "word_count": 324,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.1 Approximating Trader Profit and Loss (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "AbnormalIV . The results −1 show retail investors’ P&L decreases monotonically across the quintiles of EAV, with re- tail investors losing a statistically significant amount in the highest EAV announcements. 19InourInternetAppendix,weshowourmainresultinFigure8PanelAisrobusttousingopeningprices or the average of daily low and high prices, instead of closing prices. 32 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "5.1 Approximating Trader Profit and Loss",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 65,
    "chunk_index": 63,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.1 Approximating Trader Profit and Loss (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "Quantitatively,retaillosesonaveragearound5%ofnon-EAdollartradingvolumeonthetyp- ical earnings announcement, yet around 50% for a top-quintile EAV announcement. Given the average non-EA dollar volume in our sample is $134K, this implies an on average loss of approximately $6K per announcement and approximately $60K per top quintile EAV announcement. Aggregating across approximately 6,000 high EAV announcements in our sample, the latter estimate implies a total $360M wealth transfer in our sample. Under the assumption that a similar wealth transfer occurs across all traded options, our sample’s 25% coverage of total option activity implies a $1.5 billion wealth transfer away from retail ∼ investors in options markets over our sample period before accounting for spreads. Panel A also shows the majority of capital flows away from retail investors goes to market makers, as transfers to the remaining clientele appear indistinguishable from zero. Given this calculation ignores bid-ask spreads, we expect the actual wealth transfer to be considerably larger, as market makers receive the spread as additional compensation. In our Internet Appendix, we replicate the same analysis around pseudo-earnings announcements and find these wealth transfers we document appear specific to earnings announcements. We next estimate the investment returns of retail investors by calculating three variables. First, we calculate daily returns of retail’s long positions by calculating their P&L according to(8)summingonlyacrosslongpositions. Wethendividethisbythenetlongdollarexposure of retail to measure long option returns, Retail Avg. ReturnLong. Second, we calculate the t daily returns of retail’s short positions analogously, denoted by Retail Avg. ReturnShort. Fi- t nally, wecalculateaweightedaverageofthetwobasedonthedollarexposureofretailonlong and short positions for each announcement at t 1, denoted by Retail Avg. ReturnWeighted. =− t Table 9 estimates how much lower these returns are for top-quintile EAV announcements. The first two columns show that retail investors lose an average of 250 basis points (bps) per day on their long positions over the announcement day and 10 days following the announce- ment, while they lose around 55-70bps more on high EAV announcements. In contrast, retail investors make on average 180bps on their short positions over the same time period, but 33 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "5.1 Approximating Trader Profit and Loss",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 65,
    "chunk_index": 64,
    "word_count": 339,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.1 Approximating Trader Profit and Loss (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "day on their long positions over the announcement day and 10 days following the announce- ment, while they lose around 55-70bps more on high EAV announcements. In contrast, retail investors make on average 180bps on their short positions over the same time period, but 33 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "5.1 Approximating Trader Profit and Loss",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 65,
    "chunk_index": 65,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.1 Approximating Trader Profit and Loss (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "gain around 40bps more on their short positions around high EAV announcements. Columns (5) and (6) of Table 9 examine how retail investors’ weighted return varies across announcements. We find retail investors earn a small average return of around 6bps (not accounting for transaction costs) around lower EAV announcements. However, around high EAV announcements, we estimate that retail investors lose roughly 60bps per day over the 11 days beginning with the announcement date. Cumulating these returns over these 11 days results in our final estimate that retail investors lose around 7% on average of their options investments around high EAV earnings announcements. These losses are an order of magnitude larger than the losses that Bauer et al. (2009) show retail investors in the Netherlands incur trading options on the typical day, which amount to 181 basis points per month. This is consistent with retail investors buying options that are exceptionally overpriced around high EAV announcements. 5.3 Incorporating Transaction Costs We next quantify how the large spreads incurred by retail, as documented in Section 4.2, influence their returns and the amount of wealth they yield to market makers. Figure 8 Panel B shows how the variation in Retail P&L across quintiles of EAV varies after we take into account transaction costs. We convert our estimate of the half-spread in (7) into dollars by multiplying by Retail Position and then subtract it from our estimate of Retail’s P&L ∣ −1∣ in (8) to produce these estimates. In the figure, we show how our estimates vary based on the assumptions we make about the price-improvement that retail investors receive relative to the best quoted half-spread (a price improvement of 100% would give identical results to Panel A of Figure 8). As evident from Panel B, for all values of possible price improvement we consider, retail investorslosesignificantlymorewealthduetotransactioncosts. Assumingthatretailtraders receive price improvement of 20% is conservative, particularly in light of evidence in Ernst and Spatt (2022) that retail price improvement hovers around 10%. Under this assumption, 34 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "5.1 Approximating Trader Profit and Loss",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 65,
    "chunk_index": 66,
    "word_count": 337,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.1 Approximating Trader Profit and Loss (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "As evident from Panel B, for all values of possible price improvement we consider, retail investorslosesignificantlymorewealthduetotransactioncosts. Assumingthatretailtraders receive price improvement of 20% is conservative, particularly in light of evidence in Ernst and Spatt (2022) that retail price improvement hovers around 10%. Under this assumption, 34 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "5.1 Approximating Trader Profit and Loss",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 65,
    "chunk_index": 67,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.1 Approximating Trader Profit and Loss (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "we estimate the average loss for announcements in the top quintile of EAV doubles relative to Panel A. Applying the simple aggregation calculation from the previous section, this translates into a wealth loss by retail investors of around $3 billion over our sample. In Panel C, we show how incorporating transaction costs affects our estimates of retail’s cumulative returns from t 0 to t 10 under the assumption of 20% price improvement. = = Comparing the results with Table 9 highlights two effects of transaction costs. First, trans- action costs contribute to retail investors now losing wealth in all quintiles: a cumulative 6% loss over 11 days in the bottom four quintiles, in contrast to the 1% gain implied by the 9bps average daily return column (6) of Table 9. Thus, any gains retail traders make from the premium they receive by selling options are eroded by transaction costs. A second key insight of Figure 8 is transaction costs compound retail investors’ losses around high EAV announcements: in Panel C the cumulative negative loss is around 12% compared to the approximate 7% loss estimated in column (6) of Table 9. Moreover, as shown in Figure 9, more than half of this -12% return occurs on the announcement day alone. Finally, following the announcement, after again assuming 20% price improvement, Figure 9 also shows that transaction costs result in retail losing an additional 5% over the ∼ 10-day post-announcement window. 6 Conclusion The COVID pandemic coincided with a significant increase in retail investors participat- ing in options markets, and this behavior has led to concern among regulators. This study aims to offer important insights into how their behavior impacts prices, gains, and losses. We first show that retail investors are attracted to trading options around announcements with high expected volatility (EAV), likely due to their greater salience through news cov- erage. Second, these retail demands generate risk for market makers that are priced and hence generate return predictability on and following high EAV announcements. Finally, retail investors are slow to close their positions following losses on the announcement day as 35 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "5.1 Approximating Trader Profit and Loss",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 65,
    "chunk_index": 68,
    "word_count": 355,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.1 Approximating Trader Profit and Loss (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "salience through news cov- erage. Second, these retail demands generate risk for market makers that are priced and hence generate return predictability on and following high EAV announcements. Finally, retail investors are slow to close their positions following losses on the announcement day as 35 Electronic copy available at: https://ssrn.com/abstract=4050165 option prices predictably decay. This combination of behaviors translates to retail losses of 5-to-9% around earnings an- nouncements on average, and 10-to-14% for high expected volatility announcements. This has led to significant capital transfers from retail investors to market makers, especially dur- ing the COVID pandemic. Our results complement the findings in Poteshman and Serbin (2003) that unsophisticated investors exercise options early by showing that not only do these investors misunderstand the mechanics of options, but also they trade these options at times when and in stocks where they have exceptionally high prices. 36 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "5.1 Approximating Trader Profit and Loss",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 65,
    "chunk_index": 69,
    "word_count": 149,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.1 Approximating Trader Profit and Loss (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "the findings in Poteshman and Serbin (2003) that unsophisticated investors exercise options early by showing that not only do these investors misunderstand the mechanics of options, but also they trade these options at times when and in stocks where they have exceptionally high prices. 36 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 65,
    "chunk_index": 70,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "Baker, Malcolm, Brendan Bradley, and Jeffrey Wurgler (2011), “Benchmarks as limits to arbitrage: Understanding the low-volatility anomaly.” Financial Analysts Journal, 67, 40– 54. Bali, Turan G., Nusret Cakici, and Robert F. Whitelaw (2011), “Maxing out: Stocks as lotteries and the cross-section of expected returns.” Journal of Financial Economics, 99, 427–446. Barber, Brad M, Emmanuel T De George, Reuven Lehavy, and Brett Trueman (2013), “The earnings announcement premium around the globe.” Journal of Financial Economics, 108, 118–138. Barber, Brad M, Xing Huang, Terrance Odean, and Christopher Schwarz (2021), “Atten- tion induced trading and returns: Evidence from robinhood users.” Journal of Finance, Forthcoming. Barber, Brad M and Terrance Odean (2008), “All that glitters: The effect of attention and news on the buying behavior of individual and institutional investors.” The review of financial studies, 21, 785–818. Barberis, Nicholas, MingHuang, andTanoSantos(2005), “Prospecttheoryandassetprices.” Advances in Behavioral Finance, 2, 224–270. Barberis, Nicholas and Wei Xiong (2012), “Realization utility.” Journal of Financial Eco- nomics, 104, 251–271. Barrot, Jean-Noel, Ron Kaniel, and David A. Sraer (2016), “Are retail traders compensated for providing liquidity?” Journal of Financial Economics, 120, 146–168. Barth, Mary E and Eric C So (2014), “Non-diversifiable volatility risk and risk premiums at earnings announcements.” The Accounting Review, 89, 1579–1607. Bauer, Rob, Mathijs Cosemans, and Piet Eichholtz (2009), “Option trading and individual investor performance.” Journal of Banking & Finance, 33, 731–746. Boehmer, Ekkehart, Charles M. Jones, Xiaoyan Zhang, and Xinran Zhang (2021), “Tracking Retail Investor Activity.” Journal of Finance, 76, 2249–2305. Bordalo, Pedro, Nicola Gennaioli, and Andrei Shleifer (2012), “Salience theory of choice under risk.” Quarterly Journal of Economics, 127, 1243–1285. Boyer, Brian H. and Keith Vorkink (2014), “Stock options as lotteries.” The Journal of Finance, 69, 1485–1527. Brunnermeier,MarkusK.andJonathanA.Parker(2005),“Optimalexpectations.” American Economic Review, 95, 1092–1118. Bryzgalova, Svetlana, Anna Pavlova, and Taisiya Sikorskaya (2022), “Retail trading in op- tions and the rise of the big three wholesalers.” Available at SSRN. Buraschi, Andrea and Alexei Jiltsov (2006), “Model uncertainty and option markets with heterogeneous beliefs.” The Journal of Finance, 61, 2841–2897. Calvet, Laurent E., John Y. Campbell, and Paolo Sodini (2009), “Fight or flight? Portfolio rebalancing by individual investors.” The Quarterly Journal of Economics, 124, 301–348. 37 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 65,
    "chunk_index": 71,
    "word_count": 362,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "Andrea and Alexei Jiltsov (2006), “Model uncertainty and option markets with heterogeneous beliefs.” The Journal of Finance, 61, 2841–2897. Calvet, Laurent E., John Y. Campbell, and Paolo Sodini (2009), “Fight or flight? Portfolio rebalancing by individual investors.” The Quarterly Journal of Economics, 124, 301–348. 37 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 65,
    "chunk_index": 72,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "Carr, Peter and Liuren Wu (2009), “Variance risk premiums.” Review of Financial Studies, 22, 1311–1341. Choukhmane, Taha and Tim de Silva (2022), “What drives investors’ portfolio choices? separating risk preferences from frictions.” Working Paper. Choy, Siu Kai (2015), “Retail clientele and option returns.” Journal of Banking and Finance, 51, 26–42. Choy, SiuKaiandJasonWei(2012), “Optiontrading: Informationordifferencesofopinion?” Journal of Banking & Finance, 36, 2299–2322. Coval, Joshua D and Tyler Shumway (2001), “Expected option returns.” The Journal of Finance, 56, 983–1009. Da, Zhi, Joseph Engelberg, and Pengjie Gao (2011), “In search of attention.” The journal of finance, 66, 1461–1499. DellaVigna, Stefano and Joshua M. Pollet (2009), “Investor inattention and friday earnings announcements.” Journal of Finance, 64, 709–749. Duarte, Jefferson, Christopher S. Jones, and Junbo L. Wang (2019), “Very Noisy Option Prices and Inferences Regarding Option Returns.” Working Paper. Dubinsky, Andrew, Michael Johannes, Andreas Kaeck, and Norman J. Seeger (2019), “Op- tion pricing of earnings announcement risks.” Review of Financial Studies, 32, 646–687. Ernst, ThomasandChesterSpatt(2022), “Paymentfororderflowandassetchoice.” Working Paper. Fama, Eugene F. and James D. MacBeth (1973), “Risk, Return, and Equilibrium: Empirical Tests.” Journal of Political Economy, 81, 607–636. Foucault, Thierry, David A. Sraer, and David Thesmar (2011), “Individual Investors and Volatility.” Journal of Finance, LXVI. Gabaix, Xavier (2014), “A Sparsity-Based Model of Bounded Rationality.” The Quarterly Journal of Economics, 1661–1710. Gao, Pengjie, Allen Hu, Peter Kelly, Cameron Peng, and Ning Zhu (2022), “Exploited by complexity.” Review of Finance, Forthcoming. Garleanu, Nicolae, Lasse Heje Pedersen, and Allen M Poteshman (2009), “Demand-based option pricing.” The Review of Financial Studies, 22, 4259–4299. Genesove, David and Christopher Mayer (2001), “Loss Aversion and Seller Behavior: Evi- dence from the Housing Market.” The Quarterly Journal of Economics, 116, 1233–1260. Goyal, Amit and Alessio Saretto (2009), “Cross-section of option returns and volatility.” Journal of Financial Economics, 94, 310–326. Han, Bing and Alok Kumar (2013), “Speculative retail trading and asset prices.” Journal of Financial and Quantitative Analysis, 48, 377–404. Hirshleifer, David A. (2001), “Investor Psychology and Asset Pricing.” The Journal of Fi- nance, 56, 1533–1597. Ingersoll, Jonathan E. and Lawrence J. Jin (2013), “Realization utility with reference- dependent preferences.” Review of Financial Studies, 26, 723–767. 38 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 65,
    "chunk_index": 73,
    "word_count": 358,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "Journal of Financial and Quantitative Analysis, 48, 377–404. Hirshleifer, David A. (2001), “Investor Psychology and Asset Pricing.” The Journal of Fi- nance, 56, 1533–1597. Ingersoll, Jonathan E. and Lawrence J. Jin (2013), “Realization utility with reference- dependent preferences.” Review of Financial Studies, 26, 723–767. 38 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 65,
    "chunk_index": 74,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "Johnson, Travis L. and Eric C. So (2018), “Asymmetric Trading Costs Prior to Earnings Announcements: Implications for Price Discovery and Returns.” Journal of Accounting Research, 56, 217–263. Kahneman, Daniel and Amos Tversky (1979), “Prospect Theory: an Analysis.” Economet- rica, 47, 263–292. Kaniel, Ron, Shuming Liu, Gideon Saar, and Sheridan Titman (2012), “Individual Investor Trading and Return Patterns around Earnings Announcements.” The Journal of Finance, 67, 639–680. Kelley, Eric K and Paul C Tetlock (2013), “How wise are crowds? insights from retail orders and stock returns.” The Journal of Finance, 68, 1229–1265. Lakonishok, Josef, Inmoo Lee, Neil D Pearson, and Allen M Poteshman (2007), “Option market activity.” The Review of Financial Studies, 20, 813–857. Lazarus, Eben, Daniel J. Lewis, James H. Stock, and Mark W. Watson (2018), “HAR Infer- ence: Recommendations for Practice.” Journal of Business and Economic Statistics, 36, 541–559. Lee, Suzanne S and Per A Mykland (2008), “Jumps in financial markets: A new nonpara- metric test and jump dynamics.” The Review of Financial Studies, 21, 2535–2563. Leland, Hayne E (1980), “Who should buy portfolio insurance?” The Journal of Finance, 35, 581–594. Linnainmaa, Juhani T (2011), “Why do (some) households trade so much?” The Review of Financial Studies, 24, 1630–1666. Mahani, Reza S and Allen M Poteshman (2008), “Overreaction to stock market news and misevaluation of stock prices by unsophisticated investors: Evidence from the option mar- ket.” Journal of Empirical Finance, 15, 635–655. Muravyev, Dmitriy and Neil D. Pearson (2020), “Option Trading Costs Are Lower than You Think.” Review of Financial Studies, 33, 4973–5014. Ni, Sophie X, Jun Pan, and Allen M Poteshman (2008), “Volatility information trading in the option market.” The Journal of Finance, 63, 1059–1091. Niessner, Marina and Eric C So (2018), “Bad news bearers: The negative tilt of the financial press.” Available at SSRN 3219831. Noh, Suzie, Eric C So, and Rodrigo S Verdi (2021), “Calendar rotations: A new approach for studying the impact of timing using earnings announcements.” Journal of Financial Economics, 140, 865–893. Patell, James M and Mark A Wolfson (1979), “Anticipated information releases reflected in call option prices.” Journal of accounting and economics, 1, 117–140. Poteshman, Allen M and Vitaly Serbin (2003), “Clearly irrational financial market behav- ior: Evidence from the early exercise of exchange traded stock options.” The Journal of Finance, 58, 37–70. Seru, Amit, Tyler Shumway, and Noah Stoffman (2010), “Learning by trading.” The Review of Financial Studies, 23, 705–739. Sims, Christopher A. (2003), “Implications of rational inattention.” Journal of Monetary Economics, 50, 665–690. 39 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 65,
    "chunk_index": 75,
    "word_count": 418,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "exercise of exchange traded stock options.” The Journal of Finance, 58, 37–70. Seru, Amit, Tyler Shumway, and Noah Stoffman (2010), “Learning by trading.” The Review of Financial Studies, 23, 705–739. Sims, Christopher A. (2003), “Implications of rational inattention.” Journal of Monetary Economics, 50, 665–690. 39 Electronic copy available at: https://ssrn.com/abstract=4050165 Smith, Kevin (2019), “Financial markets with trade on risk and return.” The Review of Financial Studies, 32, 4042–4078. Smith, Kevin and Eric C So (2020), “Measuring risk information.” Journal of Accounting Research, forthcoming. 40 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 41,
    "page_range": "p.41-42",
    "total_pages": 65,
    "chunk_index": 76,
    "word_count": 89,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.41-42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "of Monetary Economics, 50, 665–690. 39 Electronic copy available at: https://ssrn.com/abstract=4050165 Smith, Kevin (2019), “Financial markets with trade on risk and return.” The Review of Financial Studies, 32, 4042–4078. Smith, Kevin and Eric C So (2020), “Measuring risk information.” Journal of Accounting Research, forthcoming. 40 Electronic copy available at: https://ssrn.com/abstract=4050165 A Variable Definitions Variable Definition TimePeriod DataSources t daysrelativetoanearningsannouncement,whichoccursatt=0 CompustatandIBES ∆TraderPosition see(1) t Nasdaq t TraderPosition see(2) t Nasdaq t TraderPositionShare TraderPosition dividedbythesumofTraderPosition acrossallunderlyingondatet t Nasdaq t t t TraderP&L see(8) t Nasdaq t RetailAvg. ReturnLong averagedailyreturnonallretaillongoptionspositionsinagivenunderlying,describedin t Nasdaq t Section5 RetailAvg. ReturnShort averagedailyreturnonallretailshortoptionspositionsinagivenunderlying,describedin t Nasdaq t Section5 RetailAvg. ReturnWeighted weightedaverageofRetailAvg. ReturnLong andRetailAvg. ReturnShort, withweightsde- t Nasdaq t t t terminedbyrelativedollarexposureofretaillongandshortpositionsatt=−1, described inSection5 Half-SpreadIncurredbyRetail estimate of half of bid-ask spread incurred by retail investors trading before the earnings t∈{−5,−2} Nasdaq iq announcementoffirmiinquarterqcalculatedin(7) RetailEquityBuys number of shares bought by retail investors in the underlying stock i on day t, identified t TAQ t followingBoehmeretal.(2021) RetailEquitySells number of shares sold by retail investors in the underlying stock i on day t, identified t TAQ t followingBoehmeretal.(2021) AbnormalIV see(5) t OptionMetrics t MAX EA largestabsolutereturnatanEAinpast5years t∈{−1260,−1} CRSP SRET see(6) t OptionMetrics t AT totalassets t∈{−126,−1} Compustat log(BTM) logofbook-to-market t∈{−126,−11} CRSPandCompustat β V variancebeta= corr(ri 2 s t d ,r ( m 2 r2 t )∗ ) sd(ri 2 t ) (CarrandWu2009) t∈{−252,−11} CRSP mt IdioVol in-sampleRMSEfromthemarketmodelinFigure7 t∈{−252,−11} CRSP √ Volatility absolutevalueofannouncementdayreturnmultipliedby 252 t=0 CRSP 0 √ Volatility standarddeviationofdailyreturnsmultipliedby 252 t∈{−60,−5} CRSP −60,−5 Volume−22,−5 tradingvolumeacrossalloptions t∈{−22,−5} OptionMetrics EAOrder #daysbetweenfirstannouncementinsamequarter byannouncement CompustatandIBES #daysbetweenfirstandlastannouncementsinsamequarter skew BV option-impliedskewnesscalculatedfollowingBoyerandVorkink(2014),averagedacrossall t=−10 CRSPandOptionMetrics optionstradedonagivenannouncement,meaasuredpriortotheannouncement skewS option-implied skewness calculated for straddles traded calculated following Boyer and t∈{−129,−3} CRSPandOptionMetrics BV Vorkink(2014),averagedover132days ROTP average ratio of Customer trading volume to total OptionMetrics trading volume (Choy t∈[−22,−1] NasdaqandOptionMetrics 2015) NewsArticles thenumberofnewsarticlespublishedintheWSJ,WashingtonPost,USAToday,andNew Factiva.com τ,s YorkTimesonagivenunderlyingduringt∈[τ,s],whereannouncementsthatdonotmatch withFactiva.comareassumedtohavezeronewsarticlespublished. Electronic copy available at: https://ssrn.com/abstract=4050165 41",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 65,
    "chunk_index": 77,
    "word_count": 297,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "#daysbetweenfirstandlastannouncementsinsamequarter skew BV option-impliedskewnesscalculatedfollowingBoyerandVorkink(2014),averagedacrossall t=−10 CRSPandOptionMetrics optionstradedonagivenannouncement,meaasuredpriortotheannouncement skewS option-implied skewness calculated for straddles traded calculated following Boyer and t∈{−129,−3} CRSPandOptionMetrics BV Vorkink(2014),averagedover132days ROTP average ratio of Customer trading volume to total OptionMetrics trading volume (Choy t∈[−22,−1] NasdaqandOptionMetrics 2015) NewsArticles thenumberofnewsarticlespublishedintheWSJ,WashingtonPost,USAToday,andNew Factiva.com τ,s YorkTimesonagivenunderlyingduringt∈[τ,s],whereannouncementsthatdonotmatch withFactiva.comareassumedtohavezeronewsarticlespublished. Electronic copy available at: https://ssrn.com/abstract=4050165 41",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 65,
    "chunk_index": 78,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "B Additional Details on P&L Calculation Our approach to calculating the profit and loss (P&L) of different traders is as follows. Denote the portfolio value in dollars of a given trader’s position on day t as Trader PV and t let i denote an option that the trader holds. By definition, Trader PV Trader Position Option Price Outside Wealth , (9) t =∑ it∗ it+ t i whereTrader Position correspondstothepositionofthetraderinoptioniatt,Option Price it it denotes the price of option i at t, and the sum over i is across all options on all underlyings that the trader holds. Outside Wealth denotes other assets held in the traders’ portfolio t (e.g., the underlying stock), which we do not observe. Taking first differences of (9) and rearranging gives an expression for the trader P&L: Trader P&L ∆Trader PV Trader Position Option Price Option Price t ≡ t =∑ it−1∗( it− it−1) i Option Price Trader Position Trader Position +∑ it∗( it− it−1) i ∆Outside Wealth . + t Since a trader’s outside wealth is not observable, we assume that changes in outside wealth stem from using assets (e.g., cash) to buy options and receiving assets from selling options: Option Price Trader Position Trader Position ∆Outside Wealth . (10) ∑ it∗( it− it−1)=− t i Under this assumption, we can calculate the P&L of each trader using (8). Calculating the P&L of each clientele group using (8) requires three additional assump- tions. First, it requires that we observe all of the options positions of each trader. Since the latter assumption clearly fails as traders trade options on other exchanges than Nasdaq, we choose to scale the P&L of each trader by the average dollar trading volume on Nasdaq one month before the announcement. By estimating P&L as a multiple of observed trad- 42 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 65,
    "chunk_index": 79,
    "word_count": 304,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "latter assumption clearly fails as traders trade options on other exchanges than Nasdaq, we choose to scale the P&L of each trader by the average dollar trading volume on Nasdaq one month before the announcement. By estimating P&L as a multiple of observed trad- 42 Electronic copy available at: https://ssrn.com/abstract=4050165 ing volume, we hope to take into account variation in Nasdaq sample coverage that would pollute an unnormalized measure in dollars. Second, when implementing (8) empirically, we use the last traded price of each option from Nasdaq. Thus, we make the assumption that all traders rebalance at market close, as we do not observe intra-day trading in our data. Finally, we ignore bid-ask spreads in this calculation, which will result in an understatement of the P&L to market makers and an overstatement of the P&L to other traders (we relax this assumption in subsection 4.2). Although these assumptions required for us to correctly estimate the level of trader P&L may appear restrictive, we emphasize our interest is pri- marily in how P&L varies across announcements and we see no reason for the validity of these assumptions to meaningfully vary with EAV. In Table 9, we using this methodology to approximate the returns of retail investors. When doing so, we require the additional assumption that there are no collateral require- ments associated with shorting options. In practice, this is of course not the case. However, we view this as a conservative assumption because it results in an over-estimate of the re- turn of retail investors on short positions, which in practice require the option writer to post additional collateral that drives down the return. 43 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 65,
    "chunk_index": 80,
    "word_count": 279,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "course not the case. However, we view this as a conservative assumption because it results in an over-estimate of the re- turn of retail investors on short positions, which in practice require the option writer to post additional collateral that drives down the return. 43 Electronic copy available at: https://ssrn.com/abstract=4050165 Figure 1. Option Trading Over Time This figure plots trading volume and open interest in our sample over time. Panel A of this figure plots the fraction of total volume and open interest in OptionMetrics that is covered in the Nasdaq data. For each option-day, we merge Nasdaq with OptionMetrics and calculate the ratio of Nasdaq to OptionMetrics trading volume and open interest. Panel A then plots the average of these ratios across every day in each year using all options available on Nasdaq. Panel B of this figure plots the total dollar trading volume of Retail for each year in our sample across all options available on Nasdaq. The asterisk on 2021 in Panel B denotes the fact that our sample ends in February 2021. Panel A: Sample Coverage XLHP/XDN no latoT scirteMnoitpO fo noitcarF naeM %05 %04 %03 %02 %01 %0 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 Trading Volume Open Interest Panel B: Retail Trading Over Time )snoillib $ ni( emuloV liateR latoT 052 002 051 001 05 0 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 20202021* 44 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 45,
    "page_range": "p.45-46",
    "total_pages": 65,
    "chunk_index": 81,
    "word_count": 244,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.45-46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 Trading Volume Open Interest Panel B: Retail Trading Over Time )snoillib $ ni( emuloV liateR latoT 052 002 051 001 05 0 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 20202021* 44 Electronic copy available at: https://ssrn.com/abstract=4050165 Figure 2. Options Trading around Earnings Announcements Thisfigureplotsoptiontradingvolumearoundearningsannouncements. PanelAplotsaveragedollartrading volumeacrossallannouncementsinoursampleatdifferenttradingdaysrelativetoearningsannouncements, which occurs at day t = 0. Panel B plots the average dollar trading volume across all announcements in each year that occurs between t=−5 and t=−2 for our five different classifications of traders. Both panels aggregate across all options for each announcement from Nasdaq. Panel A: Dollar Volume in Event-Time )snoillim $ ni( emuloV gnidarT egarevA 8. 6. 4. 2. -40 -20 0 20 40 Trading Days Relative to EA Panel B: Pre-Announcement Dollar Volume )snoillim $ ni( 2- ot 5- = t morf emuloV egarevA 4 3 2 1 0 2010 2015 2020 Year Retail Market Maker Broker/Dealer Firm Professional 45 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 46,
    "page_range": "p.46-47",
    "total_pages": 65,
    "chunk_index": 82,
    "word_count": 168,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.46-47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "6. 4. 2. -40 -20 0 20 40 Trading Days Relative to EA Panel B: Pre-Announcement Dollar Volume )snoillim $ ni( 2- ot 5- = t morf emuloV egarevA 4 3 2 1 0 2010 2015 2020 Year Retail Market Maker Broker/Dealer Firm Professional 45 Electronic copy available at: https://ssrn.com/abstract=4050165 Figure 3. Option Trading in Earnings Announcement Event-Time This figure plots the average change in option positions in earnings announcement event-time for different traders, corresponding to ∆Trader Position in (1). For each earnings announcement (firm-quarter), Panel t A plots the average number of options purchased by Retail and Market Makers, while Panel B plots the analogousresultsforBroker/Dealers,Firms,andProfessionals. Thenumberofoptionspurchasedisequalto 100 multipled by the number of contracts purchased. Trader positions are aggregated across all options on each underlying and are winsorized at 2%-98%. Detailed variable definitions are provided in Appendix A. Panel A: Retail and Market Makers )sdnasuoht ni( noitisoP DegarevA t 01 5 0 5- 01- -40 -20 0 20 40 Trading Days Relative to EA Retail Market Maker Panel B: Other Traders )sdnasuoht ni( noitisoP DegarevA t 01 5 0 5- 01- -40 -20 0 20 40 Trading Days Relative to EA Broker/Dealer Firm Professional 46 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 47,
    "page_range": "p.47-48",
    "total_pages": 65,
    "chunk_index": 83,
    "word_count": 200,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.47-48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "5 0 5- 01- -40 -20 0 20 40 Trading Days Relative to EA Retail Market Maker Panel B: Other Traders )sdnasuoht ni( noitisoP DegarevA t 01 5 0 5- 01- -40 -20 0 20 40 Trading Days Relative to EA Broker/Dealer Firm Professional 46 Electronic copy available at: https://ssrn.com/abstract=4050165 Figure 4. Retail Equity vs. Option Trading in Earnings Announcement Event-Time This figure plots the average value of the ratio of unsigned delta-weighted retail option trades to total retail buys and sells in the equity market defined in (3), Unsigned OS Ratio , and the ratio of delta-weighted it retail call purchases to retail buys in the equity market defined in (4), OS Call Buy Ratio . Retail option it positions are aggregated across all options that expire at least 10 days after the earnings announcement and both variables are winsorized at 2%-98%. Detailed variable definitions are given in Appendix A. gniylrednU reP naeM 51. 1. 50. 0 50.- -20 -10 0 10 20 Trading Days Relative to EA Unsigned OS Ratio OS Call Buy Ratio 47 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 48,
    "page_range": "p.48-49",
    "total_pages": 65,
    "chunk_index": 84,
    "word_count": 182,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.48-49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "after the earnings announcement and both variables are winsorized at 2%-98%. Detailed variable definitions are given in Appendix A. gniylrednU reP naeM 51. 1. 50. 0 50.- -20 -10 0 10 20 Trading Days Relative to EA Unsigned OS Ratio OS Call Buy Ratio 47 Electronic copy available at: https://ssrn.com/abstract=4050165 Figure 5. Trader Positions Pre-Announcement This figure plots the average pre-announcement trading behavior and positions for different traders and different quintiles of AbnormalIV , defined as ∆Position and Position in (1) and (2). For each quintile −5 t t of AbnormalIV and trader group, Panel A shows the average number of options bought between t = −5 −5 and t=−2, ∆Position . Panel B shows the average position at t=−2, Position . Trader positions are −5,−2 −2 aggregatedacrossalloptionsthatexpireatleast10daysaftertheearningsannouncementandarewinsorized at 2%-98%. Error bars in both panels represent 95% confidence intervals. Panel C shows the coefficients and90%confidenceintervalsfromrunningtheregressionincolumn(5)ofTable2separatelyeachyear. The resultingcoefficientsarenormalizedbytheaveragevalueof∣∆Retail Position ∣acrossallannouncements −5,−2 in each year. Detailed variable definitions are given in Appendix A. Panel A: Pre-Announcement Buying Across Quintiles of AbnormalIV −5 )sdnasuoht ni( noitisoP D egarevA 2- ,5- 01 5 0 5- Quintile 1 Quintile 2 Quintile 3 Quintile 4 Quintile 5 Retail Market Maker Broker/Dealer Firm Professional Panel B: Pre-Announcement Positions Across Quintiles of AbnormalIV −5 )sdnasuoht ni( noitisoP egarevA 2- 04 02 0 02- 04- Quintile 1 Quintile 2 Quintile 3 Quintile 4 Quintile 5 Retail Market Maker Broker/Dealer Firm Professional 48 Electronic copy available at: https://ssrn.com/abstract=4050165 Figure 5. Trader Positions Pre-Announcement (continued) Panel C: Annual Fama-MacBeth Regressions of ∆Retail PositionCalls onto AbnormalIV −5,−2 −5 12.0% 10.0% 8.0% 6.0% 4.0% 2.0% 0.0% 2.0% 2010 2012 2014 2016 2018 2020 |2 ,5 liateR | .gvA fo % sa tneiciffeoC launnA 49 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 49,
    "page_range": "p.49-50",
    "total_pages": 65,
    "chunk_index": 85,
    "word_count": 286,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.49-50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "at: https://ssrn.com/abstract=4050165 Figure 5. Trader Positions Pre-Announcement (continued) Panel C: Annual Fama-MacBeth Regressions of ∆Retail PositionCalls onto AbnormalIV −5,−2 −5 12.0% 10.0% 8.0% 6.0% 4.0% 2.0% 0.0% 2.0% 2010 2012 2014 2016 2018 2020 |2 ,5 liateR | .gvA fo % sa tneiciffeoC launnA 49 Electronic copy available at: https://ssrn.com/abstract=4050165 Figure 6. Transaction Costs Incurred by Retail Investors ThisfigureplotsthetransactioncostsincurredbyretailinvestorsacrossquintilesofAbnormalIV . Foreach −1 quintile of AbnormalIV , Panel A plots the average value of Half-Spread Incurred by Retail defined in −1 iq (7) converted into dollars by multiplying by ∣Retail Position ∣, as in Panel C of Figure 8. Panel B plots the −1 average value of Half-Spread Incurred by Retail defined in (7). In both panels, we winsorize at 2%-98%. iq Errorbarsinallpanelsrepresent95%confidenceintervals. FordetailedvariabledefinitionsseeAppendixA. Panel A: Dollar Half-Spreads Incurred by Retail Investors 22 02 81 61 41 Quintile 1 Quintile 2 Quintile 3 Quintile 4 Quintile 5 Average Half-Spread Incurred by Retail (in $ Thousands) iq Panel B: Half-Spreads Incurred by Retail Investors 590. 90. 580. 80. 570. Quintile 1 Quintile 2 Quintile 3 Quintile 4 Quintile 5 Average Half-Spread Incurred by Retail (in % of Midpoint) iq 50 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 51,
    "page_range": "p.51-52",
    "total_pages": 65,
    "chunk_index": 86,
    "word_count": 193,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.51-52)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "4 Quintile 5 Average Half-Spread Incurred by Retail (in $ Thousands) iq Panel B: Half-Spreads Incurred by Retail Investors 590. 90. 580. 80. 570. Quintile 1 Quintile 2 Quintile 3 Quintile 4 Quintile 5 Average Half-Spread Incurred by Retail (in % of Midpoint) iq 50 Electronic copy available at: https://ssrn.com/abstract=4050165 Figure 7. Idiosyncratic Volatility and Expected Announcement Volatility Thisfigureplotstherelationshipbetweenidiosyncraticvolatilityandourmeasureofexpectedannouncement volatility. PanelAplotstheaverageidiosyncraticvolatilityinevent-timerelativetoearningsannouncements, which occurs at t = 0, for two groups of earnings announcements: (i) those in the bottom quintile of AbnormalIV ; (ii) those in the top quintile of AbnormalIV . Panel B plots the regression coefficients −5 −5 and 95% confidence intervals from regressing idiosyncratic volatility at day t onto an indicator variable that captures whether the announcement is in the top quintile of AbnormalIV with year-quarter fixed effects −5 using only announcements in the top and bottom quintile of AbnormalIV . Idiosyncratic volatility on −5 day t is defined as the ratio of the absolute value of the residual on day t from a firm-specific market model regression(withthreelags)estimatedovert=−51tot=−11totheaverageabsoluteresidualintheestimated model, subtracting one. Confidence intervals are based on two-way clustered standard errors by firm- and year-quarter. Panel A: Average Idiosyncratic Volatility by AbnormalIV Quintile −5 3.0 2.5 2.0 1.5 1.0 0.5 0.0 10 9 8 7 6 5 4 3 2 1 0 1 2 3 4 5 6 7 8 9 10 Event Time: EA at t=0 ytilitaloV citarcnysoidI Quintile 1 AbnormalIV 5 Quintile 5 AbnormalIV 5 Average over t= 51, 11 Panel B: Difference in Idiosyncratic Volatility Quintile 5 and Quintile 1 AbnormalIV −5 1.4 1.2 1.0 0.8 0.6 0.4 0.2 0.0 10 9 8 7 6 5 4 3 2 1 0 1 2 3 4 5 6 7 8 9 10 Event Time: EA at t=0 ytilitaloV citarcnysoidI 1 elitniuQ - 5 elitniuQ 51 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 52,
    "page_range": "p.52",
    "total_pages": 65,
    "chunk_index": 87,
    "word_count": 303,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.52)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "1 AbnormalIV −5 1.4 1.2 1.0 0.8 0.6 0.4 0.2 0.0 10 9 8 7 6 5 4 3 2 1 0 1 2 3 4 5 6 7 8 9 10 Event Time: EA at t=0 ytilitaloV citarcnysoidI 1 elitniuQ - 5 elitniuQ 51 Electronic copy available at: https://ssrn.com/abstract=4050165 Figure 8. Wealth Dynamics ThisfigureplotsthetradingperformanceofeachtraderacrossquintilesofAbnormalIV . Foreachquintile −1 ofAbnormalIV ,PanelAplotstheaverageP&Lforeachtrader. P&Lrepresentsourestimateofthedollar −1 change in a trader’s position on market close at day t across all options that expire at least 10 days after the earnings announcement. Trader P&L is then normalized by the average daily option dollar volume on Nasdaq for t∈[−33,−5] across all options on each underlying and is winsorized at 2%-98%. In Panel B, we plot the P&L of Retail from Panel A after adjusting for our estimates of the half-spread incurred by retail investorsfrom(7). Weconvertthishalf-spreadintodollarsbymultiplyingby∣Retail Position ∣anddividing −1 by the measure of average trading volume used to normalize Retail P&L in Panel A, reducing this estimate based on various assumptions about the level of price improvement receives. Panel C makes an analogous plot to Panel B with our approximation to the return of retail investors described in Table 9, including the averagereturnacrossquintilesintherightgraph. Errorbarsinallpanelsrepresent90%confidenceintervals. For detailed variable definitions see Appendix A. Panel A: P&L Across Quintiles of AbnormalIV −1 ) emuloV $ yb dezilamron( L&P egarevA 5-,33- 01,0 1 5. 0 5.- 1- Quintile 1 Quintile 2 Quintile 3 Quintile 4 Quintile 5 Retail Market Maker Broker/Dealer Firm Professional Panel B: Transaction Cost Adjusted Retail P&L Across Quintiles of AbnormalIV −1 daerpS-flaH rof detsujdA L&P liateR egarevA 01,0 5. 0 5.- 1- 5.1- Quintile 1 Quintile 2 Quintile 3 Quintile 4 Quintile 5 50% Price Improvement 20% Price Improvement 10% Price Improvement 5% Price Improvement Panel C on Next Page 52 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 53,
    "page_range": "p.53",
    "total_pages": 65,
    "chunk_index": 88,
    "word_count": 298,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.53)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "Across Quintiles of AbnormalIV −1 daerpS-flaH rof detsujdA L&P liateR egarevA 01,0 5. 0 5.- 1- 5.1- Quintile 1 Quintile 2 Quintile 3 Quintile 4 Quintile 5 50% Price Improvement 20% Price Improvement 10% Price Improvement 5% Price Improvement Panel C on Next Page 52 Electronic copy available at: https://ssrn.com/abstract=4050165 Figure 8. Wealth Dynamics (continued) Panel C: Transaction Cost Adjusted Retail Return Across Quintiles of AbnormalIV −1 0 )% ni( daerpS-fl 5 a - H rof detsujdA de 0 thg 1 ie - W01,0nruteR evita 5 lu 1 m - uC Quintile 1 Quintile 2 Quintile 3 Quintile 4 Quintile 5 50% Price Improvement 20% Price Improvement 10% Price Improvement 5% Price Improvement 4- )% ni( daerpS 6 - - flaH rof detsuj 8 d - A dethgieW01,0nru 0 te 1 R - evitalumuC 21- Average Across Quintiles 50% Price Improvement 20% Price Improvement 10% Price Improvement 5% Price Improvement 53 Electronic copy available at: https://ssrn.com/abstract=4050165 Figure 9. Announcement-Day Retail Investor Returns This figure plots the average return of retail investors adjusted for transaction costs on the announcement day across quintiles of AbnormalIV . To approximate the return of retail investors, we use the measure −1 described and used in Table 9 adjusted for transaction costs estimated according to (7). We assume a price improvement for retail investors of 20%. Error bars in all panels represent 90% confidence intervals. For detailed variable definitions see Appendix A. )% ni( daerpS-flaH rof detsujdA dethgieWnruteR 0 4- 5- 6- 7- 8- Quintile 1 Quintile 2 Quintile 3 Quintile 4 Quintile 5 Announcement-Day Retail Return (20% Price Improvement) 54 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 54,
    "page_range": "p.54-55",
    "total_pages": 65,
    "chunk_index": 89,
    "word_count": 270,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.54-55)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "Error bars in all panels represent 90% confidence intervals. For detailed variable definitions see Appendix A. )% ni( daerpS-flaH rof detsujdA dethgieWnruteR 0 4- 5- 6- 7- 8- Quintile 1 Quintile 2 Quintile 3 Quintile 4 Quintile 5 Announcement-Day Retail Return (20% Price Improvement) 54 Electronic copy available at: https://ssrn.com/abstract=4050165 Table 1. Summary Statistics Thistableshowssummarystatisticsonthetradingofeachtypeoftraderacrosstheearningsannouncements in our sample in number of options. Panel A shows summary statistics on the average number of options boughtbetweent=−5andt=−2,∆Position . PanelBshowssummarystatisticsontheaverageposition −5,−2 at t = −2, Position . Trader positions are aggregated across all options that expire at least 10 days after −2 the earnings announcement. Detailed variable definitions are given in Appendix A. Panel A: Pre-Announcement Trading Obs. Mean 10% 25% 50% 75% 90% ∆Retail Position 32,758 5,045 -31,000 -6,200 0 7,500 38,200 −5,−2 ∆Market Maker Position 32,758 -5,098 -37,100 -8,800 -100 4,200 23,600 −5,−2 ∆Broker/Dealer Position 32,758 -1,591 -15,000 -2,600 0 2,700 13,400 −5,−2 ∆Firm Position 32,758 1,002 -9,900 -500 0 2,000 17,900 −5,−2 ∆Professional Position 32,758 642 -5,900 -300 0 300 8,000 −5,−2 Panel B: Pre-Announcement Positions Obs. Mean 10% 25% 50% 75% 90% Retail Position 32,758 57,574 -116,200 -18,300 -300 11,900 101,900 −2 Market Maker Position 32,758 -44,316 -106,400 -22,400 -500 6,000 45,600 −2 Broker/Dealer Position 32,758 -20,436 -45,100 -5,000 0 7,100 42,900 −2 Firm Position 32,758 -18,134 -29,000 -1,200 0 10,600 71,300 −2 Professional Position 32,758 25,313 -10,700 -400 0 4,200 51,800 −2 55 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 56,
    "page_range": "p.56-57",
    "total_pages": 65,
    "chunk_index": 90,
    "word_count": 239,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.56-57)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "11,900 101,900 −2 Market Maker Position 32,758 -44,316 -106,400 -22,400 -500 6,000 45,600 −2 Broker/Dealer Position 32,758 -20,436 -45,100 -5,000 0 7,100 42,900 −2 Firm Position 32,758 -18,134 -29,000 -1,200 0 10,600 71,300 −2 Professional Position 32,758 25,313 -10,700 -400 0 4,200 51,800 −2 55 Electronic copy available at: https://ssrn.com/abstract=4050165 Table 2. Retail Option Trading and EAV This table displays regressions of the change in positions of retail investors over t = −5 to t = −2 onto our twomeasuresofexpectedannouncementvolatility,AbnormalIV andMAX . Columns(1)-(4)aggregate −5 EA across all retail traders. Columns (5)-(6) use net retail opening trades, which are defined as opening buys minus opening sells. Columns (7)-(8) use an analogous definition for closing trades. Trader positions are aggregatedacrossalloptionsthatexpireatleast10daysaftertheearningsannouncementandarewinsorized at 2%-98%. Detailed variable definitions are given in Appendix A. ∆RetailPosition−5,−2 ∆RetailPositionO −5 p , e − n 2 ∆RetailPositionC −5 lo ,− se 2 (1) (2) (3) (4) (5) (6) (7) (8) log(AbnormalIV−5) 1686.3 1586.4 3608.3 -2610.3 (4.67) (4.46) (7.20) (-8.52) log(MAX EA) 7145.8 7022.8 12557.3 -7088.2 (7.53) (8.85) (8.53) (-7.05) Volatility -14887.4 -15921.0 2735.1 2203.8 -18170.7 -18012.1 −60,−5 (-2.42) (-2.67) (0.29) (0.27) (-3.23) (-3.56) log(AT) -101.4 175.9 6752.2 7173.7 -6231.1 -6183.6 (-0.19) (0.35) (6.37) (6.62) (-9.45) (-8.91) β -241.4 -345.8 -202.3 -356.7 165.8 224.5 V (-1.14) (-1.90) (-0.60) (-1.20) (0.71) (1.04) EAOrder 5065.4 5405.3 871.4 1135.5 2898.6 2555.8 (0.68) (0.81) (0.07) (0.10) (0.41) (0.39) IdioVol 218784.2 207309.1 466019.5 430389.9 -225744.6 -208382.5 (2.40) (2.42) (3.40) (3.23) (-2.42) (-2.32) skew 172.3 151.6 566.7 519.0 -342.2 -327.7 BV (2.51) (2.47) (6.17) (6.16) (-6.46) (-6.66) log(BTM) -535.3 -673.3 -5277.2 -5599.2 4682.5 4743.2 (-1.13) (-1.49) (-5.27) (-5.88) (7.77) (8.16) Year-QuarterFixedEffects ✓ ✓ ✓ ✓ ✓ ✓ FirmandYear-QuarterClustering ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ TotalObservations 29130 32462 24473 27463 24473 27463 24473 27463 AdjustedR-Squared 0.00234 0.00712 0.00675 0.0105 0.0518 0.0536 0.0853 0.0813 56 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 57,
    "page_range": "p.57",
    "total_pages": 65,
    "chunk_index": 91,
    "word_count": 304,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.57)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "-5277.2 -5599.2 4682.5 4743.2 (-1.13) (-1.49) (-5.27) (-5.88) (7.77) (8.16) Year-QuarterFixedEffects ✓ ✓ ✓ ✓ ✓ ✓ FirmandYear-QuarterClustering ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ TotalObservations 29130 32462 24473 27463 24473 27463 24473 27463 AdjustedR-Squared 0.00234 0.00712 0.00675 0.0105 0.0518 0.0536 0.0853 0.0813 56 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 58,
    "page_range": "p.58",
    "total_pages": 65,
    "chunk_index": 92,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.58)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "Table 3. The Role of News Coverage Panel A of this table displays Poisson regressions estimated via maximum likelihood of the number of news articlesonagivenannouncementontoourtwomeasuresofexpectedannouncementvolatility,AbnormalIV −5 and MAX . News Articles is defined as the number of news articles published in the WSJ, Washington EA τ,s Post, USA Today, and New York Times on a given underlying during t ∈ [τ,s]. The first two columns of Panel B displays regressions of Retail pre-announcement trading onto AbnormalIV and an interaction −5 with an indicator for whether the announcement receives news coverage between t = −10 and t = −2. The second two columns of Panel B display regressions of Retail pre-announcement trading onto indicators for eachquintileofAbnormalIV fortwosubsamples: announcementswithoutnewscoverageincolumn(3)and −5 announcements with news coverage in column (4). Trader positions are aggregated across all options that expire at least 10 days after the earnings announcement and are winsorized at 2%-98%. Detailed variable definitions are given in Appendix A. Panel A: News Coverage and Expected Announcement Volatility NewsArticles−5,−2 NewsArticles−1,1 NewsArticles2,5 (1) (2) (3) (4) (5) (6) log(AbnormalIV−5) 0.163 0.139 0.111 (3.19) (3.99) (2.31) log(MAXEA) 0.223 0.371 0.189 (1.98) (4.47) (1.88) PoissonMLE ✓ ✓ ✓ ✓ ✓ ✓ Controls ✓ ✓ ✓ ✓ ✓ ✓ Year-QuarterFixedEffects ✓ ✓ ✓ ✓ ✓ ✓ FirmandYear-QuarterClustering ✓ ✓ ✓ ✓ ✓ ✓ TotalObservations 25048 28121 25048 28121 25048 28121 Panel B: News Coverage and Retail Trading ∆RetailPosition −5,−2 (1) (2) (3) (4) log(AbnormalIV −5) 1058.9 1033.3 (4.06) (3.44) 1(NewsArticles −10,−2>0) 35108.8 26504.5 (4.94) (4.30) log(AbnormalIV −5)×1(NewsArticles −10,−2>0) 4729.4 3673.9 (4.24) (3.75) Quintile1AbnormalIV 799.1 -2186.3 −5 (1.42) (-0.83) Quintile2AbnormalIV 606.3 1563.8 −5 (0.99) (0.60) Quintile3AbnormalIV 2694.4 7709.6 −5 (4.48) (2.86) Quintile4AbnormalIV 3262.5 11110.5 −5 (5.49) (3.95) Quintile5AbnormalIV 4431.8 15674.4 −5 (6.53) (4.44) NewsArticles −10,−2>0 ✗ ✓ Controls ✓ ✓ ✓ Year-QuarterFixedEffects ✓ ✓ FirmandYear-QuarterClustering ✓ ✓ TotalObservations 29130 24473 20557 3916 AdjustedR-Squared 0.00706 0.00927 0.00738 0.0132 57 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 58,
    "page_range": "p.58",
    "total_pages": 65,
    "chunk_index": 93,
    "word_count": 313,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.58)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "(0.99) (0.60) Quintile3AbnormalIV 2694.4 7709.6 −5 (4.48) (2.86) Quintile4AbnormalIV 3262.5 11110.5 −5 (5.49) (3.95) Quintile5AbnormalIV 4431.8 15674.4 −5 (6.53) (4.44) NewsArticles −10,−2>0 ✗ ✓ Controls ✓ ✓ ✓ Year-QuarterFixedEffects ✓ ✓ FirmandYear-QuarterClustering ✓ ✓ TotalObservations 29130 24473 20557 3916 AdjustedR-Squared 0.00706 0.00927 0.00738 0.0132 57 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 59,
    "page_range": "p.59",
    "total_pages": 65,
    "chunk_index": 94,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.59)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "Table 4. Option Trading and EAV: Breakdown by Option and Trader Type Thistabledisplaysregressionsofthechangeinpositionsofdifferenttradersovert=−5tot=−2ontoourtwo measuresofexpectedannouncementvolatility,AbnormalIV andMAX . PanelsAandBshowanalogous −5 EA resultstocolumns(3)and(4)ofTable2forthepositionsofretailtradersaggregatingacrossdifferentoption moneyness and option maturity, respectively. Option maturity is defined in terms of business days relative to the earnings announcement. At-the-money options are defined as options where the spot price is within 10% of the strike price. Panel C shows the analogous results to columns (3) and (4) of Table 2 for other traders. Trader positions are aggregated across all options that expire at least 10 days after the earnings announcement and are winsorized at 2%-98%. Detailed variable definitions are given in Appendix A. Panel A: Retail Trading by Option Type ∆RetailPosition−5,−2 OTMCalls ATMCalls ITMCalls OTMPuts ATMPuts ITMPuts (1) (2) (3) (4) (5) (6) (7) (8) (9) (10) (11) (12) log(AbnormalIV−5) 431.3 1111.1 -13.36 -139.5 58.77 -29.21 (4.76) (5.25) (-0.74) (-2.44) (0.74) (-5.52) log(MAXEA) 1778.0 4768.9 -42.95 -46.01 102.4 -73.80 (6.29) (8.89) (-0.89) (-0.26) (0.38) (-5.03) Controls ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ Year-QuarterFixedEffects ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ FirmandYear-QuarterClustering ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ TotalObservations 24473 27463 24473 27463 24473 27463 24473 27463 24473 27463 24473 27463 AdjustedR-Squared 0.0232 0.0254 0.00807 0.0114 0.00310 0.00276 0.0101 0.0101 0.0157 0.0177 0.0183 0.0176 Panel B: Retail Trading by Option Maturity ∆RetailPosition−5,−2 2to4Weeks 5to8Weeks >8Weeks (1) (2) (3) (4) (5) (6) log(AbnormalIV−5) 700.1 350.8 535.0 (4.48) (3.23) (3.58) log(MAXEA) 2217.6 2195.9 2345.1 (5.05) (8.08) (6.96) Controls ✓ ✓ ✓ ✓ ✓ ✓ Year-QuarterFixedEffects ✓ ✓ ✓ ✓ ✓ ✓ FirmandYear-QuarterClustering ✓ ✓ ✓ ✓ ✓ ✓ TotalObservations 24473 27463 24473 27463 24473 27463 AdjustedR-Squared 0.00561 0.00596 0.00489 0.00858 0.00823 0.0118 Panel C: Trading of Other Traders ∆MarketMaker−5,−2 ∆Broker/Dealer −5,−2 ∆Firm−5,−2 ∆Professional−5,−2 (1) (2) (3) (4) (5) (6) (7) (8) log(AbnormalIV−5) -563.0 -453.7 29.47 -449.2 (-2.99) (-3.32) (0.20) (-5.02) log(MAXEA) -3432.9 -2069.8 -304.1 -1047.5 (-5.60) (-5.71) (-0.74) (-4.44) Controls ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ Year-QuarterFixedEffects ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ FirmandYear-QuarterClustering ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ TotalObservations 24473 27463 24473 27463 24473 27463 24473 27463 AdjustedR-Squared 0.00608 0.00860 0.00899 0.0101 0.00361 0.00575 0.0214 0.0254 58 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 59,
    "page_range": "p.59",
    "total_pages": 65,
    "chunk_index": 95,
    "word_count": 374,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.59)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ Year-QuarterFixedEffects ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ FirmandYear-QuarterClustering ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ TotalObservations 24473 27463 24473 27463 24473 27463 24473 27463 AdjustedR-Squared 0.00608 0.00860 0.00899 0.0101 0.00361 0.00575 0.0214 0.0254 58 Electronic copy available at: https://ssrn.com/abstract=4050165 Table 5. Retail Option vs. Stock Trading and EAV This table displays regressions of the change in positions of retail investors over t=−5 to t=−2 in options marketsrelativetostockmarketsontoourtwomeasuresofexpectedannouncementvolatility,AbnormalIV −5 and MAX . Columns (1)-(2) use the ratio of unsigned delta-weighted trades to total retail buys and sells EA in the equity market, defined in (3). Columns (3)-(4) use the ratio of delta-weighted call purchases to retail buysintheequitymarket,definedin(4). Thesedependentvariablesaresummedfrommarketcloseatt=−5 tomarketcloseatt=−2,correspondingtothesametimehorizonasthedependentvariableinTable2. Retail optionpositionsareaggregatedacrossalloptionsthatexpireatleast10daysaftertheearningsannouncement and are winsorized at 2%-98%. Detailed variable definitions are given in Appendix A. Unsigned OS Ratio OS Call Buy Ratio −5,−2 −5,−2 (1) (2) (3) (4) log(AbnormalIV ) 0.00389 0.0302 −5 (2.74) (9.28) log(MAX ) 0.0198 0.0690 EA (5.89) (9.21) Volatility -0.0692 -0.0712 -0.176 -0.134 −60,−5 (-2.77) (-3.15) (-3.02) (-2.66) log(AT) -0.00905 -0.00715 -0.00122 0.000507 (-6.80) (-5.73) (-0.33) (0.14) β -0.00102 -0.00127 -0.00168 -0.00278 V (-1.31) (-1.63) (-0.95) (-1.65) EAOrder 0.0522 0.0546 -0.0181 0.00337 (1.75) (2.06) (-0.29) (0.06) IdioVol 0.0760 0.0241 2.248 2.015 (0.25) (0.09) (2.79) (2.81) skew 0.0000945 0.0000431 0.00199 0.00173 BV (0.43) (0.21) (5.46) (4.83) log(BTM) 0.000725 -0.0000879 -0.0278 -0.0311 (0.38) (-0.05) (-5.71) (-6.21) Year-Quarter Fixed Effects ✓ ✓ ✓ ✓ Firm and Year-Quarter Clustering ✓ ✓ ✓ ✓ Total Observations 24688 27722 24688 27722 Adjusted R-Squared 0.00818 0.00988 0.0365 0.0347 59 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 60,
    "page_range": "p.60",
    "total_pages": 65,
    "chunk_index": 96,
    "word_count": 260,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.60)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "0.0000431 0.00199 0.00173 BV (0.43) (0.21) (5.46) (4.83) log(BTM) 0.000725 -0.0000879 -0.0278 -0.0311 (0.38) (-0.05) (-5.71) (-6.21) Year-Quarter Fixed Effects ✓ ✓ ✓ ✓ Firm and Year-Quarter Clustering ✓ ✓ ✓ ✓ Total Observations 24688 27722 24688 27722 Adjusted R-Squared 0.00818 0.00988 0.0365 0.0347 59 Electronic copy available at: https://ssrn.com/abstract=4050165 Table 6. Pre-Announcement Price Pressure Thistabledisplaysregressionsoflog(AbnormalIV )ontomeasuresofpre-announcementretailtradingand −1 log(AbnormalIV ). Columns (1)-(3) use the measure of retail trading from Table 2, after standardizing it −5 to have zero mean and unit standard deviation; columns (4)-(6) use an indicator variable that equals one if theannouncementisintermsofthismeasure. Traderpositionsareaggregatedacrossalloptionsthatexpire at least 10 days after the earnings announcement and winsorized at 2%-98%. Detailed variable definitions are given in Appendix A. log(AbnormalIV ) −1 (1) (2) (3) (4) (5) (6) ∆Retail Position 0.123 0.0802 0.0850 −5,−2 (8.83) (8.82) (7.59) Q5 ∆Retail Position 0.416 0.336 0.394 −5,−2 (10.29) (11.88) (14.50) log(AbnormalIV ) 0.555 0.475 0.549 0.464 −5 (38.00) (28.96) (38.13) (29.55) Positions Standardized ✓ ✓ ✓ Controls ✓ ✓ Year-Quarter Fixed Effects ✓ ✓ Firm and Year-Quarter Clustering ✓ ✓ ✓ ✓ ✓ ✓ Total Observations 29114 27285 22878 30946 28939 23794 Adjusted R-Squared 0.00717 0.298 0.315 0.0124 0.296 0.319 60 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 61,
    "page_range": "p.61-62",
    "total_pages": 65,
    "chunk_index": 97,
    "word_count": 199,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.61-62)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "−5 (38.00) (28.96) (38.13) (29.55) Positions Standardized ✓ ✓ ✓ Controls ✓ ✓ Year-Quarter Fixed Effects ✓ ✓ Firm and Year-Quarter Clustering ✓ ✓ ✓ ✓ ✓ ✓ Total Observations 29114 27285 22878 30946 28939 23794 Adjusted R-Squared 0.00717 0.298 0.315 0.0124 0.296 0.319 60 Electronic copy available at: https://ssrn.com/abstract=4050165 Table 7. Straddle Return Predictability This table displays the results from portfolio sorts quarterly Fama-MacBeth regressions using returns to selling straddles, defined as SRET and SRET in (6) for the announcement-day and 10 trading days 0 1,10 post-announcement,respectively. Thestraddleforeachannouncementischosenasthenearest-to-the-money straddle with the shortest maturity that expires at least 13 days after the announcement. In Panel A, firm- quarterobservationsareplacedintoquintileseachquarter,usingquintilebreakpointsfromthepriorquarter. We then calculate the returns for each portfolio in a given quarter by taking the equal-weighted average of SRET for all firm-quarters in that portfolio. The values displayed in the left half of each table are the 0 time-series mean and t-statistics (in parenthesis) of the resulting quarterly returns. The values displayed in the right half of each table are the time-series skewness and excess kurtosis (in parenthesis) of the quarterly portfolioreturns. PanelBperformstheanalogousanalysiswithSRET . PanelCdisplaystheresultsfrom 1,10 quarterly Fama and MacBeth (1973) regressions with standard errors calculated from a frequency-domain heteroskedasticityandautocorrelationrobustequal-weightedcosineestimatorofthelong-runvariancematrix with the truncation rule suggested by Lazarus, Lewis, Stock, and Watson (2018). Panel A: Announcement-Day Portfolio Sort: AbnormalIV −1 Univariate: mean (t-stat) Univariate: skew (excess kurtosis) 1 (low AbnormalIV ) 0.07 1 (low AbnormalIV ) 0.16 −1 −1 . . . . 2 0.08 2 -0.15 . . . . 3 0.11 3 0.19 . . . . 4 0.14 4 -0.03 . . . . 5 (high AbnormalIV ) 0.18 5 (high AbnormalIV ) -0.57 −1 −1 . . . . 5 - 1 (long-short) 0.11 5 - 1 (long-short) 0.06 (19.44) (0.12) Panel B: Post-Announcement Portfolio Sort: AbnormalIV −1 Univariate: mean (t-stat) Univariate: skew (excess kurtosis) 1 (low AbnormalIV ) 0.07 1 (low AbnormalIV ) -1.60 −1 −1 . . . . 2 0.08 2 -0.69 . . . . 3 0.11 3 -1.13 . . . . 4 0.14 4 -0.99 . . . . 5 (high AbnormalIV ) 0.17 5 (high AbnormalIV ) -1.39 −1 −1 . . . . 5 - 1 (long-short) 0.09 5 - 1 (long-short) 0.49 (8.31) (0.74) Panel C on Next Page 61 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 62,
    "page_range": "p.62",
    "total_pages": 65,
    "chunk_index": 98,
    "word_count": 385,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.62)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": ". . . 4 0.14 4 -0.99 . . . . 5 (high AbnormalIV ) 0.17 5 (high AbnormalIV ) -1.39 −1 −1 . . . . 5 - 1 (long-short) 0.09 5 - 1 (long-short) 0.49 (8.31) (0.74) Panel C on Next Page 61 Electronic copy available at: https://ssrn.com/abstract=4050165 Table 7. Straddle Return Predictability (continued) Panel C: Fama-MacBeth Regressions SRET SRET 0 1,10 (1) (2) (3) (4) (5) (6) (7) (8) Intercept 0.170 0.245 0.265 0.346 0.190 0.260 0.352 0.437 [6.929] [7.961] [5.459] [8.301] [15.079] [14.776] [6.384] [7.205] log(AbnormalIV −5 ) 0.009 -0.006 0.014 0.002 0.012 -0.001 0.014 0.003 [3.406] [-3.370] [6.609] [1.076] [6.206] [-0.182] [3.457] [0.885] log(AbnormalIV −1 ) 0.027 0.028 0.024 0.025 [10.022] [18.564] [6.657] [9.684] β -0.014 -0.021 -0.005 -0.005 V [-2.056] [-1.643] [-0.427] [-0.378] ROTP -0.061 -0.058 0.039 0.053 [-2.607] [-1.979] [0.923] [1.165] EAOrder -0.229 -0.206 -0.229 -0.206 [-2.669] [-2.150] [-2.669] [-2.150] log(Volume −22,−5 ) -0.002 -0.006 -0.002 -0.006 [-0.540] [-1.654] [-0.540] [-1.654] log(AT) -0.014 -0.009 -0.014 -0.009 [-2.405] [-1.604] [-2.405] [-1.604] log(BTM) 0.002 0.003 0.016 0.015 [1.612] [1.176] [1.729] [1.673] IdioVol -0.025 -0.022 -0.026 -0.019 [-7.535] [-13.124] [-3.046] [-2.261] skewS 0.012 0.010 0.007 0.005 BV [3.412] [3.044] [4.177] [2.585] Volatility 0.006 -0.018 0.148 0.101 −60,−5 [0.318] [-0.514] [2.606] [1.712] Avg. AdjustedR-Squared 0.979% 4.086% 5.128% 8.213% 0.343% 1.18% 3.511% 4.021% TotalObservations 24,504 22,838 18,756 17,398 30,124 28,153 21,893 20,379 Avg. ObservationsperQuarter 556.9 519.0 426.3 395.4 684.6 639.8 497.6 463.2 NumberofQuarters 44 44 44 44 44 44 44 44 62 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 63,
    "page_range": "p.63-64",
    "total_pages": 65,
    "chunk_index": 99,
    "word_count": 249,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.63-64)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "0.101 −60,−5 [0.318] [-0.514] [2.606] [1.712] Avg. AdjustedR-Squared 0.979% 4.086% 5.128% 8.213% 0.343% 1.18% 3.511% 4.021% TotalObservations 24,504 22,838 18,756 17,398 30,124 28,153 21,893 20,379 Avg. ObservationsperQuarter 556.9 519.0 426.3 395.4 684.6 639.8 497.6 463.2 NumberofQuarters 44 44 44 44 44 44 44 44 62 Electronic copy available at: https://ssrn.com/abstract=4050165 Table 8. Predicting Trader Positions Post-Announcement This table displays regressions of trader positions five days after the announcement at t = 5 onto our two measures of expected announcement volatility, AbnormalIV and MAX . Columns (1) and (4) of Panel −1 EA AshowtheresultsforRetailpositions; PanelBshowstheanalogousresultsforothertraders, corresponding tospecifications(1)and(2)ofPanelA.TheothercolumnsofPanelAshowresultscorrespondingtocolumns (1)and(4)withameasureofthedispositioneffectinRetail,Retail Loss ,definedasmax(0,−Retail P&L ) 0 0 (in $) following Genesove and Mayer (2001), and the average bid-ask spread across all options on a given underlyingbetweent=1,...,5,includingtheirrespectiveinteractions. InPanelA,bothofthesevariablesare standardizedandallregressionsincludethemaineffectsofthesevariables. TraderpositionsandRetail Loss 0 are winsorized at 2%-98%. Detailed variable definitions are given in Appendix A. Panel A: Retail Positions Retail Position 5 (1) (2) (3) (4) (5) (6) log(AbnormalIV −1 ) 12615.3 11502.6 11894.9 (7.94) (6.95) (6.78) log(MAX ) 28255.8 24021.5 24550.6 EA (5.20) (4.71) (4.68) log(AbnormalIV −1 )×Retail Loss 0 11356.3 10907.7 (2.69) (2.59) log(AbnormalIV −1 )×Average Bid-Ask Spread 1,5 -2982.4 (-5.86) log(MAX )×Retail Loss 23703.5 22433.4 EA 0 (2.55) (2.43) log(MAX )×Average Bid-Ask Spread -9417.0 EA 1,5 (-5.93) Main Effects Included ✓ ✓ ✓ ✓ ✓ ✓ Controls ✓ ✓ ✓ ✓ ✓ ✓ Year-Quarter Fixed Effects ✓ ✓ ✓ ✓ ✓ ✓ Firm and Year-Quarter Clustering ✓ ✓ ✓ ✓ ✓ ✓ Total Observations 25043 24295 24292 28281 27343 27340 Adjusted R-Squared 0.0275 0.0604 0.0614 0.0270 0.0583 0.0595 Panel B: Positions of Other Traders Market Maker Broker/Dealer Firm Professional 5 5 5 5 (1) (2) (3) (4) (5) (6) (7) (8) log(AbnormalIV −1 ) -6858.2 -3905.6 -1917.8 -241.5 (-8.47) (-6.28) (-3.11) (-0.50) log(MAX ) -15899.7 -9462.4 -5750.6 -19.02 EA (-6.20) (-5.13) (-2.59) (-0.01) Controls ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ Year-Quarter Fixed Effects ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ Firm and Year-Quarter Clustering ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ Total Observations 25043 28281 25043 28281 25043 28281 25043 28281 Adjusted R-Squared 0.0365 0.0329 0.0161 0.0142 0.0125 0.0154 0.143 0.143 63 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 64,
    "page_range": "p.64",
    "total_pages": 65,
    "chunk_index": 100,
    "word_count": 358,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.64)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "✓ Year-Quarter Fixed Effects ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ Firm and Year-Quarter Clustering ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ Total Observations 25043 28281 25043 28281 25043 28281 25043 28281 Adjusted R-Squared 0.0365 0.0329 0.0161 0.0142 0.0125 0.0154 0.143 0.143 63 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 65,
    "page_range": "p.65",
    "total_pages": 65,
    "chunk_index": 101,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.65)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "Table 9. Returns of Retail Traders This table displays regressions of our estimate of the average return by Retail traders over t = 0,...,10 onto an indicator for the top quintile AbnormalIV announcements. Retail Avg. ReturnLong corresponds −1 0,10 to the average daily return in basis points of retail traders over t = 0,...,10. We calculate the return on day t by taking a weighted sum of option returns across all options in which retail traders are long with weightsproportionaltotheirpositions. Retail Avg. ReturnShort iscalculatedanalogouslyforshortpositions. 0,10 Retail Avg. ReturnWeighted is the weighted average of Retail Avg. ReturnLong and Retail Avg. ReturnShort 0,10 0,10 0,10 with weights corresponding to the relative dollar value of Retail’s aggregate long and short positions in each announcement measured at t = −1. Returns are winsorized at 2%-98%. Detailed variable definitions are given in Appendix A. Retail Return 0,10 Avg. ReturnLong Avg. ReturnShort Avg. ReturnWeighted 0,10 0,10 0,10 (1) (2) (3) (4) (5) (6) Constant -237.6 -253.6 181.0 184.9 6.525 3.922 (-11.08) (-57.88) (7.66) (34.03) (0.64) (1.08) Quintile 5 AbnormalIV -70.99 -61.47 39.78 47.01 -61.18 -49.62 −1 (-3.12) (-2.52) (1.45) (1.64) (-3.32) (-3.08) Volatility 142.3 183.0 237.5 −60,−5 (0.63) (1.39) (2.13) log(AT) 39.07 -19.16 2.850 (4.73) (-2.11) (0.67) β -7.209 -3.412 -1.536 V (-1.26) (-0.55) (-0.48) EAOrder -23.80 70.39 -44.14 (-0.17) (0.51) (-0.53) IdioVol 1370.5 -4720.0 -4295.1 (0.38) (-2.17) (-2.23) skew 2.769 -0.556 -0.114 BV (2.21) (-0.43) (-0.12) log(BTM) -0.0433 -15.04 3.815 (-0.00) (-1.50) (0.50) Controls Standardized ✓ ✓ ✓ Year-Quarter Fixed Effects ✓ ✓ ✓ Firm and Year-Quarter Clustering ✓ ✓ ✓ ✓ ✓ ✓ Total Observations 31422 26186 31796 26560 28245 23439 Adjusted R-Squared 0.000327 0.00912 0.0000856 0.0114 0.000543 0.00317 64 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 65,
    "page_range": "p.65",
    "total_pages": 65,
    "chunk_index": 102,
    "word_count": 281,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.65)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  },
  {
    "text": "log(BTM) -0.0433 -15.04 3.815 (-0.00) (-1.50) (0.50) Controls Standardized ✓ ✓ ✓ Year-Quarter Fixed Effects ✓ ✓ ✓ Firm and Year-Quarter Clustering ✓ ✓ ✓ ✓ ✓ ✓ Total Observations 31422 26186 31796 26560 28245 23439 Adjusted R-Squared 0.000327 0.00912 0.0000856 0.0114 0.000543 0.00317 64 Electronic copy available at: https://ssrn.com/abstract=4050165",
    "title": "Losing is Optional Retail Option Trading and Expected Announcement Volatility",
    "source_type": "pdf",
    "document_id": "2ff95e37905f",
    "source_file": "Losing is Optional Retail Option Trading and Expected Announcement Volatility.pdf",
    "section": "References",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 65,
    "chunk_index": 103,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230608134547Z",
    "duration": null
  }
]