[
  {
    "text": "Federal Reserve Bank of Kansas City Pu Shen is an economist at the Federal Reserve Bank of Kansas City. Douglas Rolph co-authored an earlier draft of this work entitled “Do the Spreads between the E/P Ratio and Interest Rates Contain Information on Future Equity Market Movements?” (RWP 99-03), which can be found at www.kc.frb.org/publicat/reswkpap/rwp99.htm. The author is grateful for the excellent research assis- tance provided by Jonathan Corning, a research associate at the Federal Reserve Bank of Kansas City. The views expressed in this paper are solely those of the author and do not necessarily reflect the views of the Federal Reserve Bank of Kansas City or the Federal Reserve System. Shen email: pu.shen@kc.frb.org",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Research Division",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 39,
    "chunk_index": 0,
    "word_count": 114,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Research Division (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "provided by Jonathan Corning, a research associate at the Federal Reserve Bank of Kansas City. The views expressed in this paper are solely those of the author and do not necessarily reflect the views of the Federal Reserve Bank of Kansas City or the Federal Reserve System. Shen email: pu.shen@kc.frb.org In this paper, we present a few simple market-timing strategies that appear to outperform the “buy-and-hold” strategy, with real-time data from 1970 to 2000. Our focus is on spreads between the E/P ratio of the S&P 500 index and interest rates. Extremely low spreads, as compared to their historical ranges, appear to predict higher frequencies of subsequent market downturns in monthly data. We construct “horse races” between switching strategies based on extremely low spreads and the market index. Switching strategies call for investing in the stock market index unless spreads are lower than predefined thresholds. We find that switching strategies outperformed the market index in the sense that they provide higher mean returns and lower variances. In particular, the strategy based on the spread between the E/P ratio and a short-term interest rate comfortably and robustly beat the market index even when transaction costs are incorporated. JEL classification: G10, G11, G14 Keywords: Investment, stock market, earning yields",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Abstract",
    "page_number": 2,
    "page_range": "p.2-3",
    "total_pages": 39,
    "chunk_index": 1,
    "word_count": 207,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.2-3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "that they provide higher mean returns and lower variances. In particular, the strategy based on the spread between the E/P ratio and a short-term interest rate comfortably and robustly beat the market index even when transaction costs are incorporated. JEL classification: G10, G11, G14 Keywords: Investment, stock market, earning yields Market-Timing Strategies That Worked May 2002 Few investment strategies have a worse reputation than market timing. Investors are told that their best strategy in stock investing is a simple “buy-and-hold” strategy: buy a diversified stock market index and hold it. Yet most investment literature assumes that investors will hold a security if and only if its expected return at the market price provides an adequate tradeoff with the risk exposure the security brings. In other words, investors are assumed to make their own judgment on whether a security is worth holding. Saying that investors should not “time the market” is equivalent to saying that consumers should not maximize utility when making consumption decisions.1 The standard reply to this criticism is that because the stock market is fairly efficient, accurate market timing is very difficult. In fact, it is said to be so difficult that investors are better off not trying.2 In this paper, we present a few simple market-timing strategies that would have worked well over the past three decades, using real-time data. The simplicity and effectiveness of these strategies challenge the notion that market timing is inherently difficult. We investigate strategies that focus on spreads between the E/P ratio of the S&P 500 index and interest rates. As most media attention to these spreads occurs when they are extremely high (such as in the 1970s) or extremely low (such as in 1999 and 2000), we consider whether extreme values of the spreads contain useful information for timing the market. In particular, we focus on periods when the spreads were extremely low relative to their historical values, and examine whether such low spreads are associated with market downturns in the following month. We also investigate whether extreme values of the components of the spreads predict market downturns. These strategies are, in a sense, modifications of the “buy-and-hold” strategy, rather than active market timing strategies. They are consistent with the belief that, on average, stock prices generally reflect fundamentals, but there are times, although rare, when even aggregate market prices may deviate",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Abstract",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 39,
    "chunk_index": 2,
    "word_count": 391,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "of the spreads predict market downturns. These strategies are, in a sense, modifications of the “buy-and-hold” strategy, rather than active market timing strategies. They are consistent with the belief that, on average, stock prices generally reflect fundamentals, but there are times, although rare, when even aggregate market prices may deviate",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Abstract",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 39,
    "chunk_index": 3,
    "word_count": 50,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "widely from fundamentals. Further, such rare times may be hinted at by extreme values of the spreads. For example, when the market is dominated by overly optimistic sentiment, the E/P ratio of the market index is more likely to be extremely low relative to yields of alternative investments, such as debt instruments. Therefore, extremely low values of the spreads may indicate that most stock prices are too high to be justified by fundamentals, thus it may be a good time to alter the usual “buy-and-hold” strategy and exit the stock market temporarily. Using data from 1962 to 2000, we find that the frequencies of negative monthly returns in the S&P 500 index are significantly higher when spreads at the end of the prior month were at extremely low levels. We also construct “horse races” to examine the profitability of trading on spreads. We compare a benchmark strategy, which is a buy-and-hold strategy that invests in the stock market index all the time, with alternative strategies that invest in the stock market most of the time, but switch to cash investment when the spreads are at unusually low levels. If information in the spreads is economically important, we will expect the alternative strategies to have higher risk-adjusted returns. We find that the alternative strategies indeed have better Sharpe ratios than the benchmark buy-and-hold strategy. While E/P ratios of individual stocks or portfolios are regularly used to explain the returns of the stocks or stock portfolios,3 few papers use the spreads between E/P ratios and interest rates to forecast movements of broad stock market indices. Campbell and Shiller [1998] show that the E/P ratio at the beginning of a 10-year period is negatively correlated with stock returns for the 10-year period. Lander, Orphanides, and Douvogiannis [1997] use various linear combinations of the E/P ratio and bond yields to predict returns on the S&P 500 index in a regression framework.4 Finally, Pesaran and Timmermann [1995] include both interest rates and E/P ratios as possible explanatory variables of stock market movements. None of these papers, however, has directly evaluated the usefulness of the spreads between E/P ratios and interest rates as indicators for future equity market movements.5 Many academics have tested various strategies that may be useful in timing the market.6 For example, Lander, Orphanides, and Douvogiannis [1997] tested their models’ ability to time the market. Fuller and Kling [1990, 1994] studied regression-based market-timing strategies using dividend yields. 1",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Abstract",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 39,
    "chunk_index": 4,
    "word_count": 405,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "rates as indicators for future equity market movements.5 Many academics have tested various strategies that may be useful in timing the market.6 For example, Lander, Orphanides, and Douvogiannis [1997] tested their models’ ability to time the market. Fuller and Kling [1990, 1994] studied regression-based market-timing strategies using dividend yields. 1",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Abstract",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 39,
    "chunk_index": 5,
    "word_count": 50,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "Grauer and Hakansson [1987, 1998] and Grauer, Hakansson, and Shen [1990] studied market-timing strategies that rotate among different portfolios based on a non-linear algorithm that weighs both investors’ risk attitudes and past empirical distributions of portfolios.7 The current study differs from most of the past work in that the strategy does not rely on sophisticated statistical models to explore every return advantage. As discussed earlier, the strategy is based on the belief that it is usually “good enough” to follow the buy-and-hold strategy. The strategy is simple and crude and only meant to identify the very rare times when the stock market seems so pricey that investors may be better off to avoid it.8 The rest of the paper is organized as follows. The first section examines the signaling quality of the spreads: when the spreads are below certain historical thresholds, they are interpreted as giving signals that market downturns are likely to happen in the following month. We examine the stock market performance during those months to measure the quality of the spread signals and find that extremely low spreads indeed signal a higher occurrence of imminent market downturns. The second section describes three portfolios in “horse races”. One is the benchmark buy-and-hold portfolio. Another is a portfolio that switches between stock market index and cash investment using the spread between the E/P ratio and the short-term interest rate for the signal. And the third is the switching portfolio using the spread between the E/P ratio and the long-term interest rate for the signal. We then show that, generally, the portfolios based on switching strategies outperformed the benchmark portfolio. We also discuss the impact of transaction costs and the robustness of the results. The third section describes three additional “horse races” between the same benchmark buy-and-hold portfolio and portfolios that switch between stock market index and cash investment using just components of the spreads. The last section concludes the paper. Do Spreads Provide Useful Signals? In this section, we examine whether very low spreads between the E/P ratio and interest rates, i.e. a very high P/E ratio relative to interest rates, are associated with a higher occurrence of subsequent market downturns. In other words, we use spreads as signaling devices: when the spreads are lower than 2",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Abstract",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 39,
    "chunk_index": 6,
    "word_count": 378,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "section, we examine whether very low spreads between the E/P ratio and interest rates, i.e. a very high P/E ratio relative to interest rates, are associated with a higher occurrence of subsequent market downturns. In other words, we use spreads as signaling devices: when the spreads are lower than 2",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Abstract",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 39,
    "chunk_index": 7,
    "word_count": 50,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "some pre-specified thresholds, to be defined shortly, we consider them to be signals that market downturns are imminent. In this context, we can evaluate the quality of the signals by comparing the percentage of times the spreads give the correct signal versus the percentage of times the spreads do not give the correct signal.9 We use two spreads corresponding to two interest rates: one is the yield of 3-month Treasury bills, and the other is the yield of 10-year Treasury notes. For simplicity, when the yields of 3-month Treasury bills are used in calculating the spreads, we call them short spreads; and when the yields of 10-year Treasury notes are used, we call them long spreads. We are interested in short spreads because short-term interest rates are closely related to the returns on alternative “safe” investments, which is an important factor in evaluating the stock market. In addition, short-term interest rates are highly influenced by the Federal Open Market Committee. Thus, short spreads may reflect contemporaneous monetary policy better than the long spreads. Many analysts consider the current stance of monetary policy to be an important predictor of short-term stock market movements. For example, Conover et al [1999] find that both US and international security returns are much higher during periods of expansionary monetary policy, and much lower during periods of restrictive monetary policy. We investigate long spreads because many practitioners have focused on them.10 Our sample covers the time period from January 1962 to December 2000. Spreads are calculated as follows. The E/P ratio is the reciprocal of the P/E ratio of the S&P 500 index. The earnings are the total earnings of all companies in the S&P 500 index for the previous four-quarters11 and the price is the current monthly average of the S&P 500 index.12 The short spread is the difference between the E/P ratio and the yield of 3-month Treasury bills; and the long spread is the difference between the E/P ratio and the yield of 10-year Treasury notes. Both yields are the most recent weekly averages as of the last Monday of the current month. We purposely restrict the spreads to include only past information and make no attempts to forecast either future interest rates or future earnings. This way, the signaling power of the spreads (if there is any) will not be confused as the consequence of superior forecasts of future interest rate movements or earnings growth. 3",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Abstract",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 39,
    "chunk_index": 8,
    "word_count": 404,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "spreads to include only past information and make no attempts to forecast either future interest rates or future earnings. This way, the signaling power of the spreads (if there is any) will not be confused as the consequence of superior forecasts of future interest rate movements or earnings growth. 3",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Abstract",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 39,
    "chunk_index": 9,
    "word_count": 50,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "Figures 1 and 2 show the historical short and long spreads from the beginning of 1970 to the end of 2000, and their respective tenth percentiles. We start with the first eight years of data (January 1962 - December 1969) to calculate the initial value of the 10th percentile threshold for the beginning of 1970. We use the tenth percentile of the historical range of a spread to define the threshold of the extremely low range. That is, when a spread was below its historical tenth percentile level, we consider the spread to be extremely low and thus interpreted as predicting a market downturn in the following month.13 As the spread for a particular month is used to predict the market movement in the following month, the plotted spread is shifted one month later for better visual alignment. For example, in Figure 1, at the end of 2000, the plotted short spread was –2.36%, which was based on the E/P ratio and yield on the 3-month Treasury bill at the end of November.14 Similarly, the plotted tenth percentile of the spread in December was –1.35%, which was based on all spreads from January 1962 to November 2000. The shaded areas in the figures represent low-spread months: those when the spread was below the tenth-percentile threshold based on data at the end of the previous month. Tables 1 and 2 tabulate the actual market downturns versus the predicted market downturns. When the monthly return (including dividends) of the market index was negative, it is considered an actual market downturn. We start at the beginning of 1970, as the first eight years of data are used to calculate the initial value of the tenth percentile threshold. Every month, we add the new observation and update the threshold. Thus the actual testing is from January 1970 to December 2000, with a total of 372 monthly observations. By our definition, a market downturn occurred roughly 39% of the months in the sample period (N =144). By contrast, when the short spreads “predicted” a market downturn, 51% 2 of the time a market downturn occurred in the following month. Similarly, when the long spreads “predicted” a market downturn, 45% of the time the prediction was correct. Therefore, it appears that signals produced by the spreads indeed contained useful information on how vulnerable the overall market was in the near term. 4",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Abstract",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 39,
    "chunk_index": 10,
    "word_count": 396,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "a market downturn occurred in the following month. Similarly, when the long spreads “predicted” a market downturn, 45% of the time the prediction was correct. Therefore, it appears that signals produced by the spreads indeed contained useful information on how vulnerable the overall market was in the near term. 4",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Abstract",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 39,
    "chunk_index": 11,
    "word_count": 50,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "We can also formally test the statistical significance of the signals. The null hypothesis is that the spreads produced the correct signals by mere luck. Under this null hypothesis, the number of times that the “prediction” of the spreads coincided with the actual market downturns is distributed as a hyper- geometric distribution.15 Table 3 shows the test results. The first row shows the sum of the ratios that the “signals” of the spread were correct. n /N is the ratio when the spread “predicted” that the next 1 1 monthly return of the market index would be positive and the realized return was indeed positive. n /N is the ratio when the spread “predicted” the next monthly return of the market would be negative 2 2 and it was indeed negative. Under the null hypothesis that the spreads only got it right by luck, this sum is expected to be unity. As shown in Table 3, both sums for short spreads and long spreads are bigger than unity. Further, the p-value shows the probability of achieving this performance or better by mere luck is only 1% for the short spreads, and under 9% for the long spreads.16 In other words, we can reject the null hypotheses that the signals produced by the short spreads were correct by pure chance at the 1% level, and reject the null hypothesis that signals produced by long spreads were correct by chance at the 9% level. Figures 3 and 4 show the log levels of the S&P 500 total index from January 1970 to December 2000 with shaded areas corresponding to the low-spread months. Visually, these figures suggest that the S&P 500 index tended to perform worse in the low-spread months. They also suggest that not all major market downturns were signaled by extremely low spreads. In particular, both spreads were well above their thresholds in the 1974 market downturn. Table 4 provides some statistical evidence that the stock market performs very differently when spreads are extremely low. The first column of the table shows that for the whole sample period of 372 months, the monthly total returns of the stock index averaged almost 1.1%.17 The next two columns compare the stock index performance during low-spread months and other months, based on the short spreads. For the 300 months when spread was not particularly low, the return to holding the stock market index averaged 1.5%. For the 72 low-spread months, in contrast, the return averaged negative 0.4% per 5",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Abstract",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 39,
    "chunk_index": 12,
    "word_count": 415,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "compare the stock index performance during low-spread months and other months, based on the short spreads. For the 300 months when spread was not particularly low, the return to holding the stock market index averaged 1.5%. For the 72 low-spread months, in contrast, the return averaged negative 0.4% per 5",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Abstract",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 39,
    "chunk_index": 13,
    "word_count": 50,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "month. The difference in average returns is statistically significant at the 1% level. The final two columns compare the stock index performance during low-spread months and non low-spread months, defined by the long spread. It shows that, similarly, in the low-spread months, the average returns of the stock index was lower than the average market returns of the stock index in other months, and such difference is significant at the 4% level. In addition to growing slower in low-spread months, the stock market index also tended to be more volatile in these months. One measure of volatility is the standard deviation of the growth rate of the index. As shown in Table 4, based on the short spreads, the standard deviation was 5.05% in low- spread months but only 4.23% in other months. The difference is statistically significant at the 6% level. Similarly, based on the long spreads, the standard deviation was 4.58% in low-spread months, but only 4.39% in other months, though the difference is not significant. Thus, it appears that on average the stock market performed poorly during the months when the spreads were very low, both in terms of average returns and volatility. Portfolio Switching Strategies The previous section showed that extremely low values of spreads tend to be followed by poor performance of the overall stock market, and the relationship is statistically significant. A natural question to ask is whether this information has any economic value. In this section, we construct two simple portfolio-switching strategies, which use extreme values of the short or long spreads as signals to exit the stock market temporarily. We use historical data to compare the performance of the switching strategies with a benchmark strategy, which is to simply invest in the market index all of the time. This way, our evaluation of the effectiveness of the market-timing strategies using spreads can be based on the relative performance of the switching strategies to the benchmark strategy. The comparison between the switching strategies and the “buy-and-hold” strategy suggests that the information contained in the spreads is economically important. 6",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Abstract",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 39,
    "chunk_index": 14,
    "word_count": 346,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "This way, our evaluation of the effectiveness of the market-timing strategies using spreads can be based on the relative performance of the switching strategies to the benchmark strategy. The comparison between the switching strategies and the “buy-and-hold” strategy suggests that the information contained in the spreads is economically important. 6",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Abstract",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 39,
    "chunk_index": 15,
    "word_count": 50,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "The switching strategy using short spreads as the switching signal proceeds as follows. The portfolio starts with $1 in the market index at the end of January 1970. At the end of every month, we look at the value of the short spread. If the spread is above the threshold level, which is the historical tenth percentile of the short spread, the portfolio is invested in the market index for the next whole month. If the spread is under the threshold level, the entire portfolio is liquidated at the end of month market price and invested in 30-day Treasury-bills for the entire next month. At the end of the next month, if the spread is still under the updated threshold level, the portfolio will again be 100% invested in the 30-day Treasury-bills for the following month. If the spread is above the updated threshold level, the entire portfolio will be moved into the stock index for the following month. We repeat this process at the end of every month until the end of 2000. All dividends and interest income are reinvested in the portfolio. The switching strategy using the long spread is similarly constructed except the switching signal is based on long spreads, i.e., the portfolio stays in the stock market unless the long spread is under its tenth percentile threshold. The strategies are designed to be extremely simple and to be easily implemented with real-time data. The timing of the spread variable is constructed such that the earnings are lagged one month more than price, because market price data are available earlier than earnings data. For example, the P/E ratio of the S&P 500 index for May is reported in the middle of June. To make sure that the switching strategies are feasible in real time, we use the earnings data for May and the average stock market prices for the month of June to calculate the spreads at the end of June and decide the portfolio allocation for the month of July.18 Table 5 shows some statistics of the benchmark portfolio and the two switching portfolios. Both switching portfolios did slightly better than the benchmark portfolio. The mean monthly return for investing in the market all the time for the entire 31-year period was 1.1%. In contrast, the mean monthly return for the switching portfolio using short spreads was 1.3%, and 1.2% for the switching portfolio using long spreads. Given the volatility of stock prices, it is not surprising that the differences in the mean returns are not statistically significant. The standard deviations of the mean returns of the switching 7",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Abstract",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 39,
    "chunk_index": 16,
    "word_count": 433,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "for the switching portfolio using short spreads was 1.3%, and 1.2% for the switching portfolio using long spreads. Given the volatility of stock prices, it is not surprising that the differences in the mean returns are not statistically significant. The standard deviations of the mean returns of the switching 7",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Abstract",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 39,
    "chunk_index": 17,
    "word_count": 50,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "portfolios, however, are significantly smaller than the standard deviation of the benchmark portfolio.19 Furthermore, even though the mean return differences of the switching portfolios and the benchmark are statistically insignificant, they are not trivial in dollar value. One dollar invested in January 1970 would become roughly $47 at the end of 2000 if kept in the market index all the time; it would be $66 following the switching strategy based on long spreads; and the same dollar would become $101 following the switching strategy based on short spreads. The last row of the table shows that the Sharpe ratios of both switching portfolios are higher than the Sharpe ratio of the benchmark portfolio. Both switching strategies produce portfolios with lower mean return variances. A main reason for the lower variances is that, by design, such strategies call for staying out of the market a non-trivial percentage of the time.20 In addition, both strategies are somewhat successful in avoiding periods of volatile market (Table 4).21 As switching strategies generally have lower mean return variances, a portfolio following the switching strategies with higher mean returns than the benchmark portfolio will have a higher Sharpe ratio and thus, better performance. Therefore, the rest of the discussion will be focused on mean returns. Figure 5 shows the log-values of the benchmark portfolio and the switching portfolio using short spreads as the signal. Figure 6 shows the log-values of the benchmark portfolio and the switching portfolio based on long spreads. The shaded areas in each figure are the months that the corresponding switching portfolio was out of the stock market. As the figures show, the switching strategies did not involve much trading: the switching strategy using short spreads only made 14 and a half “round-trip” trades, or 29 actual trades, for the entire sample period of 31 years. Since we use monthly data, which is equivalent to restricting the switching strategy to making decisions only at the end of each month, the total number of possible trades is the same as the number of months in the sample: 372. The switching strategy using long spreads involved a bit more trading: it made 17 “round-trip” trades, or 34 total, for the 372-month sample period. Using switching portfolios, we can now address the issue of transaction costs. As the switching strategies did not involve frequent trading, transaction costs have only limited impact on our results. 8",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Abstract",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 39,
    "chunk_index": 18,
    "word_count": 399,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "spreads involved a bit more trading: it made 17 “round-trip” trades, or 34 total, for the 372-month sample period. Using switching portfolios, we can now address the issue of transaction costs. As the switching strategies did not involve frequent trading, transaction costs have only limited impact on our results. 8",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Abstract",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 39,
    "chunk_index": 19,
    "word_count": 50,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "Assume that each trade costs one percent of the total portfolio value at the time, which is high by current standards but might be reasonable for earlier periods of the sample. Then for the switching portfolio using short spreads, its end value would be reduced by roughly 25% (0.9929 =0.747), which reduced the end value of the portfolio from $101 to $75. Comparing this number to Table 5, it is obvious that this portfolio would still produce higher mean returns and lower variance, as transaction costs have little effect on the variance of the portfolio. The impact on the switching portfolio using long spreads is slightly bigger. The same cost assumption would lower the end value of the switching portfolio using long spreads by about 29% (0.9934 =0.711), from $66 to about $47, or the same as the end value of the benchmark portfolio. Nevertheless, the variance of the portfolio would still be significantly lower than that of the benchmark portfolio. In sum, switching portfolios still outperform the benchmark buy-and- hold strategy when transaction costs are incorporated. How robust is the performance of the switching strategies to the choice of the percentile and the starting time of the sample period? The next four figures show that the switching strategies are reasonably robust. Figures 7 through 10 show the average annual returns of the benchmark and switching portfolios, relative to different choices of the switching percentile or the starting time. Figure 7 shows average annual returns for switching portfolios using the short spreads based on the choice of percentiles from the 2nd to the 30th, both before and after transaction costs, as well as the average return for the benchmark portfolio. It shows that the average net return would be higher for every switching portfolio using percentile between the 2nd and the 24th. Similarly, figure 8 shows that, with the long spreads, the average net return would be higher for every switching portfolio using percentiles between the 2nd and the 10th. Figure 9 (10) shows the average annual returns for the benchmark and switching portfolios based on the 10th percentile of the short (long) spreads, for various starting times. The figures show that switching portfolios consistently provide somewhat higher returns, whether the sample started in 1962 (the actual horse race started eight years later, in 1970), 1967 (1975), 1972 (1980), 1977 (1985), or 1982 (1990). 9",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Abstract",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 39,
    "chunk_index": 20,
    "word_count": 395,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "on the 10th percentile of the short (long) spreads, for various starting times. The figures show that switching portfolios consistently provide somewhat higher returns, whether the sample started in 1962 (the actual horse race started eight years later, in 1970), 1967 (1975), 1972 (1980), 1977 (1985), or 1982 (1990). 9",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Abstract",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 39,
    "chunk_index": 21,
    "word_count": 50,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "In summary, the horse races between the benchmark and switching portfolios suggest the following: (1) Net of transaction costs, the switching strategies produce slightly higher returns than the buy-and-hold strategy in historical data. (2) The switching strategies produce lower variances than the market index. (3) Consequently, after adjusting for risk, the switching strategies produce better performance than the benchmark portfolio, which is reflected in the higher Sharpe ratios for the switching portfolios. And (4), the switching strategies are not sensitive to the choice of the starting time of the sample. Further, the switching strategy based on the short spreads is robust to the choice of the percentile as well. In this context, market-timing strategies based on spreads would have been successful in the past thirty-one years.22 The Impact of Interest Rates One natural question to ask is whether the market-timing ability of the spreads arises from their components or from the whole spreads. To find out, we conducted horse races between the market index and switching strategies using the E/P ratio alone as the switching signal, or using yields of 3-month Treasury bills or 10-year Treasury notes alone as the signals. The results are summarized in table 6. Table 6 shows that the E/P ratio alone is not a very useful tool for market timing.23 A switching strategy that stayed in the stock market unless the E/P ratio was under its tenth percentile would have produced lower returns, but also lower volatility, than the market index. Its Sharpe ratio is slightly lower than the Sharpe ratio of the market index. Therefore, for the rest of this section, we will focus on the two switching strategies based on short-term and long-term interest rates. For switching strategies based on interest rates, the thresholds are the respective ninetieth percentile levels (interest rates were subtracted from the E/P ratio in spreads) and the portfolios are invested in the stock market unless the respective interest rate is above its historical threshold. It turns out both switching strategies using interest rates alone performed better than the market index, especially the strategy based on short rates. In fact, this strategy even outperformed the switching strategy based on 10",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Abstract",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 39,
    "chunk_index": 22,
    "word_count": 361,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "invested in the stock market unless the respective interest rate is above its historical threshold. It turns out both switching strategies using interest rates alone performed better than the market index, especially the strategy based on short rates. In fact, this strategy even outperformed the switching strategy based on 10",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Abstract",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 39,
    "chunk_index": 23,
    "word_count": 50,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "short spreads. How do we interpret this result? A casual observer may consider this strategy to be a quantified version of the common Wall Street wisdom “don’t fight the Fed”. This is because this strategy calls for investing in the stock market index unless the yield of 3-month Treasury is above its ninetieth percentile, then the whole portfolio is moved to 30-day Treasury bills. As the yield of 3-month Treasury bills is highly influenced by the Fed Funds rate, which is controlled by the Federal Open Market Committee (FOMC), it appears that this strategy calls for exiting the stock market if and only if the FOMC has been raising Fed Funds rates, that is, tightening monetary policy. This characterization of the strategy, however, is inaccurate and misleading. The above characterization is inaccurate and misleading because it does not square with historical facts. Closer examination shows that the main reason (both) switching strategies based on interest rates outperformed the benchmark stock index is that they successfully avoid being in the stock market in periods when inflation was a major problem for the economy. Figures 11 and 12 show the performance of the market index and strategies based on short rates and long rates. Shaded areas represent months that the switching portfolios were not invested in the stock market. These figures show that the outstanding performance of these switching strategies is achieved entirely in the earlier years, when runaway inflation necessitated aggressive tightening of monetary policy by the FOMC. Short-term interest rates increased as the FOMC tightened to combat the runaway inflation, while long-term interest rates skyrocketed both due to heightened inflation expectations and elevated short rates. In fact, short rates stayed above 9% for most of the months between 1979 to 1982, and long rates were in double-digit range for five consecutive years in the early 80s. As the interest rates went well above their respective ninetieth percentiles, the switching portfolio based on interest rates exited from the stock market, thus avoiding the dismal stock performance in mid 70s and early 80s. Since then, both strategies call for staying invested in the stock market even when the FOMC tightened monetary policy aggressively in 1988 and 1994.24 Therefore, the proper interpretation for the outstanding performance of the switching strategy using short-term interest rates is not that tight monetary policy is bad for the stock market, but inflation, especially runaway inflation, is detrimental to the stock market. 11",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Abstract",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 39,
    "chunk_index": 24,
    "word_count": 405,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "the FOMC tightened monetary policy aggressively in 1988 and 1994.24 Therefore, the proper interpretation for the outstanding performance of the switching strategy using short-term interest rates is not that tight monetary policy is bad for the stock market, but inflation, especially runaway inflation, is detrimental to the stock market. 11",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Abstract",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 39,
    "chunk_index": 25,
    "word_count": 50,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "Comparing figures 5 and 6 with figures 11 and 12 shows that switching strategies based on the spreads between the E/P ratio and interest rates worked differently from switching strategies based on interest rates only. For example, both strategies based on spreads exited the stock market before the 1987 market crash, while strategies based on interest rates alone stayed. Hence, it appears that spreads and their components have different information content. Regardless of the underlying mechanisms, in the whole sample period, all four strategies outperformed market index. Net of transaction costs, strategies based on short spreads or short rates are still superior to the popular buy-and-hold advice. Conclusion We examined five market-timing strategies. One uses the spread between the E/P ratio of the stock market index and the yield of 3-month Treasury bills, another uses the spread between the E/P ratio and the yield on 10-year Treasury notes. The remaining three are based on each of the components of the above two spreads. All strategies call for investing in the stock market index unless some threshold is crossed. For the two strategies based on spreads and the strategy based on the E/P ratio only, the thresholds are defined as their respective historical tenth percentiles. For the two strategies based on interest rates only, the thresholds are their respective historical ninetieth percentiles. We find that except for the strategy using only E/P ratios, all other four strategies outperformed the market index in the sense that they provide higher mean returns and lower variances. In particular, the strategies based on short spreads comfortably and robustly beat the market index even when transaction costs were incorporated. Therefore, our research suggests that it may be possible to use a simple rule-of-thumb to avoid some of the market downturns and to improve upon the widely preached buy-and-hold strategy. 12",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Abstract",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 39,
    "chunk_index": 26,
    "word_count": 304,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "the strategies based on short spreads comfortably and robustly beat the market index even when transaction costs were incorporated. Therefore, our research suggests that it may be possible to use a simple rule-of-thumb to avoid some of the market downturns and to improve upon the widely preached buy-and-hold strategy. 12",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Abstract",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 39,
    "chunk_index": 27,
    "word_count": 50,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "Basu, S. “Investment Performance of Common Stocks in Relation to Their Price Earnings Ratios: A Test of the Efficient Market Hypothesis.” The Journal of Finance, vol. 32, no. 3 (June 1977), pp.663-82. Basu, S. “The Relationship between Earnings' Yield, Market Value and Return for NYSE Common Stocks: Further Evidence.” Journal of Financial Economics, vol. 12, no. 1 (June 1983), pp.129-56. Bauer, Richard J., Jr., and Julie R. Dahlquist. “Market Timing and Roulette Wheels.” Financial Analysts Journal, vol. 57, no. 1 (January/February 2001), pp.28-40. Black, Fischer. “Noise.” The Journal of Finance, vol. 41, no. 3, (June 1986), pp.529-43. Brown, Stephen J., William N. Goetzmann, and Alok Kumar. “The Dow Theory: William Peter Hamilton's Track Record Reconsidered.” The Journal of Finance, vol. 53, no. 4 (August 1998), pp.1311-33. Campbell, John Y., and Robert J. Shiller. “Valuation Ratios and the Long-Run Stock Market Outlook.” The Journal of Portfolio Management}, vol. 24, no. 2 (Winter 1998), pp.11-26. Chan, K., Y. Hamao, and J. Lakonichok. “Fundamentals and Stock Returns in Japan.” The Journal of Finance, vol. 45, no. 5 (December 1991), pp.1739-64. Cole, Kevin, Jean Helwege, and David Laster. “Stock Market Valuation Indicators: Is This Time Different?” Financial Analysts Journal, vol. 52, no. 3 (May/June 1996), pp.56-64. Conover, M., G. Jensen, R. Johnson. “Monetary conditions and international investing,” Financial Analysts Journal, Vol. 55, no. 4 (July/August 1999), pp.38-48. Cumby, Robert E., and David M. Modest. “Testing for Market Timing Ability: A Framework for Forecast Evaluation.” Journal of Financial Economics, vol. 19, no. 1 (September 1987), pp.169-89. Dreman, D. and M. Berry. “Overreaction, Underreaction, and the Low-P/E Effect.” Financial Analysts Journal}, vol. 51, no. 4 (July/August 1995), pp.21-30. Fairfield, P. “P/E, P/B and the Present Value of Future Dividends.” Financial Analyst Journal, vol. 50, no. 4 (July/August 1994), pp. 23-31. Fama, E. and K. French. “Dividend Yields and Expected Stock Returns.” The Journal of Financial Economics, vol. 22 (October 1988), pp.3-25. Fama, E. and K. French. “The Cross-Section of Expected Stock Returns.” The Journal of Finance, vol. 46, no. 2 (June 1992), pp.427-66. Fisher, Kenneth L. and Meir Statman. “Cognitive Biases in Market Forecasts.” The Journal of Portfolio Management, vol. 27, no. 1 (Fall 2000), pp. 72-81. 13",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "References",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 39,
    "chunk_index": 28,
    "word_count": 362,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "(October 1988), pp.3-25. Fama, E. and K. French. “The Cross-Section of Expected Stock Returns.” The Journal of Finance, vol. 46, no. 2 (June 1992), pp.427-66. Fisher, Kenneth L. and Meir Statman. “Cognitive Biases in Market Forecasts.” The Journal of Portfolio Management, vol. 27, no. 1 (Fall 2000), pp. 72-81. 13",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "References",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 39,
    "chunk_index": 29,
    "word_count": 50,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "Fuller, Russell J. and John L. Kling. “Is the Stock Market Predictable?” The Journal of Portfolio Management, vol. 15, no. 4, (Summer 1990), pp.28-36. Fuller, Russell J. and John L. Kling. “Can Regression-Based Models Predict Stock and Bond Returns?” The Journal of Portfolio Management, vol. 19, no. 3, (Spring 1994), pp.56-63. Fuller, Russell J., Lex C. Huberts, and Michael J. Levinson. “Returns to E/P Strategies, Higgledy- Piggledy Growth, Analysts' Forecast Errors, and Omitted Risk Factors.” The Journal of Portfolio Management, vol. 19, no. 2 (Winter 1993), pp.13-24. Grauer, Robert R. and Hils H. Hakansson. “Gains from International Diversification: 1968-85 Returns on Portfolios of Stocks and Bonds.” The Journal of Finance, vol. 42, no. 3, (July 1987), pp.721-39. Grauer, Robert R. and Hils H. Hakansson. “On Naïve Approaches to Timing the Market: the Empirical Probability Assessment Approach with an Inflation Adapter.” In World Wide Asset and Liability Modeling, edited by William T. Ziemba and John M. Mulvey, Cambridge University Press, 1998, pp149- 81. Grauer, Robert R., Nils H. Hakansson, and Frederick C. Shen. “Industry Rotation in the U.S. Stock Market.” Journal of Banking and Finance, vol. 14, nos. 2/3 (August, 1990), pp.513-38. Henriksson, Roy D., and Robert C. Merton. “On Market Timing and Investment Performance. II. Statistical Procedures for Evaluating Forecasting Skills.” Journal of Business, vol. 54, no. 4 (October 1981), pp.513-33. Jaffe, J., D. Keim, and R. Westerfield. “Earnings Yields, Market Values, and Stock Returns.” The Journal of Finance, vol. 44, no. 1 (March 1989), pp.135-48. Kane, A., A. Marcus, and J. Noh. “The P/E Multiple and Market Volatility.” Financial Analysts Journal, vol. 52, no. 4 (July/August 1996), pp.16-24. Lander, Joel, Athanasios Orphanides, and Martha Douvogiannis. “Earnings Forecasts and the Predictability of Stock Returns: Evidence from Trading the S&P.” The Journal of Portfolio Management}, vol. 23, no. 4 (Summer 1997), pp.24-35. Lettau Martin and Sydney Ludvigson. “Consumption, Aggregate Wealth, and Expected Stock Returns.” The Journal of Finance, vol. 56, no. 3. (June 2001), pp.815-49. Merton, Robert C. “On Market Timing and Investment Performance. I. An Equilibrium Theory of Value for Market Forecasts.” Journal of Business, vol. 54, no. 3 (July 1981), pp.363-406. Owen, Lamont. “Earnings and Expected Returns.” The Journal of Finance, vol.53, no. 5 (October 1998), pp.1563-87. Pesaran, M. Hashem, and Allan Timmermann. “Predictability of Stock Returns: Robustness and Economic Significance.” The Journal of Finance, vol. 50, no. 4 (September 1995), pp.1201-28. Roll, R. “Style Return Differentials: Illusions, Risk Premia, or Investment Opportunities?” Working Paper, 1994. University of California, Los Angeles. 14",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "References",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 39,
    "chunk_index": 30,
    "word_count": 413,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "no. 5 (October 1998), pp.1563-87. Pesaran, M. Hashem, and Allan Timmermann. “Predictability of Stock Returns: Robustness and Economic Significance.” The Journal of Finance, vol. 50, no. 4 (September 1995), pp.1201-28. Roll, R. “Style Return Differentials: Illusions, Risk Premia, or Investment Opportunities?” Working Paper, 1994. University of California, Los Angeles. 14 Shiller, Robert J. “Stock Prices and Social Dynamics.” Brookings Paper on Economic Activity. 1984, pp.457-98. Sullivan, Ryan, Allan Timmermann, and Halbert White. “Data-Snooping, Technical Trading Rule Performance, and the Bootstrap.” The Journal of Finance, vol. 54, no. 5 (October 1999), pp.1647-91. 15",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "References",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 39,
    "chunk_index": 31,
    "word_count": 92,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "Paper, 1994. University of California, Los Angeles. 14 Shiller, Robert J. “Stock Prices and Social Dynamics.” Brookings Paper on Economic Activity. 1984, pp.457-98. Sullivan, Ryan, Allan Timmermann, and Halbert White. “Data-Snooping, Technical Trading Rule Performance, and the Bootstrap.” The Journal of Finance, vol. 54, no. 5 (October 1999), pp.1647-91. 15",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Endnotes",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 39,
    "chunk_index": 32,
    "word_count": 50,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Endnotes (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "1 With the benefit of hindsight, many of us may wish we had timed the market in March 2000 when, to the best of our judgment, most stocks appeared to be ridiculously expensive. 2 Bauer and Dahlquist [2001] provide a review of the literature and the consensus. 3 A number of studies document the ability of E/P ratios to predict future returns of individual stocks or portfolios. These include Basu [1977], Basu [1983], Chan et al [1991], Cole et al [1996], Dreman and Berry [1995], Fairfield [1994], Fama and French [1992], Fuller et al [1993], Jaffe et al [1989], and Roll [1994]. Overall, the evidence on the predictive power of the ratios is mixed. 4 They propose that there is a linear relationship between E/P ratio and bond yields, and when such equilibrium is violated, market prices move slowly back towards the equilibrium level. This slow adjustment of market prices gives rise to the predictive power of their model. 5 The E/P ratio, also called earnings yield, is studied in Shiller [1984], Fama and French [1988], and Lamont [1998] as well, though it is not the main focuses of these papers. 6 Fuller and Kling [1990, 1994] provided good discussions on inherent difficulties in finding market timing strategies that are truly useful to investors. Some of their concerns revolve around the issue of “data-snooping”, which is addressed statistically in Sullivan, Timmermann, and White [1999]. 7 More recently, Lettau and Ludvigson [2001] suggested that the deviations from the estimated cointegration vector of consumption, labor income and asset holdings seem to do a better job in out-of-sample forecasts than many popular financial variables such as dividend yields, dividend payout ratios, etc. While such a finding raised the possibility that this constructed macroeconomic variable may be useful in devising a market-timing strategy, they did not pursue this route. 8 The advantage of a simple and crude strategy is that it may suffer less from the potential “data-snooping” problem. 9 Evaluating spreads on their signaling properties is closest to the way spreads are used by popular press and practitioners. Most practitioners do not claim that spreads are highly correlated with future market returns. Instead, they typically use the extremely low values of spreads as an indication that overall market conditions are unusually vulnerable. 10 One cited reason for using long-term interest rates is the following. Stock prices should be equal to the discounted sum of their expected future earnings, most of which will only be realized in the distant future; therefore the long-term interest rates are more likely to be related to the discount rate used in valuing stock prices. This argument, however, can also be used to justify the use of short rates. Notice that in the discounted earnings model the proper discount rate to use is the risk-free rate plus the risk premium. There is little reason to expect that the yield on a long-term Treasury security is a good proxy for the discount rate for the future earnings on stocks, as the risk premium for Treasury bonds is likely to be very different from the risk premium for stocks. On the other hand, the short rate is, at least, a good proxy for the risk-free rate in the near term. 11 Earnings for the most recent quarter are typically monthly updated estimation, weighted by the market capitalization at the end of the most recent quarter. 16",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Endnotes",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 39,
    "chunk_index": 33,
    "word_count": 565,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Endnotes (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "premium for stocks. On the other hand, the short rate is, at least, a good proxy for the risk-free rate in the near term. 11 Earnings for the most recent quarter are typically monthly updated estimation, weighted by the market capitalization at the end of the most recent quarter. 16",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Endnotes",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 39,
    "chunk_index": 34,
    "word_count": 50,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Endnotes (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "12 For example, the P/E ratio for December 1998 is calculated as follows. The numerator is the monthly average of S&P 500 index for December 1998. The denominator is the total weighted average earnings of the companies in the index for the forth quarter of 1997, and the first, second, and third quarter of 1998, with the weights updated to the end of September, 1998. 13 The choice of the tenth percentile as the threshold is somewhat arbitrary. We want to define an “extreme range” for the spreads, thus the twentieth percentile seems too generous. The fifth percentile, on the other hand, maybe too extreme. More importantly, with eight years of monthly data to start, the ninth lowest observations define the value of tenth percentile at the beginning of the sample, as there were only ninety-six monthly observations to begin with. If the fifth percentile is chosen, that will leave us with only four observations to start with. Another reason for choosing the tenth percentile is that it can be interpreted as if the stock market only deviates far away from fundamentals 10% of the time, which is consistent with Black’s estimation. We decide to expand the sample size in calculating the threshold instead of using a fixed length sample size because we do not want to throw away observations that are less than forty years old, as there seem to be many similarities between the macroeconomic conditions in the early sixties and late nineties. At the end of the section, we will show that our conclusion is robust to the choice of the percentiles or the starting time of the experiment. 14 In fact, to insure that the switching strategies only use real time data, earnings data are another month older, which would be on the end of October in the above example. More detailed discussion is provided later in the text. 15 For details of the test, see Henriksson and Merton [1981], and Cumby and Modest [1987]. Merton [1981] provides some excellent theoretical background discussions. 16 Prob(n ≥ 193|N=372, N =228,M=300)=0.0103; Prob(n ≥ 180|N=372,N =228,M=284)=0.0872. 1 1 1 1 17 The use of the nominal index exaggerates the real return to investors because inflation averaged about 0.4 percent per month during the period. 18 As a robustness check, we have also simulated the switching portfolios with the entire P/E ratio lagged for a month. Nothing changed qualitatively. 19 The sub-sample variances are calculated with respect to the sub-sample means. As shown in the table, the sub- sample means of the stock index were significantly lower when the switching portfolios were out of the market. Therefore, it is likely that the sub-sample variances would be higher if they were calculated with respect to the whole sample mean. 20 Brown et al [1998] also take note that the risk to investors is lower when they are out of the stock market. Careful readers may notice that the actual months of either switching portfolios were not in the market were more than 10%. This is mainly due to the factor that the tenth percentile values of the spreads were real time. We do not want to use the entire sample tenth percentile point because that would make the switching strategies non- implementable in real time framework. During our sample period, both tenth percentile values for long spreads and short spreads declined noticeably which caused the actual switching out time higher than 10 percent. If we had used the whole sample tenth percentile values for the entire sample, then some of the earlier switching out would not have had happened and the months either portfolio were out of the market would have been exactly 10 percent. 17",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Endnotes",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 39,
    "chunk_index": 35,
    "word_count": 615,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Endnotes (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "switching out time higher than 10 percent. If we had used the whole sample tenth percentile values for the entire sample, then some of the earlier switching out would not have had happened and the months either portfolio were out of the market would have been exactly 10 percent. 17 21 Kane et al [1996] find a strong relationship between P/E ratios and the level of stock market volatility. 22 An interesting question and possible future research topic is why such market-timing strategies worked. Market analysts have been using spreads as a rule-of-thumb measure of stock market valuations for a long time. The switching strategies described above are all very simple and implementing them requires neither private information nor statistical knowledge. Therefore, ex ante, one would expect that any information contained in the spreads (or interest rates) should already be fully reflected in market prices, rendering those strategies useless. To us, the fact that such simple strategies seem to work well in the past three decades is both interesting and puzzling. 23 This is consistent with other researchers’ work (e.g. Fisher and Statman [2000]). 24 As inflation declined, the levels of interest rates were well below the extremely high levels set in the high inflation era, despite the aggressive tightening of monetary policy. In fact, these two strategies would be identical to the benchmark “buy-and-hold” strategy if we move the starting time of the sample period to 1975 (and the starting time for the horse race to 1983). 18",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Endnotes",
    "page_number": 21,
    "page_range": "p.21-22",
    "total_pages": 39,
    "chunk_index": 36,
    "word_count": 249,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Endnotes (p.21-22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "levels set in the high inflation era, despite the aggressive tightening of monetary policy. In fact, these two strategies would be identical to the benchmark “buy-and-hold” strategy if we move the starting time of the sample period to 1975 (and the starting time for the horse race to 1983). 18 Table 1. Comparison of realized monthly stock market returns and signals produced by the short spreads Positive realized Negative realized Total number of returns returns occurrences Signal of positive stock market returns n = 193 107 M = 300 1 Signal of negative stock market returns 35 n = 37 72 2 Total number of occurrences N = 228 N = 144 N = 372 1 2 Table 2. Comparison of realized monthly stock market returns and signals produced by the long spreads Positive realized Negative realized Total number of returns returns occurrences Signal of positive stock market returns n = 180 104 M = 284 1 Signal of negative stock market returns 48 n = 40 88 2 Total number of occurrences N = 228 N = 144 N = 372 1 2 Table 3. Henriksson and Merton tests on the significance of the spread signals Short spreads Long spreads n + n 1 2 N N 1.1034 1.0673 1 2 p-values 0.0106 0.0872",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Endnotes",
    "page_number": 22,
    "page_range": "p.22-25",
    "total_pages": 39,
    "chunk_index": 37,
    "word_count": 215,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Endnotes (p.22-25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "= 40 88 2 Total number of occurrences N = 228 N = 144 N = 372 1 2 Table 3. Henriksson and Merton tests on the significance of the spread signals Short spreads Long spreads n + n 1 2 N N 1.1034 1.0673 1 2 p-values 0.0106 0.0872 Table 4. Performances of the S&P 500 Total Index in Different Periods When short When short When long When long Entire spreads are spreads spreads are spreads sample NOT ARE NOT ARE period extremely extremely extremely extremely low low low low Mean monthly 0.01117 0.01482 -0.00403 0.01387 0.00244 returns Test of same mean for the two periods 0.0042 0.0406 (p-values) Monthly standard 0.04455 0.04230 0.05048 0.04389 0.04579 deviations Test of same sample standard deviation for 0.0600 0.6258 the two periods (p-values) Total number of 372 300 72 284 88 months Table 5. Switching Strategies versus Benchmark. Switching strategy Switching strategy Benchmark using short spreads using long spreads Mean monthly returns 0.01117 0.01322 0.01206 Test against benchmark 0.5000 0.7712 (p-values) Sample standard deviations 0.00231 0.00198 0.00200 Test against benchmark 0.0028 0.0050 (p-values) End values of portfolios ($) 46.65 101.39 65.57 Sharpe ratios 0.130 0.205 0.173 Table 6. Switching Strategies Based on Components of the Spreads versus Benchmark. Switching Switching Switching Benchmark strategy using strategy using strategy using E/P ratio short rates long rates Mean monthly returns 0.01117 0.01020 0.01337 0.01137 Test against benchmark 0.7475 0.4688 0.9453 (p-values) Sample standard 0.00231 0.00194 0.00197 0.00188 deviations Test against benchmark 0.0009 0.0021 0.0001 (p-values) End values of portfolios ($) 46.65 36.46 106.69 52.36 Sharpe ratios 0.130 0.128 0.210 0.165",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Endnotes",
    "page_number": 25,
    "page_range": "p.25-27",
    "total_pages": 39,
    "chunk_index": 38,
    "word_count": 265,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Endnotes (p.25-27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "using E/P ratio short rates long rates Mean monthly returns 0.01117 0.01020 0.01337 0.01137 Test against benchmark 0.7475 0.4688 0.9453 (p-values) Sample standard 0.00231 0.00194 0.00197 0.00188 deviations Test against benchmark 0.0009 0.0021 0.0001 (p-values) End values of portfolios ($) 46.65 36.46 106.69 52.36 Sharpe ratios 0.130 0.128 0.210 0.165 Figure 1: percentage Short Spread and Its 10th Percentile percentage points points 6 6 4 4 Short Spread 2 2 0 0 -2 10th Percentile -2 -4 -4 -6 -6 70 72 74 76 78 80 82 84 86 88 90 92 94 96 98 00 The Short Spread is the difference between the S&P 500 Index E/P ratio and the yield on the 3 month Treasury Bill. Shaded areas indicate periods the spread fell below its 10th percentile. Figure 2: percentage percentage Long Spread and Its 10th Percentile points points 6 6 4 4 2 2 Long Spread 0 0 -2 -2 10th Percentile -4 -4 -6 -6 70 72 74 76 78 80 82 84 86 88 90 92 94 96 98 00 The Long Spread is the difference between the S&P 500 Index E/P ratio and the yield on the 10 year Treasury Note. Shaded areas indicate periods the spread fell below its 10th percentile. Figure 3: S & P 500 Index vs. Short Spread Signals 4.5 4.0 3.5 3.0 2.5 2.0 1.5 1.0 0.5 0.0 -0.5 70 72 74 76 78 80 82 84 86 88 90 92 94 96 98 00 Line shows Log of S&P 500 index (dividends included), normalized to 0 at January 1970. Shaded areas indicate periods the Short Spread fell below its 10th percentile.",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Endnotes",
    "page_number": 28,
    "page_range": "p.28-30",
    "total_pages": 39,
    "chunk_index": 39,
    "word_count": 273,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Endnotes (p.28-30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "2.5 2.0 1.5 1.0 0.5 0.0 -0.5 70 72 74 76 78 80 82 84 86 88 90 92 94 96 98 00 Line shows Log of S&P 500 index (dividends included), normalized to 0 at January 1970. Shaded areas indicate periods the Short Spread fell below its 10th percentile. Figure 4: S & P 500 Index vs. Long Spread Signals 4.5 4.0 3.5 3.0 2.5 2.0 1.5 1.0 0.5 0.0 -0.5 70 72 74 76 78 80 82 84 86 88 90 92 94 96 98 00 Line shows Log of S&P 500 index (dividends included), normalized to 0 at January 1970. Shaded areas indicate periods the Long Spread fell below its 10th percentile. Figure 5: Benchmark vs. Switching Strategy Based on Short Spreads (Log Levels) 5.0 5.0 4.5 4.5 4.0 Switching 4.0 3.5 3.5 3.0 3.0 2.5 2.5 Benchmark 2.0 2.0 1.5 1.5 1.0 1.0 0.5 0.5 0.0 0.0 -0.5 -0.5 70 72 74 76 78 80 82 84 86 88 90 92 94 96 98 00 The Short Spread is the difference between the S&P 500 Index E/P ratio and the yield on the 3 month Treasury Bill. Shaded areas indicate periods the spread fell below its 10th percentile. Figure 6: Benchmark vs. Switching Strategy Based on Long Spreads (Log Levels) 5.0 5.0 4.5 4.5 Switching 4.0 4.0 3.5 3.5 3.0 3.0 2.5 2.5 Benchmark 2.0 2.0 1.5 1.5 1.0 1.0 0.5 0.5 0.0 0.0 -0.5 -0.5 70 72 74 76 78 80 82 84 86 88 90 92 94 96 98 00 The Long Spread is the difference between the S&P 500 Index E/P ratio and the yield on the 10 Year Treasury Note. Shaded bars indicate periods the spread fell below its 10th percentile.",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Endnotes",
    "page_number": 31,
    "page_range": "p.31-33",
    "total_pages": 39,
    "chunk_index": 40,
    "word_count": 289,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Endnotes (p.31-33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "-0.5 70 72 74 76 78 80 82 84 86 88 90 92 94 96 98 00 The Long Spread is the difference between the S&P 500 Index E/P ratio and the yield on the 10 Year Treasury Note. Shaded bars indicate periods the spread fell below its 10th percentile. Figure 7: Average Annual Returns Using the Short Spread with Different Percentiles 18% 18% 17% 17% Gross 16% 16% 15% 15% Net 14% 14% 13% 13% Benchmark 12% 12% 11% 11% 10% 10% 9% 9% 8% 8% 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 Percentiles Figure 8: Average Annual Returns Using the Long Spread with Different Percentiles 18% 18% 17% 17% Gross 16% 16% 15% 15% Net 14% 14% 13% 13% Benchmark 12% 12% 11% 11% 10% 10% 9% 9% 8% 8% 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 Percentiles Figure 9: Average Annual Returns Using the Short Spread with Different Sample Periods 25% 25% Gross Net Benchmark 20% 20% 15% 15% 10% 10% 5% 5% 0% 0% 1970 -- 2000 1975 -- 2000 1980 -- 2000 1985 -- 2000 1990 -- 2000 Figure 10: Average Annual Returns Using the Long Spread with Different Sample Periods 25% 25% Gross Net Benchmark 20% 20% 15% 15% 10% 10% 5% 5% 0% 0% 1970 -- 2000 1975 -- 2000 1980 -- 2000 1985 -- 2000 1990 -- 2000",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Endnotes",
    "page_number": 34,
    "page_range": "p.34-37",
    "total_pages": 39,
    "chunk_index": 41,
    "word_count": 270,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Endnotes (p.34-37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  },
  {
    "text": "2000 1985 -- 2000 1990 -- 2000 Figure 10: Average Annual Returns Using the Long Spread with Different Sample Periods 25% 25% Gross Net Benchmark 20% 20% 15% 15% 10% 10% 5% 5% 0% 0% 1970 -- 2000 1975 -- 2000 1980 -- 2000 1985 -- 2000 1990 -- 2000 Figure 11: Benchmark vs. Switching Strategy Based on Short Rates Only (Log Levels) 5.0 5.0 4.5 4.5 4.0 4.0 Switching 3.5 3.5 3.0 3.0 2.5 2.5 Benchmark 2.0 2.0 1.5 1.5 1.0 1.0 0.5 0.5 0.0 0.0 -0.5 -0.5 70 72 74 76 78 80 82 84 86 88 90 92 94 96 98 00 The short rate is the yield on the 3 month Treasury Bill. Shaded areas indicate periods the short rate rose above its 90th percentile. Figure 12: Benchmark vs. Switching Strategy Based on Long Rates Only (Log Levels) 5.0 5.0 4.5 4.5 4.0 4.0 3.5 3.5 Switching 3.0 3.0 2.5 2.5 Benchmark 2.0 2.0 1.5 1.5 1.0 1.0 0.5 0.5 0.0 0.0 -0.5 -0.5 70 72 74 76 78 80 82 84 86 88 90 92 94 96 98 00 The long rate is the yield on the 10 year Treasury Note. Shaded areas indicate periods the long rate rose above its 90th percentile.",
    "title": "Market - Timing Strategies That Worked?",
    "source_type": "pdf",
    "document_id": "026a0ca6f5f4",
    "source_file": "MARKET-TIMING STRATEGIES THAT WORKED.pdf",
    "section": "Endnotes",
    "page_number": 38,
    "page_range": "p.38-39",
    "total_pages": 39,
    "chunk_index": 42,
    "word_count": 208,
    "author": "j1pxsr4",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Endnotes (p.38-39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020516165119-05'00'",
    "duration": null
  }
]