[
  {
    "text": "Mean reversion - A new approach Tarek Nassar, Sandro Ephrem August 27, 2020 1 Introduction Mean reversion is an all-time favourite of quantitative traders and has been used in trading strategies for the equities, fixed income, FX and commodities markets. The basic idea is perhaps best expressed by examining stock prices. Stock markets follow a \"staircase\" like curve that looks like the superposition of a piecewise continuous curve and an oscillatory, quasi-periodic process where the price evolution looks like a “rugged” staircase which sometimes goes up and sometimes goes down as illustrated by the figure 1 below for the Nasdaq index: Figure 1: Nasdaq historical prices In figure 1 above, the \"staircase\" we are referring to is shown by the straight lines in different colors. Overall the “staircase” points up and this is natural due to inflation and natural growth. If we subtract the “staircase” from the Nasdaq in the graph above we get the following graph: 1 Electronic copy available at: https://ssrn.com/abstract=3682487",
    "title": "Mean Reversion A New Approach",
    "source_type": "pdf",
    "document_id": "113117190374",
    "source_file": "Mean Reversion A New Approach.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 13,
    "chunk_index": 0,
    "word_count": 163,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200827174316+03'00'",
    "duration": null
  },
  {
    "text": "are referring to is shown by the straight lines in different colors. Overall the “staircase” points up and this is natural due to inflation and natural growth. If we subtract the “staircase” from the Nasdaq in the graph above we get the following graph: 1 Electronic copy available at: https://ssrn.com/abstract=3682487 Figure 2: Nasdaq de-trended We note that this second graph looks somewhat chaotic except for an interesting feature: it looks almost periodic. This almost-periodicity is called “mean reversion” and is typically modeled via the Ornstein-Uhlenbeck process, who first developed the model in physics to account for the motion of a Brownian particle under the effect of friction. Why do we see this kind of behaviour? There are a thousand theories and although we do not propose to go through these in any detail, a cursory look is instructive. Trends (as illustrated by figure 1) usually occur because of: • Macro changes across the entire economy, such as the one the world is currently undergoing with the COVID-19 pandemic • Changes in the specific industry of the company’s whose stock is being traded (e.g. the introduction of 3G licences in the early 2000’s) • Herd behaviour (almost any financial crisis in the past 50 years would be a fitting example) • Exogenous factors such as political turmoil (9/11 terror attacks) or natural events (2004 tsunami) • Corporate events (earnings forecasts, mergers and acquisitions, share buybacks etc.) • Substantive changes in monetary or fiscal policy by central banks The list is not exhaustive but it showcases some of the potential explanatory factors for the be- haviour of stock prices. With the exception of herd behaviour, all of the above factors are discrete in nature: we do not have new and impactful news on the economy or on specific companies or industrial sectors every day and, mercifully, we do not have major wars or climatic calamities every other month! 2 Electronic copy available at: https://ssrn.com/abstract=3682487",
    "title": "Mean Reversion A New Approach",
    "source_type": "pdf",
    "document_id": "113117190374",
    "source_file": "Mean Reversion A New Approach.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 13,
    "chunk_index": 1,
    "word_count": 322,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200827174316+03'00'",
    "duration": null
  },
  {
    "text": "behaviour, all of the above factors are discrete in nature: we do not have new and impactful news on the economy or on specific companies or industrial sectors every day and, mercifully, we do not have major wars or climatic calamities every other month! 2 Electronic copy available at: https://ssrn.com/abstract=3682487",
    "title": "Mean Reversion A New Approach",
    "source_type": "pdf",
    "document_id": "113117190374",
    "source_file": "Mean Reversion A New Approach.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 13,
    "chunk_index": 2,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200827174316+03'00'",
    "duration": null
  },
  {
    "text": "Butpriceschangeneverthless: thisisreflectedbythemeanreversionseeninfigure2. Whydoes it happen? The reason may be deceptively simple: few market agents have long trading horizons andassuch,tendtotakeprofitorstoplossontheirpositionswithinashorttimeperiod. Sincemost traders have access to substantially similar information, if it so happens that the market is in an uneventful period, there will be as many buyers as sellers. Putting this together gives a behaviour that closely mimics the mean reversion we observe in the market. During this quasi-periodic part, statistical arbitrage takes place. This basically exploits price mean reversion: when the price is considerably above its expected mean, one sells in the expectation that this price will drop and vice-versa. But the devil is in the detail, namely, where is the mean and when exactly are we “considerably above (or below) the mean”? Statistical arbitrage is old and widely practised but it is far from being completely understood or mastered. The literature on mean reversion is vast. In references [2,6,8,18], the basics of mean reversionanditsapplicationsinvariousmarketsarediscussed. Extensionstothebasicaffineframe- workarediscussedin[5,12]wheresolvablemeanrevertingmodelswithnonlineardriftarepresented while in [14] the nonlinearity is in the diffusion (Brownian motion) term. More recently with the advent of real life use cases of artificial intelligence, the use of neural networks in trading has also becomeextensive: in[3],reinforcementlearningmethodsareappliedtopairstradingstrategies,the precursorsofmoststatisticalarbitragetrades. In[15],neuralnetworksareusedtooptimisetrading strategies when the underlying return dynamics are given by an Ornstein-Uhlenbeck process while in [16], the impact of transaction costs is explicitly taken into account. In [1], statistical arbitrage basedonmeanreversionfortheUSequitymarketsusingPCAfactorsandsectorETFsisdiscussed. In this paper we start by recalling recent approaches to statistical arbitrage and mean reversion and then proceed to present a new approach that combines model-independence (through the use of neural networks) with information theory. 2 Mean reversion - the basics Typically, practitioners approach mean reversion by modeling stock returns using an Ornstein- Uhlenbeck model (known in the fixed income world as the Vasicek model) or variants thereoff. For instance if we denote by P(i) the price of the ith security, a mean reversion model would be: t (cid:16) (cid:17) x(i) −x(i) =κ(i) µ(i)−x(i) +σ (cid:15)(i) (1) t+1 t t i t+1 where the beta hedged portfolio is defined as: x(i) =P(i)− (cid:88) Λ F(α)−η (2) t t iα t i α ThefactorsF(α) areusuallytakentorepresentmarketbeta,e.g. thereturnsonsectorETFsso t thatequation(1)canbeviewedasthecumulativeeffectofamarketwidetrendandastock-specific (idiosyncratic) component. The inclusion of these factors is essential since otherwise, the trends typically seen over sustained periods cannot be captured. The process in (2) is mean reverting and allows us to calculate the idiosyncratic return: (cid:16) (cid:17) R(i) =κ(i) µ(i)−x(i) +σ (cid:15)(i) (3) t+1 t i t+1 Meanreversioninthecontextoftheprocessin(2)isusuallyunderstoodasfollows. Thevariables (cid:15)(i) for t > 0 are generally assumed to be N(0,1) and uncorrelated. This means that, taking the t expected value (2) gives: (cid:16) (cid:17) ρ(i) −ρ(i) =κ(i) µ(i)−ρ(i) (4) t+1 t t 3 Electronic copy available at: https://ssrn.com/abstract=3682487",
    "title": "Mean Reversion A New Approach",
    "source_type": "pdf",
    "document_id": "113117190374",
    "source_file": "Mean Reversion A New Approach.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 13,
    "chunk_index": 3,
    "word_count": 440,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200827174316+03'00'",
    "duration": null
  },
  {
    "text": "=κ(i) µ(i)−x(i) +σ (cid:15)(i) (3) t+1 t i t+1 Meanreversioninthecontextoftheprocessin(2)isusuallyunderstoodasfollows. Thevariables (cid:15)(i) for t > 0 are generally assumed to be N(0,1) and uncorrelated. This means that, taking the t expected value (2) gives: (cid:16) (cid:17) ρ(i) −ρ(i) =κ(i) µ(i)−ρ(i) (4) t+1 t t 3 Electronic copy available at: https://ssrn.com/abstract=3682487",
    "title": "Mean Reversion A New Approach",
    "source_type": "pdf",
    "document_id": "113117190374",
    "source_file": "Mean Reversion A New Approach.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 13,
    "chunk_index": 4,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200827174316+03'00'",
    "duration": null
  },
  {
    "text": "where: (cid:104) (cid:105) ρ(i) =E x(i) (5) t t which solves out to: (cid:16) (cid:17) ρ(i) = x(i)−µ(i) e−κ(i)t+µ(i) (6) t 0 As t→∞,ρ →µ(i), i.e. to a long term equilibrium value: we say that the variable x(i) reverts t t back to it’s mean. If κ(i) is large enough, we see that, regardless of the value of x(i), reversion will 0 happen quickly. Plugging this back into (1) we see that the return on the portfolio consisting of S(i) − (cid:80) Λ F(α) will revert to µ(i) quickly. This presents a trading opportunity: if the current t α iα t value of the signal x(i) is below µ(i), we go long and vice-versa since we know we don’t need to wait t for long before the return goes back to µ(i): this is the essence of mean reversion. Before discussing the estimation of the signal x(i), let’s recapitulate explicitly the two assumptions t needed for mean reversion to work: 1. the errors (cid:15)(i) are decorrelated with a mean of zero and t (cid:104) (cid:105) 2. the mean ρ(i) =E x(i) has to tend to some fixed equilibrium value t t When these assumptions are met the problem reduces to determining the values of the mean rever- sion parameters Λ and b . A brute force approach is the basic regression model where the mean iα i reversion parameters are calculated by minimising the overall error over some sample: (cid:15)2 = (cid:88) T (cid:88) N (cid:32) P t ( + i) 1 −P t (i) − (cid:88) Λ F t ( + α 1 ) −F t (α) −η (cid:33) 2+ (cid:88) T (cid:88) N (cid:16) x(i) −x(i)−κ(i) (cid:16) µ(i)−x(i) (cid:17)(cid:17) 2 P(i) iα F(i) i t+1 t t t=1 i=1 t α t t=1 i=1 (7) As the factors F may be highly correlated, a Tikhonov regularisation approach (sometimes also known as a “ridge regression” in this context) is typically used where instead of minimising (7) one adds a penalty term: (cid:16) (cid:17) L=(cid:15)2+λ (cid:107)Λ(cid:107)2−1 (8) Alternatively,wecanfirstdetermineΛandη throughalinearregressionbetweenthestockannd the factors and then estimate equation (1) separately. Whatever the method used, the resulting residuals are then used to detect potential trades. The specific trading rule obviously depends on individual preferences but the typical elements that go into the trade decision are: 1. if the current signal is above or below a certain “threshold” number of standard deviations from the mean (where such thresholds depend on the investor’s risk aversion): (cid:16) (cid:17) κ(i) µ(i)−x(i) >n σ (9) t sell i (cid:16) (cid:17) κ(i) µ(i)−x(i) <n σ (10) t buy i 2. another parameter of importance in setting mean reversion based trades is the typical time before a deviation from the mean is corrected. This is given by the first passage time of the Ornsetin Uhlenbeck process (see [13]). The exact expression in [13] is complicated and semi-analytical but, to gainsome intuition, we canconsiderthefirstpassage timeof theerror (cid:15)(i), i.e. we are asking for the typical value of the variable: t (cid:16) (cid:17) (cid:16) (cid:17) τˆ t,(cid:15)(i) =argmin (cid:15)(i) =0 (11) t s>0 t+s 4 Electronic copy available at: https://ssrn.com/abstract=3682487",
    "title": "Mean Reversion A New Approach",
    "source_type": "pdf",
    "document_id": "113117190374",
    "source_file": "Mean Reversion A New Approach.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 13,
    "chunk_index": 5,
    "word_count": 516,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200827174316+03'00'",
    "duration": null
  },
  {
    "text": "[13]). The exact expression in [13] is complicated and semi-analytical but, to gainsome intuition, we canconsiderthefirstpassage timeof theerror (cid:15)(i), i.e. we are asking for the typical value of the variable: t (cid:16) (cid:17) (cid:16) (cid:17) τˆ t,(cid:15)(i) =argmin (cid:15)(i) =0 (11) t s>0 t+s 4 Electronic copy available at: https://ssrn.com/abstract=3682487",
    "title": "Mean Reversion A New Approach",
    "source_type": "pdf",
    "document_id": "113117190374",
    "source_file": "Mean Reversion A New Approach.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 13,
    "chunk_index": 6,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200827174316+03'00'",
    "duration": null
  },
  {
    "text": "ForBrownianmotion(whichistypicallyassumedinthecontextofstochasticcalculus), thiscan be calculated as: (cid:12) (cid:12) f(i)(t)=Prob (cid:16) τˆ (cid:16) t,(cid:15)(i) (cid:17) =t (cid:17) = (cid:12) (cid:12) √ (cid:15) t (i)(cid:12) (cid:12) exp (cid:32) − (cid:15)( t i)2 (cid:33) (12) t σ 2πt3 2σ2 i i From the above distribution, the typical first passage time, defined by f(cid:48)(t)=0 is given by: (cid:16) (cid:17) (cid:15)(i)2 τ t,(cid:15)(i) = t (13) t 3σ2 i Equation (13) shows that, as intuitively expected, the typical mean reversion time increases the further we are from the mean and decreases the more volatile the stock is. Approachesbasedonmeanreversiondiscussedpreviouslysufferfromtwoproblems. Firstofall,one assumes that the “error” (cid:15)(i) in the idiosyncratic return is normally distributed. This assumption, t although sometimes valid, has no a priori justification. The reasons why this assumption may fail are many, not least of which the asymmetry in the behaviour of market participants during bull and bear markets and the impact of liquidity. Furthermore, as we will discuss later, the standard approach to calculating the parameters of the mean reversion in (1) is not geared towards insuring that the resulting error is Gaussian as assumed. The second problem is that these approaches are model-dependent: they assume that the model representing the beta-hedged portfolio returns is affine. This last assumption may sometimes be justifiedifweinterpretP(i) asthepricethenextminuteormaybethenexthour: thisissobecause, t+1 if we look closely enough, any curve looks like a straight line over very short intervals of time. But this starts to fail for longer periods of time and does not adequately capture long term correlations between prices. A less model dependent approach that tries to “learn” the data instead of coercing it to a pre-determined model would, at least conceptually, be more appealing. Model risk has been discussedintheliterature(seereferences[4,7,10,17]),andsomeapproachestomitigationhavebeen proposedbutmostoftheeffortsarearoundtheriskinherentinthepricingofsecuritiesandfinancial instruments. Otherstatisticalmodelsusedinfinance,suchasmean-reversiontrading,havereceived less attention. 3 Ditching the model Inthispaperweproposeanalternativeapproachtostatisticalarbitrage. Ourfirstpointofcallis todealwithmodelrisk byusinganeuralnetworkasauniversalapproximator: neuralnetworkswith asinglehiddenlayerareuniversalapproximators,i.e. anyfunctioncanbeexpressedtoanarbitrary degree of accuracy by such a network. Put simply, if we specify a generic form for modeling asset returns: (cid:16) (cid:17) x(i) −x(i) =Q x(1),..,x(N) +σ (cid:15)(i) (14) t+1 t t t i t+1 where Q is some unknown function, the universal approximation theorem (see [9]) says that this function can be “represented” as   H N Q (cid:16) x( t 1),..,x( t N) (cid:17) = (cid:88) h iα f (cid:88) W αj x( t j)+b α+σ i (cid:15)( t+ i) 1 (15) α=1 j=1 where the matrices W and h are known as weights while the vector b is known as the bias, and the function f is the activation. In this paper, the number of factors used is chosen to correspond to the number of sector ETFs while H, the number of “hidden neurons” represents the architecture of the model: 5 Electronic copy available at: https://ssrn.com/abstract=3682487",
    "title": "Mean Reversion A New Approach",
    "source_type": "pdf",
    "document_id": "113117190374",
    "source_file": "Mean Reversion A New Approach.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 13,
    "chunk_index": 7,
    "word_count": 444,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200827174316+03'00'",
    "duration": null
  },
  {
    "text": "b is known as the bias, and the function f is the activation. In this paper, the number of factors used is chosen to correspond to the number of sector ETFs while H, the number of “hidden neurons” represents the architecture of the model: 5 Electronic copy available at: https://ssrn.com/abstract=3682487 Figure 3: Generic neural network architecture In figure3, the architecture, which refers tothe specific connectionsbetweenthe different layers of the network; is that of a “plain vanilla” feed forward network. Many other architectures are possible such as convolutional neural networks, LSTM, transformer networks etc. The financial applicationsofthesedifferentarchitecturesaremanifoldbutinthispaper,weshallonlyexplorethe use of feedforward networks as in equation (15). Note that in the case of a linear activation, we recover equation (1) which is the basic affine model of mean reversion. Here however, the activation function used will be f(x) = tanh(x). Remem- bering that equation (1) is the discretised version of a differential equation we have, under certain conditions, a long term mean since: (cid:104) (cid:105) ρ(i) =E x(i) (16) t t and hence: H N (cid:88) h f( (cid:88) W x(j)+b )=0 (17) i,α α,j t α α=1 j=1 Since most activation functions used have the property f(0)=0, the long term mean is charca- terised by: N (cid:88) W x(j)+b =0 (18) αj ∞ α j=1 The condition of convergence for the differential form of (15) is given by the Picard-Lindelof iteration which basically requires the mapping on the RHS of (15) to be contractive, i.e.: |h(f(Wx+b)−f(Wy+b))|<k|x−y| (19) where | . | denotes some vector norm. If the activation itself is a contractive mapping or at least Lipschitz, we will get (using the Cauchy inequality): (cid:107)h(f(Wx+b)−f(Wy+b))(cid:107)≤(cid:107)h(cid:107)(cid:107)(f(Wx+b)−f(Wy+b))(cid:107) ≤ρ(cid:107)h(cid:107)(cid:107)W(x−y)(cid:107) (20) ≤ρ(cid:107)h(cid:107)(cid:107)W(cid:107)(cid:107)(x−y)(cid:107) which implies the constraint: ρ(cid:107)h(cid:107)(cid:107)W(cid:107)<1 (21) 6 Electronic copy available at: https://ssrn.com/abstract=3682487",
    "title": "Mean Reversion A New Approach",
    "source_type": "pdf",
    "document_id": "113117190374",
    "source_file": "Mean Reversion A New Approach.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 13,
    "chunk_index": 8,
    "word_count": 288,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200827174316+03'00'",
    "duration": null
  },
  {
    "text": "(15) to be contractive, i.e.: |h(f(Wx+b)−f(Wy+b))|<k|x−y| (19) where | . | denotes some vector norm. If the activation itself is a contractive mapping or at least Lipschitz, we will get (using the Cauchy inequality): (cid:107)h(f(Wx+b)−f(Wy+b))(cid:107)≤(cid:107)h(cid:107)(cid:107)(f(Wx+b)−f(Wy+b))(cid:107) ≤ρ(cid:107)h(cid:107)(cid:107)W(x−y)(cid:107) (20) ≤ρ(cid:107)h(cid:107)(cid:107)W(cid:107)(cid:107)(x−y)(cid:107) which implies the constraint: ρ(cid:107)h(cid:107)(cid:107)W(cid:107)<1 (21) 6 Electronic copy available at: https://ssrn.com/abstract=3682487",
    "title": "Mean Reversion A New Approach",
    "source_type": "pdf",
    "document_id": "113117190374",
    "source_file": "Mean Reversion A New Approach.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 13,
    "chunk_index": 9,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200827174316+03'00'",
    "duration": null
  },
  {
    "text": "Equation (21) is basically a regularisation condition that must be imposed on the model to ensure it behaves well asymptotically. Such regularisation conditions are familiar in training neural networks and serve to increase generalisation capacity for out-of-sample predictions by \"clipping\" spurious weights and nodes from the architecture. In addition to this condition, dropout and drop connect methods can be used to get more robust results. In the neural network literature, determining the weight and bias parameters in equation (15) is usually done by applying some variation on gradient descent method e.g., Stochastic Gradient Decsent(SGD)oradaptivemomentminimisation(ADAM[11]) tominimisethein-sample/training error:    T N H N (cid:15)2 = (cid:88)(cid:88) x( t+ i) 1 −x t (i)− (cid:88) h iα f (cid:88) Λ αj x( t j)+b α 2 (22) t=1 i=1 α=1 j=1 andthe“correctness” oftheresultsisthenmeasuredbythesizeoftheerrorontheout-ofsample testing set. 4 Built-in mean reversion As noted earlier, one of the weaknesses of traditional approaches to mean reversion is the as- sumption that the idiosyncratic residual is basically white noise: a series of uncorrelated, zeero mean random variables. White noise is characterised by a flat power spectrum where the power spectrum is defined as the magnitude of its Fourier transform: (cid:12)(cid:90) ∞ (cid:12)2 Φ[dsˆ t ](ω)= (cid:12) (cid:12) dsˆ t eiωt(cid:12) (cid:12) (23) (cid:12) (cid:12) −∞ To intuitively understand (16), we recall that the Fourier transform of a signal is a decomposition of the latter into periodic/sinusoidal waves with given amplitudes. When the amplitudes for all possible frequencies are equal, we have have a flat power spectrum: loosely speaking, it means that there is no perceivable regularity in the signal. Going back to equation (15), the calibration procedure by which the quantities Λ,h and b are obtained from the observed idiosyncratic return (cid:15)(i) must have the power spectrum of white noise. t+1 This requirement can be fullfilled by minimising the following loss function: (cid:12)    (cid:12)2 (cid:12) T H N (cid:12) p( n i) = (cid:12) (cid:12) (cid:12) (cid:88) x( t+ i) 1 −x( t i)− (cid:88) h iα f (cid:88) Λ αj x( t j)+b αe2πint/T(cid:12) (cid:12) (cid:12) (24) (cid:12)t=1 α=1 j=1 (cid:12) with the loss function: (cid:88) L=− p(i)logp(i) (25) n n i,n and where the parameters are obtained as: Λ ,h ,b =argmin L (26) ∗ ∗ ∗ Λ,h,b Equation (24) is the power spectrum of the error on the beta-hedged portfolio corresponding to the ith stock. Equation (25) says that we would like to maximize the Shannon information in the powerspectrum. SinceforanyfinitetradinghorizonT, (cid:80)T p(i) isboundedwededucethatwhen n=1 n the information (25) is maximal, the spectrum is flat, i.e. corresponds to the requirement of mean reversion. Traditionally, instead of the loss function in (25), one minimises the RMS distance:   2 T H N d2 = (cid:88) x( t+ i) 1 −x( t i)− (cid:88) h iα f (cid:88) Λ αj x t (j)+b α (27) t=1 α=1 j=1 7 Electronic copy available at: https://ssrn.com/abstract=3682487",
    "title": "Mean Reversion A New Approach",
    "source_type": "pdf",
    "document_id": "113117190374",
    "source_file": "Mean Reversion A New Approach.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 13,
    "chunk_index": 10,
    "word_count": 483,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200827174316+03'00'",
    "duration": null
  },
  {
    "text": "Traditionally, instead of the loss function in (25), one minimises the RMS distance:   2 T H N d2 = (cid:88) x( t+ i) 1 −x( t i)− (cid:88) h iα f (cid:88) Λ αj x t (j)+b α (27) t=1 α=1 j=1 7 Electronic copy available at: https://ssrn.com/abstract=3682487",
    "title": "Mean Reversion A New Approach",
    "source_type": "pdf",
    "document_id": "113117190374",
    "source_file": "Mean Reversion A New Approach.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 13,
    "chunk_index": 11,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200827174316+03'00'",
    "duration": null
  },
  {
    "text": "Minimising (27) however, only guarantees that the first moment (average) of the error will be zeroandthatthestandarddeviationwillbeminimalbutitdoesnotguaranteeanyotherproperties ofthedistributionoferrorsnordoesitautomaticallysayanythingabouttheirdependencestructure. 5 Trading Strategy Using the results from the preceding section, we would like to generate a trading signal akin to the one in equations (9) and (10). However, we need to note that, in arriving to equations (9) and (10), the parameters have been estimated in a way to make sure that E[(cid:15) ] = 0. The approach t outlined in the previous section does not guarantee this last equation since it maximises entropy ratherthanminimisesthemeansquareerror. Wethereforehavetoadaptourdecisionruletoreflect this as follows:   H N (cid:88) h iα f (cid:88) Λ αj x( t j)+b α≥ω(i)+n buy σ(i) (28) α=1 j=1 or:   H N (cid:88) h iα f (cid:88) Λ αj x( t j)+b α≤ ω(i)−n sell σ(i) (29) α=1 j=1 where ω(i) is the (arithmetic) mean of the error. Put simply, equations (28-29) tell us that if the signal is large enough, we should buy, else we should sell ! The specific thresholds, as discussed earlier, are a function of the risk aversion of individual in- vestors and, possibly, of the specific stocks and ETFs being traded. The amount traded can, in principle, be a function of the signal strength and other important variables such as trade volume. In this paper, our focus is really on measuring the impact on statistical arbitrage strategies that comes from ditching pre-specified models (by using neural networks as discussed previously) and changing the way in which parameters are estimated. Therefore, we deem that optimising thresh- olds or allocations may “muddy the waters” in terms of understanding the efficacy of the outlined approach. As such, we have chosen to use a flat allocation where the same amount is traded re- gardless of the signal strength and n =n =2. buy sell 8 Electronic copy available at: https://ssrn.com/abstract=3682487",
    "title": "Mean Reversion A New Approach",
    "source_type": "pdf",
    "document_id": "113117190374",
    "source_file": "Mean Reversion A New Approach.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 13,
    "chunk_index": 12,
    "word_count": 310,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200827174316+03'00'",
    "duration": null
  },
  {
    "text": "or allocations may “muddy the waters” in terms of understanding the efficacy of the outlined approach. As such, we have chosen to use a flat allocation where the same amount is traded re- gardless of the signal strength and n =n =2. buy sell 8 Electronic copy available at: https://ssrn.com/abstract=3682487 6 Backtesting To back test the trading strategy, we have used the following sector ETFs: XLF Financial SPDR XLE Energy SPDR VONG, QQQ Technology SPDR XBI, IBB Biotech VGT Information technology VNQ Realestate XLV Healthcare HHH Internet IYR Realestate IYT Transportation XLP Consumer staples XLY Consumer discretionary XLI Industrial OIH Oilservices Table 1. List of ETF factors used Following [1], we used actual as opposed to synthetic ETFs for backtesting as of 2005. The data was obtained from Yahoo Finance and missing values were linearly interpolated. The dataset was divided50/50intotrainingandtestingdatasets. Noattemptwasmadetoevaluateperformanceon separatehistoricalpatchesonpurpose: wedonotwanttofeedtheapproachwithknowledgegained inhindsight. Wealsodonottaketransactioncosts, reporates(forshortselling)orborrowingrates into account in this paper. Unlike linear regression analysis, calibrating the parameters of a neural network has no analytic solution and as such is a numerical gradient-descent based procedure. Such procedures rarely lead to a global optimum and frequently end up in different local minima upon repetition. We deal with this by averaging the signal over multiple runs (we have used 1000 such runs in this paper) which leads to a fairly stable outcome. The trading strategy’s P&L is summarised by: (cid:16) (cid:17) x(i) −x(i) Π(i) =s(i) t+τ t (30) t t P(i) t where x(i) is given by equation (2), P(i) is the price of the specific stock being traded and s(i) t t t is the signal. The exit time t+τ is defined as the first time the signal reverses sign: (cid:16) (cid:17) τ =argmin δ s(i) =−s(i) (31) θ=1,...,∞ t+θ t 9 Electronic copy available at: https://ssrn.com/abstract=3682487",
    "title": "Mean Reversion A New Approach",
    "source_type": "pdf",
    "document_id": "113117190374",
    "source_file": "Mean Reversion A New Approach.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 13,
    "chunk_index": 13,
    "word_count": 296,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200827174316+03'00'",
    "duration": null
  },
  {
    "text": "(2), P(i) is the price of the specific stock being traded and s(i) t t t is the signal. The exit time t+τ is defined as the first time the signal reverses sign: (cid:16) (cid:17) τ =argmin δ s(i) =−s(i) (31) θ=1,...,∞ t+θ t 9 Electronic copy available at: https://ssrn.com/abstract=3682487 In figure 4 below we show the histogram of returns for a few selected companies in the Biotech, Tech, Financials and Industrial sectors: (a) Alexion Pharmaceuticals, Inc. (b) Amazon.com, Inc. (c) American Express Company (d) Amgen Inc. (e) Apple Inc. (f) CME Group Inc. (g) CSX Corporation (h) Facebook, Inc. (i) General Electric Company (j) Alphabet Inc. Figure 4: Plots of mean reversion strategy returns All of these histograms show returns that are considerably positively skewed. Also, for most companies examined, the percentage of correct trade decisions, i.e. decisions resulting in a positive P&L, ’sell’ decisions were more likely to be correct than buy decisions. 10 Electronic copy available at: https://ssrn.com/abstract=3682487 However, the holding time betweeen trades is very long as figures 5 below show: (a) Alexion Pharmaceuticals, Inc. (b) Amazon.com, Inc. (c) American Express Company (d) Amgen Inc. (e) Apple Inc. (f) CME Group Inc. (g) CSX Corporation (h) Facebook, Inc. (i) General Electric Company (j) Alphabet Inc. Figure 5: Plots of mean reversion strategy durations 11 Electronic copy available at: https://ssrn.com/abstract=3682487",
    "title": "Mean Reversion A New Approach",
    "source_type": "pdf",
    "document_id": "113117190374",
    "source_file": "Mean Reversion A New Approach.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10-12",
    "total_pages": 13,
    "chunk_index": 14,
    "word_count": 223,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10-12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200827174316+03'00'",
    "duration": null
  },
  {
    "text": "below show: (a) Alexion Pharmaceuticals, Inc. (b) Amazon.com, Inc. (c) American Express Company (d) Amgen Inc. (e) Apple Inc. (f) CME Group Inc. (g) CSX Corporation (h) Facebook, Inc. (i) General Electric Company (j) Alphabet Inc. Figure 5: Plots of mean reversion strategy durations 11 Electronic copy available at: https://ssrn.com/abstract=3682487 The reason for the long holding time is the thresholds in equations (28) and (29): these are quitehighandthererforenecessitatelongwaitingtimesbeforeunwindingthetradesbecomes\"safe\". Finding optimal bounds for these thresholds is in itself the topic of a different study and is quite likely to be specific to the stocks being traded. 7 Conclusions Inthispaper, wehaveexploredtheimpactofusingmodelindependentestimatorsforstockreturns and calibrating their parameters in a way that guarantees mean reversion. The results are quite encouraging and suggest future work that focuses on: • Optimising the architecture of the neural network used • Finding a more scientific way of determining appropriate threresholds for trading • Examining the impact of using a non-Markovian approach where current returns depend on longer histories of prices and returns. 12 Electronic copy available at: https://ssrn.com/abstract=3682487",
    "title": "Mean Reversion A New Approach",
    "source_type": "pdf",
    "document_id": "113117190374",
    "source_file": "Mean Reversion A New Approach.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 13,
    "chunk_index": 15,
    "word_count": 169,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200827174316+03'00'",
    "duration": null
  },
  {
    "text": "that focuses on: • Optimising the architecture of the neural network used • Finding a more scientific way of determining appropriate threresholds for trading • Examining the impact of using a non-Markovian approach where current returns depend on longer histories of prices and returns. 12 Electronic copy available at: https://ssrn.com/abstract=3682487",
    "title": "Mean Reversion A New Approach",
    "source_type": "pdf",
    "document_id": "113117190374",
    "source_file": "Mean Reversion A New Approach.pdf",
    "section": "References",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 13,
    "chunk_index": 16,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200827174316+03'00'",
    "duration": null
  },
  {
    "text": "[1] MarcoAvellanedaandJeong-HyunLee. StatisticalarbitrageintheUSequitiesmarket. Quan- titative Finance, 10(7):761–782, 2010. [2] MichaelBrennanandEduardoS.Schwartz. Analyzingconvertiblebonds. Journal of Financial and Quantitative Analysis, 15(4):907–929, 1980. [3] Andrew Brim. Deep reinforcement learning pairs trading. In All Graduate Plan B and other Reports, 2019. [4] Andrea Buraschi and Francesco Corielli. Risk management implications of time-inconsistency: Model updating and recalibration of no-arbitrage models. Journal of Banking Finance, 29(11):2883 – 2907, 2005. Thirty Years of Continuous-Time Finance. [5] GiuseppeCampolietiandRomanN.Makarov. Solvablediffusionmodelswithlinearandmean- reverting nonlinear drifts. SIAM Journal on Financial Mathematics, 8(1):146–170, 2017. [6] K. C. Chan, G. Andrew Karolyi, Francis A. Longstaff, and Anthony B. Sanders. An empirical comparison of alternative models of the short-term interest rate. The Journal of Finance, 47(3):1209–1227, 1992. [7] Rama Cont and Romain Deguest. Equity correlations implied by index options: Estimation and model uncertainty analysis. Mathematical Finance, 23, 04 2010. [8] John C. Cox, Jonathan E. Ingersoll, and Stephen A. Ross. An analysis of variable rate loan contracts. The Journal of Finance, 35(2):389–403, 1980. [9] GCybenkot.Approximationbysuperpositionsofasigmoidalfunction.InMathematicalControl Signals Systems 2:303-314, 1989, 2006. [10] Emanuel Derman. Goldman scahs quantitative strategies research notes. 1996. [11] Diederik P. Kingma and Jimmy Ba. Adam: A method for stochastic optimization. In 3rd International Conference on Learning Representations, ICLR 2015, San Diego, CA, USA, May 7-9, 2015, Conference Track Proceedings, 2015. [12] Zisimos Koustas and Jean-Francois Lamarche. Evidence of nonlinear mean reversion in the real interest rate. Applied Economics, 42:237–248, 01 2010. [13] Alexander Lipton and Vadim Kaushansky. On the first hitting time density of an ornstein- uhlenbeck process. 10 2018. [14] Freddy Marín and J. Palacio. Gaussian estimation of one-factor mean reversion processes. Journal of Probability and Statistics, 2013, 10 2013. [15] JohnMulvey,YifanSun,MengdiWang,andJingYe. Optimizingaportfolioofmean-reverting assets with transaction costs via a feedforward neural network. Quantitative Finance, pages 1–23, 04 2020. [16] John M. Mulvey, Yifan Sun, Mengdi Wang, and Jing Ye. Optimizing a portfolio of mean- revertingassetswithtransactioncostsviaafeedforwardneuralnetwork. Quantitative Finance, 20(8):1239–1261, 2020. [17] Philipp Sibbertsen, Gerhard Stahl, and Corinna Luedtke. Measuring model risk. 2008. [18] Oldrich Vasicek. An equilibrium characterization of the term structure. Journal of Financial Economics, 5(2):177 – 188, 1977. 13 Electronic copy available at: https://ssrn.com/abstract=3682487",
    "title": "Mean Reversion A New Approach",
    "source_type": "pdf",
    "document_id": "113117190374",
    "source_file": "Mean Reversion A New Approach.pdf",
    "section": "References",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 13,
    "chunk_index": 17,
    "word_count": 343,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200827174316+03'00'",
    "duration": null
  },
  {
    "text": "Wang, and Jing Ye. Optimizing a portfolio of mean- revertingassetswithtransactioncostsviaafeedforwardneuralnetwork. Quantitative Finance, 20(8):1239–1261, 2020. [17] Philipp Sibbertsen, Gerhard Stahl, and Corinna Luedtke. Measuring model risk. 2008. [18] Oldrich Vasicek. An equilibrium characterization of the term structure. Journal of Financial Economics, 5(2):177 – 188, 1977. 13 Electronic copy available at: https://ssrn.com/abstract=3682487",
    "title": "Mean Reversion A New Approach",
    "source_type": "pdf",
    "document_id": "113117190374",
    "source_file": "Mean Reversion A New Approach.pdf",
    "section": "References",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 13,
    "chunk_index": 18,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200827174316+03'00'",
    "duration": null
  }
]