[
  {
    "text": "Modeling the Implied Volatility Surface Jim Gatheral Global Derivatives and Risk Management 2003 Barcelona May 22, 2003 This presentation represents only the personal opinions of the author and not those of Merrill Lynch, its subsidiaries or affiliates. Jim Gatheral, Merrill Lynch, May-2003 Outline of this talk A compound Poisson model of stock trading n Empirical verification of modeling assumptions n Stochastic volatility n Empirical dynamics of SPX and VIX n Dynamics of the implied volatility skew n Which stochastic volatility model? n Do stochastic volatility models fit option prices? n Jumps n The impact of large option trades n Jim Gatheral, Merrill Lynch, May-2003 Stock trading as a compound Poisson process Consider a random time change from conventional calendar time to n trading time such that the rate of arrival of stock trades in a given (transformed) time interval is a constant l . Intuitively, relative to real time, trading time flows faster when there is n more activity in the stock and more slowly when there is less activity. Suppose that the (random) size n of a trade is independent of the level of n activity in the stock. Assume further that each trade impacts the mid-log-price of the stock by n an amount proportional to n . • This is a standard assumption in the market microstructure literature Then the change in log-mid-price over some time interval is given by n N (cid:229) D = xn nsgn( ) i i i=1 Note that both the number of trades N and the size of each trade n in a n i D given time interval t are random. Jim Gatheral, Merrill Lynch, May-2003",
    "title": "Barcelona2003",
    "source_type": "pdf",
    "document_id": "1af44fcd676e",
    "source_file": "Modeling the Implied Volatility Surface_barcelona2003.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-4",
    "total_pages": 49,
    "chunk_index": 0,
    "word_count": 274,
    "author": "jim",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030430173025",
    "duration": null
  },
  {
    "text": "log-mid-price over some time interval is given by n N (cid:229) D = xn nsgn( ) i i i=1 Note that both the number of trades N and the size of each trade n in a n i D given time interval t are random. Jim Gatheral, Merrill Lynch, May-2003 Volatility and volume: a relationship The variance of this random sum of random variables is given by n [ D= ] [ ] ØøØ + ø [ ] 2 VarxE NVarnVar NEa n a ºßº ß i i [ ] [ ] = a 2ENE n i Rewriting this in terms of volatility, we obtain n [ ] [ ] [ ] Varxt D= E D = N sE 2 n a 2 i [ ] [ ] But E N E n is just the expectation of the volume over the time n i [ ] D = D interval t . Let E N l t where l is the trading rate. D The factor t cancels and transforming back to real time, we see that n variance is directly proportional to volume in this simple model. Moreover, the distribution of returns in trading time is approximately n D Gaussian for large t . Jim Gatheral, Merrill Lynch, May-2003",
    "title": "Barcelona2003",
    "source_type": "pdf",
    "document_id": "1af44fcd676e",
    "source_file": "Modeling the Implied Volatility Surface_barcelona2003.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5-6",
    "total_pages": 49,
    "chunk_index": 1,
    "word_count": 211,
    "author": "jim",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5-6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030430173025",
    "duration": null
  },
  {
    "text": "the trading rate. D The factor t cancels and transforming back to real time, we see that n variance is directly proportional to volume in this simple model. Moreover, the distribution of returns in trading time is approximately n D Gaussian for large t . Jim Gatheral, Merrill Lynch, May-2003 n The relationship A key assumption in our simple model is that market impact is n proportional to the square root of the trade size n . The following argument shows why this is plausible: • A market maker requires an excess return proportional to the risk of holding inventory. T • Risk is proportional to s T where is the holding period. • The holding period should be proportional to the size of the position. • So the required excess return must be proportional to n . Jim Gatheral, Merrill Lynch, May-2003 Independence of trade size and trade frequency* INTC: 30 minute buckets from 10/1/2002 to 4/25/2003 2000 1800 y = -0.0011x + 910.03 1600 R2 = 0.0003 1400 1200 1000 800 600 400 200 0 0 2000 4000 6000 8000 10000 12000 14000 16000 18000 Frequency * Excluding trades over 10,000 shares Jim Gatheral, Merrill Lynch, May-2003 eziS egarevA Independence of trade size and trade frequency* MER: 30 minute buckets from 10/1/2002 to 4/25/2003 2500 y = -0.0221x + 910.37 R2 = 9E-05 2000 1500 1000 500 0 0 100 200 300 400 500 600 700 800 900 Frequency * Excluding trades over 10,000 shares Jim Gatheral, Merrill Lynch, May-2003 eziS egarevA",
    "title": "Barcelona2003",
    "source_type": "pdf",
    "document_id": "1af44fcd676e",
    "source_file": "Modeling the Implied Volatility Surface_barcelona2003.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6-8",
    "total_pages": 49,
    "chunk_index": 2,
    "word_count": 254,
    "author": "jim",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6-8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030430173025",
    "duration": null
  },
  {
    "text": "size and trade frequency* MER: 30 minute buckets from 10/1/2002 to 4/25/2003 2500 y = -0.0221x + 910.37 R2 = 9E-05 2000 1500 1000 500 0 0 100 200 300 400 500 600 700 800 900 Frequency * Excluding trades over 10,000 shares Jim Gatheral, Merrill Lynch, May-2003 eziS egarevA Empirical variance vs volume INTC from 4/30/2001 to 4/25/2003 0.018 0.016 0.014 0.012 y = 5E-11x R2 = 0.2183 0.01 0.008 0.006 0.004 0.002 0 0 40,000,000 80,000,000 120,000,000 160,000,000 200,000,000 Volume (Shares) Jim Gatheral, Merrill Lynch, May-2003 )ol/ih(2^nl Empirical variance vs volume MER from 2/26/2001 to 4/25/2003 0.02 0.018 0.016 0.014 0.012 y = 3E-10x 0.01 R2 = 0.2854 0.008 0.006 0.004 0.002 0 0 5,000,000 10,000,000 15,000,000 20,000,000 25,000,000 Volume (Shares) Jim Gatheral, Merrill Lynch, May-2003 )ol/ih(2^nl Implications of our simple model Our simple but realistic model has the following modeling implications n • Log returns are roughly Gaussian with constant variance in trading time (sometimes call intrinsic time) defined in terms of transaction volume • Trading time is the inverse of variance • When we transform from trading time to real time, variance appears to be random It is natural to model the log stock price as a diffusion process n subordinated to another random process which is really trading volume in our model - stochastic volatility What form should the volatility process take? n Jim Gatheral, Merrill Lynch, May-2003",
    "title": "Barcelona2003",
    "source_type": "pdf",
    "document_id": "1af44fcd676e",
    "source_file": "Modeling the Implied Volatility Surface_barcelona2003.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9-12",
    "total_pages": 49,
    "chunk_index": 3,
    "word_count": 233,
    "author": "jim",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9-12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030430173025",
    "duration": null
  },
  {
    "text": "real time, variance appears to be random It is natural to model the log stock price as a diffusion process n subordinated to another random process which is really trading volume in our model - stochastic volatility What form should the volatility process take? n Jim Gatheral, Merrill Lynch, May-2003 Empirical observations In the underlying index return data we observe n • Clustering: large moves follow large moves, small moves follow small moves • Mean reversion of volatility • Negative correlation between implied volatility moves and index returns In the implied volatility data we observe n • The volatility envelope: short-dated volatilities move more than long-dated ones • A pronounced skew with downside implied volatilities significantly higher than upside implied volatilities. • Implied volatilities move more when implied volatility is high. Jim Gatheral, Merrill Lynch, May-2003 A generic stochastic volatility model We are now in a position to write down a generic stochastic volatility n model consistent with our observations. Let x denote the log stock price and v denote its variance. Then = + dxdtvmdZ 1 ( ) dvv = vdaZ + h b 2 = with d Z d , Z d t r . 1 2 ( ) a v is a mean-reversion term, r is the correlation between volatility n moves and stock price moves and h is called “volatility of volatility”. = b 1 gives the Heston model n 2 b =1 gives Wiggins' lognormal model = b 3 gives Lewis's 3 model 2 2 To estimate b we analyze historical SPX and VIX data. n Jim Gatheral, Merrill Lynch, May-2003",
    "title": "Barcelona2003",
    "source_type": "pdf",
    "document_id": "1af44fcd676e",
    "source_file": "Modeling the Implied Volatility Surface_barcelona2003.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12-13",
    "total_pages": 49,
    "chunk_index": 4,
    "word_count": 266,
    "author": "jim",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12-13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030430173025",
    "duration": null
  },
  {
    "text": "stock price moves and h is called “volatility of volatility”. = b 1 gives the Heston model n 2 b =1 gives Wiggins' lognormal model = b 3 gives Lewis's 3 model 2 2 To estimate b we analyze historical SPX and VIX data. n Jim Gatheral, Merrill Lynch, May-2003 SPX from 1/1/1990 to 4/25/2003 Correlation of vol changes with log returns 15.00% 10.00% y = -1.0953x + 0.0003 R2 = 0.6177 5.00% 0.00% -8.00% -6.00% -4.00% -2.00% 0.00% 2.00% 4.00% 6.00% 8.00% -5.00% -10.00% -15.00% Log Return Jim Gatheral, Merrill Lynch, May-2003 egnahC ytilitaloV Regressing VIX vs SPX We regress V I X aV D I X vs D l n ( S P X ) for different values of a . n Fit quality is plotted below: n R2 0.62 a -1 -0.5 0.5 1 1.5 2 = a 0 is lognormal 0.58 = - a 1 is 3/2 model 0.56 = a 1 is Heston 0.54 0.52 We note that R 2 is maximized at roughly a = 0 which corresponds to a n lognormal process for volatility. At a = 0 , R 2 » 0 . 6 2 so r » - 0 . 7 9 . Then, from the slope of the n D» D » regression, v v t hZ with h 2 . 8 . Jim Gatheral, Merrill Lynch, May-2003 Historical SPX implied volatility VIX Index 60 50 40 30 20 10 0 Jan-90 Jan-91 Jan-92 Jan-93 Jan-94 Jan-95 Jan-96 Dec-96 Dec-97 Dec-98 Dec-99 Dec-00 Jim Gatheral, Merrill Lynch, May-2003",
    "title": "Barcelona2003",
    "source_type": "pdf",
    "document_id": "1af44fcd676e",
    "source_file": "Modeling the Implied Volatility Surface_barcelona2003.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14-16",
    "total_pages": 49,
    "chunk_index": 5,
    "word_count": 258,
    "author": "jim",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14-16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030430173025",
    "duration": null
  },
  {
    "text": "n D» D » regression, v v t hZ with h 2 . 8 . Jim Gatheral, Merrill Lynch, May-2003 Historical SPX implied volatility VIX Index 60 50 40 30 20 10 0 Jan-90 Jan-91 Jan-92 Jan-93 Jan-94 Jan-95 Jan-96 Dec-96 Dec-97 Dec-98 Dec-99 Dec-00 Jim Gatheral, Merrill Lynch, May-2003 Empirical dynamics of VIX We regress the 20-day moving average std of D V I X vs V I X a for n different values of a . Fit quality is plotted below: n R2 0.6 0.55 = a 1 is lognormal 0.5 = a 2 is 3/2 model 0.45 = a 0 is Heston 0.4 0.35 a 0.5 1 1.5 2 2.5 We note that R 2 is maximized at roughly a = 1 . 4 . This would put the n volatility dynamics between lognormal and 3/2 with b =+ (a1)/21 » .2 Imposing lognormality, the slope of the regression should give us n volatility of volatility directly. Jim Gatheral, Merrill Lynch, May-2003 Regression of VIX volatility vs VIX level 6.00% 5.00% y = 0.0635x 4.00% 2 R = 0.5629 3.00% 2.00% 1.00% 0.00% 0.0% 5.0% 10.0% 15.0% 20.0% 25.0% 30.0% 35.0% 40.0% 45.0% 50.0% 20 day moving average Jim Gatheral, Merrill Lynch, May-2003 noitaived dradnats yad 02 The regression gives D»D » s h s 1 t 0 . 0 s 6 3 5 . Then, h »·· 0 » .063516 22.0 n 2 Unconditional distribution of VIX vs lognormal VIX from 1/1/1990 to 4/25/2003 250 200 150 100 50 0 -3 -2.5 -2 -1.5 -1 -0.5 0 ln(VIX) Jim Gatheral, Merrill Lynch, May-2003 ycneuqerF Consistent with lognormal volatility dynamics! n",
    "title": "Barcelona2003",
    "source_type": "pdf",
    "document_id": "1af44fcd676e",
    "source_file": "Modeling the Implied Volatility Surface_barcelona2003.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17-19",
    "total_pages": 49,
    "chunk_index": 6,
    "word_count": 274,
    "author": "jim",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17-19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030430173025",
    "duration": null
  },
  {
    "text": "6 3 5 . Then, h »·· 0 » .063516 22.0 n 2 Unconditional distribution of VIX vs lognormal VIX from 1/1/1990 to 4/25/2003 250 200 150 100 50 0 -3 -2.5 -2 -1.5 -1 -0.5 0 ln(VIX) Jim Gatheral, Merrill Lynch, May-2003 ycneuqerF Consistent with lognormal volatility dynamics! n Dynamics of the volatility skew Our empirical investigations so far indicate that the appropriate n specification of stochastic volatility is lognormal with volatility of volatility h somewhere between 2.0 and 3.0. This choice of specification has implications for the dynamics of the n implied volatility skew. We can check to see whether or not the volatility skew behaves consistently with this specification. Jim Gatheral, Merrill Lynch, May-2003",
    "title": "Barcelona2003",
    "source_type": "pdf",
    "document_id": "1af44fcd676e",
    "source_file": "Modeling the Implied Volatility Surface_barcelona2003.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20-21",
    "total_pages": 49,
    "chunk_index": 7,
    "word_count": 117,
    "author": "jim",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20-21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030430173025",
    "duration": null
  },
  {
    "text": "stochastic volatility is lognormal with volatility of volatility h somewhere between 2.0 and 3.0. This choice of specification has implications for the dynamics of the n implied volatility skew. We can check to see whether or not the volatility skew behaves consistently with this specification. Jim Gatheral, Merrill Lynch, May-2003 Vol term structure and skew under stochastic volatility All stochastic volatility models generate volatility surfaces with n approximately the same shape ( ) =-- + The Heston model d v v v d t lv d Z h has an implied n volatility term structure that looks to leading order like (1 - e - lT ) ( ) ( ) 2 »+ - s xT, vv v BS lT It’s easy to see that this shape should not depend very much on the particular choice of model. Also, Gatheral (2002) shows that the term structure of the at-the-money n volatility skew has the following approximate behavior for all stochastic ( ) volatility models of the form dvv = v -- dtlvdZ + h b ¶ rh vb- 1/2 (cid:236) ( - 1 e - l ¢ T (cid:252) ) ( ) s x,T 2 » (cid:237) 1 - (cid:253) ¶ BS ¢ ¢ xT T l (cid:238) l (cid:254) x=0 with ll ¢ = rh - vb- 1/2 /2 So we can estimate b by regressing volatility skew against volatility n level. Jim Gatheral, Merrill Lynch, May-2003 SPX 3-month ATM volatility skew vs ATM 3m volatility ATM vol skew -0.08 -0.09 ATM vol 0.25 0.3 0.35 -0.11 -0.12 -0.13 Jim Gatheral, Merrill Lynch, May-2003",
    "title": "Barcelona2003",
    "source_type": "pdf",
    "document_id": "1af44fcd676e",
    "source_file": "Modeling the Implied Volatility Surface_barcelona2003.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21-22",
    "total_pages": 49,
    "chunk_index": 8,
    "word_count": 265,
    "author": "jim",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21-22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030430173025",
    "duration": null
  },
  {
    "text": "rh - vb- 1/2 /2 So we can estimate b by regressing volatility skew against volatility n level. Jim Gatheral, Merrill Lynch, May-2003 SPX 3-month ATM volatility skew vs ATM 3m volatility ATM vol skew -0.08 -0.09 ATM vol 0.25 0.3 0.35 -0.11 -0.12 -0.13 Jim Gatheral, Merrill Lynch, May-2003 Interpreting the regression of skew vs volatility Recall that if the variance satisfies the SDE n dvv~dZb at-the-money variance skew should satisfy ¶ v (cid:181) vb- 1/2 ¶ k k=0 and at-the-money volatility skew should satisfy ¶ s BS (cid:181) s 2b- 2 ¶ BS k k=0 The graph shows volatility skew to be roughly independent of volatility n level so b » 1 again consistent with lognormal volatility dynamics. Jim Gatheral, Merrill Lynch, May-2003 Implied vs empirical stochastic volatility parameters It is often claimed that stochastic volatility parameters obtained by fitting n stochastic volatility models to option prices are inconsistent with historical parameters. Specifically, the implied volatility of volatility is often thought to be extreme. The typical volatility of volatility returned from a fit of the Heston model n » to option prices is h 1 . H The relationship between lognormal vol of vol and Heston vol of vol n » » · h 1 should be h h s . With an implied volatility level of around 30%, HBS H » ˛ would give h 3 . 3 which should be compared with h ( 2 . 0 , 3 . 0 ) from our empirical analysis. Jim Gatheral, Merrill Lynch, May-2003",
    "title": "Barcelona2003",
    "source_type": "pdf",
    "document_id": "1af44fcd676e",
    "source_file": "Modeling the Implied Volatility Surface_barcelona2003.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23-24",
    "total_pages": 49,
    "chunk_index": 9,
    "word_count": 255,
    "author": "jim",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23-24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030430173025",
    "duration": null
  },
  {
    "text": "h 1 should be h h s . With an implied volatility level of around 30%, HBS H » ˛ would give h 3 . 3 which should be compared with h ( 2 . 0 , 3 . 0 ) from our empirical analysis. Jim Gatheral, Merrill Lynch, May-2003 Do stochastic volatility models fit option prices? Once again, we note that the shape of the implied volatility surface n generated by a stochastic volatility model does not strongly depend on the particular choice of model. Given this observation, do stochastic volatility models fit the implied n volatility surface? The answer is “more or less”. Moreover, fitted parameters are reasonably stable over time. For very short expirations however, stochastic volatility models certainly n don’t fit as the next slide will demonstrate. Jim Gatheral, Merrill Lynch, May-2003",
    "title": "Barcelona2003",
    "source_type": "pdf",
    "document_id": "1af44fcd676e",
    "source_file": "Modeling the Implied Volatility Surface_barcelona2003.pdf",
    "section": "Document",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 49,
    "chunk_index": 10,
    "word_count": 136,
    "author": "jim",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030430173025",
    "duration": null
  },
  {
    "text": "Given this observation, do stochastic volatility models fit the implied n volatility surface? The answer is “more or less”. Moreover, fitted parameters are reasonably stable over time. For very short expirations however, stochastic volatility models certainly n don’t fit as the next slide will demonstrate. Jim Gatheral, Merrill Lynch, May-2003 Here’s a graph of the SPX volatility skew on 17-Sep-02 (just before n expiration) and various possible fits of the volatility skew formula: ATM skew t 0.5 1 1.5 2 -0.2 -0.4 -0.6 -0.8 -1 We see that the form of the fitting function is too rigid to fit the observed n skews. Jumps could explain the short-dated skew! n Jim Gatheral, Merrill Lynch, May-2003 More reasons to add jumps The statistical (historical) distribution of stock returns and the option n implied distribution have quite different shapes. The size of the volatility of volatility parameter estimated from fits of n stochastic volatility models to option prices is too high to be consistent with empirical observations Jim Gatheral, Merrill Lynch, May-2003 Fitting STOXX50 volatilities using Heston and SVJ Heston and SVJ models were fitted to SX5E implied volatility data from n 18-Oct-2002. Heston and SVJ parameter definitions are as follows: n v instantaneous variance vbar long-term mean variance l rate of mean reversion of variance h volatility of volatility r correlation between stock and volatility changes l rate of arrival of jumps J a mean log-jump size d standard deviation of log-jump size Jim Gatheral, Merrill Lynch, May-2003",
    "title": "Barcelona2003",
    "source_type": "pdf",
    "document_id": "1af44fcd676e",
    "source_file": "Modeling the Implied Volatility Surface_barcelona2003.pdf",
    "section": "Short Expirations",
    "page_number": 26,
    "page_range": "p.26-29",
    "total_pages": 49,
    "chunk_index": 11,
    "word_count": 247,
    "author": "jim",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Short Expirations (p.26-29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030430173025",
    "duration": null
  },
  {
    "text": "as follows: n v instantaneous variance vbar long-term mean variance l rate of mean reversion of variance h volatility of volatility r correlation between stock and volatility changes l rate of arrival of jumps J a mean log-jump size d standard deviation of log-jump size Jim Gatheral, Merrill Lynch, May-2003 Heston Fits 2 2 l fi 3.9, r fi -.7, h fi 1.15, vfi 0.54 , vbar fi .31 The orange line is a parametric fit to the implied volatility data; the dashed blue line is the Heston fit. 0.55 0.65 0.7 0.5 0.6 0.45 0.6 0.55 0.5 0.4 0.5 0.45 0.35 -0.6 -0.4 -0.2 0.2 0.4 0.6 -0.6 -0.4 -0.2 0.2 0.4 0.6 -0.6 -0.4 -0.2 0.2 0.4 0.6 0.5 0.45 0.45 0.4 0.4 0.4 0.35 0.35 0.35 -0.6 -0.4 -0.2 0.2 0.4 0.6 -0.6 -0.4 -0.2 0.2 0.4 0.6 -0.6 -0.4 -0.2 0.2 0.4 0.6 0.25 0.4 0.38 0.36 0.375 0.36 0.34 0.35 0.34 0.325 0.32 0.32 -0.6 -0.4 -0.2 0.2 0.4 0.6 -0.6 -0.4 -0.2 0.2 0.4 0.6 -0.6 -0.4 -0.2 0.2 0.4 0.6 0.275 0.28 0.28 0.25 0.26 0.26 Jim Gatheral, Merrill Lynch, May-2003",
    "title": "Barcelona2003",
    "source_type": "pdf",
    "document_id": "1af44fcd676e",
    "source_file": "Modeling the Implied Volatility Surface_barcelona2003.pdf",
    "section": "Short Expirations",
    "page_number": 29,
    "page_range": "p.29-30",
    "total_pages": 49,
    "chunk_index": 12,
    "word_count": 188,
    "author": "jim",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Short Expirations (p.29-30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030430173025",
    "duration": null
  },
  {
    "text": "0.2 0.4 0.6 -0.6 -0.4 -0.2 0.2 0.4 0.6 0.25 0.4 0.38 0.36 0.375 0.36 0.34 0.35 0.34 0.325 0.32 0.32 -0.6 -0.4 -0.2 0.2 0.4 0.6 -0.6 -0.4 -0.2 0.2 0.4 0.6 -0.6 -0.4 -0.2 0.2 0.4 0.6 0.275 0.28 0.28 0.25 0.26 0.26 Jim Gatheral, Merrill Lynch, May-2003 SVJ Fits 2 2 l fi 3.5, rfi -.75, h fi 1.15, vfi 0.55 , vbar fi .25 , l fi 1, afi -.1, dfi .1 J The orange line is a parametric fit to the implied volatility data; the dashed blue line is the SVJ fit. 0.55 0.7 0.65 0.5 0.6 0.6 0.45 0.55 0.4 0.5 0.5 0.45 0.35 -0.6 -0.4 -0.2 0.2 0.4 0.6 -0.6 -0.4 -0.2 0.2 0.4 0.6 -0.6 -0.4 -0.2 0.2 0.4 0.6 0.35 0.5 0.45 0.45 0.4 0.4 0.4 0.35 0.35 0.35 -0.6 -0.4 -0.2 0.2 0.4 0.6 -0.6 -0.4 -0.2 0.2 0.4 0.6 -0.6 -0.4 -0.2 0.2 0.4 0.6 0.25 0.25 0.4 0.375 0.36 0.34 0.35 0.34 0.32 0.325 0.32 -0.6 -0.4 -0.2 0.2 0.4 0.6 -0.6 -0.4 -0.2 0.2 0.4 0.6 -0.6 -0.4 -0.2 0.2 0.4 0.6 0.275 0.28 0.28 0.25 0.26 0.26 0.24 Jim Gatheral, Merrill Lynch, May-2003 Observations on the fits We note that the Heston model cannot fit volatility levels at all n expirations simultaneously nor can it fit the skew at the front. On the other hand, the SVJ model allows us to fit the short term skew n and also more or less all of the at-the-money volatility levels. Both fits return volatility-of-volatility parameters that are larger than n seem reasonable. Jim Gatheral, Merrill Lynch, May-2003",
    "title": "Barcelona2003",
    "source_type": "pdf",
    "document_id": "1af44fcd676e",
    "source_file": "Modeling the Implied Volatility Surface_barcelona2003.pdf",
    "section": "Short Expirations",
    "page_number": 30,
    "page_range": "p.30-31",
    "total_pages": 49,
    "chunk_index": 13,
    "word_count": 269,
    "author": "jim",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Short Expirations (p.30-31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030430173025",
    "duration": null
  },
  {
    "text": "fit the skew at the front. On the other hand, the SVJ model allows us to fit the short term skew n and also more or less all of the at-the-money volatility levels. Both fits return volatility-of-volatility parameters that are larger than n seem reasonable. Jim Gatheral, Merrill Lynch, May-2003 Volatility skew from the characteristic function We can compute the volatility skew directly if we know the n characteristic function f ( u) E [ = e ]i u x T . T The volatility skew is given by the formula (Gatheral (2002)): n ¶ - s 21Im[(/2¥ )] uu if BS = - ed - suBS 2T/8 (cid:242) T ¶ k p T 0 u2+ 1/4 k=0 The Heston characteristic function is given by n { } SV = + f ()ueCxpu(T,)v(,D )uT v T where C ( u , T ) and D ( u , T ) are the familiar Heston coefficients with parameters l , h , r . Adding a jump in the stock price (SVJ) gives the characteristic function n SVJSV = J ff ()u(u)(f) u TT T { ( ) ( )} with f J ()ueiux = Tp --+ 1eT e l ad+-a 22/2/2 12d l i u- u TJ J Jim Gatheral, Merrill Lynch, May-2003",
    "title": "Barcelona2003",
    "source_type": "pdf",
    "document_id": "1af44fcd676e",
    "source_file": "Modeling the Implied Volatility Surface_barcelona2003.pdf",
    "section": "Short Expirations",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 49,
    "chunk_index": 14,
    "word_count": 213,
    "author": "jim",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Short Expirations (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030430173025",
    "duration": null
  },
  {
    "text": "Adding a jump in the stock price (SVJ) gives the characteristic function n SVJSV = J ff ()u(u)(f) u TT T { ( ) ( )} with f J ()ueiux = Tp --+ 1eT e l ad+-a 22/2/2 12d l i u- u TJ J Jim Gatheral, Merrill Lynch, May-2003 Adding a simultaneous jump in the volatility gives the characteristic n function (Matytsin (2000)): SVJSV = J J fff ()u(u)(u)f( ) u V TTT T { ( )} with f J V ()uevxT = pe(I) u1 l iau- u2d2/2 - T J 1 (cid:242) TD u T 2g (cid:242) - g ( , ) ed - zz where Iu(d)te == - g V D(u,T) V V ( )( ) + + Tpp0zpz p 0 1/1 / +-+ - g { } with p b i = u V d - r h – (usual Heston notation) – h2 Jim Gatheral, Merrill Lynch, May-2003 Comparing ATM skews from different models With parameters n (cid:143) l fi 2.03, r fi -0.57, h fi 0.38,vfi 0.1, vfi 0.04, lJ fi 0.59, a fi -0.05, d fi 0.07, gvfi 0.1 we get the following plots of ATM variance skew vs time to expiration SVJ -0.025 -0.05 SVJJ S-0V.075 2 4 6 8 10 -0.125 -0.15 Jim Gatheral, Merrill Lynch, May-2003 Short expiration detail SV and SVJ skews essentially differ only for very short expirations n 0.05 0.1 0.15 0.2 0.25 -0.025 -0.05 -0.075SV SVJ -0.1 -0.125 SVJJ -0.15 Jim Gatheral, Merrill Lynch, May-2003",
    "title": "Barcelona2003",
    "source_type": "pdf",
    "document_id": "1af44fcd676e",
    "source_file": "Modeling the Implied Volatility Surface_barcelona2003.pdf",
    "section": "SVJJ",
    "page_number": 33,
    "page_range": "p.33-36",
    "total_pages": 49,
    "chunk_index": 15,
    "word_count": 249,
    "author": "jim",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "SVJJ (p.33-36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030430173025",
    "duration": null
  },
  {
    "text": "SVJ -0.025 -0.05 SVJJ S-0V.075 2 4 6 8 10 -0.125 -0.15 Jim Gatheral, Merrill Lynch, May-2003 Short expiration detail SV and SVJ skews essentially differ only for very short expirations n 0.05 0.1 0.15 0.2 0.25 -0.025 -0.05 -0.075SV SVJ -0.1 -0.125 SVJJ -0.15 Jim Gatheral, Merrill Lynch, May-2003 Other problems for diffusion models If the underlying stochastic process for the stock is a diffusion, we n should be able to get from the statistical measure to the risk neutral measure using Girsanov’s Theorem • This change of measure preserves volatility of volatility. However, historical volatility of volatility is significantly lower than the n SV fitted parameter. Finally, in the few days prior to SPX expirations, out-of-the money n option prices are completely inconsistent with the diffusion assumption • For example a 5 cent bid for a contract 10 standard deviations out-of-the- money. Jim Gatheral, Merrill Lynch, May-2003 Simple jump diffusion models don’t work either Although jumps may be necessary to explain very short dated volatility n skews, introducing jumps introduces more parameters and this is not necessarily a good thing. For example, Bakshi, Cao, and Chen (1997 and 2000) find that adding jumps to the Heston model has little effect on pricing or hedging longer-dated options and actually worsens hedging performance for short expirations (probably through overfitting). Different authors estimate wildly different jump parameters for simple n jump diffusion models. Jim Gatheral, Merrill Lynch, May-2003 SPX large moves from 1/1/1990 to 4/25/2003 Log returns over 4% 8.00% 6.00% 4.00% 2.00% 0.00% -15.00% -10.00% -5.00% 0.00% 5.00% 10.00% 15.00% -2.00% -4.00% -6.00% -8.00% Volatility Change Jim Gatheral, Merrill Lynch, May-2003 nruteR goL",
    "title": "Barcelona2003",
    "source_type": "pdf",
    "document_id": "1af44fcd676e",
    "source_file": "Modeling the Implied Volatility Surface_barcelona2003.pdf",
    "section": "SVJJ",
    "page_number": 36,
    "page_range": "p.36-38",
    "total_pages": 49,
    "chunk_index": 16,
    "word_count": 273,
    "author": "jim",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "SVJJ (p.36-38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030430173025",
    "duration": null
  },
  {
    "text": "different jump parameters for simple n jump diffusion models. Jim Gatheral, Merrill Lynch, May-2003 SPX large moves from 1/1/1990 to 4/25/2003 Log returns over 4% 8.00% 6.00% 4.00% 2.00% 0.00% -15.00% -10.00% -5.00% 0.00% 5.00% 10.00% 15.00% -2.00% -4.00% -6.00% -8.00% Volatility Change Jim Gatheral, Merrill Lynch, May-2003 nruteR goL SPX large moves from 1/1/1990 to 4/25/2003 Vol changes over 6% 6.00% 4.00% 2.00% 0.00% -15.00% -10.00% -5.00% 0.00% 5.00% 10.00% 15.00% -2.00% -4.00% -6.00% -8.00% Volatility Change Jim Gatheral, Merrill Lynch, May-2003 nruteR goL Empirical jump observations A large move in the SPX index is invariably accompanied by a large n move in volatility • Volatility changes and log returns have opposite sign This is consistent with clustering n • If there is a large move, more large moves follow i.e. volatility must jump We conclude that any jumps must be double jumps! n Jim Gatheral, Merrill Lynch, May-2003 What about pure jump models? Dilip Madan and co-authors have written extensively on pure jump n models with stable increments • The latest versions of these models involve subordinating a pure jump process to the integral of a CIR process – trading time again. Pure jump models are more aesthetically pleasing than SVJJ n • The split between jumps and and diffusion is somewhat ad hoc in SVJJ However, large jumps in the stock price don’t force an increase in n implied volatilities. Jim Gatheral, Merrill Lynch, May-2003",
    "title": "Barcelona2003",
    "source_type": "pdf",
    "document_id": "1af44fcd676e",
    "source_file": "Modeling the Implied Volatility Surface_barcelona2003.pdf",
    "section": "SVJJ",
    "page_number": 39,
    "page_range": "p.39-42",
    "total_pages": 49,
    "chunk_index": 17,
    "word_count": 238,
    "author": "jim",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "SVJJ (p.39-42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030430173025",
    "duration": null
  },
  {
    "text": "CIR process – trading time again. Pure jump models are more aesthetically pleasing than SVJJ n • The split between jumps and and diffusion is somewhat ad hoc in SVJJ However, large jumps in the stock price don’t force an increase in n implied volatilities. Jim Gatheral, Merrill Lynch, May-2003 The instantaneous volatility impact of option trades Recall our simple market price impact model n D = x s x where x is the number of days’ volume represented by the trade. We can always either buy an option or replicate it by delta hedging until n expiration: in equilibrium, implied volatilities should reflect this If we delta hedge, each rebalancing trade will move the price against us n by DG D d n S ==G D sss x S ADVADV In the spirit of Leland (1985), we obtain the shifted expected n instantaneous volatility (cid:236) (cid:252) (cid:239) G (cid:239) 2 s S x sˆ » s (cid:237) 1 – 2 (cid:253) (cid:239)(cid:238) p d t (cid:239)(cid:254) What does this mean for the implied volatility? n Jim Gatheral, Merrill Lynch, May-2003 The implied volatility impact of an option trade To get implied volatility from instantaneous volatilities, integrate local n variance along the most probable path from the current stock price today to the strike price at expiration (see Gatheral (2002)) T 1 s 2 (KT,)S(, t » )dt (cid:242) s 2 % BS t T 0 (cid:230) (cid:246) t/T K % » with S S (cid:231) (cid:247) . t 0 Ł S ł 0 Jim Gatheral, Merrill Lynch, May-2003",
    "title": "Barcelona2003",
    "source_type": "pdf",
    "document_id": "1af44fcd676e",
    "source_file": "Modeling the Implied Volatility Surface_barcelona2003.pdf",
    "section": "SVJJ",
    "page_number": 42,
    "page_range": "p.42-43",
    "total_pages": 49,
    "chunk_index": 18,
    "word_count": 259,
    "author": "jim",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "SVJJ (p.42-43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030430173025",
    "duration": null
  },
  {
    "text": "price today to the strike price at expiration (see Gatheral (2002)) T 1 s 2 (KT,)S(, t » )dt (cid:242) s 2 % BS t T 0 (cid:230) (cid:246) t/T K % » with S S (cid:231) (cid:247) . t 0 Ł S ł 0 Jim Gatheral, Merrill Lynch, May-2003 20 70 120 170 Jim Gatheral, Merrill Lynch, May-2003 m3 m6 m9 m21 m51 m81 m12 m42 m72 m03 m33 m63 m93 m24 m54 m84 m15 m45 m75 m06 The volatility impact of a 5 year 120 strike call 33.00% 32.00% 31.00% 32.00%-33.00% 30.00% 31.00%-32.00% 30.00%-31.00% 29.00% 29.00%-30.00% 28.00%-29.00% 28.00% 27.00%-28.00% 26.00%-27.00% 27.00% 25.00%-26.00% 26.00% 25.00% 5 year 120 call, 10 days volume (original surface flat 40% volatility) 20 70 120 170 Jim Gatheral, Merrill Lynch, May-2003 m3 m6 m9 m21 m51 m81 m12 m42 m72 m03 m33 m63 m93 m24 m54 m84 m15 m45 m75 m06 The volatility impact of a 5 year 100/120 collar trade 42.00% 41.00% 40.00% 41.00%-42.00% 39.00% 40.00%-41.00% 39.00%-40.00% 38.00% 38.00%-39.00% 37.00%-38.00% 36.00%-37.00% 37.00% 35.00%-36.00% 36.00% 35.00% 5 years, 100/120 collar, 3 1/2 days volume (original surface flat 40% volatility) Liquidity and the volatility surface We see that the shape of the implied volatility surface should reflect the n structure of open delta-hedged option positions. In particular, if delta hedgers are structurally short puts and long calls, n the skew will increase relative to a hypothetical market with no frictions. • Part of what we interpret as volatility of volatility when we fit stochastic volatility models to the market can be ascribed to liquidity effects. Jim Gatheral, Merrill Lynch, May-2003",
    "title": "Barcelona2003",
    "source_type": "pdf",
    "document_id": "1af44fcd676e",
    "source_file": "Modeling the Implied Volatility Surface_barcelona2003.pdf",
    "section": "SVJJ",
    "page_number": 44,
    "page_range": "p.44-46",
    "total_pages": 49,
    "chunk_index": 19,
    "word_count": 265,
    "author": "jim",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "SVJJ (p.44-46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030430173025",
    "duration": null
  },
  {
    "text": "are structurally short puts and long calls, n the skew will increase relative to a hypothetical market with no frictions. • Part of what we interpret as volatility of volatility when we fit stochastic volatility models to the market can be ascribed to liquidity effects. Jim Gatheral, Merrill Lynch, May-2003 How option prices reflect the behavior of stock prices Short-dated implied vol. more Clustering - mean reversion of n n volatile than long-dated implied vol. volatility Significant at-the-money skew Anti-correlation of volatility moves n n and log returns Skew depends on volatility level Volatility of volatility increases with n n volatility level Jumps Extreme short-dated implied n n volatility skews High implied volatility of volatility Stock volatility depends on the n n strikes and expirations of open delta- hedged options positions. Jim Gatheral, Merrill Lynch, May-2003",
    "title": "Barcelona2003",
    "source_type": "pdf",
    "document_id": "1af44fcd676e",
    "source_file": "Modeling the Implied Volatility Surface_barcelona2003.pdf",
    "section": "SVJJ",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 49,
    "chunk_index": 20,
    "word_count": 136,
    "author": "jim",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "SVJJ (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030430173025",
    "duration": null
  },
  {
    "text": "log returns Skew depends on volatility level Volatility of volatility increases with n n volatility level Jumps Extreme short-dated implied n n volatility skews High implied volatility of volatility Stock volatility depends on the n n strikes and expirations of open delta- hedged options positions. Jim Gatheral, Merrill Lynch, May-2003 Far from being ad hoc, stochastic volatility models are natural n continuous time extensions of simple but realistic discrete-time models of stock trading. Stylized features of log returns can be related to empirically observed n features of implied volatility surfaces. By carefully examining the various stylized features of option prices and n log returns, we are led to reject all models except stochastic volatility with simultaneous index and volatility jumps. Investor risk preferences and liquidity effects also affect the observed n volatility skew so SV-type models may be misspecified and fitted parameters unreasonable. Jim Gatheral, Merrill Lynch, May-2003",
    "title": "Barcelona2003",
    "source_type": "pdf",
    "document_id": "1af44fcd676e",
    "source_file": "Modeling the Implied Volatility Surface_barcelona2003.pdf",
    "section": "Conclusions",
    "page_number": 48,
    "page_range": "p.48",
    "total_pages": 49,
    "chunk_index": 21,
    "word_count": 148,
    "author": "jim",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Conclusions (p.48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030430173025",
    "duration": null
  },
  {
    "text": "option prices and n log returns, we are led to reject all models except stochastic volatility with simultaneous index and volatility jumps. Investor risk preferences and liquidity effects also affect the observed n volatility skew so SV-type models may be misspecified and fitted parameters unreasonable. Jim Gatheral, Merrill Lynch, May-2003 Clark, Peter K., 1973, A subordinated stochastic process model with finite n variance for speculative prices, Econometrica 41, 135-156. Duffie D., Pan J., and Singleton K. (2000). Transform analysis and asset pricing n for affine jump-diffusions. Econometrica, 68, 1343-1376. Geman, Hélyette, and Thierry Ané, 2000, Order flow, transaction clock, and n normality of asset returns, The Journal of Finance 55, 2259-2284. Gatheral, J. (2002). Case studies in financial modeling lecture notes. n http://www.math.nyu.edu/fellows_fin_math/gatheral/case_studies.html Heston, Steven (1993). A closed-form solution for options with stochastic n volatility with applications to bond and currency options. The Review of Financial Studies 6, 327-343. Leland, Hayne (1985). Option Pricing and Replication with Transactions Costs. n Journal of Finance 40, 1283-1301. Lewis, Alan R. (2000), Option Valuation under Stochastic Volatility : with n Mathematica Code, Finance Press. Matytsin, Andrew (2000). Modeling volatility and volatility derivatives, Cirano n Finance Day, Montreal. http://www.cirano.qc.ca/groupefinance/activites/fichiersfinance/matytsin.pdf Wiggins J.B. (1987). Option values under stochastic volatility: theory and n empirical estimates. Journal of Financial Economics 19, 351-372. Jim Gatheral, Merrill Lynch, May-2003",
    "title": "Barcelona2003",
    "source_type": "pdf",
    "document_id": "1af44fcd676e",
    "source_file": "Modeling the Implied Volatility Surface_barcelona2003.pdf",
    "section": "References",
    "page_number": 49,
    "page_range": "p.49",
    "total_pages": 49,
    "chunk_index": 22,
    "word_count": 219,
    "author": "jim",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030430173025",
    "duration": null
  }
]