[
  {
    "text": "Chapter 1 MONTE CARLO SIMULATION FOR AMERICAN OPTIONS Russel E. Ca(cid:13)isch Mathematics Department, UCLA ca(cid:13)isch@math.ucla.edu Suneal Chaudhary Mathematics Department, UCLA suneal@ucla.edu Abstract This paper reviews the basic properties of American options and the di(cid:14)cultiesof applyingMonteCarlo valuationtoAmerican options. Asymptotic results by Keller and co-workers are described for the sin- gularityintheearlyexerciseboundaryfortimetnearthe(cid:12)naltimeT. Recent progress on application of Monte Carlo to American options is described including the following: Branching processes have been con- structed to obtain upper and lower bounds on the American option price. A Martingale optimization formulation for the American option pricecanbeusedtoobtainanupperboundontheprice,whichiscom- plementarytothetriviallower bound. TheLeastSquaresMonteCarlo (LSM) provides a direct method for pricing American options. Quasi- random sequences have been used to improve performance of LSM; a brief introductiontoquasi-randomsequencesispresented. Conclusions andprospectsforfutureresearcharediscussed. Inparticular,weexpect thattheasymptoticresultsof Kellerandco-workerscouldbeusefulfor improving Monte Carlo methods. Keywords: Americanoptions,MonteCarlo,martingaleoptimization,leastsquares MonteCarlo,Americanput,Americancallwithdividends,quasi-Monte Carlo, Brownian bridge, Least Squares Monte Carlo 1",
    "title": "MONTE CARLO SIMULATION FOR AMERICAN",
    "source_type": "pdf",
    "document_id": "a4f68796343b",
    "source_file": "MONTE CARLO SIMULATION FOR AMERICAN.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2-3",
    "total_pages": 17,
    "chunk_index": 0,
    "word_count": 136,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2-3)",
    "start_timestamp_seconds": 0,
    "upload_date": "",
    "duration": null
  },
  {
    "text": "the American option pricecanbeusedtoobtainanupperboundontheprice,whichiscom- plementarytothetriviallower bound. TheLeastSquaresMonteCarlo (LSM) provides a direct method for pricing American options. Quasi- random sequences have been used to improve performance of LSM; a brief introductiontoquasi-randomsequencesispresented. Conclusions andprospectsforfutureresearcharediscussed. Inparticular,weexpect thattheasymptoticresultsof Kellerandco-workerscouldbeusefulfor improving Monte Carlo methods. Keywords: Americanoptions,MonteCarlo,martingaleoptimization,leastsquares MonteCarlo,Americanput,Americancallwithdividends,quasi-Monte Carlo, Brownian bridge, Least Squares Monte Carlo 1 2 1. Introduction American options are derivative securities for which the holder of the security can choose the time of exercise. In an American put, for exam- ple, the option holder has the right to sell an underlying security for a speci(cid:12)ed price K (the strike price) at any time between the initiation of the agreement (t = 0) and the expiration date (t = T). The exercise time (cid:28) can be represented be represented as a stopping time; so that American options are an example of optimal stopping time problems. Valuation ofAmerican optionspresentsat least two di(cid:14)culties. First, there isa singularity inthe option characteristics at the expiration time. For American puts and calls on equities with dividends, a thorough analysis of this singularity was performed by Evans, Kuske and Keller [10]. These results are brie(cid:13)y described in Section 3 A second di(cid:14)culty occurs for Monte Carlo valuation of American op- tions, themainsubjectofthispaper. Monte Carlo methodsare required for options that dependonmultiple underlyingsecurities or that involve path dependent features. Since determination of the optimal exercise time depends on an average over future events, Monte Carlo simulation for an American option has a \\Monte Carlo on Monte Carlo\" feature that makes it computationally complex. Inthispaper,wereviewseveralmethodsforovercoming thisdi(cid:14)culty withAmericanoptions. The(cid:12)rst,developedbyBroadieandGlasserman [5]andpresentedinSection 4, involves two branchingprocesses,the (cid:12)rst of which provides an upper bound and the second a lower bound on op- tion price. The second method, presented in Section 5, is a martingale optimization formula developed in [29] that provides a dual formulation of the Monte Carlo valuation formula and leads naturally to an upper bound on the option price. The third (Section 6) is the Least Squares Monte Carlo (LSM) methodderived by Longsta(cid:11) and Schwartz [19]. Fi- nally we describework by the authors on use of quasi-random sequences in LSM [8] in Section 7. A brief introduction to the salient features of American options is given in Section 2 and a discussion of conclusions and prospects for future research is described in Section 8. 2. American options In this section we describe some of the basic features of American options. These include the Black-Scholes PDE and the risk-neutral val- uation formula for option price, the optimal exercise boundary, and the \\Monte Carlo on Monte Carlo\" di(cid:14)culty.",
    "title": "MONTE CARLO SIMULATION FOR AMERICAN",
    "source_type": "pdf",
    "document_id": "a4f68796343b",
    "source_file": "MONTE CARLO SIMULATION FOR AMERICAN.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 17,
    "chunk_index": 1,
    "word_count": 421,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "",
    "duration": null
  },
  {
    "text": "for future research is described in Section 8. 2. American options In this section we describe some of the basic features of American options. These include the Black-Scholes PDE and the risk-neutral val- uation formula for option price, the optimal exercise boundary, and the \\Monte Carlo on Monte Carlo\" di(cid:14)culty.",
    "title": "MONTE CARLO SIMULATION FOR AMERICAN",
    "source_type": "pdf",
    "document_id": "a4f68796343b",
    "source_file": "MONTE CARLO SIMULATION FOR AMERICAN.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 17,
    "chunk_index": 2,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "",
    "duration": null
  },
  {
    "text": "Monte Carlo Simulation for American Options 3 Consider an equity price process S(t) that follows an exponential Brownian motion process according to the following stochastic di(cid:11)er- ential equation dS = (cid:22)Sdt+(cid:27)Sd! (1.1) in which (cid:22) and (cid:27) are the average growth rate and volatility (both as- sumed to be constant) and ! = !(t) is standard Brownian motion. 2.1 Option payout and early exercise The option payout function is u(S;t). A path dependent option is 0 0 one for which u(S;t) depends on the entire path S(t ) : 0 < t < t ; f g whereas a simple (non-path dependent) option has u(S;t) = u(S(t);t). For a simple European option the payout may only be collected at the (cid:12)nal time so that it is f(T) = u(S(T);T). For a simple American option, exercise may be at any time before T so that the payout is f((cid:28))= u(S((cid:28));(cid:28)) in which (cid:28) is an optimally chosen stopping time. The reason (cid:28) is a stopping time is that the decision of whether to exercise at time t can only depend on the values of S up to and including t. Examplesofsimplepayout functionare acall, forwhichu= max(S (cid:0) K;0), and a put, for which u = max(K S;0). Examples of path (cid:0) dependent payouts are the Asian option u and the lookback u given A L by t u = U (t t ) (cid:0)1 S(t 0 )dt 0 (1.2) A 0 (cid:18) (cid:0) Z (cid:19) t0 0 u = U max S(t) (1.3) L (cid:18)t0<t0<t (cid:19) in which U is some function such as the call or put payout. In u and A u , the lower time limit t could be 0 or it could be t (cid:1), in which L 0 (cid:0) the average is taken over a moving time window of length (cid:1). The latter case is particularly di(cid:14)cult because the resulting American price is not a Markov process. The early exercise boundary is the set in time and state space on which exercise of the American option is optimal. For a simple option, (cid:3) this is just a curve S = S (t) in the space (S;t). For a path dependent security, the exercise decision depends on more that S(t) and t, so that the early exercise boundary is more complicated.",
    "title": "MONTE CARLO SIMULATION FOR AMERICAN",
    "source_type": "pdf",
    "document_id": "a4f68796343b",
    "source_file": "MONTE CARLO SIMULATION FOR AMERICAN.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 17,
    "chunk_index": 3,
    "word_count": 383,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "",
    "duration": null
  },
  {
    "text": "which exercise of the American option is optimal. For a simple option, (cid:3) this is just a curve S = S (t) in the space (S;t). For a path dependent security, the exercise decision depends on more that S(t) and t, so that the early exercise boundary is more complicated.",
    "title": "MONTE CARLO SIMULATION FOR AMERICAN",
    "source_type": "pdf",
    "document_id": "a4f68796343b",
    "source_file": "MONTE CARLO SIMULATION FOR AMERICAN.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 17,
    "chunk_index": 4,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "",
    "duration": null
  },
  {
    "text": "4 2.2 Black-Scholes PDE and risk-neutral valuation for American options Intheirclassicpapers,BlackandScholes[3]andMerton[21]described two methodsforvaluation ofderivative securities. The(cid:12)rstistheBlack- Scholes PDE. For an American option with value F, the Black-Scholes PDE is F +rSF +(cid:27)2S2F S = rF (1.4) t S S in which r is the risk-free rate of return. The \\(cid:12)nal condition\" is F(S;T) = u(S;T) (1.5) (cid:3) and the boundary conditions on the free boundary S = S (t) are F = u (1.6) F = u : (1.7) S S The second method, which is applicable to path-dependent options and other derivatives for which the PDE is either unavailable or in- tractable, is the risk-neutral valuation formula F(S;t) = max E 0 [e (cid:0)r((cid:28)(cid:0)t)u(S((cid:28));(cid:28)) S(t) =S] (1.8) t<(cid:28)<T j 0 in which E is the risk-neutral expectation, for which the growth rate (cid:22) in (1.1) is replaced by r. This is the formula to which Monte Carlo quadrature can be applied. This risk-neutral valuation approach provides a stochastic character- ization of the early exercise boundary. Consider the exercise decision at a point (S;t). The value of early exercise is just the payo(cid:11) u(S;t). The expected value of deferred exercise is F~ given by F~ = max E 0 [e (cid:0)r((cid:28)(cid:0)t)u(S((cid:28));(cid:28)) S(t) = S]: (1.9) t<(cid:28)<T j The holder of the option will choose to exercise if u F~, so that (cid:21) F = max(u(S;t);F~) (1.10) and u(S (cid:3) (t);t) = F~ on the early exercise boundary. A lower boundon the American option price follows fromthe formula 0 0 (1.10). Let (cid:28) be any stopping time and let F be the price using this stopping time; i.e. F 0 = E 0 [e (cid:0)r((cid:28)0(cid:0)t)u(S((cid:28) 0 );(cid:28) 0 ) S(t) = S] (1.11) j then 0 F F : (1.12) (cid:21)",
    "title": "MONTE CARLO SIMULATION FOR AMERICAN",
    "source_type": "pdf",
    "document_id": "a4f68796343b",
    "source_file": "MONTE CARLO SIMULATION FOR AMERICAN.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 17,
    "chunk_index": 5,
    "word_count": 290,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "",
    "duration": null
  },
  {
    "text": "the American option price follows fromthe formula 0 0 (1.10). Let (cid:28) be any stopping time and let F be the price using this stopping time; i.e. F 0 = E 0 [e (cid:0)r((cid:28)0(cid:0)t)u(S((cid:28) 0 );(cid:28) 0 ) S(t) = S] (1.11) j then 0 F F : (1.12) (cid:21)",
    "title": "MONTE CARLO SIMULATION FOR AMERICAN",
    "source_type": "pdf",
    "document_id": "a4f68796343b",
    "source_file": "MONTE CARLO SIMULATION FOR AMERICAN.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 17,
    "chunk_index": 6,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "",
    "duration": null
  },
  {
    "text": "Monte Carlo Simulation for American Options 5 2.3 American options on trees: rolling-back on the tree Forasecuritywhosepriceismodeledonabinarytree,evaluationofan Americanoptionwithsimplepayoutisstraightforwardby\\rolling-back\" on the tree. Suppose that the security price S follows the following n process: uS with probability p S = n (1.13) n+1 (cid:26) dS n with probability 1 p (cid:0) in which p is the risk-neutral probability and the discrete time variable runs over the values n = 0;1;:::N. Assume that the discount factor over a single time period is er(cid:14)t At the (cid:12)nal time N, exercise is determined by whether the payout is positiveornot. Consideratime k beforethe(cid:12)naltimeandsupposethat the price F has been found for all times m with m > k. The price F m k at a point S is determined as in (1.10). Set k F~0 = E 0 [e (cid:0)r(cid:14)tF(S )] (1.14) k Sk k+1 and then F = max(u(S );F~ ): (1.15) k k k In (1.14), the expectation is the empirical average over a chosen set of branches that continue from S . k This straightforward method does not apply to path-dependent secu- rities. Even at the (cid:12)rst step, the value at the (cid:12)nal time depends on the path history for each path separately, not just on the value S at the N (cid:12)nal time. These di(cid:14)culties with path-dependent securities are similar tothedi(cid:11)erencebetweenpath-integralsandPDEs. InsteadMonte Carlo methods are required for evaluation of path-dependent options. If the security is modeled as a process on a tree, then Monte Carlo can be performed on the tree as well. Similarly for options that depend on a large number of underlying securities (or random factors), Monte Carlo is required because the cor- responding Black-Scholes equation will have a large number of spatial dimensions, making it computationally intractable. For a tree in a large number of dimensions, a deterministic treatment on the tree would re- quire branching for every dimension at every time step, which is also intractable.",
    "title": "MONTE CARLO SIMULATION FOR AMERICAN",
    "source_type": "pdf",
    "document_id": "a4f68796343b",
    "source_file": "MONTE CARLO SIMULATION FOR AMERICAN.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 17,
    "chunk_index": 7,
    "word_count": 317,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "",
    "duration": null
  },
  {
    "text": "is required because the cor- responding Black-Scholes equation will have a large number of spatial dimensions, making it computationally intractable. For a tree in a large number of dimensions, a deterministic treatment on the tree would re- quire branching for every dimension at every time step, which is also intractable.",
    "title": "MONTE CARLO SIMULATION FOR AMERICAN",
    "source_type": "pdf",
    "document_id": "a4f68796343b",
    "source_file": "MONTE CARLO SIMULATION FOR AMERICAN.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 17,
    "chunk_index": 8,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "",
    "duration": null
  },
  {
    "text": "6 3. Asymptotics for American puts and calls with dividends The most common form of American options are American puts and calls. For an American call without dividends, early exercise of the option is never optimal, so that an American call (without dividends) is no di(cid:11)erent than a European call. On the other hand, early exercise may be optimal for an American put or an American call on a security that pays dividends. Calls are not exercised early because of the risk premium that o(cid:11)ers a better average rate of return for a risky asset than for a non-risky in- vestment. For a putonthe otherhand, at somelow value of thesecurity the option holder can gain more by taking the payout and investing it at the risk-free rate of return than by holding the option in hopes of a small increase in payment later. This same argument works for a call with dividend. (cid:3) Whentheearlyexercise boundaryS = S (t)hitsthe(cid:12)naltime t= T, there is a singularity in the exercise boundary shape, which is charac- (cid:3) teristic of a many free boundary problems. In addition, S (T) (the in- tersection of the early exercise boundary and the (cid:12)nal time) may di(cid:11)er from K (the exercise boundary at the (cid:12)nal time). Whilethesepropertieshavelongbeenrecognized, thedetailedasymp- totics ofthesingularityintheearlyexercise boundarywerenotanalyzed until recently. Evans, Kuske and Keller [10] derived the shape of the earlyexerciseboundaryforAmericanputandcallwithdividendsbytwo alternative methods: asymptotics for an integral equation formulation and matched asymptotics for the Black-Scholes PDE. The dividendsare assumed to payout at a continuous rate D. The early exercise boundary (cid:3) (cid:3) S (t) for the American put and S (t) for the American call satisfy the P C following: K +c (T t)log[1=(T t)] if 0 D <r 1 (cid:0) (cid:0) (cid:20) 8 p S P (cid:3) (t) = >>>>>< K +c 2 p (T (cid:0) t)log[1=(T (cid:0) t)] if D = r (1.16) >>>>>: (r=D)(K +c 3 pT (cid:0) t) if D > r (1.17) K +c (T t)log[1=(T t)] if D > r 1 (cid:0) (cid:0) 8 p S C (cid:3) (t) = >>>>>< K +c 2 p (T (cid:0) t)log[1=(T (cid:0) t)] if D = r (1.18) >>>>>: (r=D)(K +c 3 pT (cid:0) t) if 0 (cid:20) D <r",
    "title": "MONTE CARLO SIMULATION FOR AMERICAN",
    "source_type": "pdf",
    "document_id": "a4f68796343b",
    "source_file": "MONTE CARLO SIMULATION FOR AMERICAN.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 17,
    "chunk_index": 9,
    "word_count": 367,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "",
    "duration": null
  },
  {
    "text": "D > r (1.17) K +c (T t)log[1=(T t)] if D > r 1 (cid:0) (cid:0) 8 p S C (cid:3) (t) = >>>>>< K +c 2 p (T (cid:0) t)log[1=(T (cid:0) t)] if D = r (1.18) >>>>>: (r=D)(K +c 3 pT (cid:0) t) if 0 (cid:20) D <r",
    "title": "MONTE CARLO SIMULATION FOR AMERICAN",
    "source_type": "pdf",
    "document_id": "a4f68796343b",
    "source_file": "MONTE CARLO SIMULATION FOR AMERICAN.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 17,
    "chunk_index": 10,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "",
    "duration": null
  },
  {
    "text": "Monte Carlo Simulation for American Options 7 in which c ;c ;c are constants that depend on (cid:27), D and r. Note that 1 2 3 (cid:3) (cid:3) forD > r,S (T) = (r=D)K < K andforD < r,S (T) = (r=D)K >K P C which shows that the exercise boundary on the (cid:12)nal boundary is not on the early exercise curve. Also as D 0, the early exercise boundaryfor ! the American call goes away to in(cid:12)nity. Ca(cid:13)isch and Goldenfeld [7] have developed a cellular automata ap- proach to evaluation of American calls and puts with dividends. In this representation, di(cid:11)using particles are emitted from the singularity and absorbed at the free boundary. In this method the principal e(cid:11)ects are generated from the singularity point, so that the asymptotics of Evans, KuskeandKeller[10] couldpossiblybeusedto improve theconvergence of the representation. 4. Branching processes The \\Monte Carlo on Monte Carlo\" property can be seen in the de- cision formula (1.10). Consider a simulated path and a point (S(T);t) on that path. In order to decide whether to exercise at that point, one must evaluate the expectation in (1.9). This in turns requires continu- ation from (S(T);t) on many paths. Therefore this direct Monte Carlo simulation of theAmerican option requiresa set ofcontinuously branch- ing paths, which is computationally intractable. Broadie and Glasserman [5] consider a Bermudan option; i.e., an op- tion in which exercise can occur at any one of a discrete number d+1 times t ;:::;t . They constructed two branching processes, each with 0 d b branches at each exercise time. The (cid:12)rst process provides an upper estimate F and the second a lower estimate F , on average; i.e. u ‘ E[F ] F E[F ]: (1.19) ‘ u (cid:20) (cid:20) Inaddition,bothprocessesconvergetothecorrectpriceasthebranching number b and the number of paths N increase; i.e. lim F = lim F = F: (1.20) ‘ u b!1; N!1 b!1; N!1 On the other hand, this construction is computationally complex with CPU time that scales like O(Nbd). In both processes the price is determined by \\rolling-back\" on the branched paths. At the (cid:12)nal time, exercise is determined by whether the payout is positive or not. Consider a time t before the (cid:12)nal time k and suppose that the price has been found for all times t with m > k. m The price F at a point (S ;t ) is determined as in (1.10). Set k k k F~0 = E 0 [e (cid:0)r(tk+1 (cid:0)tk)u(S ;t )] (1.21) k Sk;tk k+1 k+1",
    "title": "MONTE CARLO SIMULATION FOR AMERICAN",
    "source_type": "pdf",
    "document_id": "a4f68796343b",
    "source_file": "MONTE CARLO SIMULATION FOR AMERICAN.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 17,
    "chunk_index": 11,
    "word_count": 418,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "",
    "duration": null
  },
  {
    "text": "k and suppose that the price has been found for all times t with m > k. m The price F at a point (S ;t ) is determined as in (1.10). Set k k k F~0 = E 0 [e (cid:0)r(tk+1 (cid:0)tk)u(S ;t )] (1.21) k Sk;tk k+1 k+1",
    "title": "MONTE CARLO SIMULATION FOR AMERICAN",
    "source_type": "pdf",
    "document_id": "a4f68796343b",
    "source_file": "MONTE CARLO SIMULATION FOR AMERICAN.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 17,
    "chunk_index": 12,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "",
    "duration": null
  },
  {
    "text": "8 and then F = max(u(S ;t );F~ ): (1.22) k k k k In (1.21), the expectation is the empirical average over a chosen set of branches that continue from (S ;t ). k k The di(cid:11)erence between the upper and lower processes is in which paths are used in the expectation of (1.21). In the upper process all of the branches are used. Since the early exercise decision uses knowledge ofthefutureforthe(cid:12)nitesetofbranchingpaths,thenthepriceestimate F is biased high. This gives the upper estimate in (1.19). u For the lower process, at each decision points, one of the branches is designated to be the continuation branch. The average in (1.21) is determined using the other b 1 branches. The value of this empirical (cid:0) average is independentof the continuation branch, butsince the average is approximate, the resulting exercise decision is suboptimal. There- fore the resulting price estimate F is biased low. This gives the lower ‘ estimate in (1.19). As stated in [5], it seems quite likely that there is no unbiased, con- vergent Monte Carlo estimator of the American option price. Their construction shows that this should be true because correlations with the future lead to upward bias and independence of the future leads to non-optimal early exercise causing downward bias. 5. Martingale optimization Rogers [29] derived a formula for the American option price that is dual to the formula in (1.8): F(0) = minE 0 [ max e (cid:0)rt0 u(t 0 ) M(t 0 ) ] (1.23) M 0<t0<T (cid:16) (cid:0) (cid:17) in which the minimum is taken over all martingales for which M(0) = 0. Similar formulas were derived by Anderson and Broadie [2] and Kogan and Haugh [17]. By insertion of a (non-optimal) martingale M into (1.23), one gets a upper bound on F. This has been carried out for various choices of M in [2, 17, 18, 29]. Chaudhary [9] has used this to form an approximate method for hedging the American option. In this method, it is di(cid:14)cult to determine the accuracy of the upper bound, because it is di(cid:14)cult to quantify the degree of non-optimality for the martingale that is used in (1.23) in order to generate the upper bound. Thefollowingcharacterization oftheoptimalMartingale maybe a starting point for determining the degree of optimality. The optimal (cid:3) martingale M (t) is the one coming from the American itself, for which",
    "title": "MONTE CARLO SIMULATION FOR AMERICAN",
    "source_type": "pdf",
    "document_id": "a4f68796343b",
    "source_file": "MONTE CARLO SIMULATION FOR AMERICAN.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 17,
    "chunk_index": 13,
    "word_count": 393,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "",
    "duration": null
  },
  {
    "text": "di(cid:14)cult to quantify the degree of non-optimality for the martingale that is used in (1.23) in order to generate the upper bound. Thefollowingcharacterization oftheoptimalMartingale maybe a starting point for determining the degree of optimality. The optimal (cid:3) martingale M (t) is the one coming from the American itself, for which",
    "title": "MONTE CARLO SIMULATION FOR AMERICAN",
    "source_type": "pdf",
    "document_id": "a4f68796343b",
    "source_file": "MONTE CARLO SIMULATION FOR AMERICAN.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 17,
    "chunk_index": 14,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "",
    "duration": null
  },
  {
    "text": "Monte Carlo Simulation for American Options 9 (using the Martingale decomposition of F(t)) M (cid:3) (t)= e (cid:0)rtF(t) F(0)+A(t) (1.24) (cid:0) in which A(t) is a nondecreasing process with A(0) = 0. As shown by Rogers [29], F(0) E[sup (e (cid:0)rtu(t) M (cid:3) (t))] 0<t<T (cid:20) (cid:0) = F(0)+E[sup e (cid:0)rt(u(t) F(t)) A(t) ] (1.25) 0<t<T (cid:16) (cid:0) (cid:0) (cid:17) Since both u(t)+F(t) and A(t) are nonnegative, they must both be (cid:0) 0; i.e. sup (e (cid:0)rtu(t) M (cid:3) (t)) = F(0): (1.26) 0<t<T (cid:0) One can also show that (1.26) uniquely characterizes the correct price F(0). 6. Least squares Monte Carlo (LSM) Longsta(cid:11) and Schwartz [19] introduced a new approach to Monte CarloevaluationofAmericanoptionsbyreplacingthefutureexpectation by a least squares interpolation, based on earlier work of Tsitsiklis and Van Roy [33]. The method starts with N random paths (Sk;t ) for n n 1 k N and t = ndt. Valuation is performed by rolling-back on n (cid:20) (cid:20) these paths. Suppose that Fk = F(Sk ;t ) is known. For points (Sk;t ) set n+1 n+1 n+1 n n X = Sk the current equity value and Yk = e (cid:0)rdtF(Sk ;t ) the value n n+1 n+1 of deferred exercise. Then perform regression of Y as a function of the polynomials X;X2;:::;Xm for some small value of m; i.e. approximate Y by a least squares (cid:12)t of these polynomials in X. Use this regressed valueasanapproximationto F~ in(1.9) andapplyitindecidingwhether to exercise early. In this method the least squares (cid:12)t provides coupling between the prices ondi(cid:11)erent Monte Carlo paths. Thiscoupling replaces the Monte Carlo-on-Monte CarlofeatureofdirectMonte Carloevaluation ofAmer- ican options, without the computational intractability of direct method. Ontheotherhand,thee(cid:14)ciencyoftheLSMmethoddependsononlyus- inga small numberm ofpolynomials inthe least squares(cid:12)t. Thestrong accuracy that is attained with such small degree for the polynomial (cid:12)t is remarkable. Longsta(cid:11) and Schwartz have applied this method to puts, Asian op- tions, swaps,swaptionsandotheroptionswithexcellent resultsforsmall m. A convergence proof for the LSM method has been constructed in [32].",
    "title": "MONTE CARLO SIMULATION FOR AMERICAN",
    "source_type": "pdf",
    "document_id": "a4f68796343b",
    "source_file": "MONTE CARLO SIMULATION FOR AMERICAN.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 17,
    "chunk_index": 15,
    "word_count": 324,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "",
    "duration": null
  },
  {
    "text": "Ontheotherhand,thee(cid:14)ciencyoftheLSMmethoddependsononlyus- inga small numberm ofpolynomials inthe least squares(cid:12)t. Thestrong accuracy that is attained with such small degree for the polynomial (cid:12)t is remarkable. Longsta(cid:11) and Schwartz have applied this method to puts, Asian op- tions, swaps,swaptionsandotheroptionswithexcellent resultsforsmall m. A convergence proof for the LSM method has been constructed in [32].",
    "title": "MONTE CARLO SIMULATION FOR AMERICAN",
    "source_type": "pdf",
    "document_id": "a4f68796343b",
    "source_file": "MONTE CARLO SIMULATION FOR AMERICAN.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 17,
    "chunk_index": 16,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "",
    "duration": null
  },
  {
    "text": "10 7. Quasi-Monte Carlo for LSM In their LSM paper, Longsta(cid:11) and Schwartz [19] suggested that their method might be improved by the use of quasi-random points. There are two potential di(cid:14)culties with this extension of the method: the problem is high dimensional and the prices along di(cid:11)erent paths in the LSMmethodarecorrelated, bothofwhichcan beproblematic for quasi- Monte Carlo. 7.1 Quasi-Monte Carlo Quasi-random sequences [26, 14] are a deterministic alternative to random or pseudo-random points. The distribution of quasi-random points is much more uniform that than of random points, because of correlations between the points that are designed to keep them from clumping. As a result, Monte Carlo quadrature in d dimensions us- ing N quasi-random points (i.e. quasi-Monte Carlo) can converge at a rate N (cid:0)1(logN)d, as opposed to convergence at rate N (cid:0)1=2 for random points. Theuniformityofaquasi-randomsequenceismeasuredinterms of its discrepancy, which is de(cid:12)ned as the maximum error in the Monte Carlo estimate of the volume of a rectangular set. Theexponentdforthelogindicatesthattheadvantagesofthemethod can breakdown for large dimension [23]. In addition, this convergence rate is not attained for quasi-Monte Carlo quadrature on functions that are not smooth [24]. Making e(cid:11)ective use of quasi-random sequences requires specially adapted techniques in order to avoid these limitations on the method [6, 31], including smoothing of nonsmooth integrands and reduction of e(cid:11)ective dimension. Note, however, that when the e(cid:11)ectiveness of quasi-Monte Carlo is lost, its typical performance is the same as that of standard Monte Carlo. Examples of quasi-random sequences include the sequences of Hasel- grove [13], Halton [12], Faure [11], Sobol[30] and Niederreiter [34]. Soft- ware for generating quasi-random sequences can be found, for example, in [4, 28]. A promising alternative acceleration of quasi-Monte Carlo is through randomization of the quasi-random sequence [27] which gives conver- gence rates of almost N (cid:0)3=2 for quadrature of smooth functions. When using quasi-random sequences in Gaussian random variables [22], one must use the inverse of the normal CDF (see [16] for an algo- rithm) rather than the Box-Muller method (e.g. [20]).",
    "title": "MONTE CARLO SIMULATION FOR AMERICAN",
    "source_type": "pdf",
    "document_id": "a4f68796343b",
    "source_file": "MONTE CARLO SIMULATION FOR AMERICAN.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 17,
    "chunk_index": 17,
    "word_count": 333,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "",
    "duration": null
  },
  {
    "text": "of the quasi-random sequence [27] which gives conver- gence rates of almost N (cid:0)3=2 for quadrature of smooth functions. When using quasi-random sequences in Gaussian random variables [22], one must use the inverse of the normal CDF (see [16] for an algo- rithm) rather than the Box-Muller method (e.g. [20]).",
    "title": "MONTE CARLO SIMULATION FOR AMERICAN",
    "source_type": "pdf",
    "document_id": "a4f68796343b",
    "source_file": "MONTE CARLO SIMULATION FOR AMERICAN.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 17,
    "chunk_index": 18,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "",
    "duration": null
  },
  {
    "text": "Monte Carlo Simulation for American Options 11 7.2 The Brownian bridge method The standard discretization of a random walk is to represent the po- sition b(t+(cid:1)t) in terms of the previous position b(t) by the formula b(t+(cid:1)t)= b(t)+p(cid:1)t (cid:23) (1.27) in which (cid:23) is an N(0;1) random variable. Using a sequence of indepen- dent samples of (cid:23) we can generate the random walk sequentially by y = 0; y = b((cid:1)t); y = b(2(cid:1)t); ::: (1.28) 0 1 2 Evaluation of pathintegrals, such as the risk-neutral expectation for the price of a path-dependent security, using this representation for Brow- nian motion results in a high dimensional integral, for which the e(cid:11)ec- tiveness of quasi-Monte Carlo is lost. The e(cid:11)ectiveness of quasi-Monte Carlo for path integrals will be re- gainedusinganalternativerepresentationoftherandomwalk,theBrow- nian Bridge Discretization, which was (cid:12)rst introduced as a quasi-Monte Carlo technique by [25]. This representation relies on the following Brownian bridge formula [15] for b(t + (cid:1)t ) knowing b(t) and b(T = 1 t+(cid:1)t +(cid:1)t ): 1 2 b(t+(cid:1)t ) = ab(t)+(1 a)b(T)+c(cid:23) (1.29) 1 (cid:0) in which a = (cid:1)t =((cid:1)t +(cid:1)t ) 2 1 2 c = a(cid:1)t : (1.30) 1 p Using this representation, the random walk can be generated by succes- sive subdivision. Suppose for simplicity that M is a power of 2. Then generate the random walk in the following order: y = 0; y ; y ; y ; y ; :::: (1.31) 0 M M=2 M=4 3M=4 The signi(cid:12)cance of this representation is that it (cid:12)rst chooses the large time steps over which the changes in b(t) are large. Then it (cid:12)lls in the smalltime stepsinbetween, inwhichthechanges inb(t)are quitesmall. The advantage of this representation is that it concentrates the variance into the early, large time steps. A similar, more general but slower, approach was developed in [1] using principal component analysis. Althoughtheactualdimensionoftheproblemisnotchanged, insome sense the e(cid:11)ective dimension of the problem is lowered, so that quasi- Monte Carlo retains its e(cid:11)ectiveness. To make this statement quantita- tive, suppose that at some given value of N, the discrepancy is of size",
    "title": "MONTE CARLO SIMULATION FOR AMERICAN",
    "source_type": "pdf",
    "document_id": "a4f68796343b",
    "source_file": "MONTE CARLO SIMULATION FOR AMERICAN.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 17,
    "chunk_index": 19,
    "word_count": 347,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "",
    "duration": null
  },
  {
    "text": "general but slower, approach was developed in [1] using principal component analysis. Althoughtheactualdimensionoftheproblemisnotchanged, insome sense the e(cid:11)ective dimension of the problem is lowered, so that quasi- Monte Carlo retains its e(cid:11)ectiveness. To make this statement quantita- tive, suppose that at some given value of N, the discrepancy is of size",
    "title": "MONTE CARLO SIMULATION FOR AMERICAN",
    "source_type": "pdf",
    "document_id": "a4f68796343b",
    "source_file": "MONTE CARLO SIMULATION FOR AMERICAN.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 17,
    "chunk_index": 20,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "",
    "duration": null
  },
  {
    "text": "12 N (cid:0)1 for dimension d (omitting logarithmic terms for simplicity), but is of size N (cid:0)1=2 for the remaining dimensions. We expect that the integra- tion error is roughly of the size of the variance times the discrepancy. Using the Brownian bridge discretization, the variance over the (cid:12)rst d dimensions is (cid:27) , which is about the same size as the original value of (cid:27); 0 whereas the variance over the remaining M d dimensions is (cid:27) , which 1 (cid:0) is much smaller; i.e., (cid:27) <<(cid:27) (cid:27) (1.32) 1 0 (cid:25) Denote \" and \" to be the errors for quasi-Monte Carlo using the stan- s bb darddiscretization and the Brownian bridge discretization, respectively. Then approximately \" = (cid:27)N (cid:0)1=2 s \" = (cid:27) N (cid:0)1+(cid:27) N (cid:0)1=2: (1.33) bb 0 1 The ordering (1.32) then implies that \" <<\" : (1.34) bb s This shows that the Brownian bridge discretization can provide a sig- ni(cid:12)cant improvement in quasi-Monte Carlo integration for path integral problems. 7.3 Application to the LSM method Chaudhary [8] implemented a Brownian bridge construction for the pathsintheLSMmethod. Asdescribedabove,thiscanreduceorremove the high dimensionality di(cid:14)culty for quasi-Monte Carlo quadrature of path dependent securities. In addition, the Brownian bridge method shows that the memory requirements of the LSM method can be signif- icantly reduced. The potential di(cid:14)culty with correlations between the pathsdidnotturnouttobemuchofaproblem,perhapsbecausethetrue correlations are via the early exercise boundary which is deterministic. 8. Conclusions Our intention in writing this paper is to describe the di(cid:14)culties in- volved in applying Monte Carlo evaluation to American options, as well as several recent methods that are quite promising for overcoming these di(cid:14)culties. Here are some directions that we believe to be promising for future research. The singularity in the early exercise boundary at the (cid:12)nal time has been well characterized by Keller and co-workers [10], at least for call",
    "title": "MONTE CARLO SIMULATION FOR AMERICAN",
    "source_type": "pdf",
    "document_id": "a4f68796343b",
    "source_file": "MONTE CARLO SIMULATION FOR AMERICAN.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 17,
    "chunk_index": 21,
    "word_count": 308,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "",
    "duration": null
  },
  {
    "text": "well as several recent methods that are quite promising for overcoming these di(cid:14)culties. Here are some directions that we believe to be promising for future research. The singularity in the early exercise boundary at the (cid:12)nal time has been well characterized by Keller and co-workers [10], at least for call Monte Carlo Simulation for American Options 13 and put options. The information in these asymptotic results could be valuable in improving Monte Carlo simulations. ForMartingaleoptimization, thereisnotyetagoodmethodforchoos- ing the Martingale in order to get a good approximation. In particular, one might hope to (cid:12)nd an iterative method, in which an approximate Martingale would be modi(cid:12)ed at each step in order to improve the ap- proximation over that of the previous step. The LSM method with random or quasi-random sequences has been shown to work well on a good selection of examples, but it still needs to be validated for more complicated examples, such as American Asian options with the average taken over a moving window. 9. Acknowledgement The research of this paper was supported in part by ARO through grant DAAD19-02-1-0336.",
    "title": "MONTE CARLO SIMULATION FOR AMERICAN",
    "source_type": "pdf",
    "document_id": "a4f68796343b",
    "source_file": "MONTE CARLO SIMULATION FOR AMERICAN.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14-15",
    "total_pages": 17,
    "chunk_index": 22,
    "word_count": 180,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14-15)",
    "start_timestamp_seconds": 0,
    "upload_date": "",
    "duration": null
  },
  {
    "text": "shown to work well on a good selection of examples, but it still needs to be validated for more complicated examples, such as American Asian options with the average taken over a moving window. 9. Acknowledgement The research of this paper was supported in part by ARO through grant DAAD19-02-1-0336. 14 References [1] P. Acworth and M. Broadie and P. Glasserman. A Comparison of some Monte CarloandquasiMonte Carlo techniques foroptionpric- ing. preprint, 1997. [2] L. Andersen and M. Broadie. A primal-dual simulation algorithm for pricing multi-dimensional American options. Working Paper, Columbia U., 2001. [3] F. Black and M. Scholes. The pricing of options and corporate lia- bilities. J. Political Economy, 81:637{654, 1973. [4] P. Bratley, B. L. Fox and H. Niederreiter. Algorithm 738 - Programs to generate Niederreiters discrepancy sequences. ACM Transactions on Math. Software, 20:494{495, 1994. [5] M. Broadie and P. Glasserman. Pricing American-style securities us- ingsimulation.JournalofEconomicDynamics&Control,(21):1323{ 1352, 1997. [6] R.E. Ca(cid:13)isch. Monte Carlo and Quasi-Monte Carlo Methods. Acta Numerica, pages 1{49, 1998. [7] R.E. Ca(cid:13)isch and N. Goldenfeld. private communication. 2003. [8] S.K. Chaudhary. American options and the LSM algorithm: Quasi- random sequences and Brownian bridges. 2003. [9] S.K. Chaudhary. Numerical upper bounds on Bermudan puts using martingales, the lattice and the LSM. 2003. [10] J.D. Evans and R. Kuske and J.B. Keller. American options on assets with dividends near expiry. Math. Finance, 12:219{237, 2002. [11] Henri Faure. Discr(cid:19)epance de Suites Associ(cid:19)ees a(cid:18) un syst(cid:18)eme de Num(cid:19)eration (en Dimension s). Acta Arithmetica, 41:337{351, 1982. [12] J.H.Halton.Onthee(cid:14)ciency ofcertain quasi-randomsequencesof points in evaluating multi-dimensional integrals. Numerische Math- ematik, 2:84{90, 1960. [13] C.B.Haselgrove. Amethodfornumericalintegration. Mathematical Computing, 15:323{337, 1961. [14] L.K.HuaandY. Wang. Applications of Number Theory to Numer- ical Analysis. Springer-Verlag, Berlin; New York, 1981. [15] I. Karatzas and S. E. Shreve Brownian Motion and Stochastic Cal- culus. Springer, New York, 1991. [16] W. J. Kennedy and J. E. Gentle. Statistical Computing. Dekker, New York, 1980.",
    "title": "MONTE CARLO SIMULATION FOR AMERICAN",
    "source_type": "pdf",
    "document_id": "a4f68796343b",
    "source_file": "MONTE CARLO SIMULATION FOR AMERICAN.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 17,
    "chunk_index": 23,
    "word_count": 314,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "",
    "duration": null
  },
  {
    "text": "Computing, 15:323{337, 1961. [14] L.K.HuaandY. Wang. Applications of Number Theory to Numer- ical Analysis. Springer-Verlag, Berlin; New York, 1981. [15] I. Karatzas and S. E. Shreve Brownian Motion and Stochastic Cal- culus. Springer, New York, 1991. [16] W. J. Kennedy and J. E. Gentle. Statistical Computing. Dekker, New York, 1980.",
    "title": "MONTE CARLO SIMULATION FOR AMERICAN",
    "source_type": "pdf",
    "document_id": "a4f68796343b",
    "source_file": "MONTE CARLO SIMULATION FOR AMERICAN.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 17,
    "chunk_index": 24,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "",
    "duration": null
  },
  {
    "text": "[17] L. Kogan and M. Haugh. Pricing American options: A duality ap- proach. MIT Sloan School of Management, Working Paper 4340-01, 2001. [18] D. Lamper and S. Howison. private communication. 2002. [19] F.A. Longsta(cid:11) and E.S. Schwartz. Valuing American options by simulation:asimpleleast-squaresapproach.The Review of Financial Studies, 14(1):113{147, Spr 2001. [20] G. Marsaglia. Normal (Gaussian) random variables for supercom- puters. The Journal of Supercomputing, 5:49{55, 1991. [21] R.C. Merton. The theory of rational option pricing. Bell J. Econ. Manag. Science, 4:141{183, 1973. [22] W. Moroko(cid:11) and R.E. Ca(cid:13)isch. A quasi-Monte Carlo approach to particle simulation oftheheat equation. SIAM Journal of Numerical Analysis, 30:1558{1573, 1993. [23] W. Moroko(cid:11) and R.E. Ca(cid:13)isch. Quasi-random sequences and their discrepancies. SIAM Journal of Scienti(cid:12)c and Statistical Computing, 15:1251{79, 1994. [24] W. Moroko(cid:11) and R.E. Ca(cid:13)isch. Quasi-Monte Carlo integration. Journal of Computational Physics, 112:218{30, 1995. [25] B. Moskowitz and R.E.Ca(cid:13)isch. Smoothness and dimension reduc- tion in quasi-Monte Carlo methods. Journal of Mathematical Com- puter Modelling, 23:37{54, 1996. [26] H.Niederreiter.Random number generation and quasi-Monte Carlo method. SIAM, Philadelphia, 1992. [27] A. B. Owen. Monte Carlo Variance of scrambled net quadrature. SIAM Journal of Numerical Analysis, 34:1884-1910, 1997. [28] W. H. Press and S. A. Teukolsky and W. T. Vettering and B. P. Flannery. Numerical Recipes in C. The Art of Scienti(cid:12)c Computing, Second Edition. Cambridge U. Press, 1992. [29] L.C.G.Rogers.MonteCarloValuationofAmericanOptions.Math- ematical Finance, (12):271{286, 2002. [30] I.M. Sobol’. Uniformly distributed sequences with additional uni- formity property. U.S.S.R. Computational Math. and Math. Phys., 16:1332{1337, 1976. [31] J. Spanier and E. H. Maize. Quasi-random methods for estimat- ing integrals using relatively small samples. SIAM Review, 36:18{44, 1994. [32] L. Stentoft. Convergence of the Least-Squares Monte Carlo Ap- proachtoAmericanOptionValuation.CenterforAnalyticalFinance",
    "title": "MONTE CARLO SIMULATION FOR AMERICAN",
    "source_type": "pdf",
    "document_id": "a4f68796343b",
    "source_file": "MONTE CARLO SIMULATION FOR AMERICAN.pdf",
    "section": "REFERENCES 15",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 17,
    "chunk_index": 25,
    "word_count": 277,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES 15 (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "",
    "duration": null
  },
  {
    "text": "I.M. Sobol’. Uniformly distributed sequences with additional uni- formity property. U.S.S.R. Computational Math. and Math. Phys., 16:1332{1337, 1976. [31] J. Spanier and E. H. Maize. Quasi-random methods for estimat- ing integrals using relatively small samples. SIAM Review, 36:18{44, 1994. [32] L. Stentoft. Convergence of the Least-Squares Monte Carlo Ap- proachtoAmericanOptionValuation.CenterforAnalyticalFinance 16 Working Paper Series 113, University of Aarhus School of Business, 2002. [33] J. A. Tsitsiklis and B. Van Roy. Optimal stopping of Markov pro- cesses:Hilbertspacetheory,approximationalgorithms,andanappli- cation topricinghigh-dimensional(cid:12)nancialderivatives. IEEETrans- actions on Automatic Control, 44:1840{1851, 1999. [34] C. P. Xing and H. Niederreiter. A construction of low-discrepancy sequences using global function (cid:12)elds. Acta Arithmetica, 73:87{102, 1995.",
    "title": "MONTE CARLO SIMULATION FOR AMERICAN",
    "source_type": "pdf",
    "document_id": "a4f68796343b",
    "source_file": "MONTE CARLO SIMULATION FOR AMERICAN.pdf",
    "section": "REFERENCES 15",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 17,
    "chunk_index": 26,
    "word_count": 105,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES 15 (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "",
    "duration": null
  }
]