[
  {
    "text": "No Max Pain, No Max Gain: Stock Return Predictability at Options Expiration ILIAS FILIPPOU PEDRO A. GARCIA-ARES FERNANDO ZAPATERO November19,2022 Abstract MaxPainpriceisthestrikepriceatwhichthetotalpayoffofalloptions(callsandputs) written on a particular stock, and with the same expiration date, is the lowest. We construct a measure of (potential) Max Pain gain/loss, sort stocks according to this measure,andfindthataspreadportfoliothatbuyshighMaxPainstocksandsellslow MaxPainstocksgenerateslarge,positiveandstatisticallysignificantreturnsandalphas. Ourresultsprovidestrongevidenceofstockreturnpredictabilityattheexpirationof the options. Finally, we find that these returns reverse after the options expiration week. Thisisallconsistentwithstockmanipulationonthepartofmarketparticipants withshortoptionpositions. Ourresultsareespeciallystrongforrelativelysmalland illiquidstocks. Keywords: Max Pain, stock price clustering. JEL Classification: G12, G13, G14, G23. WewouldliketothankBenjaminGolez,DmitriyMuravyev,NeilD.Pearson,FranciscoPerez,Aurelio VasquezandseminarparticipantsatBostonUniversityandITAMforusefulcomments. Filippou: JohnM. OlinBusinessSchool,WashingtonUniversityinSt. Louis,iliasfilippou@wustl.edu;Garcia-Ares: Instituto TecnológicoAutónomodeMéxico(ITAM),pedro.garcia@itam.mx;Zapatero: QuestromSchoolofBusiness, BostonUniversity,fzapa@bu.edu. Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 52,
    "chunk_index": 0,
    "word_count": 98,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "to this measure,andfindthataspreadportfoliothatbuyshighMaxPainstocksandsellslow MaxPainstocksgenerateslarge,positiveandstatisticallysignificantreturnsandalphas. Ourresultsprovidestrongevidenceofstockreturnpredictabilityattheexpirationof the options. Finally, we find that these returns reverse after the options expiration week. Thisisallconsistentwithstockmanipulationonthepartofmarketparticipants withshortoptionpositions. Ourresultsareespeciallystrongforrelativelysmalland illiquidstocks. Keywords: Max Pain, stock price clustering. JEL Classification: G12, G13, G14, G23. WewouldliketothankBenjaminGolez,DmitriyMuravyev,NeilD.Pearson,FranciscoPerez,Aurelio VasquezandseminarparticipantsatBostonUniversityandITAMforusefulcomments. Filippou: JohnM. OlinBusinessSchool,WashingtonUniversityinSt. Louis,iliasfilippou@wustl.edu;Garcia-Ares: Instituto TecnológicoAutónomodeMéxico(ITAM),pedro.garcia@itam.mx;Zapatero: QuestromSchoolofBusiness, BostonUniversity,fzapa@bu.edu. Electronic copy available at: https://ssrn.com/abstract=4140487 1 Introduction WetesttheMaxPaintheoryandshowthatitispossibletodesignlong-shortstrategiesbased on an intuitive measure of Max Pain that generate large and statistically significant returns and alphas. The Max Pain theory states that as the expiration of the options approaches, stockpricesconvergetothemaximumpainprice,thestrikepriceatwhichthetotalpayoffof the options written on that stock and with that expiration will be the lowest. The empirical validity of the Max Pain theory is consistent with possible stock price manipulation on the part of some market participants with exposure to the options payoffs. FirstweneedtoidentifytheMaxPainstrikepricecorrespondingtoaparticularstockfor a particular expiration date. Suppose all the short positions in both calls and puts written on that stock and with that expiration were held by a single market participant. We take one of the strike prices and compute what would be the cost for the seller if the stock price finished at that strike price at maturity. Some options (puts and/or calls) would be out of the money, some would be in the money and their total cost would depend on the open interest of that option. We repeat this exercise for all strike prices, and the one that yields the lowest cost for the option seller is the Max Pain strike price. Next we introduce our measure of Max Pain gain/loss. We define it as the difference between the Max Pain strike price on a particular day and the stock price on the same day, divided by the same stock price. Last, we design a Max Pain strategy in the equities market. In particular, on the second Friday of each month -typically one week before the options expiration- we allocate stocks into deciles based on our Max Pain gain/loss measure. We hold our portfolio until the expiration of the attached options, in general the third Friday of the month. We construct a zero-cost portfolio that buys high Max Pain stocks as according to the max pain theory their prices are supposed to go up to minimize option sellers losses and sells low Max Pain 1 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 52,
    "chunk_index": 1,
    "word_count": 377,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "options, in general the third Friday of the month. We construct a zero-cost portfolio that buys high Max Pain stocks as according to the max pain theory their prices are supposed to go up to minimize option sellers losses and sells low Max Pain 1 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 52,
    "chunk_index": 2,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "stocks as they are supposed to go down in price to reduce costs for the sellers. We find a positive and statistically significant return of the spread for both equally-weighted and value-weighted portfolios. The corresponding CAPM and Fama and French (1993) (FF3) alphas are also positive and significant. The source of profits to our Max Pain strategy is mainly coming from the positive returns generated by the high Max Pain stocks. Our paper is related to Ni, Pearson, and Poteshman (2005) who show that changes in options trading can affect the price of the stocks. In addition, the prices of stocks with attached options tend to cluster at strike prices as the expiration date approaches. They show that hedge rebalancing by option market makers and/or price manipulation may contribute to explain this. The theory of maximum pain goes further, saying that the stock price will tend to move toward the price where the total value of options contracts, both puts and calls together, is the lowest. This theory thus identifies the specific option strike price that will tend to attract the stock price. If the stock price closes at the strike that minimizes the total value of options contracts, this minimizes the value received by buyers and paid by option sellers when the options expire. We verify this and show that the Max Pain strategy can exploit stock return predictability close to options expiration. We also show that max pain is different from the clustering effect documented by Ni et al. (2005) as pinning is more pronounced for those portfolios in where max pain gain/loss is near zero (portfolios P5, P6 and P7) as hedge rebalancing cluster the stock price around the strike price and this is translated to a small max pain gain/loss. We further test our results in Fama and MacBeth (1973) regressions: We regress the cross-section of stock returns on Max Pain as well as on other drivers of stock returns such as price, size, stock volume, institutional ownership, book-to-market ratio, debt-to-assets, monthlyreversals,weeklyreversals,momentum,stockilliquidity,andidiosyncraticvolatility. We find that the coefficients of Max Pain remain highly positive and statistically significant. We find stronger results if we run this regression only for small, illiquid, or NASDAQ stocks 2 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 52,
    "chunk_index": 3,
    "word_count": 372,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "stock returns such as price, size, stock volume, institutional ownership, book-to-market ratio, debt-to-assets, monthlyreversals,weeklyreversals,momentum,stockilliquidity,andidiosyncraticvolatility. We find that the coefficients of Max Pain remain highly positive and statistically significant. We find stronger results if we run this regression only for small, illiquid, or NASDAQ stocks 2 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 52,
    "chunk_index": 4,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "whicharefoundtobestocksmorepronetomanipulation. Wealsoshowthatourresultsare not driven by previous month or week reversals. In addition, we establish that, on average, Max Pain stocks are growth stocks, illiquid, with low stock volume and low prices. We find similar results if we use abnormal stock returns using returns on the CRSP value-weighted index. We also analyze strategies with different formation and holding periods within the option’s life. Specifically, we formdecile portfolios twoweeks, three weeks, andfour weeks prior to expiration, and we hold the portfolios until the expiration of the options, which is the third Friday of the month. Recall that in our baseline strategy, we form a portfolio one week prior to expiration as it is more likely for stock manipulation to occur during this period. We find that the strategies formed three and four weeks to expiration offer economically positive, but not statistically significant returns and CAPM or FF3 alphas. When the portfolios are formed two weeks before expiration the long-short strategy offers economicallypositiveandstatisticallysignificantreturns,butthealphasarenotstatistically significant. Interestingly, returns increase as we get closer to the expiration of the options. Additionally, we compute abnormal volume and order imbalances for all the stocks, sortedonMaxPain,oneweekbeforetheoptionsexpiration. Abnormalvolumeisdefinedas the difference between the average daily volume of the third week of the month minus the averagevolumeofthepreviousmonth.1 Likewise, wecomputeabnormalorderimbalances. We find significantly higher abnormal volume for high and low Max Pain stocks. Similar results are obtained for abnormal imbalances, for which we show that investors are net buyersofhighMaxPainstocksandnetsellersoflowMaxPainstocksduringthethirdweek of the month. To complement the previous results we compute a retail order imbalance measure (e.g., Boehmer, Jones, Zhang, and Zhang, 2021) and find that the difference in abnormal order 1Wealsocomputeabnormalvolumebasedonthepreviousthree,sixandtwelvemonths. 3 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 52,
    "chunk_index": 5,
    "word_count": 273,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "obtained for abnormal imbalances, for which we show that investors are net buyersofhighMaxPainstocksandnetsellersoflowMaxPainstocksduringthethirdweek of the month. To complement the previous results we compute a retail order imbalance measure (e.g., Boehmer, Jones, Zhang, and Zhang, 2021) and find that the difference in abnormal order 1Wealsocomputeabnormalvolumebasedonthepreviousthree,sixandtwelvemonths. 3 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 52,
    "chunk_index": 6,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "imbalances is not statistically different from zero. This indicates that the Max Pain strategy ismorerelevantforinstitutionalinvestors,whichisconsistentwiththepossibilitythatsome market participants with exposure to the short positions manipulate stock prices before the options expiration. We established previously that high and low Max Pain stocks are on average growth stocks, small and illiquid. We further explore the implications of these characteristics for the Max Pain strategy’s performance by constructing double-sorted portfolios based on size, or illiquidity, or book-to-market ratio, on one hand, and Max Pain on the other. We find that the Max Pain strategy is positive and statistically significant regardless of the level of size or illiquidity. However, it is significant only for growth stocks. We also perform a placebo test to check if the payoff of the Max Pain strategy can be generated in another week within the lifespan of the option. Recall that the baseline strategy is based on the last week before the expiration of the options (third week of the month). In particular, in this placebo test, we form a portfolio two weeks before expiration and hold the portfolio for one week. The resulting returns and alphas are not statistically significant. This reinforces the possibility that price manipulation to minimize the cost of the short positions is a factor, because the third week of the month is when it would have to take place. We examine the performance of the Max Pain strategy one month and one week before and after its formation period. We find that the stocks we select during the third week of the month display a negative and statistically significant spread portfolio the week before and the month before the third week. On the other hand, the strategy is not significant one week and one month after the holding period. We further verify these results in an event study where week 0 is the third week of the month. In this analysis, low Max Pain stocks yield positive returns one to three weeks before the formation period, while high Max Pain stocks pay negative returns. Notably, and consistent with the previous tests, the returns 4 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 52,
    "chunk_index": 7,
    "word_count": 354,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "week 0 is the third week of the month. In this analysis, low Max Pain stocks yield positive returns one to three weeks before the formation period, while high Max Pain stocks pay negative returns. Notably, and consistent with the previous tests, the returns 4 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 52,
    "chunk_index": 8,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "of high (low) Max Pain stocks become more negative (positive) the closer the expiration date. In principle, this could be the result of a reversal. We test that possibility and in cross-sectional regressions we verify that it is unrelated to the returns of the previous week. This pattern of increasing (decreasing) returns for low (high) Max Pain portfolios one to three weeks before the option expiration week is related to the construction of our Max Pain portfolios. Low Max Pain portfolios consist of stocks that have performed well in the past and for which investors have been buying more call options. For these stocks, the max pain theory predicts that their prices will go down closer to expiration to avoid the exerciseofthesecalloptions. Thereverseissupposedtohappenforthosestockswithmore negative returns. Investors will tend to buy more put options instead. Max pain predicts that the price of these stocks will go up to leave these put options unexercised. Consistent with this argument, we find that the put-to-call open interest ratio increases with Max Pain in a monotonic fashion. We also test whether we find evidence of reversals in a shorter period than a week after the expiration of the options. To verify that the movement in prices we observe in the expiration week is due to manipulation rather than information-based trading, we determine whether prices reverse in the first trading day after expiration of the options. We find that the return is significantly more negative for the highest Max Pain stocks on the following day after expiration. We also employ NYSE Trade and Quote data (TAQ) to examine intraday evidence on intraday price patterns. We compute the stock returns for each thirty-minute interval between 9:30 and 16:00 and find that the price impact of thesereversalsisthestrongestearlierintheday. Thisevidenceindicatesthepossibilitythat some option sellers are pumping up (down) the price of the stocks with high (low) Max Pain during the expiration week and consistent with the reversion of a pure price pressure effect,thereturnrightafterexpirationissignificantlymorenegative(positive)forthesame stocks. 5 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 52,
    "chunk_index": 9,
    "word_count": 329,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "and 16:00 and find that the price impact of thesereversalsisthestrongestearlierintheday. Thisevidenceindicatesthepossibilitythat some option sellers are pumping up (down) the price of the stocks with high (low) Max Pain during the expiration week and consistent with the reversion of a pure price pressure effect,thereturnrightafterexpirationissignificantlymorenegative(positive)forthesame stocks. 5 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 52,
    "chunk_index": 10,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "Next, as it is standard on studies related to options, we check whether our results hold for similar stocks without options. If manipulation that tries to minimize the cost of short positions in options is a factor, the strategy we have presented should not work for similar, but non-optionable, stocks, and that is, in a nutshell, what we find. More explicitly, we match stocks with and without options according to a propensity score based on size and volume.2 We assign the Max Pain value of the optionable stock to its non-optionable match. Wefindthatnon-optionablestocksofferspreadportfolioswithnegativeandnotstatistically significant returns. Finally,wesortindexstocksbasedonMaxPainandfindthatthestrategyisinsignificant. This is not surprising because index stocks comprise bigger stocks that are harder to manipulate. TheoreticalFrameworkandRelatedLiterature. Ourworkcontributestoarecentstrand of the literature which examines the role of information flows between stocks and options markets (e.g., Pan and Poteshman, 2006; Ni, 2008; Cremers and Weinbaum, 2010; Ge, Lin, and Pearson, 2016; Cremers, Fodor, and Weinbaum, 2017) . For example, Hu (2014) finds that option-induced stock imbalance strongly predicts the cross-section of stock returns. In addition, option order imbalances offer important information for stock returns. Filippou, Garcia-Ares, and Zapatero (2021) show a substitution effect between lottery stocks and lottery options. Filippou, Garcia-Ares, and Zapatero (2022) find that investors with lottery preferences bet on the possibility of a short squeeze by buying call options. Ontheotherhand,Nietal.(2005)andGolezandJackwerth(2012)presentevidenceof anon-informationalchannelconsistentwiththehypothesisthatrebalancingandunwinding of option market makers’ delta hedges on or near option expiration causes the prices of individual stocks and stock index futures, respectively, to cluster or “pin” at option strike 2Ourresultsarerobusttodifferentmatchingmethods. 6 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 52,
    "chunk_index": 11,
    "word_count": 253,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "bet on the possibility of a short squeeze by buying call options. Ontheotherhand,Nietal.(2005)andGolezandJackwerth(2012)presentevidenceof anon-informationalchannelconsistentwiththehypothesisthatrebalancingandunwinding of option market makers’ delta hedges on or near option expiration causes the prices of individual stocks and stock index futures, respectively, to cluster or “pin” at option strike 2Ourresultsarerobusttodifferentmatchingmethods. 6 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 52,
    "chunk_index": 12,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "prices on option expiration dates. Ni, Pearson, Poteshman, and White (2021) find that rehedging away from expiration also changes stock price movements and influences stock return volatility and the likelihood of stock price jumps. Avellaneda and Lipkin (2003) describe a potential mechanism for these findings by examining the time derivatives’ role in the options delta. Specifically, investors with delta-hedge positions that are net buyers (sellers) of options will take opposite positions in the stock when the stock price exceeds the option strike price, and they will buy (sell) the stock otherwise. This way, they will drive the stock price towards the option strike price. We also contribute to the literature which examines stock price manipulation. Ni et al. (2005) also show that stock price manipulation by investors who write options in the week leadinguptoexpirationcontributestotheexpirationdateclusteringofoptionablestocksat strike prices. Blocher, Engelberg, and Reed (2012) show that short-sellers exercise selling pressureinthelastminutesoftheyeartoinflatetheirreturns. Ben-David,Franzoni,Landier, and Moussawi (2013) provide evidence of stock manipulation by hedge funds on reporting dates. Allen and Gale (1992), in a different setting, show that in a rational expectations model, where agents are utility maximizers, it is likely for an uninformed manipulator to generate profits, given that investors perceive the manipulator being as an informed trader. The rest of the paper is organized as follows: in section 2 we describe the theoretical framework and position this paper with respect to the relevant literature. In section 3 we describe the data and portfolio construction. Section 4 focuses on the empirical results. Section 5 provides a broad range of robustness and other specification tests, and section 6 concludes. 7 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 52,
    "chunk_index": 13,
    "word_count": 269,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "framework and position this paper with respect to the relevant literature. In section 3 we describe the data and portfolio construction. Section 4 focuses on the empirical results. Section 5 provides a broad range of robustness and other specification tests, and section 6 concludes. 7 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 52,
    "chunk_index": 14,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "2 Development of the Hypotheses Max pain occurs when market makers reach a net positive position of call and put options at a strike price where option holders stand to lose the most money. By contrast, option sellersmayreapthemostaftersellingmoreoptionsthanbuyingandcausingthemtoexpire worthless. We aim to test whether option sellers try to drive the underlying stock price toward this particular strike price. More formally, Hypothesis 1 (H1). Optionable Stocks with high (low) Max Pain gain/loss exhibit: (a.) abnormal positive (negative) returns during the third week of the month. (b.) abnormal negative (positive) returns following the turn of the following week. We expect that optionable stocks exhibit returns that are abnormally higher (lower) during the expiration week of the options (third week of the month) for high (low) max pain portfolios. These returns are due to price pressure, so we expect that prices revert following the turn of the following week. Hypothesis 2 (H2). Optionable Stocks with high (low) Max Pain gain/loss exhibit: (a.) abnormal volume during the third week of the month. (b.) abnormal buying (selling) pressure during the third week of the month. (c.) significantly more demand from institutional investors. (d.) less demand from retail investors. According to our second hypothesis, some option sellers such as large institutions that hedge large positions of their portfolios will attempt to manipulate the underlying stocks in where they have large short positions by buying or selling shares of those stocks up the third week of the month. If our conjecture is valid, we would observe abnormal volume and buying (selling) pressure in stocks with high (low) max pain gain/loss the third week ofthemonthandabnormalvolumeandselling(buying)pressuretheweekafterexpiration. 8 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 52,
    "chunk_index": 15,
    "word_count": 273,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "large short positions by buying or selling shares of those stocks up the third week of the month. If our conjecture is valid, we would observe abnormal volume and buying (selling) pressure in stocks with high (low) max pain gain/loss the third week ofthemonthandabnormalvolumeandselling(buying)pressuretheweekafterexpiration. 8 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 52,
    "chunk_index": 16,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "This effect should more pronounced for institutional investors and less prevalent for retail investors. Hypothesis 3 (H3). Small, illiquid and growth stocks are more likely to be manipulated. To assess whether the predicted patterns are the result of intentional manipulation, we examine whether such patterns are more evident in settings where manipulation is likely to be most effective. In particular, we expect the manipulation to be stronger and more effective on small and illiquid stocks as they tend to be more mispriced and easier to manipulate. In other words, the bang for the buck is higher for this type of stocks and there is a lower cost of manipulation. These stocks exhibit a high degree of information asymmetry are the more prone to manipulation (e.g. Aggarwal and Wu (2006)). Hypothesis 4 (H4). Stocks without options are less likely to be manipulated. Next, we expect stocks without options to be less manipulated as investors do not have an incentive to manipulate these stocks. Hypothesis 5 (H5). Manipulation is more likely as we get closer to the expiration of the options. We also expect the possibility of manipulation to increase as we get closer to the expiration of the options because option sellers have higher incentives to manipulate the underlying stocks. Doing so would cause most of the options to expire worthless and thus inflict \"max pain\". Overall, our hypothesis test the basic idea that as the option expiration approaches, option writers will try to buy or sell shares of stock to drive the price toward a closing price that is profitable for them, or at least to hedge their payouts to option holders. 9 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 52,
    "chunk_index": 17,
    "word_count": 278,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "test the basic idea that as the option expiration approaches, option writers will try to buy or sell shares of stock to drive the price toward a closing price that is profitable for them, or at least to hedge their payouts to option holders. 9 Electronic copy available at: https://ssrn.com/abstract=4140487 3 Data and Portfolio Construction 3.1 Stock and Option Data Stock Data. Our daily and monthly stock returns and daily trading volume are obtained fromtheCenterforResearchinSecurityPrices(CRSP),includingNewYorkStockExchange (NYSE), American Stock Exchange (AMEX), and NASDAQ markets, as well as common stocks with share codes 10 and 11, financials and non-financials. We exclude stocks with prices below $5 at the end of the month. The data span the period from January 1996 to December 2021. We also use accounting information for these stocks from the Compustat database. Option Data. We collect options data from the OptionMetrics IvyDB database and for all exchange-listed options on U.S equities. We focus on the end-of-day bid and ask quotes, trading volume, open interest, strike prices, deltas, and implied volatility. The data span the period from January 1996 to December 2021. We eliminate observations not satisfying several criteria to guard against tradability concerns. First, to avoid illiquidity concerns, we remove options with no option interest, options for which the ask price is lower than the bid price, the bid price is equal to zero, or theaverageofthebidandaskquoteislessthan0.125dollars. Second,toremovetheeffect of the early exercise premium in American options, we exclude options whose underlying stockpaysadividendduringtheremaininglifeoftheoption. Finally,weexcludealloptions that violate arbitrage restrictions. Stock Imbalances. We collect buy and sell trades from TAQ. The trades are signed following the Lee and Ready (1991) procedure. The data span the period from January 1996 to December 2021. We define the order imbalance of stock i at time t as OIB = i,t 10 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 52,
    "chunk_index": 18,
    "word_count": 300,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "collect buy and sell trades from TAQ. The trades are signed following the Lee and Ready (1991) procedure. The data span the period from January 1996 to December 2021. We define the order imbalance of stock i at time t as OIB = i,t 10 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 52,
    "chunk_index": 19,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "(Buy −Sell )/(Buy +Sell ) where Buy (Sell ) denotes the dollar value of buy i,t i,t i,t i,t i,t i,t (sell)ordersofstockiattime t. Wealsoconsideranalternativemeasureoforderimbalances that captures retail activity following Boehmer et al. (2021). The data span the period from January 2006 to December 2021. Max Pain Strike Price. One component of the Max Pain Gain Loss is the strike price associated with the minimum loss of Max Pain. Specifically, for each stock, we collect all the strike prices of the attached options. Then we compute the loss of call and put writersassumingthatthestockpriceatexpirationisequaltoeachofthestrikepricesofthe attached options. We multiply the losses by open interest.3 Intuitively, the strike price with the highest number of outstanding contracts is the price at which the stock could create the biggest losses for option buyers. For example, if a stock has only one call and one put option attached, we compute the loss of the call and put writer, assuming that the stock’s price at expiration will equal the strike price of the call option. Then we sum the losses for the two options. We repeat the same exercise for the put option’s strike price (e.g., we assume that the stock price at expiration will be equal to the put option’s strike price) and calculate the corresponding total call and put loss for an option writer. The Max Pain will be the minimum loss across the two strike prices. The Max Pain strike price will be the strike price associated with the minimum loss. Max Pain. We define as Max Pain the gain/loss implied by the max pain strategy. Specifi- cally, the Max Pain gain/loss (our sorting variable) will be the difference between the Max Pain strike price and the stock price (e.g., MaxPain = (XMaxPain−S2ndFriday)/S2ndFriday) the second Friday of the month which is the day that we form our portfolios. For simplic- 3WetakeintoaccountthatopeninterestfromOptionmetricsislaggedbyonedayafterNovember28, 2000. Priortothisdate,theopeninterestisnotlagged. 11 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 52,
    "chunk_index": 20,
    "word_count": 314,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "Max Pain gain/loss (our sorting variable) will be the difference between the Max Pain strike price and the stock price (e.g., MaxPain = (XMaxPain−S2ndFriday)/S2ndFriday) the second Friday of the month which is the day that we form our portfolios. For simplic- 3WetakeintoaccountthatopeninterestfromOptionmetricsislaggedbyonedayafterNovember28, 2000. Priortothisdate,theopeninterestisnotlagged. 11 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 52,
    "chunk_index": 21,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "ity, we label the Max Pain gain/loss as Max Pain. We provide a detailed example of the construction of the measure in Section 2 of the Internet Appendix. Figure1offerstwoexamplesofMaxPaingainsandlosses. Thetopleftpanelshowsthe MaxPain(inmillions)ofputandcalloptionsofGameStopCorp. (GME)fordifferentstrike prices on March 12, 2021. The top right panel shows the total Max Pain. We find that the strike price, associated with the minimum loss (e.g., Max Pain strike price), is $150, and the stock price on the second Friday of the month (formation period) is $264.5. Thus, the MaxpainlossorMaxPainforGMEis(150−264.5)/264.5 = −43.29%. GMEstockpriceis supposed to go down by more than 43% in order to minimize losses for the option sellers. We also show an example of Max Pain gain. The bottom left panel shows the Max Pain (in millions) for calls and puts of Moderna Inc. (MRNA) for different strike prices on September 11, 2020. The bottom right panel shows the total Max Pain. The Max Pain strike price is $69.5 and the stock price on the second Friday of the month is $59.5. Thus, the Max Pain gain is (69.5−59.5)/59.5 = 17.75%. According to max pain, Moderna stock price is expected to go up by 18% to reduce option seller losses. [Figure 1 about here.] Institutional Ownership. We collect end-of-quarter institutional stock holdings from the 13F form of the SEC (Thomson Reuters Institutional, included in WRDS). The data span the period from January 1996 to September 2021. 3.2 Max Pain Portfolios WeformdecileportfoliosofstocksthataresortedbasedontheMaxPain(e.g.,thedifference betweenthestrikepriceofMaxPainwiththestockpriceonthesecondFridayofthemonth) one week before the expiration of the options, which is typically the third Friday of the 12 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 52,
    "chunk_index": 22,
    "word_count": 258,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "13F form of the SEC (Thomson Reuters Institutional, included in WRDS). The data span the period from January 1996 to September 2021. 3.2 Max Pain Portfolios WeformdecileportfoliosofstocksthataresortedbasedontheMaxPain(e.g.,thedifference betweenthestrikepriceofMaxPainwiththestockpriceonthesecondFridayofthemonth) one week before the expiration of the options, which is typically the third Friday of the 12 Electronic copy available at: https://ssrn.com/abstract=4140487 month. Inparticular,weformportfoliosonthesecondFridayofeachmonthandholdthem for one week, which refers to the expiration date of the attached options. We offer results of equally-weighted and value-weighted portfolios. We construct a zero-cost portfolio that buys stocks with high Max Pain and sells stocks with low Max Pain. In Figure 2 we present an example of the construction of our portfolios in May 2012. Specifically, we build our portfolio on Friday 11th of May, 2012, and holds it until the 18th of May, which refers to the option’s last trading day. [Figure 2 about here.] 13 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14-15",
    "total_pages": 52,
    "chunk_index": 23,
    "word_count": 145,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14-15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "we present an example of the construction of our portfolios in May 2012. Specifically, we build our portfolio on Friday 11th of May, 2012, and holds it until the 18th of May, which refers to the option’s last trading day. [Figure 2 about here.] 13 Electronic copy available at: https://ssrn.com/abstract=4140487 4 Empirical Results 4.1 Summary Statistics We first present time-series averages of median characteristics of stocks sorted into deciles based on Max Pain. Panel A of Table 1 shows time-series averages of the median Max Pain of decile portfolios of call options sorted based on Max Pain every month, as well as the spread in Max Pain between the extreme portfolios. We find that the median max pain is -0.084 in the lowest decile and 0.076 in the highest decile rendering a difference of 0.160, which is statically significant. Panel B of table 1 reports additional characteristics of such portfolios. In particular, we find that high Max Pain portfolios tend to have lower institutional ownership (IOR), debt-to-assets(D/A),reversals(previousmonthreturn),momentum,idiosyncraticvolatility, stock volume, stock price, size in comparison to low Max Pain portfolios. At the same time, we find that the high Max Pain portfolios exhibit high book-to-market ratios and illiquidity. We do not observe statistical differences between low and high Max Pain portfolios in the NASDAQ membership or in terms of idiosyncratic volatility and debt-to-assets. Finally, we observe that the absolute difference between closing prices and nearest strike prices is the lowest for the middle portfolios (P5, P6 and P7) compare to stocks with high and low Max Pain. [Table 1 about here.] 14 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 52,
    "chunk_index": 24,
    "word_count": 266,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "terms of idiosyncratic volatility and debt-to-assets. Finally, we observe that the absolute difference between closing prices and nearest strike prices is the lowest for the middle portfolios (P5, P6 and P7) compare to stocks with high and low Max Pain. [Table 1 about here.] 14 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 52,
    "chunk_index": 25,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "WeallocatestocksintoportfoliosonthesecondFridayofeachmonthandholdtheportfolio until the expiration of the underlying options, typically the third Friday of the month. We repeat this exercise every month. Stock returns are calculated using the midpoint of the bid and ask prices at market close adjusted for stock splits using the the CRSP Cumulative Factor to Adjust Price (cfacpr). Panel A of table 2 reports returns of equally-weighted and value-weighted decile portfo- lios that are sorted every month based on Max Pain. We find that the return of the spread portfolio is positive and statistically significant, which indicates a strong economic value of max pain for the cross-sectional stock returns. In other words, our findings shed more light on the role of options in the mispricing of the underlying securities. We find similar results also in Panel A for value-weighted portfolios. Panel B of Table 2 reports alphas of the risk-adjusted spread portfolios based on CAPM and FF3 asset pricing models. In all cases, the strategy offers positive and statistically significant alphas of the spread portfolios. This is the first piece of evidence consistent with Hypothesis H1a, indicating the possibility that some option sellers are pumping up (down) the price of the stocks for which they are selling options when the expiration of these options approaches. [Table 2 about here.] 4.3 Cross-Sectional Regressions In the previous subsection, we have studied the cross-sectional predictive ability of Max Pain without taking into consideration other factors that might drive the cross-sectional variation of stock returns. To further explore the relationship between Max Pain and stock returns, we perform a cross-sectional regression that projects stock returns at time t +1 15 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "4.2 Univariate Sorts",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 52,
    "chunk_index": 26,
    "word_count": 274,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.2 Univariate Sorts (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "predictive ability of Max Pain without taking into consideration other factors that might drive the cross-sectional variation of stock returns. To further explore the relationship between Max Pain and stock returns, we perform a cross-sectional regression that projects stock returns at time t +1 15 Electronic copy available at: https://ssrn.com/abstract=4140487 on several predictor variables at time t. Table 3 reports the average coefficient of such regressionandthecorrespondingaverageadjustedR-squared. Thesetofpredictorvariables (e.g., Controls) includes the stock illiquidity, price, size, book to market, debt to assets, stock volume (SVOL), institutional ownership (IOR), idiosyncratic volatility (IVOL), weekly reversals, monthly reversals, and momentum. We show results for the entire sample and for small, illiquid, and Nasdaq stocks. Specifically, we focus on the model below: Ret = α+βMaxPain +γControls +(cid:34) (1) i,t+1 i,t i,t i,t+1 where Ret represents the return of stock i at time t +1. Table 3 shows that Max Pain i,t+1 is a strong positive predictor of the cross-section of stock returns even after controlling for other drivers of stock returns. It is worth mentioning that both monthly and weekly reversals cannot explain the cross-sectional predictive ability of Max Pain. This finding also reinforces our first hypothesis (H1a). Aggarwal and Wu (2006) demonstrate that manipulation is not equally likely across all stocks. Specifically, they show that manipulation is more likely among NASDAQ stocks, illiquid stocks, and small stocks. In line with this, we find that our max pain coefficients are more economically and statistically significant for small stocks, illiquid stocks, and NASDAQ stocks. This is consistent with the idea that manipulators would focus on stocks on which they can have large price impact. These results are strongly consistent with the prediction of Hypothesis H3. [Table 3 about here.] 16 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "4.2 Univariate Sorts",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 52,
    "chunk_index": 27,
    "word_count": 289,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.2 Univariate Sorts (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "significant for small stocks, illiquid stocks, and NASDAQ stocks. This is consistent with the idea that manipulators would focus on stocks on which they can have large price impact. These results are strongly consistent with the prediction of Hypothesis H3. [Table 3 about here.] 16 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "4.2 Univariate Sorts",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 52,
    "chunk_index": 28,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.2 Univariate Sorts (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "Here,weconsiderthedifferentformationandholdingperiods. Inourmainanalysis,webuy a stock a week before expiration and hold it until expiration. Table 4 shows average stock returns sorted based on max pain for different holding and formation periods. We form portfolios two, three, or four weeks before expiration. In all cases we hold the portfolios until expiration. We show results for equally-weighted and value-weighted portfolios. Panel A of Table 4 shows average stock returns of such portfolios. In any case, we find that the strategies that consider the different formation and holding periods within the life of the options offer economically positive but not statistically significant Max Pain spread portfolios. The only exception is the portfolio that is formed two weeks prior to the expiration of the option. However, the alphas of the spread portfolio in Panel B are not statistically significant. Interestingly, we observe that the return of the spread portfolios in Panel A decreases, and it is less significant the farther we are from the expiration date of the attached options as the likelihood of stock manipulation decreases. This finding is line with our fifth hypothesis (H5) which states that manipulation is stronger as we get closer to the expiration of the options. [Table 4 about here.] 4.5 Trading Activity during the Holding Period Abnormal Volume. Table 5 reports time-series averages of median abnormal volume of stocks sorted into deciles based on Max Pain. We form portfolios on the first, second, or third Friday of the month. We compute abnormal volume as: AbnormalVolume = Volume −Volume , (2) w,m w,m m−1→m−n 17 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "4.4 Different Holding and Formation Periods",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 52,
    "chunk_index": 29,
    "word_count": 261,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Different Holding and Formation Periods (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "5 reports time-series averages of median abnormal volume of stocks sorted into deciles based on Max Pain. We form portfolios on the first, second, or third Friday of the month. We compute abnormal volume as: AbnormalVolume = Volume −Volume , (2) w,m w,m m−1→m−n 17 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "4.4 Different Holding and Formation Periods",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 52,
    "chunk_index": 30,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Different Holding and Formation Periods (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "where Volume represents the average daily volume (expressed in millions) over the w last week w of month m before the expiration of the option and Volume is the m−1→m−n average daily volume over the months m−n to m−1 where n = 1,3,6,12. We find that the abnormal stock volume is concentrated in low and high max pain portfolios. These portfolios contain stocks that are supposed to go up or go down significantly according to the max pain theory. Specifically, the difference between the time-series average of P10 and P1 is positive and not statistically significant, but the differences between portfolios P10 and P5 and P1 and P5 are also highly positive and significant. The results are similar if we compute the abnormal volume against the previous three, six, or twelve-month average stock volume. This finding supports our second hypothesis (H2). [Table 5 about here.] Abnormal Order Imbalances. Our second hypothesis (H2) also highlights that option- able stocks with high (low) Max Pain gain/loss exhibit abnormal buying (selling) during the third week of the month. Table 6 reports time-series averages of median abnormal volume of stocks sorted into deciles based on Max Pain. We form portfolios on the first, second, or third Friday of the month. We compute abnormal volume as: AbnormalOIB = OIB −OIB , (3) w,m w,m m−1→m−n where OIB represents the average daily order imbalance over the last week w of month w m before the expiration of the option and OIB is the average daily volume over m−1→m−n the months m−n to m−1 where n = 1,3,6,12. We report results for aggregated order imbalances (Panel A) as well as order imbalances that capture retail trading (Panel B) following (e.g., Boehmer et al., 2021). 18 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "4.4 Different Holding and Formation Periods",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 52,
    "chunk_index": 31,
    "word_count": 293,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Different Holding and Formation Periods (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "and OIB is the average daily volume over m−1→m−n the months m−n to m−1 where n = 1,3,6,12. We report results for aggregated order imbalances (Panel A) as well as order imbalances that capture retail trading (Panel B) following (e.g., Boehmer et al., 2021). 18 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "4.4 Different Holding and Formation Periods",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 52,
    "chunk_index": 32,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Different Holding and Formation Periods (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "We find in Panel A of Table 6 that investors are net buyers of high Max Pain portfolios andnetsellersoflowMaxPainportfolios. Thedifferenceinorderimbalancesbetweenhigh and low Max Pain portfolios is statistically significant. We find similar results for abnormal order imbalances that are measured against average imbalances of the previous three, six, and twelve months. Panel B shows the corresponding results for order imbalances of retail investors. Retail investors tend to be net buyers of high and low Max Pain portfolios. In addition, we observe that the difference between portfolios P10 and P1 is not statistically different from zero. We observe a similar pattern for abnormal imbalances measured against order imbalances of the previous three, six, and twelve months. This finding might indicate that the Max Pain strategy is not a strategy that retail investors try to exploit and is somewhat more relevant for sophisticated investors. [Table 6 about here.] 4.6 Double Sorts We double sort stocks into portfolios based on size, illiquidity, book-to-market ratio, and Max Pain. Specifically, we allocate stocks into two quintiles based on size, illiquidity, or book-to-market ratio, and then within each portfolio, we form quintile portfolios sorted based on Max Pain. We report the average return of each portfolio and the corresponding spread portfolios. Panel A of Table 7 shows that the Max Pain strategy is highly significant for low and high size portfolios. The return of the spread portfolio is slightly higher for small stocks as they are easier to be manipulated. Panel B shows that the Max Pain strategy is highly significant for low and high illiquidity stocks. The return of the spread portfolio is higher for more illiquid stocks. Panel C shows that the Max Pain strategy is highly significant only for low book-to-market stocks, which indicates that the strategy is more profitable 19 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "4.4 Different Holding and Formation Periods",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 52,
    "chunk_index": 33,
    "word_count": 302,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Different Holding and Formation Periods (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "highly significant for low and high illiquidity stocks. The return of the spread portfolio is higher for more illiquid stocks. Panel C shows that the Max Pain strategy is highly significant only for low book-to-market stocks, which indicates that the strategy is more profitable 19 Electronic copy available at: https://ssrn.com/abstract=4140487 for growth stocks while it is not significant for high book-to-market portfolios as they are harder to be manipulated. This finding verifies our third hypothesis (H3). [Table 7 about here.] 4.7 Placebo Test Our previous results indicate that the Max Pain strategy is more significant the closer we are to the expiration of the attached options. Here we consider a placebo test where we form a portfolio two weeks to expiration (instead of one week to expiration) and hold the portfolio for one week instead of waiting until the expiration of the options. Panel A of Table 8 report average stock returns of portfolios sorted based on Max Pain two weeks to the expiration of the attached options. We show results for equally-weighted and value-weighted portfolios. In line with our conjecture, we find that a strategy that is lagged by one week (in comparison to the previously reported Max Pain strategy) offers spread portfolios that are not economically and statistically significant. We find in Panel B that the corresponding alphas are not statistically significant. This finding indicates that the return pattern observed in Table 2 is not mechanical and reflects the trading activity of investors attempting to manipulate the attached stocks. This finding supports our fifth hypothesis (H5) because the possibility of a manipulation is stronger as we get closer to the expiration of the option. [Table 8 about here.] 20 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "4.4 Different Holding and Formation Periods",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 52,
    "chunk_index": 34,
    "word_count": 286,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Different Holding and Formation Periods (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "not mechanical and reflects the trading activity of investors attempting to manipulate the attached stocks. This finding supports our fifth hypothesis (H5) because the possibility of a manipulation is stronger as we get closer to the expiration of the option. [Table 8 about here.] 20 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "4.4 Different Holding and Formation Periods",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 52,
    "chunk_index": 35,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Different Holding and Formation Periods (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "In this section, we examine the performance of the Max Pain strategy in periods before and after the third week of the month. We form decile portfolios of stocks that are sorted on Max Pain on the second Friday of each month. Then we compute the average return of the same portfolios one month before, one week before, one week after, and one month after the third week of the current month. Panel A of Table 9 shows average weekly stock returns of such portfolios. We find that high (low) Max Pain stocks offered negative (positive) and significant returns the month and week before the formation period. We find that a spread portfolio between P10 and P1 offers negative and statistically significant returns. However, we find that the return of high Max Pain stocks is positive one week and one month after the formation period, but it is not economically and statistically significant. This finding indicates that high (low) Max Pain stocks performed poorly (well) in the past, but our results are not related to stock reversals, as shown in Table 3 where weekly and monthly reversals cannot subsume the cross-sectional predictability of Max Pain for stock returns. Panel B shows the spread portfolios’ corresponding alphas. We find that the alphas are highly negative and significant for one month and one week before the formation period and insignificant for one week and one month after the third week of the current month. This is line with our first hypothesis (H1a). [Table 9 about here.] We further verify these results in an event study. Figure 3 shows weekly stock returns of stocks with low and high Max Pain. Week 0 refers to our formation period, the second Friday of the month. We form decile portfolios in Week 0 and report the return of low 21 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Period",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 52,
    "chunk_index": 36,
    "word_count": 309,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Period (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "in an event study. Figure 3 shows weekly stock returns of stocks with low and high Max Pain. Week 0 refers to our formation period, the second Friday of the month. We form decile portfolios in Week 0 and report the return of low 21 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Period",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 52,
    "chunk_index": 37,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Period (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "and high Max Pain portfolios. Then we report in weeks -3 to -1 and Week 1 to Week 4 the returns of the low and high Max Portfolios we selected in Week 0. In this way, we examine the performance of low and high Max Pain stocks three weeks before and four weeks after the formation period. Our findings verify our previous findings. Specifically, we find that low Max Pain stocks exhibit very positive returns the weeks before the formation period that reverse during the third week of the month. We also find that high Max Pain portfolios offer very negative returns that become more negative as we get closer to the formation period and their returns reverse and become positive during the holding period. This is in line with our first hypothesis (H1a). The pattern of returns before the third week of the month is related to the construction of our max pain portfolios. In the case of those stocks that performed well in the past, investors will tend to buy more calls options at lower prices as they believe that these stocks will continue going up in the future. For these stocks, the max pain theory predicts that they will go down closer to expiration to avoid the exercise of these call options. The reverse is supposed to happen for those stocks that performed badly in the past. Investors will tend to buy more put options at higher prices as they believe that the downward trend will continue. Max pain predicts that the price of these stocks will go up to leave these put options unexercised. [Figure 3 about here.] 4.9 Daily Returns after the Options Expiration date We now examine whether there are reversals after the option expiration date. If the movementsintheweekpriortooptionexpirationareduetomanipulationoftheunderlying stock price, then the stock price movement should reverse right after the option expiration date. In the previous section, we did not find evidence of reversals in the week after the 22 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Period",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 52,
    "chunk_index": 38,
    "word_count": 332,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Period (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "examine whether there are reversals after the option expiration date. If the movementsintheweekpriortooptionexpirationareduetomanipulationoftheunderlying stock price, then the stock price movement should reverse right after the option expiration date. In the previous section, we did not find evidence of reversals in the week after the 22 Electronic copy available at: https://ssrn.com/abstract=4140487 options expiration date. We now test whether we find evidence of reversals in a shorter periodaftertheexpirationoftheoptions. Inotherwords,wearetestingourfirsthypothesis (H1b). We follow Ben-David et al. (2013) and for each stock expiration date, we construct indicator variables based on the deciles portfolios sorted on Max Pain. We drop the first indicator variable to avoid perfect multicollinearity. We then regress in Table 10 the abnormal daily stock return for the three days after options expiration onto the max pain portfolio indicators. We calculate abnormal stock returns using returns on the CRSP value-weighted index. Standard errors are clustered at the date and firm level. Table 10 shows that the return is significantly more negative for the highest Max Pain stocks (deciles 9 and 10) on the following day after expiration. The panel also shows that thereisnoeffectforthesestocksontheotherdaysafterexpiration. Thisevidenceindicates the possibility that some option sellers are pumping up (down) the price of the stocks with high(low)MaxPainduringtheexpirationweekandconsistentwiththereversionofapure price pressure effect, the return after expiration is significantly more negative (positive) for the same stocks. [Table 10 about here.] 4.10 Intraday Returns after the Options Expiration date We also employ NYSE Trade and Quote data (TAQ) to examine intraday evidence on price patterns. We compute the stock returns for each thirty-minute interval between 9:30 and 16:00. Table 11 shows results for regressions of thirty-minutes interval returns of decile dum- mies. We cluster the standard errors by firm and date. We eliminate the first dummy 23 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Period",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 52,
    "chunk_index": 39,
    "word_count": 290,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Period (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "on price patterns. We compute the stock returns for each thirty-minute interval between 9:30 and 16:00. Table 11 shows results for regressions of thirty-minutes interval returns of decile dum- mies. We cluster the standard errors by firm and date. We eliminate the first dummy 23 Electronic copy available at: https://ssrn.com/abstract=4140487 variable. WefindthecoefficientofD10isnegativeandstatisticallysignificantfrom10amto 11:30am. This pattern shows strong evidence of return reversal in line with our hypothesis 1 (H1b). Overall,ourresultsshowthatstockswithhighmaxpainexhibitabnormallyhighreturns in the expiration week of the options and abnormally low returns in the first hours of the following day after expiration. [Table 11 about here.] 5 Robustness 5.1 Put to Call Open Interest Ratios Table 12 reports time-series average of median put to call open interest portfolios. We find that the put-to-call open interest ratio increases with Max Pain in a monotonic fashion. The difference between high and low Max Pain portfolios is highly positive and significant, indicating higher open interest for put (call) options for high (low) Max Pain portfolios. These results are in line with the role of options and the performance of max pain before the third week of the month. [Table 12 about here.] 24 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "Period",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 52,
    "chunk_index": 40,
    "word_count": 193,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Period (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "positive and significant, indicating higher open interest for put (call) options for high (low) Max Pain portfolios. These results are in line with the role of options and the performance of max pain before the third week of the month. [Table 12 about here.] 24 Electronic copy available at: https://ssrn.com/abstract=4140487 We show cross-sectional regressions of abnormal returns on Max Pain and control variables. Table 13 reports the average coefficient of such regressions and the corresponding average adjusted R-squared. The set of predictor variables (e.g., Controls) includes the stock illiquidity, price, size, book to market, debt to assets, stock volume (SVOL), institutional ownership (IOR), idiosyncratic volatility (IVOL), weekly reversals, monthly reversals, and momentum. We show results for the entire sample, small, illiquid, and Nasdaq stocks. Specifically, we focus on the model below: Ret = α+βMaxPain +γControls +(cid:34) (4) i,t+1 i,t i,t i,t+1 whereRet representstheabnormalreturnofstocki attime t+1. Wecalculateabnormal i,t+1 stock returns using returns on the CRSP value-weighted index. Table 13 shows that Max Painisastrongpositivepredictorofthecross-sectionofstockreturnsevenaftercontrolling for other drivers of stock returns. We also find that our results are robust to different subgroups, namely, small stocks, illiquid stocks and NASDAQ stocks. This finding supports our second hypothesis (H2). [Table 13 about here.] 5.3 Stocks with and without Options Our main analysis focuses on stocks with options. Here we test whether the stock pattern we observe in Max Pain sorted portfolios is solely related to the information of the attached options, which correspond to Max Pain. In other words, similar stocks without options should not render a significant pattern. To this end, we match stocks with and without options based on size and volume using propensity score matching. We apply a one-to-one 25 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "5.2 Abnormal Returns",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 52,
    "chunk_index": 41,
    "word_count": 283,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.2 Abnormal Returns (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "the attached options, which correspond to Max Pain. In other words, similar stocks without options should not render a significant pattern. To this end, we match stocks with and without options based on size and volume using propensity score matching. We apply a one-to-one 25 Electronic copy available at: https://ssrn.com/abstract=4140487 matching without replacement. Then we assign the Max Pain values of each optionable stocktoanon-optionablestockwithsimilarcharacteristics. Wesortstockswithandwithout options based on Max Pain for the matched samples. We find in Panel A of Table 14 that onlystockswithoptionsrenderapositiveandstatisticallysignificantreturn, indicatingthat our finding is inherited from the options market. We find similar results, in Panel B, for the CAPM and FF3 alphas of the spread portfolios. This finding supports our fourth hypothesis (H4). [Table 14 about here.] 5.4 Index Options Our previous analysis indicates that the Max Pain strategy is more concentrated in groups of illiquid stocks with low book-to-market ratios. Thus, we expect the strategy to perform poorly for index options as they comprise large stocks. Panel A of Table 15 shows returns of index options that are sorted into terciles based on Max Pain. We find the average index returntotheMaxPainstrategydecreaseswithMaxPainrenderingaspreadportfoliothatis negative and not statistically significant. We also report the corresponding average values of Max Pain, which significantly increase with Max Pain pain, but this pattern does not translate to significant return spread portfolios. We find similar results, in Panel B, for the alphas of the spread portfolio. This finding supports our third hypothesis (H3) because index options include large and liquid stocks. [Table 15 about here.] 26 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "5.2 Abnormal Returns",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 52,
    "chunk_index": 42,
    "word_count": 258,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.2 Abnormal Returns (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "but this pattern does not translate to significant return spread portfolios. We find similar results, in Panel B, for the alphas of the spread portfolio. This finding supports our third hypothesis (H3) because index options include large and liquid stocks. [Table 15 about here.] 26 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "5.2 Abnormal Returns",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 52,
    "chunk_index": 43,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.2 Abnormal Returns (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "6 Conclusions In this paper, we test the empirical validity of the maximum pain theory. We construct a measure of Max Pain price increases and/or decreases and form decile portfolios on the second Friday of each month. We hold the portfolios for one week. We find that a spread portfolio that buys high Max Pain stocks and sells low Max Pain stocks offers very positive and statistically significant returns. We find similar results for alphas. We also show that these abnormal returns revert following the turn of the following week. Our results are similar in cross-sectional regressions when we control for other drivers of stocks returns. We find that high Max Pain portfolios tend to be growth stocks that are small and illiquid. We also construct a placebo test where the formation period is the first Friday of the month and we hold the portfolios for one week. We find that the spread portfolio of this strategy is not statistically significant. Wecomputetheabnormalstockvolumeandorderimbalancesofstockssortedbasedon MaxPain. High(Low)MaxPainstockshavehigherabnormalvolumeandorderimbalances. However, we do not find significant results for retail abnormal order imbalances, implying thatthis strategyismorerelevant forinstitutionalinvestors. Wealso showthatthestrategy is insignificant if we form portfolios two, three, or four weeks to expiration and hold them until expiration. However, the strategies’ returns become more significant the closer we get to the expiration of the options. We also construct a similar strategy for stocks without options. Specifically, we match stocks with and without options based on size and volume and assign each optionable stock’s Max Pain value to its non-optionable pair. We form decile portfolios on the second Friday of the month based on Max Pain for both groups of stocks, and we find that the strategy is significant only for stocks with options. In this way, we verify that our results depend on the information obtained from the options market. 27 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "5.2 Abnormal Returns",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 52,
    "chunk_index": 44,
    "word_count": 308,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.2 Abnormal Returns (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "second Friday of the month based on Max Pain for both groups of stocks, and we find that the strategy is significant only for stocks with options. In this way, we verify that our results depend on the information obtained from the options market. 27 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "5.2 Abnormal Returns",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 52,
    "chunk_index": 45,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.2 Abnormal Returns (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "Aggarwal, R. and G. Wu (2006). Stock market manipulations. The Journal of Business 79, 1915–1953. Allen,F.andD.Gale(1992). Stock-pricemanipulation. TheReviewofFinancialStudies5(3), 503–529. Avellaneda, M. and M. D. Lipkin (2003). A market-induced mechanism for stock pinning. Quantitative Finance 3(6), 417. Ben-David,I.,F.Franzoni,A.Landier,andR.Moussawi(2013). Dohedgefundsmanipulate stock prices? The Journal of Finance 68(6), 2383–2434. Blocher, J., J. Engelberg, and A. V. Reed (2012). The long-short wars: Evidence of end-of- year manipulation by short sellers. Available at SSRN 1364835. Boehmer, E., C. M. Jones, X. Zhang, and X. Zhang (2021). Tracking retail investor activity. The Journal of Finance 76(5), 2249–2305. Cremers, M., A. Fodor, and D. Weinbaum (2017). How do informed option traders trade. Option trading activity, news releases, and stock return predictability. University of Notre Dame Working Paper. Cremers, M. and D. Weinbaum (2010). Deviations from put-call parity and stock return predictability. Journal of Financial and Quantitative Analysis 45(2), 335–367. Fama, E. F. and K. R. French (1993). Common risk factors in the returns on stocks and bonds. Journal of Financial Economics 33(1), 3–56. Fama, E. F. and J. D. MacBeth (1973). Risk, return, and equilibrium: Empirical tests. The Journal of Political Economy, 607–636. 28 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "References",
    "page_number": 29,
    "page_range": "p.29-30",
    "total_pages": 52,
    "chunk_index": 46,
    "word_count": 192,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.29-30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "Fama, E. F. and K. R. French (1993). Common risk factors in the returns on stocks and bonds. Journal of Financial Economics 33(1), 3–56. Fama, E. F. and J. D. MacBeth (1973). Risk, return, and equilibrium: Empirical tests. The Journal of Political Economy, 607–636. 28 Electronic copy available at: https://ssrn.com/abstract=4140487 Filippou, I., P. A. Garcia-Ares, and F. Zapatero (2021). Demand for lotteries: The choice between stocks and options. Available at SSRN 3016462. Filippou, I., P. A. Garcia-Ares, and F. Zapatero (2022). Betting on the likelihood of a short squeeze. Available at SSRN 3437085. Ge, L., T.-C. Lin, and N. D. Pearson (2016). Why does the option to stock volume ratio predict stock returns? Journal of Financial Economics 120(3), 601–622. Golez, B. and J. Jackwerth (2012). Pinning in the s&p 500 futures. Journal of Financial Economics 106(1), 566–588. Hu, J. (2014). Does option trading convey stock price information? Journal of Financial Economics 111(3), 625–645. Lee, C. and M. J. Ready (1991). Inferring trade direction from intraday data. The Journal of Finance 46(2), 733–746. Newey, W. K. and K. D. West (1987). A simple, positive semi-definite, heteroskedasticity and autocorrelation consistent covariance matrix. Econometrica 55(3), 703–708. Ni, S. X. (2008). Stock option returns: A puzzle. Available at SSRN 1340767. Ni, S. X., N. D. Pearson, and A. M. Poteshman (2005). Stock price clustering on option expiration dates. Journal of Financial Economics 78(1), 49–87. Ni, S. X., N. D. Pearson, A. M. Poteshman, and J. White (2021). Does option trading have a pervasive impact on underlying stock prices? The Review of Financial Studies 34(4), 1952–1986. Pan, J. and A. M. Poteshman (2006). The information in option volume for future stock prices. Review of Financial Studies 19(3), 871–908. 29 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "References",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 52,
    "chunk_index": 47,
    "word_count": 289,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "and J. White (2021). Does option trading have a pervasive impact on underlying stock prices? The Review of Financial Studies 34(4), 1952–1986. Pan, J. and A. M. Poteshman (2006). The information in option volume for future stock prices. Review of Financial Studies 19(3), 871–908. 29 Electronic copy available at: https://ssrn.com/abstract=4140487 Figure 1. Example of the Construction of Max Pain GME Stock - Call and Put Max Pain 5000 4000 3000 2000 1000 0 100 200 300 400 500 600 700 800 Strike Prices )$ noillim ni( niaP xaM GME Stock - Total Max Pain 5000 4000 3000 2000 1000 0 100 200 300 400 500 600 700 800 Strike Prices Call Max Pain Put Max Pain )$ noillim ni( niaP xaM Max Pain Moderna Stock - Call and Put Max Pain 80 70 60 50 40 30 20 10 0 35 40 45 50 55 60 65 70 75 80 Strike Prices )$ noillim ni( niaP xaM Moderna Stock - Total Max Pain 80 70 60 50 40 30 20 10 0 35 40 45 50 55 60 65 70 75 80 Strike Prices Call Max Pain Put Max Pain )$ noillim ni( niaP xaM MaxPain Current Loss Stock -43.29% Price MaxPain $264.5 Strike Price $150 MaxPain Current Gain Stock 17.75% Price MaxPain $59.5 Strike Price $69.5 Max Pain ThefiguredisplaystwoexampleoftheconstructionoftheMaxPaingainlossmeasure. ThetopfigureshowanexampleofMaxPainlossusingdatafromthe GMEstockonMarch12,2021. ThebottompanelsusedataofModernaforagainonSeptember11,2020. ThedataarecollectedfromOptionMetricsand CRSP. Electronic copy available at: https://ssrn.com/abstract=4140487 30 Figure 2. Example of Portfolio Formation and Holding Periods May 2012 Monday Tuesday Wednesday Thursday Friday Saturday Sunday 1 2 3 4 5 6 FormingPortfolios 7 8 9 10 11 12 13 HoldingPeriod HoldingPeriod HoldingPeriod HoldingPeriod HoldingPeriod OptionsExpire 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 ThefiguredisplaysanexampleoftheformationandholdingperiodofthestrategyforMay2012. 31 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "References",
    "page_number": 31,
    "page_range": "p.31-32",
    "total_pages": 52,
    "chunk_index": 48,
    "word_count": 294,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.31-32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "Wednesday Thursday Friday Saturday Sunday 1 2 3 4 5 6 FormingPortfolios 7 8 9 10 11 12 13 HoldingPeriod HoldingPeriod HoldingPeriod HoldingPeriod HoldingPeriod OptionsExpire 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 ThefiguredisplaysanexampleoftheformationandholdingperiodofthestrategyforMay2012. 31 Electronic copy available at: https://ssrn.com/abstract=4140487 Figure 3. Weekly Event Study Event Study - Stock Returns 0.03 0.02 0.01 0 -0.01 -0.02 -3 -2 -1 0 1 2 3 4 Weeks snruteR kcotS Low Max Pain High Max Pain Thefiguredisplaysaneventstudyofweeklystockreturnsaroundtheweekoftheholdingperiodforlowandhighmaxpain portfolios. ThedataarecollectedfromOptionMetricsandCRSPandcontaindailyseriesfromJanuary1996toDecember2021. 32 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "References",
    "page_number": 33,
    "page_range": "p.33-34",
    "total_pages": 52,
    "chunk_index": 49,
    "word_count": 92,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.33-34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "31 ThefiguredisplaysanexampleoftheformationandholdingperiodofthestrategyforMay2012. 31 Electronic copy available at: https://ssrn.com/abstract=4140487 Figure 3. Weekly Event Study Event Study - Stock Returns 0.03 0.02 0.01 0 -0.01 -0.02 -3 -2 -1 0 1 2 3 4 Weeks snruteR kcotS Low Max Pain High Max Pain Thefiguredisplaysaneventstudyofweeklystockreturnsaroundtheweekoftheholdingperiodforlowandhighmaxpain portfolios. ThedataarecollectedfromOptionMetricsandCRSPandcontaindailyseriesfromJanuary1996toDecember2021. 32 Electronic copy available at: https://ssrn.com/abstract=4140487 Table 1. Characteristics of Max Pain Portfolios Thistabledisplaystime-seriesaveragesofmediancharacteristicsofstockssortedintodecilesonthelastweekbeforethe expirationFridayofthemonthbasedonmaxpain. PanelAshowstime-seriesaveragesofmedianmaxpain(inmillions) of portfolios sorted based on the max pain measure. We report in Panel B the stock price, momentum (MOM), stock reversals (REV), illiquidity (ILLIQ) (in percent), a dummy variable that takes a value of one is the stock is traded in NASDAQ, institutionalownership(IOR), booktomarket (B/M),Size (inbillion), Debtto assets(D/A),idiosyncratic volatility(IVOL)andtheabsolutedifferencebetweenclosingpricesandneareststrikeprice(ADprices). WereportNewey andWest(1987) t-statisticswith6lagsinparenthesis. ThedataisfromCRSP,CompustatandOptionmetricsandcontains monthlyseriesfromJanuary1996toDecember2021. PanelA:PortfoliossortedbasedonMaxPain P1 P2 P3 P4 P5 P6 P7 P8 P9 P10 P10-P1 t-stat MaxPain -0.084 -0.051 -0.034 -0.022 -0.011 -0.001 0.010 0.023 0.040 0.076 0.160 (17.43) PanelB:StockCharacteristicsofPortfoliossortedbasedonMaxPain P1 P2 P3 P4 P5 P6 P7 P8 P9 P10 P10-P1 t-stat IOR 0.782 0.791 0.786 0.779 0.773 0.770 0.771 0.777 0.783 0.773 -0.009 (-2.85) B/M 0.284 0.319 0.347 0.363 0.374 0.388 0.387 0.387 0.376 0.350 0.066 (9.18) D/A 0.152 0.181 0.203 0.212 0.217 0.219 0.217 0.211 0.194 0.151 -0.001 (-0.19) REV 0.047 0.032 0.023 0.018 0.013 0.009 0.004 -0.002 -0.010 -0.030 -0.077 (-10.46) MOM 0.245 0.185 0.160 0.139 0.133 0.124 0.121 0.130 0.126 0.129 -0.115 (-5.24) IVOL 0.024 0.020 0.017 0.016 0.016 0.016 0.016 0.017 0.019 0.024 -0.000 (-0.11) StockVolume 0.658 0.645 0.703 0.727 0.763 0.796 0.759 0.734 0.644 0.640 -0.018 (-11.99) StockPrice 33.311 36.885 37.897 37.385 36.667 35.393 34.532 33.657 31.384 24.518 -8.792 (-11.99) Size 1.586 2.207 2.680 2.979 3.149 3.102 2.886 2.569 1.974 1.181 -0.405 (-12.05) ILLIQStocks 0.002 0.001 0.001 0.001 0.001 0.001 0.001 0.001 0.001 0.002 0.000 (5.59) Nasdaq 0.593 0.491 0.430 0.401 0.386 0.386 0.391 0.410 0.471 0.591 -0.002 (-0.21) ADprices 1.063 1.011 0.933 0.859 0.795 0.744 0.757 0.811 0.892 0.992 -0.071 (-2.77) 33 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "References",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 52,
    "chunk_index": 50,
    "word_count": 315,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "2.569 1.974 1.181 -0.405 (-12.05) ILLIQStocks 0.002 0.001 0.001 0.001 0.001 0.001 0.001 0.001 0.001 0.002 0.000 (5.59) Nasdaq 0.593 0.491 0.430 0.401 0.386 0.386 0.391 0.410 0.471 0.591 -0.002 (-0.21) ADprices 1.063 1.011 0.933 0.859 0.795 0.744 0.757 0.811 0.892 0.992 -0.071 (-2.77) 33 Electronic copy available at: https://ssrn.com/abstract=4140487 Table 2. Stocks sorted on Max Pain ThistabledisplayaveragereturnsofstockssortedintodecilesonthelastweekbeforetheexpirationFridayofthemonthbased onmaxpain. Inparticular,weformportfoliosonthesecondFridayofeachmonthandholdthemforoneweek,whichrefersto theexpirationdateoftheattachedoptions. PanelAshowsaveragestockreturns. PanelBshowsalphasbasedonCAPMandthe Fama and French (1993) 3-factor model. We use weekly factors and we use the third weekly return of every month. Stock returnsarecalculatedusingthemidpointofthebidandaskpricesatmarketcloseadjustedforstocksplits. WereportNewey and West (1987) t-statistics with 6 lags in parenthesis. The data is from CRSP, Compustat and Optionmetrics and contains monthlyseriesfromJanuary1996toDecember2021. PanelA:StockreturnsofportfoliosofstockssortedbasedonMaxPain P1 P2 P3 P4 P5 P6 P7 P8 P9 P10 P10-P1 t-stat EW -0.001 0.001 0.002 0.002 0.003 0.002 0.003 0.002 0.002 0.004 0.004 (3.28) VW 0.000 0.002 0.003 0.002 0.004 0.002 0.003 0.004 0.003 0.005 0.004 (3.01) PanelB:AlphasofportfoliosofstockssortedbasedonMaxPain CAPM FF3 EW 0.003 0.004 (3.02) (3.34) VW 0.003 0.004 (2.62) (3.01) 34 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "References",
    "page_number": 35,
    "page_range": "p.35-36",
    "total_pages": 52,
    "chunk_index": 51,
    "word_count": 164,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.35-36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "P8 P9 P10 P10-P1 t-stat EW -0.001 0.001 0.002 0.002 0.003 0.002 0.003 0.002 0.002 0.004 0.004 (3.28) VW 0.000 0.002 0.003 0.002 0.004 0.002 0.003 0.004 0.003 0.005 0.004 (3.01) PanelB:AlphasofportfoliosofstockssortedbasedonMaxPain CAPM FF3 EW 0.003 0.004 (3.02) (3.34) VW 0.003 0.004 (2.62) (3.01) 34 Electronic copy available at: https://ssrn.com/abstract=4140487 Table 3. Cross-Sectional Regressions Thistabledisplayscross-sectionalregressionsofstockreturnsonthemaxpainandanumberofcontrols. Specifically, ourcross-sectionalregressiontakesthefollowingform: Ret i,t+1 = α+βMaxPain i,t +γControls i,t +(cid:34) i,t+1 (5) where Ret i,t+1 represents the stock return at time t +1 and the set of controls include the stock illiquidity, a dummy variable that takes a value of one is the stock is traded in NASDAQ, price, size, book to market, debt to assets, stock volume (SVOL), institutional ownership (IOR), idiosyncratic volatility (IVOL), weekly reversals, monthly reversals, and momentum. We show results for the full sample, small stocks, illiquid stocks and Nasdaq stocks. We report Newey and West (1987) t-statistics with 6 lags in parenthesis. The dataisfromCRSP,CompustatandOptionmetricsandcontainsmonthlyseriesfromJanuary1996toDecember2021. Stock Returns (1) (2) (3) (4) (5) (6) (7) (8) FullSample Smallstocks IlliquidStocks NasdaqStocks MaxPain 0.016 0.013 0.089 0.064 0.043 0.037 0.020 0.017 (2.72) (2.83) (4.07) (3.02) (3.41) (2.59) (2.72) (2.69) Price -0.000 -0.000 -0.000 -0.000 (-2.14) (-0.79) (-0.23) (-2.96) Size 0.000 0.000 -0.000 0.000 (0.82) (1.47) (-1.68) (1.80) SVOL -0.000 -0.000 0.000 -0.000 (-0.56) (-1.65) (3.10) (-0.86) IOR 0.001 -0.003 0.005 0.002 (1.25) (-1.01) (1.40) (1.57) B/M -0.008 -0.011 -0.015 -0.015 (-10.33) (-6.15) (-8.53) (-8.66) D/A 0.001 0.001 0.005 0.001 (1.06) (0.52) (1.31) (0.75) REVWeekly -0.006 -0.011 -0.017 -0.009 (-1.26) (-0.95) (-1.59) (-1.43) REVMonthly -0.006 -0.006 -0.006 -0.003 (-2.36) (-1.11) (-1.47) (-1.05) MOM -0.001 -0.003 -0.003 -0.001 (-1.91) (-2.03) (-2.25) (-2.15) ILLIQStocks 0.039 0.269 -0.002 0.068 (1.04) (1.67) (-0.02) (1.51) IVOL -0.021 -0.040 -0.029 -0.000 (-0.64) (-0.76) (-0.56) (-0.00) constant 0.002 0.007 0.006 0.012 0.002 0.010 0.002 0.008 (1.43) (5.44) (2.49) (3.55) (1.00) (2.46) (1.47) (4.93) R-squared 0.006 0.087 0.021 0.254 0.019 0.232 0.008 0.095 35 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "References",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 52,
    "chunk_index": 52,
    "word_count": 316,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "ILLIQStocks 0.039 0.269 -0.002 0.068 (1.04) (1.67) (-0.02) (1.51) IVOL -0.021 -0.040 -0.029 -0.000 (-0.64) (-0.76) (-0.56) (-0.00) constant 0.002 0.007 0.006 0.012 0.002 0.010 0.002 0.008 (1.43) (5.44) (2.49) (3.55) (1.00) (2.46) (1.47) (4.93) R-squared 0.006 0.087 0.021 0.254 0.019 0.232 0.008 0.095 35 Electronic copy available at: https://ssrn.com/abstract=4140487 Table 4. Stocks sorted on Max Pain: Different Weeks Thistableaveragestockreturnsthataresortedbasedonmaxpain. Weformportfoliosthefirst,second,orthirdFridayofthe month. Weholdtheportfoliountiltheexpirationofoption. PanelAshowsweeklystockreturns. PanelBshowsalphasbasedon CAPMandtheFamaandFrench(1993)3-factormodel. Weuseweeklyfactorsandweusethethirdweeklyreturnofevery month. Stockreturnsarecalculatedusingthemidpointofthebidandaskpricesatmarketcloseadjustedforstocksplits. We reportNeweyandWest(1987) t-statisticswith6lagsinparenthesis. ThedataisfromCRSP,CompustatandOptionmetricsand containsmonthlyseriesfromJanuary1996toDecember2021. PanelA:StockreturnsofportfoliosofstockssortedbasedonMaxPain P1 P2 P3 P4 P5 P6 P7 P8 P9 P10 P10-P1 t-stat TwoWeekstoExpiration EW -0.001 0.001 0.002 0.002 0.002 0.003 0.003 0.003 0.003 0.004 0.004 (2.01) VW 0.001 0.002 0.003 0.003 0.002 0.003 0.003 0.005 0.004 0.006 0.005 (1.65) ThreeWeekstoExpiration EW 0.003 0.005 0.006 0.005 0.006 0.007 0.007 0.007 0.007 0.007 0.004 (1.75) VW 0.006 0.006 0.006 0.006 0.007 0.007 0.008 0.009 0.007 0.009 0.003 (0.89) FourWeekstoExpiration EW 0.007 0.008 0.007 0.010 0.009 0.010 0.009 0.009 0.010 0.008 0.001 (0.41) VW 0.005 0.007 0.007 0.008 0.006 0.008 0.009 0.010 0.012 0.010 0.004 (1.46) PanelB:AlphasofportfoliosofstockssortedbasedonMaxPain CAPM FF3 CAPM FF3 CAPM FF3 TwoWeekstoExpiration ThreeWeekstoExpiration FourWeekstoExpiration EW 0.004 0.003 0.004 0.005 0.002 0.002 (1.69) (1.75) (1.89) (1.95) (0.80) (0.76) VW 0.004 0.004 0.004 0.005 0.005 0.005 (1.21) (1.34) (1.20) (1.27) (1.90) (1.78) 36 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "References",
    "page_number": 37,
    "page_range": "p.37-38",
    "total_pages": 52,
    "chunk_index": 53,
    "word_count": 210,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.37-38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "0.006 0.008 0.009 0.010 0.012 0.010 0.004 (1.46) PanelB:AlphasofportfoliosofstockssortedbasedonMaxPain CAPM FF3 CAPM FF3 CAPM FF3 TwoWeekstoExpiration ThreeWeekstoExpiration FourWeekstoExpiration EW 0.004 0.003 0.004 0.005 0.002 0.002 (1.69) (1.75) (1.89) (1.95) (0.80) (0.76) VW 0.004 0.004 0.004 0.005 0.005 0.005 (1.21) (1.34) (1.20) (1.27) (1.90) (1.78) 36 Electronic copy available at: https://ssrn.com/abstract=4140487 Table 5. Stocks sorted on Max Pain: Abnormal Stock Volume Thistablereportsaverageabnormalvolumeofstocksthataresortedbasedonmaxpain. Weformportfoliosthefirst,second,or thirdFridayofthemonth. Wecomputeabnormalvolumeas: AbnormalVolume w,m = Volume w,m −Volume m−1→m−n , (6) where Volume represents the average daily volume (expressed in millions) over the last week w of month m before the w expirationoftheoptionandVolume m−1→m−n istheaveragedailyvolumeoverthemonthsm−ntom−1wheren = 1,3,6,12. WereportNeweyandWest(1987) t-statisticswith6lagsinparenthesis. ThedataisfromCRSP,CompustatandOptionmetrics andcontainsmonthlyseriesfromJanuary1996toDecember2021. AbnormalVolumeofPortfoliosofstockssortedbasedonMaxPain P1 P2 P3 P4 P5 P6 P7 P8 P9 P10 P10-P1 P10-P5 P1-P5 OneMonth EW 0.184 0.066 0.045 0.026 0.033 0.025 0.002 0.058 0.080 0.235 0.051 0.203 0.151 (7.79) (3.46) (2.17) (1.13) (1.43) (1.01) (0.10) (2.23) (3.51) (3.58) (0.86) (3.28) (6.09) ThreeMonths EW 0.238 0.082 0.048 0.018 0.050 0.031 0.003 0.085 0.109 0.280 0.042 0.230 0.189 (8.48) (3.96) (2.04) (0.66) (1.80) (0.95) (0.11) (2.77) (4.09) (3.84) (0.66) (3.53) (6.26) SixMonths EW 0.308 0.107 0.059 0.019 0.055 0.040 0.003 0.096 0.133 0.337 0.029 0.282 0.253 (7.78) (4.46) (1.90) (0.50) (1.54) (0.97) (0.08) (2.53) (4.00) (4.17) (0.43) (4.02) (5.93) TwelveMonths EW 0.392 0.149 0.091 0.037 0.066 0.050 0.016 0.114 0.171 0.438 0.045 0.371 0.326 (6.99) (4.88) (2.23) (0.79) (1.44) (0.96) (0.31) (2.29) (4.09) (4.59) (0.58) (4.69) (5.80) 37 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "References",
    "page_number": 38,
    "page_range": "p.38-39",
    "total_pages": 52,
    "chunk_index": 54,
    "word_count": 235,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.38-39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "0.029 0.282 0.253 (7.78) (4.46) (1.90) (0.50) (1.54) (0.97) (0.08) (2.53) (4.00) (4.17) (0.43) (4.02) (5.93) TwelveMonths EW 0.392 0.149 0.091 0.037 0.066 0.050 0.016 0.114 0.171 0.438 0.045 0.371 0.326 (6.99) (4.88) (2.23) (0.79) (1.44) (0.96) (0.31) (2.29) (4.09) (4.59) (0.58) (4.69) (5.80) 37 Electronic copy available at: https://ssrn.com/abstract=4140487 Table 6. Stocks sorted on Max Pain: Abnormal Stock Order Imbalances Thistablepresentsaverageabnormalorderimbalancesofstocksthataresortedbasedonmaxpain. Weformportfoliosthefirst, second,orthirdFridayofthemonth. Wecomputeabnormalvolumeas: AbnormalOIB w,m = OIB w,m −OIB m−1→m−n , (7) whereOIB representstheaveragedailyorderimbalanceoverthelastweekwofmonthmbeforetheexpirationoftheoption w andOIB m−1→m−n istheaveragedailyvolumeoverthemonthsm−ntom−1wheren = 1,3,6,12. WereportNeweyandWest (1987) t-statisticswith6lagsinparenthesis. PanelAshowsresultsfortotalorderimbalancesandPanelBdisplaysresultsfor retailorderimbalances. ThedataisfromCRSP,Compustat,OptionmetricsandTAQandcontainsmonthlyseriesfromJanuary 1996toDecember2021. TheretailorderimbalancedataspantheperiodofJune2006toDecember2021. PanelA:AbnormalOrderImbalanceofPortfoliosofStockssortedbasedonMaxPain P1 P2 P3 P4 P5 P6 P7 P8 P9 P10 P10-P1 P10-P5 P1-P5 OneMonth EW -0.005 -0.003 -0.002 -0.001 -0.000 -0.000 0.001 0.001 0.001 0.004 0.009 0.005 -0.005 (-3.56) (-2.25) (-1.83) (-1.10) (-0.14) (-0.31) (0.96) (0.99) (1.24) (3.07) (4.82) (3.34) (-4.75) ThreeMonths EW -0.004 -0.002 -0.002 -0.001 -0.000 -0.001 0.001 -0.000 0.000 0.003 0.006 0.003 -0.003 (-2.70) (-1.53) (-1.20) (-0.90) (-0.22) (-0.47) (0.55) (-0.35) (0.28) (1.90) (3.64) (2.27) (-3.73) SixMonths EW -0.003 -0.002 -0.001 -0.001 -0.000 -0.001 0.000 -0.001 -0.000 0.002 0.005 0.002 -0.003 (-1.96) (-1.17) (-1.04) (-0.92) (-0.23) (-0.49) (0.23) (-0.70) (-0.36) (1.13) (2.90) (1.59) (-2.75) TwelveMonths EW -0.002 -0.001 -0.001 -0.001 -0.000 -0.001 0.000 -0.001 -0.001 0.001 0.003 0.001 -0.002 (-1.11) (-0.56) (-0.67) (-0.64) (-0.15) (-0.46) (0.11) (-0.68) (-0.62) (0.50) (2.06) (0.90) (-1.59) PanelB:AbnormalRetailOrderImbalancesofPortfoliosofStockssortedbasedonMaxPain P1 P2 P3 P4 P5 P6 P7 P8 P9 P10 P10-P1 P10-P5 P1-P5 OneMonth EW 0.008 0.015 0.017 0.018 0.019 0.016 0.018 0.016 0.015 0.009 0.001 -0.010 -0.011 (1.82) (2.66) (2.76) (2.91) (2.92) (2.51) (2.88) (2.56) (2.47) (1.72) (0.55) (-4.28) (-4.12) ThreeMonths EW 0.008 0.015 0.017 0.018 0.019 0.017 0.018 0.017 0.015 0.010 0.002 -0.009 -0.011 (1.79) (2.67) (2.88) (2.85) (2.95) (2.61) (2.91) (2.61) (2.65) (1.85) (1.09) (-4.54) (-4.26) SixMonths EW 0.009 0.015 0.017 0.018 0.020 0.017 0.019 0.017 0.016 0.011 0.002 -0.009 -0.011 (1.96) (2.73) (2.96) (2.92) (3.02) (2.69) (3.01) (2.74) (2.75) (1.97) (1.23) (-4.35) (-4.21) TwelveMonths EW 0.010 0.016 0.019 0.019 0.021 0.019 0.020 0.018 0.017 0.012 0.003 -0.009 -0.011 (2.27) (2.98) (3.23) (3.00) (3.19) (2.89) (3.25) (2.97) (2.96) (2.33) (1.62) (-4.08) (-4.21) 38 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "References",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 52,
    "chunk_index": 55,
    "word_count": 348,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "0.002 -0.009 -0.011 (1.96) (2.73) (2.96) (2.92) (3.02) (2.69) (3.01) (2.74) (2.75) (1.97) (1.23) (-4.35) (-4.21) TwelveMonths EW 0.010 0.016 0.019 0.019 0.021 0.019 0.020 0.018 0.017 0.012 0.003 -0.009 -0.011 (2.27) (2.98) (3.23) (3.00) (3.19) (2.89) (3.25) (2.97) (2.96) (2.33) (1.62) (-4.08) (-4.21) 38 Electronic copy available at: https://ssrn.com/abstract=4140487 Table 7. Double Sorts: Size, Illiquidity and Book to Market Ratio Thistableaveragestockreturnsthataresortedbasedonmaxpainandsize(PanelA)orilliquidity(PanelB)orbooktomarket (PanelC).Weestimatethestockreturnwhichcorrespondstooneweekpriortoexpirationdateuntiltheexpirationoftheoption everymonth. PanelBshowsalphasbasedonCAPMandtheFamaandFrench(1993)3-factormodel. Weuseweeklyfactorsand we use the third weekly return of every month.Stock returns are calculated using the midpoint of the bid and ask prices at marketcloseadjustedforstocksplits. WereportNeweyandWest(1987) t-statisticswith6lagsinparenthesis. Thedataisfrom CRSP,CompustatandOptionmetricsandcontainsmonthlyseriesfromJanuary1996toDecember2021. PanelA:Size LowMaxPain P2 P3 P4 HighMaxPain HML LowSize -0.000 0.001 0.003 0.003 0.004 0.004 (-0.19) (0.64) (1.62) (1.42) (1.89) (3.12) HighSize 0.002 0.003 0.003 0.003 0.004 0.002 (1.19) (2.50) (2.52) (2.63) (2.67) (2.52) PanelB:Illiquidity LowMaxPain P2 P3 P4 HighMaxPain HML LowIlliquidity 0.002 0.003 0.003 0.004 0.004 0.003 (1.10) (2.60) (2.76) (2.70) (2.55) (2.36) HighIlliquidity -0.002 0.002 0.002 0.002 0.003 0.005 (-0.77) (1.01) (1.43) (1.06) (1.61) (3.25) PanelC:BooktoMarket LowMaxPain P2 P3 P4 HighMaxPain HML LowB/M 0.004 0.005 0.006 0.006 0.008 0.004 (2.08) (3.50) (4.53) (4.93) (4.21) (2.37) HighB/M -0.004 -0.001 -0.001 0.000 -0.003 0.001 (-1.80) (-0.50) (-0.37) (0.05) (-1.17) (0.48) 39 Electronic copy available at: https://ssrn.com/abstract=4140487 Table 8. Stocks sorted on Max Pain: Placebo Test Thistableaveragestockreturnsthataresortedbasedonmaxpain. Weformaportfoliotwoweekstoexpirationuntiloneweek to expiration. Panel A shows weekly stock returns. Panel B shows alphas based on CAPM and the Fama and French (1993) 3-factormodel. Weuseweeklyfactorsandweusethethirdweeklyreturnofeverymonth. Stockreturnsarecalculatedusingthe midpointofthebidandaskpricesatmarketcloseadjustedforstocksplits. WereportNeweyandWest(1987) t-statisticswith6 lagsinparenthesis. ThedataisfromCRSP,CompustatandOptionmetricsandcontainsmonthlyseriesfromJanuary1996to December2021. PanelA:StockreturnsofportfoliosofstockssortedbasedonMaxPain P1 P2 P3 P4 P5 P6 P7 P8 P9 P10 P10-P1 t-stat EW -0.000 0.001 0.000 0.001 0.001 0.001 0.001 0.001 0.001 0.001 0.001 (0.76) VW 0.001 0.001 0.000 0.000 0.001 0.001 0.001 0.002 0.000 0.002 0.001 (0.48) PanelB:AlphasofportfoliosofstockssortedbasedonMaxPain CAPM FF3 EW 0.001 0.001 (0.64) (0.47) VW 0.001 0.001 (0.35) (0.32) 40 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "References",
    "page_number": 40,
    "page_range": "p.40-41",
    "total_pages": 52,
    "chunk_index": 56,
    "word_count": 297,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.40-41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "P8 P9 P10 P10-P1 t-stat EW -0.000 0.001 0.000 0.001 0.001 0.001 0.001 0.001 0.001 0.001 0.001 (0.76) VW 0.001 0.001 0.000 0.000 0.001 0.001 0.001 0.002 0.000 0.002 0.001 (0.48) PanelB:AlphasofportfoliosofstockssortedbasedonMaxPain CAPM FF3 EW 0.001 0.001 (0.64) (0.47) VW 0.001 0.001 (0.35) (0.32) 40 Electronic copy available at: https://ssrn.com/abstract=4140487 Table 9. Stocks sorted on Max Pain: Performance in other Periods Thistableaverageweeklystockreturnsthataresortedbasedonmaxpain. Weshowtheperformanceofourstrategybeforeand after. The same performance of the same stocks before and after the third week of the month. Panel A shows weekly stock returns. PanelBshowsalphasbasedonCAPMandtheFamaandFrench(1993)3-factormodel. Weuseweeklyfactorsandwe usethethirdweeklyreturnofeverymonth. Stockreturnsarecalculatedusingthemidpointofthebidandaskpricesatmarket closeadjustedforstocksplits. WereportNeweyandWest(1987) t-statisticswith6lagsinparenthesis. ThedataisfromCRSP, CompustatandOptionmetricsandcontainsmonthlyseriesfromJanuary1996toDecember2021. PanelA:StockReturnsofportfoliosofstockssortedbasedonMaxPain P1 P2 P3 P4 P5 P6 P7 P8 P9 P10 P10-P1 t-stat OneMonthBefore EW 0.064 0.039 0.029 0.025 0.018 0.013 0.010 0.003 -0.003 -0.020 -0.084 (-11.51) OneWeekBefore EW 0.033 0.015 0.010 0.006 0.003 0.001 -0.002 -0.006 -0.012 -0.027 -0.060 (-12.03) OneWeekAfter EW 0.001 0.002 0.002 0.002 0.001 0.002 0.002 0.002 0.002 0.002 0.000 (0.46) OneMonthAfter EW 0.007 0.008 0.009 0.009 0.010 0.009 0.009 0.009 0.009 0.005 -0.002 (-0.67) PanelB:AlphasofportfoliosofstockssortedbasedonMaxPain CAPM FF3 CAPM FF3 CAPM FF3 CAPM FF3 OneMonthBefore OneWeekBefore OneWeekAfter OneMonthAfter EW -0.085 -0.085 -0.060 -0.060 0.001 0.001 -0.001 -0.001 (-11.51) (-11.39) (-12.13) (-12.02) (0.88) (0.63) (-0.43) (-0.25) 41 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "References",
    "page_number": 42,
    "page_range": "p.42-43",
    "total_pages": 52,
    "chunk_index": 57,
    "word_count": 200,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.42-43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "OneMonthAfter EW 0.007 0.008 0.009 0.009 0.010 0.009 0.009 0.009 0.009 0.005 -0.002 (-0.67) PanelB:AlphasofportfoliosofstockssortedbasedonMaxPain CAPM FF3 CAPM FF3 CAPM FF3 CAPM FF3 OneMonthBefore OneWeekBefore OneWeekAfter OneMonthAfter EW -0.085 -0.085 -0.060 -0.060 0.001 0.001 -0.001 -0.001 (-11.51) (-11.39) (-12.13) (-12.02) (0.88) (0.63) (-0.43) (-0.25) 41 Electronic copy available at: https://ssrn.com/abstract=4140487 Table 10. Returns after Option Expiration for Max Pain stocks This tablereports resultsfrom OLSregressions inwhich thedependent variableis thedaily return. We report resultsforthethreetradingdaysaftertheexpirationoftheoptions,ingeneralthethirdFridayofthemonth. The explanatoryvariableisanindicatorforstocks’maxpainlevel(bydecile). t-statisticsarereportedinparentheses. Standarderrorsareclusteredbyfirmanddate. ThedataisfromCRSPandOptionmetricsandcontainsmonthly seriesfromJanuary1996toDecember2021. DailyStockReturnRegressiononMaxPainDeciles (1) (2) (3) ExpirationDate+1 ExpirationDate+2 ExpirationDate+3 MaxPainD2 0.000 0.000 0.00 (-1.17) (-1.67) (1.30) MaxPainD3 0.000 0.000 0.000 (-0-19) (-0.48) (1.30) MaxPainD4 0.000 0.000 0.000 (0.27) (0.48) (0.37) MaxPainD5 0.000 0.000 0.000 (0.01) (0.77) (-0.48) MaxPainD6 0.000 0.000 0.000 (0.01) (0.32) (-1.21) MaxPainD7 0.000 0.000 0.000 (-0.99) (0.66) (-0.48) MaxPainD8 0.000 0.000 0.000 (-1.62) (-0.44) (-1.21) MaxPainD9 -0.000*** 0.000 0.000 (-3.67) (1.02) (-1.47) MaxPainD10(high) -0.001*** 0.000 0.000 (-5.38) (0.76) (-0.75) constant -0.001 0.001 0.001 (-6.42) (4.11) (6.03) R-squared 0.000 0.000 0.000 42 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "References",
    "page_number": 43,
    "page_range": "p.43-44",
    "total_pages": 52,
    "chunk_index": 58,
    "word_count": 165,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.43-44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "0.000 0.000 (0.01) (0.32) (-1.21) MaxPainD7 0.000 0.000 0.000 (-0.99) (0.66) (-0.48) MaxPainD8 0.000 0.000 0.000 (-1.62) (-0.44) (-1.21) MaxPainD9 -0.000*** 0.000 0.000 (-3.67) (1.02) (-1.47) MaxPainD10(high) -0.001*** 0.000 0.000 (-5.38) (0.76) (-0.75) constant -0.001 0.001 0.001 (-6.42) (4.11) (6.03) R-squared 0.000 0.000 0.000 42 Electronic copy available at: https://ssrn.com/abstract=4140487 Table 11. Intraday Returns after Option Expiration for Max Pain stocks ThistablereportsresultsfromOLSregressionsinwhichthedependentvariableisthehourlyreturn. Wereportresultsforthefirsttradingdayafterthe expirationoftheoptions, ingeneralthethirdFridayofthemonth. Theexplanatoryvariableisanindicatorforstocks’maxpainlevel(bydecile). t-statistics are reported in parentheses. Standard errors are clustered by firm and date. The data is from CRSP and Optionmetrics and contains thirty-minutesintervalseriesfromJanuary2003toDecember2014. StockReturnRegressiononMaxPainDeciles 10:00 10:30 11:00 11:30 12:00 12:30 13:00 13:30 14:00 14:30 15:00 15:30 16:00 MaxPainD2 0.000 0.000 -0.000 -0.000 0.000 0.000 0.000 0.000 0.000 0.000 0.000* 0.000** -0.000** (0.57) (0.80) (-0.86) (-0.51) (0.67) (0.38) (0.26) (0.74) (0.57) (0.83) (1.85) (2.54) (-2.04) MaxPainD3 0.000 0.000 -0.000 0.000 0.000* -0.000 -0.000 0.000 0.000 0.000 0.000 0.000 -0.000* (1.05) (0.04) (-0.21) (0.45) (1.82) (-0.62) (-0.31) (0.11) (1.08) (1.40) (1.33) (1.51) (-1.75) MaxPainD4 0.000 0.000 -0.000 0.000 0.000 -0.000 0.000 -0.000 0.000 0.000 0.000 0.000* -0.000** (0.86) (0.62) (-0.49) (0.26) (1.37) (-0.54) (0.40) (-0.40) (0.29) (0.72) (1.32) (1.90) (-2.17) MaxPainD5 0.001 0.000 0.000 -0.000 0.000* -0.000 0.000 0.000 0.000 0.000 0.000* 0.000* -0.000* (1.47) (0.29) (0.00) (-0.10) (1.72) (-0.40) (0.81) (0.28) (1.09) (1.01) (1.79) (1.88) (-1.82) MaxPainD6 0.000 0.000 -0.000 0.000 0.000 -0.000 -0.000 0.000 -0.000 0.000 0.000 0.000* -0.000** (1.13) (0.87) (-0.88) (0.39) (1.23) (-0.28) (-0.09) (0.90) (-0.16) (1.16) (1.27) (1.79) (-2.37) MaxPainD7 0.000 0.000 -0.000 -0.000 0.000 -0.000 0.000 -0.000 0.000 0.000 0.000 0.000** -0.000** (0.96) (0.32) (-0.45) (-0.79) (1.36) (-1.18) (0.90) (-0.15) (0.37) (0.32) (0.20) (2.16) (-2.25) MaxPainD8 0.000 0.000 -0.000 0.000 0.000* -0.000 -0.000 0.000 0.000 0.000 -0.000 0.000 -0.000* (0.57) (0.59) (-0.38) (0.05) (1.91) (-0.38) (-0.59) (0.37) (0.23) (0.47) (-0.54) (1.03) (-1.95) MaxPainD9 0.000 -0.000 -0.000 -0.000 0.000 -0.000 -0.000 0.000 0.000 -0.000 0.000 0.000 -0.000** (0.03) (-0.77) (-0.86) (-0.40) (1.12) (-0.65) (-1.02) (1.06) (0.32) (-0.27) (0.07) (1.47) (-2.13) MaxPainD10 -0.001*** -0.000** -0.000** -0.000* 0.000 -0.000 -0.000 -0.000 -0.000 -0.000 -0.000 -0.000* -0.000 (-4.32) (-2.59) (-2.22) (-1.95) (0.41) (-0.78) (-0.53) (-0.54) (-0.93) (-0.59) (-1.52) (-1.84) (-0.56) Constant -0.001 -0.000 -0.000 -0.000 -0.000 0.000 0.000 -0.000 -0.000 0.000 -0.000 0.000 0.000 (-1.43) (-0.13) (-0.79) (-0.58) (-1.08) (0.25) (0.25) (-0.21) (-0.94) (0.08) (-0.50) (0.22) (1.27) R-squared 0.001 0.000 0.000 0.000 0.000 0.000 0.000 0.000 0.000 0.000 0.000 0.000 0.000 Electronic copy available at: https://ssrn.com/abstract=4140487 43",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "References",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 52,
    "chunk_index": 59,
    "word_count": 393,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "(-1.52) (-1.84) (-0.56) Constant -0.001 -0.000 -0.000 -0.000 -0.000 0.000 0.000 -0.000 -0.000 0.000 -0.000 0.000 0.000 (-1.43) (-0.13) (-0.79) (-0.58) (-1.08) (0.25) (0.25) (-0.21) (-0.94) (0.08) (-0.50) (0.22) (1.27) R-squared 0.001 0.000 0.000 0.000 0.000 0.000 0.000 0.000 0.000 0.000 0.000 0.000 0.000 Electronic copy available at: https://ssrn.com/abstract=4140487 43 Table 12. Put to Call Open Interest Ratios of Portfolios sorted on Max Pain Thistablepresentstime-seriesaveragesofmedianputtocallopeninterestofportfoliosofstocksthataresortedbasedonmax pain. Wecomputetheratiothedaywhichcorrespondtooneweekpriortoexpirationoftheoptioneverymonth. Wereport NeweyandWest(1987) t-statisticswith6lagsinparenthesis. ThedataisfromCRSP,CompustatandOptionmetricsandcontains monthlyseriesfromJanuary1996toDecember2021. PanelA:PortfoliosofstockssortedbasedonMaxPain P1 P2 P3 P4 P5 P6 P7 P8 P9 P10 P10-P1 t-stat EW 0.321 0.342 0.360 0.370 0.371 0.383 0.390 0.400 0.419 0.450 0.129 (10.91) 44 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "References",
    "page_number": 45,
    "page_range": "p.45-46",
    "total_pages": 52,
    "chunk_index": 60,
    "word_count": 104,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.45-46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "Call Open Interest Ratios of Portfolios sorted on Max Pain Thistablepresentstime-seriesaveragesofmedianputtocallopeninterestofportfoliosofstocksthataresortedbasedonmax pain. Wecomputetheratiothedaywhichcorrespondtooneweekpriortoexpirationoftheoptioneverymonth. Wereport NeweyandWest(1987) t-statisticswith6lagsinparenthesis. ThedataisfromCRSP,CompustatandOptionmetricsandcontains monthlyseriesfromJanuary1996toDecember2021. PanelA:PortfoliosofstockssortedbasedonMaxPain P1 P2 P3 P4 P5 P6 P7 P8 P9 P10 P10-P1 t-stat EW 0.321 0.342 0.360 0.370 0.371 0.383 0.390 0.400 0.419 0.450 0.129 (10.91) 44 Electronic copy available at: https://ssrn.com/abstract=4140487 Table 13. Cross-Sectional Regressions: Abnormal Returns Thistabledisplayscross-sectionalregressionsofabnormalstockreturnsonthemaxpainandanumberofcontrols. Specifically,ourcross-sectionalregressiontakesthefollowingform: Ret i,t+1 = α+βMaxPain i,t +γControls i,t +(cid:34) i,t+1 (8) where Ret i,t+1 represents the abnormal stock return at time t +1 and the set of controls include the stock illiquidity, a dummy variable that takes a value of one is the stock is traded in NASDAQ, price, size, book to market, debt to assets, stock volume (SVOL), institutional ownership (IOR), idiosyncratic volatility (IVOL), weeklyreversals,monthlyreversalsandmomentum. Weshowresultsforthefullsample,smallstocks,illiquid stocks and Nasdaq stocks. We report Newey and West (1987) t-statistics with 6 lags in parenthesis. The dataisfromCRSP,CompustatandOptionmetricsandcontainsmonthlyseriesfromJanuary1996toDecember2021. Abnormal Stock Returns (1) (2) (3) (4) (5) (6) (7) (8) FullSample Smallstocks IlliquidStocks NasdaqStocks MaxPain 0.016 0.013 0.087 0.063 0.041 0.034 0.019 0.017 (2.66) (2.74) (4.02) (2.96) (3.22) (2.38) (2.61) (2.58) Price -0.000 -0.000 -0.000 -0.000 (-2.14) (-0.80) (-0.27) (-2.97) Size 0.000 0.000 -0.000 0.000 (0.81) (1.52) (-1.59) (1.80) SVOL -0.000 -0.000 0.000 -0.000 (-0.59) (-1.64) (2.99) (-0.92) IOR 0.001 -0.003 0.004 0.002 (1.10) (-1.01) (1.23) (1.44) B/M -0.008 -0.011 -0.015 -0.015 (-10.34) (-6.14) (-8.55) (-8.68) D/A 0.001 0.001 0.005 0.001 (0.99) (0.49) (1.38) (0.67) REVWeekly -0.006 -0.011 -0.016 -0.009 (-1.24) (-0.93) (-1.49) (-1.40) REVMonthly -0.006 -0.006 -0.005 -0.003 (-2.32) (-1.16) (-1.35) (-0.98) MOM -0.001 -0.003 -0.004 -0.001 (-1.88) (-1.97) (-2.27) (-2.12) ILLIQStocks 0.038 0.269 -0.007 0.065 (0.99) (1.67) (-0.10) (1.42) IVOL -0.021 -0.039 -0.032 -0.003 (-0.65) (-0.75) (-0.61) (-0.09) constant -0.001 0.004 0.003 0.010 -0.001 0.007 -0.000 0.006 (-0.86) (4.11) (1.71) (2.93) (-0.72) (1.82) (-0.25) (4.16) R-squared 0.006 0.087 0.021 0.253 0.019 0.231 0.008 0.095 45 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "References",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 52,
    "chunk_index": 61,
    "word_count": 305,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "ILLIQStocks 0.038 0.269 -0.007 0.065 (0.99) (1.67) (-0.10) (1.42) IVOL -0.021 -0.039 -0.032 -0.003 (-0.65) (-0.75) (-0.61) (-0.09) constant -0.001 0.004 0.003 0.010 -0.001 0.007 -0.000 0.006 (-0.86) (4.11) (1.71) (2.93) (-0.72) (1.82) (-0.25) (4.16) R-squared 0.006 0.087 0.021 0.253 0.019 0.231 0.008 0.095 45 Electronic copy available at: https://ssrn.com/abstract=4140487 Table 14. Stocks with and without options sorted on Max Pain Thistableaverageweeklystockreturnsthataresortedbasedonmaxpain. PanelAshowsweeklystockreturns. Wereportresults forstockswithandwithoutoptionsthatarematchedbasedonsizeandvolumeusingpropensityscorematching. Forstocks withoutoptionsweuseasortingvariabletheMaxPainvalueofthecorrespondingstockpairwithoptionsandsimilarsizeand volume. PanelBshowsalphasbasedonCAPMandtheFamaandFrench(1993)3-factormodel. Weuseweeklyfactorsandwe usethethirdweeklyreturnofeverymonth. Stockreturnsarecalculatedusingthemidpointofthebidandaskpricesatmarket closeadjustedforstocksplits. WereportNeweyandWest(1987) t-statisticswith6lagsinparenthesis. ThedataisfromCRSP, CompustatandOptionmetricsandcontainsmonthlyseriesfromJanuary1996toDecember2021. PanelA:PortfoliosofstockssortedbasedonMaxPain P1 P2 P3 P4 P5 P6 P7 P8 P9 P10 P10-P1 t-stat StockswithOptions EW -0.002 0.001 0.002 0.003 0.002 0.002 0.002 0.003 0.003 0.004 0.005 (3.66) VW -0.000 0.001 0.003 0.003 0.003 0.002 0.003 0.004 0.004 0.004 0.004 (2.32) StockswithoutOptions EW 0.002 0.003 0.003 0.003 0.002 0.002 0.003 0.003 0.002 0.002 -0.000 (-0.61) VW 0.002 0.002 0.005 0.003 0.002 0.002 0.002 0.003 0.002 0.002 0.000 (0.06) PanelB:AlphasofStockReturnssortedbasedonMaxPain CAPM FF3 CAPM FF3 StockswithOptions StockswithoutOptions EW 0.004 0.005 -0.000 -0.000 (3.40) (3.66) (-0.80) (-0.75) VW 0.003 0.004 0.000 0.000 (1.86) (2.62) (0.30) (0.25) 46 Electronic copy available at: https://ssrn.com/abstract=4140487 Table 15. Max Pain of Index Options Thistablepresentstime-seriesaveragesofmedianputtocallopeninterestofportfoliosofstocksthataresortedbasedonmax pain. Wecomputetheratiothedaywhichcorrespondtooneweekpriortoexpirationoftheoptioneverymonth. Indexreturns arecalculatedusingthemidpointofthebidandaskpricesatmarketclose. WereportNeweyandWest(1987) t-statisticswith6 lagsinparenthesis. ThedataisfromCRSP,CompustatandOptionmetricsandcontainsmonthlyseriesfromJanuary1996to December2021. PanelA:PortfoliosofstockindicessortedbasedonMaxPain P1 P2 P3 HML t-stat Returns EW 0.002 0.002 0.001 -0.000 (-0.23) MaxPainGain/Loss EW -0.058 -0.003 0.141 0.199 (4.42) PanelB:AlphasofIndexReturnssortedbasedonMaxPain CAPM FF3 EW -0.001 -0.001 (-0.81) (-0.59) 47 Electronic copy available at: https://ssrn.com/abstract=4140487 Internet Appendix to \"No Max Pain, No Max Gain: Price Clustering at Option Expiration\" by Ilias Filippou Pedro A. Garcia-Ares Fernando Zapatero (Not for publication) Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "References",
    "page_number": 47,
    "page_range": "p.47-49",
    "total_pages": 52,
    "chunk_index": 62,
    "word_count": 256,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.47-49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "EW -0.058 -0.003 0.141 0.199 (4.42) PanelB:AlphasofIndexReturnssortedbasedonMaxPain CAPM FF3 EW -0.001 -0.001 (-0.81) (-0.59) 47 Electronic copy available at: https://ssrn.com/abstract=4140487 Internet Appendix to \"No Max Pain, No Max Gain: Price Clustering at Option Expiration\" by Ilias Filippou Pedro A. Garcia-Ares Fernando Zapatero (Not for publication) Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "References",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 52,
    "chunk_index": 63,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "1 Example of Max Pain Calculation In this section, we offer an example of the Max Pain gain/loss calculation, which is the sorting variable of our main analysis. Let us assume that one stock has three attached call options and three put options. As it is explained in Table A1, the strike prices for the call option are $25, $50, and $100 with a corresponding open interest of 10, 20, and 10 outstanding contracts. For simplicity, we assume that put and call options have the same strike prices but a different number of outstanding contracts. Specifically, the put options have open interest of 50, 25, and 1. Table A1. Option Series for Stock A Strike Price Call Open Interest Put Open Interest 25 10 50 50 20 25 100 10 1 In Table A2, we compute the total loss assuming that the stock price at expiration will equal the first strike price, which is $25. We offer the strike prices of the calls and puts and the open interest. In the Call Loss and Put Loss columns, we calculate the potential loss for each option. At an expiration price of $25, the payoff of the call options will be zero as the strike price exceeds or is equal to the exercise price. On the other hand, the put options will be exercised for the strike prices of $50 and $100. In these cases, the writer of the put will have a loss of (Stock Price-Strike Price)*Open Interest or (50-25)*25 and (100-25)*1, respectively. Thus, the total loss will be $700. It is worth mentioning that we label as Stock Price the assumed or theoretical stock price of $25. Table A2. Stock Price Expires at 25 Price Strike Call OI Put OI Call Loss Put Loss Total Loss 25 25 10 50 0 0 0 50 20 25 0 (50-25) x 25 625 100 10 1 0 (100-25) x 1 75 700 1 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "References",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 52,
    "chunk_index": 64,
    "word_count": 326,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "$25. Table A2. Stock Price Expires at 25 Price Strike Call OI Put OI Call Loss Put Loss Total Loss 25 25 10 50 0 0 0 50 20 25 0 (50-25) x 25 625 100 10 1 0 (100-25) x 1 75 700 1 Electronic copy available at: https://ssrn.com/abstract=4140487 In Table A3, we continue with the calculation of the call and put loss, assuming that the stock price at expiration will equal the second strike price, which is $50. Here, the call option will be exercised for a strike price of $25 because the assumed stock price at expirationislarger. Inthiscase,thewriterofthecalloptionwillsufferalossof(50-25)*10. Similarly, the put option will be exercised when the strike price is equal to $100 because the strike price will be greater than the assumed price at expiration. The potential loss for the put option will be (100-50)*1. Thus, the potential total loss for call and put options will be $300. Table A3. Stock Price Expires at 50 Price Strike Call OI Put OI Call Loss Put Loss Total Loss 50 25 10 50 (50-25)x10 0 250 50 20 25 0 0 0 100 10 1 0 (100-50)x1 50 300 In Table A4, we show results for the last strike price. We assume that the stock will expire at $100. Only the call option will be exercised at this price, and the call option writer will suffer a loss of $1750. Table A4. Stock Price Expires at 100 Price Strike Call OI Put OI Call Loss Put Loss Total Loss 100 25 10 50 (100-25)x10 0 750 50 20 25 (100-50)x20 0 1000 100 10 1 0 0 0 1750 2 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "References",
    "page_number": 51,
    "page_range": "p.51",
    "total_pages": 52,
    "chunk_index": 65,
    "word_count": 277,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.51)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  },
  {
    "text": "suffer a loss of $1750. Table A4. Stock Price Expires at 100 Price Strike Call OI Put OI Call Loss Put Loss Total Loss 100 25 10 50 (100-25)x10 0 750 50 20 25 (100-50)x20 0 1000 100 10 1 0 0 0 1750 2 Electronic copy available at: https://ssrn.com/abstract=4140487 In Table A5, we summarize the information obtained in the previous tables. Thus, we report the loss of call and put writers for the three strike prices if we assume that the stock price at expiration will equal each strike price. In the last column, we sum the call, put losses per strike price, and select the smaller value, our Max Pain value for this stock. The Max Pain strike price is the one that is associated with the minimum loss, which is $50. Thus, the Max Pain Gain/Loss will be the difference between the Max Pain strike price ($50) and the stock price on the second Friday of the month –which is the day that we form our portfolios– over the stock price the second Friday of the month. Table A5. Max Pain Price for Stock A Strike Price Call Loss Put Loss Total Loss 25 0 700 700 50 250 50 300 100 1750 0 1750 3 Electronic copy available at: https://ssrn.com/abstract=4140487",
    "title": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration",
    "source_type": "pdf",
    "document_id": "f57fa182caa6",
    "source_file": "No Max Pain, No Max Gain Stock Return Predictability at Options Expiration.pdf",
    "section": "References",
    "page_number": 52,
    "page_range": "p.52",
    "total_pages": 52,
    "chunk_index": 66,
    "word_count": 214,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.52)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221119131927Z",
    "duration": null
  }
]