[
  {
    "text": "Volume, Volatility, Price, and Profit When All Traders Are Above Average TERRANCE ODEAN* ABSTRACT Peopleareoverconfident.Overconfidenceaffectsfinancialmarkets.Howdepends onwhointhemarketisoverconfidentandonhowinformationisdistributed.This paperexaminesmarketsinwhichprice-takingtraders,astrategic-tradinginsider, and risk-averse marketmakers are overconfident. Overconfidence increases ex- pectedtradingvolume,increasesmarketdepth,anddecreasestheexpectedutility ofoverconfidenttraders.Itseffectonvolatilityandpricequalitydependonwhois overconfident. Overconfident traders can cause markets to underreact to the in- formationofrationaltraders.Marketsalsounderreacttoabstract,statistical,and highlyrelevantinformation,andtheyoverreacttosalient,anecdotal,andlessrel- evant information. MODELS OF FINANCIAL MARKETS are often extended by incorporating the im- perfections that we observe in real markets. For example, models may not consider transactions costs, an important feature of real markets; so Con- stantinides ~1979!, Leland ~1985!, and others incorporate transactions costs into their models. Justastheobservedfeaturesofactualmarketsareincorporatedintomod- els, so too are the observed traits of economic agents. In 1738 Daniel Ber- noulli noted that people behave as if they are risk averse. Prior to Bernoulli most scholars considered it normative behavior to value a gamble at its ex- pectedvalue.Today,economicmodelsusuallyassumeagentsareriskaverse, though, for tractability, they are also modeled as risk neutral. In reality, people are not always risk averse or even risk neutral; millions of people engageinregularrisk-seekingactivity,suchasbuyinglotterytickets.Kahne- *UniversityofCalifornia,Davis.ThispaperisbasedonmydissertationattheUniversityof California, Berkeley. I thank Brad Barber, Minder Cheng, Simon Gervais, David Hirshleifer, Bill Keirstead, Hayne Leland, Mark Rubinstein, Paul Ruud, Hersh Shefrin, René Stulz, Rich- ard Thaler, two anonymous referees, and seminar participants at UC Berkeley and at the RussellSageFoundationSummerInstituteinBehavioralEconomicsfortheircomments.Ies- peciallythankBrettTruemanforhisnumeroussuggestionsandcomments.Financialsupport from the Nasdaq Foundation and from the American Association of Individual Investors is gratefully acknowledged. 1887",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 48,
    "chunk_index": 0,
    "word_count": 215,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "Cheng, Simon Gervais, David Hirshleifer, Bill Keirstead, Hayne Leland, Mark Rubinstein, Paul Ruud, Hersh Shefrin, René Stulz, Rich- ard Thaler, two anonymous referees, and seminar participants at UC Berkeley and at the RussellSageFoundationSummerInstituteinBehavioralEconomicsfortheircomments.Ies- peciallythankBrettTruemanforhisnumeroussuggestionsandcomments.Financialsupport from the Nasdaq Foundation and from the American Association of Individual Investors is gratefully acknowledged. 1887 1888 The Journal of Finance man and Tversky ~1979! identify circumstances in which people behave in a risk-seeking fashion. Most of the time, though, most people act risk averse, and most economists model them so.1 This paper analyzes market models in which investors are rational in all respects except how they value information.2Asubstantial literature in cog- nitivepsychologyestablishesthatpeopleareusuallyoverconfidentand,spe- cifically, that they are overconfident about the precision of their knowledge. As is the case with risk-aversion, there are well-known exceptions to the rule, but most of the time people are overconfident. Psychologists also find that people systematically underweight some types of information and over- weight others. The paper looks at what happens in financial markets when people are overconfident. Overconfidence is a characteristic of people, not of markets. It would be convenient if each person’s overconfidence had the same effect on markets. But this is not so. Some measures of the market, such as trad- ing volume, are affected similarly by the overconfidence of different market participants; other measures, such as market efficiency, are not. The effects of overconfidence depend on how information is distributed in a market and on who is overconfident. Because analyzing the overconfidence of only one typeoftraderpresentsanincompleteandperhapsmisleadingpicture,Ilook at the overconfidence of different traders: price takers in markets where information is broadly disseminated, strategic-trading insiders in markets with concentrated information, and marketmakers. I also examine markets where information is costly. Three different models are employed to facili- tate this multifaceted analysis of overconfidence. These are modifications of Diamond and Verrecchia ~1981! and Hellwig ~1980!, Kyle ~1985!, and Gross- man and Stiglitz ~1980!. The main results presented are: • Tradingvolumeincreaseswhenpricetakers,insiders,ormarketmakers are overconfident. This is the most robust effect of overconfidence. An- ecdotal evidence suggests that in many markets trading volume is ex- cessive~DowandGorton~1997!!.Recentempiricalstudies~Odean~1998a!, StatmanandThorley~1998!!indicatethatoverconfidencegeneratestrad- ing. From a modeling perspective, overconfidence can facilitate orderly trade even in the absence of noise traders. 1Anotherplacewhereobservedbehaviorhasfoundwideacceptanceineconomicmodelsisin the discounted utility of future consumption. Nineteenth-century economists such as Senior, Jevons,andBöhm-Bawerkbelievedthat,ideally,thepresentandthefutureshouldbetreated equally; yet they observed that generally people value present consumption more highly than future ~Loewenstein ~1992!!. Today, when it may affect the predictions of models, economists usually assume that people discount the utility of future consumption.And people usually do discount the future—but not always. They will, for example, “bite the bullet” and get an un- pleasantexperienceoverwith,whichtheycouldotherwisedelay.LoewensteinandPrelec~1991! identify circumstances in which people demonstrate negative, rather than the usual positive, time preference. 2In the first model presented here, investors also behave with less than full rationality by trading myopically.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 48,
    "chunk_index": 1,
    "word_count": 461,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "usually do discount the future—but not always. They will, for example, “bite the bullet” and get an un- pleasantexperienceoverwith,whichtheycouldotherwisedelay.LoewensteinandPrelec~1991! identify circumstances in which people demonstrate negative, rather than the usual positive, time preference. 2In the first model presented here, investors also behave with less than full rationality by trading myopically.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 48,
    "chunk_index": 2,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "When All Traders Are Above Average 1889 • Overconfident traders can cause markets to underreact to the informa- tion of rational traders, leading to positive serially correlated returns. Returns are also positively serially correlated when traders under- weight new information and negatively serially correlated when they overweight it. The degree of this under- or overreaction depends on the fraction of all traders who under- or overweight the information. A re- view of the psychology literature on inference finds that people system- aticallyunderweightabstract,statistical,andhighlyrelevantinformation, and overweight salient, anecdotal, and extreme information. This may shed some light on why markets overreact in some circumstances, such as initial public offerings ~IPOs! ~Ritter ~1991!!, and underreact in oth- ers,suchasearningsannouncements~BernardandThomas~1989,1990!!, dividendinitiationsandomissions~Michaely,Thaler,andWomack~1995!!, open-market share repurchases ~Ikenberry, Lakonishok, and Vermaelen ~1995!!, and brokerage recommendations ~Womack ~1996!!. • Overconfidence reduces traders’expected utility. Overconfident traders holdunderdiversifiedportfolios.Wheninformationiscostlyandtraders are overconfident, informed traders fare worse than uninformed trad- ers. And, as Barber and Odean ~1998! find to be true for individual investors, those who trade more actively fare worse than those who tradeless.Overconfidencemayalsocauseinvestorstopreferactiveman- agement~Lakonishok,Shleifer,andVishny~1992!!despiteevidencethat it subtracts value. • Overconfidence increases market depth. • Overconfident insiders improve price quality, but overconfident price takers worsen it. • Overconfident traders increase volatility, though overconfident market- makers may dampen this effect. Excess volatility in equity markets has been found by some researchers ~Shiller ~1981, 1989!, LeRoy and Porter ~1981!!, though others have questioned these findings ~Kleidon ~1986!, Marsh and Merton ~1986!!. The rest of the paper is organized as follows: Section I reviews related work. Section II describes some of the literature on overconfidence and on infer- ence and discusses why we should expect to find overconfidence in financial markets. Section III presents the models. Section IV discusses the results. Andthefinalsectionconcludes.Formalstatementsofthepropositions,proofs, and the derivations of equilibria are presented in the Appendixes. Table I provides a summary of notation used in the models. I. Related Work A number of researchers have modeled economies in which traders hold mistaken distributional beliefs about the payoff of a risky asset. In Varian ~1989! traders’priors have different means. Varian notes that the dispersion of posterior beliefs caused by differing distributional assumptions motivates trade. Harris and Raviv ~1993! investigate a multiperiod economy in which",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 48,
    "chunk_index": 3,
    "word_count": 361,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "researchers have modeled economies in which traders hold mistaken distributional beliefs about the payoff of a risky asset. In Varian ~1989! traders’priors have different means. Varian notes that the dispersion of posterior beliefs caused by differing distributional assumptions motivates trade. Harris and Raviv ~1993! investigate a multiperiod economy in which TableI Notation Price Takers Model Insider Model Costly Information Model Overconfidence parameter k$1 k$1 k$1 Parameter underweighting priors h#1 h#1 h#1 Parameter underweighting signals of others g#1 Number of traders i51, ..., N 1 insider, i51, ..., N 1 marketmaker Time t50, ..., 4 t50, 1 t50,1 Number of distinct signals m51, ..., M 1 1 Terminal value of risky asset vI ;N~0,hv 21! vI ;N~0,hv 21! vI ;N~0,hv 21! Signals yI 5vI 1eI yI 5vI 1eI yI 5vI 1eI ti tm Error term in signals eI tm ;N~0,he 21! eI ;N~0,he 21! eI ;N~0,he 21! Noise trader demand zI ;N~0,h21! zI ;N~0,h21! z z Coefficient of absolute risk aversion a a Per capita supply of risky asset xS xS Price of risky asset P P P t i’s endowment of risky asset x x 0i 0i i’s demand for risky asset x x x ti ti i’s endowment of riskless asset f f 0i 0i i’s demand for riskless asset f f ti ti i’s wealth W W ti ti Trader i’s information set F ti Fraction of traders who buy information l 1890 The Journal of Finance",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 4,
    "page_range": "p.4-5",
    "total_pages": 48,
    "chunk_index": 4,
    "word_count": 239,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.4-5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "for risky asset x x x ti ti i’s endowment of riskless asset f f 0i 0i i’s demand for riskless asset f f ti ti i’s wealth W W ti ti Trader i’s information set F ti Fraction of traders who buy information l 1890 The Journal of Finance When All Traders Are Above Average 1891 risk-neutral traders disagree about how to interpret a public signal. The model of price-taking traders presented here differs from Harris and Raviv in that my traders are risk averse and disagree about the interpretation of private signals. Furthermore, the nature of this disagreement is grounded inpsychologicalresearch.InKandelandPearson~1995!,risk-aversetraders disagree about both the mean and the variance of a public signal. In this case,thepublicsignalmaymotivateincreasedtradingevenwhenitdoesnot changeprice.DeLongetal.~1990!showinanoverlappinggenerationsmodel that oveconfident traders who misperceive the expected price of a risky as- set may have higher expected returns, though lower expected utilities, than rational traders in the same economy. Roll ~1986! suggests that overconfi- dence ~hubris! may motivate many corporate takeovers. Hirshleifer, Subrah- manyam, and Titman ~1994! argue that overconfidence can promote herding in securities markets. Figlewski ~1978! finds that the influence of traders with different posterior beliefs on prices depends on wealth, risk aversion, and overall willingness to trade; Feiger ~1978! also points out that a trader’s influenceonpricedependsonherwealth.JaffeandWinkler~1976!findthat the probability of trading is a function of the precision of an investor’s information. Shefrin and Statman ~1994! develop a model in which traders infer, from past observations, the transition matrix governing changes in the dividend growth rate. In their model, some traders are true Bayesians; others make one of two common errors: They weight recent observations too heavily, thus underweighting prior information, or they commit a gambler’s fallacy, ex- pecting recent events to reverse so that short runs of realized events more closely resemble long-term probabilities. When all traders are rational, the market behaves as if it had a “single driver” and prices are efficient. Biased traders can introduce a “second driver,” thereby distorting prices and, over time, increasing volatility while decreasing market efficiency. Benos ~1998!, Kyle and Wang ~1997!, and Wang ~1995! look at overconfi- dence in models based on Kyle ~1985!, but with two informed traders. In Benos, traders are overconfident in their knowledge of the signals of others; they also can display extreme overconfidence in their own noisy signal, be- lieving it to be perfect. Kyle and Wang ~1997! and Wang ~1995! model over- confidence similarly to how it is modeled in this paper—that is, as an overestimationoftheprecisionofone’sowninformation.3GervaisandOdean ~1997! develop a multiperiod model in which a trader’s endogenously deter- mined level of overconfidence changes dynamically as a result of his ten- dencytodisproportionatelyattributehissuccesstohisownability.InDaniel, Hirshleifer, and Subrahmanyam ~1998! rational risk-averse traders trade with risk-neutral traders who overreact to private signals, properly weight public signals, and grow more overconfident with success. This results in return-event patterns that are consistent with many market anomalies. My paper differs from these others in that it examines how the effects of over- 3I learned of Kyle and Wang’s work after developing the models in this paper.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 48,
    "chunk_index": 5,
    "word_count": 501,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "weight public signals, and grow more overconfident with success. This results in return-event patterns that are consistent with many market anomalies. My paper differs from these others in that it examines how the effects of over- 3I learned of Kyle and Wang’s work after developing the models in this paper.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 48,
    "chunk_index": 6,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "1892 The Journal of Finance confidence depend on who, in a market, is overconfident and on how infor- mation in that market is disseminated; it also relates market under- and overreactions to the psychological literature on inference. II. Overconfidence A. The Case for Overconfidence Studies of the calibration of subjective probabilities find that people tend to overestimate the precision of their knowledge ~Alpert and Raiffa ~1982!, Fischhoff, Slovic and Lichtenstein ~1977!; see Lichtenstein, Fischhoff, and Phillips ~1982! for a review of the calibration literature!. Such overconfi- dence has been observed in many professional fields. Clinical psychologists ~Oskamp~1965!!,physiciansandnurses,~Christensen-SzalanskiandBushy- head ~1981!, Baumann, Deber, and Thompson ~1991!!, investment bankers ~Staël von Holstein ~1972!!, engineers ~Kidd ~1970!!, entrepreneurs ~Cooper, Woo, and Dunkelberg ~1988!!, lawyers ~Wagenaar and Keren ~1986!!, nego- tiators ~Neale and Bazerman ~1990!!, and managers ~Russo and Schoemaker ~1992!! have all been observed to exhibit overconfidence in their judgments. ~For further discussion, see Lichtenstein et al. ~1982! and Yates ~1990!.! The best established finding in the calibration literature is that people tend to be overconfident in answering questions of moderate to extreme dif- ficulty ~Fischhoff et al. ~1977!, Lichtenstein et al. ~1982!, Yates ~1990!, Grif- fin and Tversky ~1992!!. Exceptions to overconfidence in calibration are that people tend to be underconfident when answering easy questions, and they tend to be well calibrated when predictability is high and when performing repetitivetaskswithfast,clearfeedback.Forexample,expertbridgeplayers ~Keren ~1987!!, race-track bettors ~Dowie ~1976!, Hausch, Ziemba, and Ru- binstein ~1981!! and meteorologists ~Murphy and Winkler ~1984!! tend to be well calibrated. Miscalibration is only one manifestation of overconfidence. Researchers also find that people overestimate their ability to do well on tasks and these overestimatesincreasewiththepersonalimportanceofthetask~Frank~1935!!. People are also unrealistically optimistic about future events. They expect good things to happen to them more often than to their peers ~Weinstein ~1980!; Kunda ~1987!!. They are even unrealistically optimistic about pure chance events ~Marks ~1951!, Irwin ~1953!, Langer and Roth ~1975!!.4 People have unrealistically positive self-evaluations ~Greenwald ~1980!!. Most individuals see themselves as better than the average person and most individuals see themselves better than others see them ~Taylor and Brown 4Ito ~1990! reports evidence that participants in foreign exchange markets are more opti- mistic about how exchange rate moves will affect them than how they will affect others. Over twoyearstheJapanCenterforInternationalFinanceconductedabimonthlysurveyofforeign exchange experts in forty-four companies. Each was asked for point estimates of future yen0 dollarexchangerates.Thoseexpertsinimport-orientedcompaniesexpectedtheyentoappre- ciate~whichwouldfavortheircompany!;,thoseinexport-orientedcompaniesexpectedtheyen to fall ~which would favor their company!.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 48,
    "chunk_index": 7,
    "word_count": 399,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "evidence that participants in foreign exchange markets are more opti- mistic about how exchange rate moves will affect them than how they will affect others. Over twoyearstheJapanCenterforInternationalFinanceconductedabimonthlysurveyofforeign exchange experts in forty-four companies. Each was asked for point estimates of future yen0 dollarexchangerates.Thoseexpertsinimport-orientedcompaniesexpectedtheyentoappre- ciate~whichwouldfavortheircompany!;,thoseinexport-orientedcompaniesexpectedtheyen to fall ~which would favor their company!.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 48,
    "chunk_index": 8,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "When All Traders Are Above Average 1893 ~1988!!. They rate their abilities and their prospects higher than those of their peers. For example, when a sample of U.S. students—average age 22— assessed their own driving safety, 82 percent judged themselves to be in the top 30 percent of the group ~Svenson ~1981!!.5 And 81 percent of 2994 new business owners thought their business had a 70 percent or better chance of succeeding but only 39 percent thought that any business like theirs would bethislikelytosucceed~Cooperetal.~1988!!.Peopleoverestimatetheirown contributionstopastpositiveoutcomes,recallinginformationrelatedtotheir successes more easily than that related to their failures. Fischhoff ~1982! writes that “they even misremember their own predictions so as to exagger- ate in hindsight what they knew in foresight.” And when people expect a certain outcome and the outcome then occurs, they often overestimate the degree to which they were instrumental in bringing it about ~Miller and Ross ~1975!!. Taylor and Brown ~1988! argue that exaggerated beliefs in one’sabilitiesandunrealisticoptimismmayleadto“highermotivation,greater persistence, more effective performance, and ultimately, greater success.” These beliefs can also lead to biased judgments. In this paper overconfidence is modeled as a belief that a trader’s infor- mation is more precise than it actually is. As a consequence, traders’ poste- rior beliefs are too precise—a result directly supported by the calibration literaturecitedabove.Howheavilyinformationisweighteddependsnotonly on overconfidence but also on the nature of the information. Because the overconfident traders in these models believe their information to be more precise than it is, they weight it too heavily when updating their Bayesian posteriors. Relying on these posteriors, they take actions that affect mar- kets. The models can also be used to analyze the effects of overweighting or underweighting information ~when updating posteriors! for reasons in addi- tion to overconfidence ~e.g., see Proposition 5!. To understand such reasons, it is useful to briefly review the psychological literature on inference. B. Inference Psychologists find that, when making judgments and decisions, people overweight salient information ~i.e., information that stands out and cap- turesattention!~KahnemanandTversky~1973!,Grether~1980!!.Peoplealso give too much consideration to how extreme information is and not enough to its validity ~Griffin and Tversky ~1992!!; they “often behave as though informationistobetrustedregardlessofitssource,andmakeequallystrong or confident inferences, regardless of the information’s predictive value.... Whether the information is accurate and fully reliable or alternatively out- of-date, inaccurate, and based on hearsay may... matter little” ~Fiske and Taylor ~1991!!. They overweight information that is consistent with their existing beliefs, are prone to gather information that supports these beliefs, andreadilydismissinformationthatdoesnot~Lord,Ross,andLepper~1979!, 5Amodest51percentofagroupofolderSwedishstudents—averageage33—placedthem- selves in the top 30 percent of their group.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 48,
    "chunk_index": 9,
    "word_count": 412,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "accurate and fully reliable or alternatively out- of-date, inaccurate, and based on hearsay may... matter little” ~Fiske and Taylor ~1991!!. They overweight information that is consistent with their existing beliefs, are prone to gather information that supports these beliefs, andreadilydismissinformationthatdoesnot~Lord,Ross,andLepper~1979!, 5Amodest51percentofagroupofolderSwedishstudents—averageage33—placedthem- selves in the top 30 percent of their group.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 48,
    "chunk_index": 10,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "1894 The Journal of Finance Nisbett and Ross ~1980!, Fiske and Taylor ~1991!!. They are more confident in opinions based on vivid information ~Clark and Rutter ~1985!! and weigh cases, scenarios, and salient examples more heavily than relevant, abstract, statistical, and base-rate information ~Kahneman and Tversky ~1973!, Bar- Hillel ~1980!, Hamill, Wilson, and Nisbett ~1980!, Nisbett and Ross ~1980!, Bar-Hillel and Fischhoff ~1981!, Taylor and Thompson ~1982!, Tversky and Kahneman~1982!!.Inadditiontounderweightingbase-rateinformation,peo- ple underestimate the importance of sample size ~Tversky and Kahneman ~1971!, Kahneman and Tversky ~1972!! and of regression to the mean, that is,thetendencyofextremeoutcomestobefollowedbyoutcomesclosertothe population mean ~Kahneman and Tversky ~1973!!. Ingeneralthen,wemightexpectpeopletooverreacttolessrelevant,more attention-grabbing information ~e.g., an extreme event, a prominent news article with strong human interest, a rumor! while underreacting to impor- tant abstract information.6 In particular, we might expect people to under- estimate the importance of single statistics that summarize a large sample of relevant data ~e.g., corporate earnings!. C. Information In the following models, traders update their beliefs about the terminal value of a risky asset, vI, on the basis of three sources of information: a private signal, their inferences from market price regarding the signals of others, and common prior beliefs. The overconfidence literature indicates that people believe their knowledge is more precise than it really is, rate their own abilities too highly when compared to others, and are excessively optimistic. To be consistent with these patterns, traders in the model must hold posterior beliefs about the distribution of vI that are too precise, value theirowninformationmorethanothers’information,andexpecthigherutil- ity than is warranted. In the models, traders overweight their private sig- nals and, therefore, their posteriors are too precise, their own information is valuedmorethanthatofothers,andtheyoverestimatetheirexpectedutility. For most of the propositions in this paper to be true, it is sufficient that traders~1!holdposteriorbeliefsthataretoopreciseand~2!overweighttheir own information relative to that of others.7 Both conditions are satisfied if each trader overweights his own signal. These conditions may be further amplified when traders underweight their common prior beliefs or under- 6Reacting to how extreme information is rather than how reliable its source is can have dramatic consequences. OnApril 11, 1997, The Financial Times of London reported fraud in connection with an offshore fund called the Czech Value Fund, referring to the fund by the abbreviation CVF. Four days later Castle Convertible fund, a small closed-end fund with a diversified portfolio of convertible stocks and bonds trading on the AMEX under the ticker symbolCVF,plummeted32percentintwenty-twominutes.Tradingwashalted.AftertheCas- tle managers assured the exchange that they had no news, trading resumed at close to its preplungeprice.Apparentlysomeinvestorsreactedtowordofextremeproblemsratherthanto the reliability of that word ~New York Times,April 20, 1997, p. C1, byline Floyd Norris!. 7Propositions 2 and 9 require additionally that traders value new information relative to prior information.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 48,
    "chunk_index": 11,
    "word_count": 441,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "the ticker symbolCVF,plummeted32percentintwenty-twominutes.Tradingwashalted.AftertheCas- tle managers assured the exchange that they had no news, trading resumed at close to its preplungeprice.Apparentlysomeinvestorsreactedtowordofextremeproblemsratherthanto the reliability of that word ~New York Times,April 20, 1997, p. C1, byline Floyd Norris!. 7Propositions 2 and 9 require additionally that traders value new information relative to prior information.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 48,
    "chunk_index": 12,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "When All Traders Are Above Average 1895 weight the signals of others when updating beliefs. Common priors incorpo- ratepreviousinformationaboutsecurityreturns’behaviorandthusconstitute base-rate data that are likely to be underweighted when updating. The sig- nalsofothersconstitutealargesample.Becauselargesampleinferencesare usually undervalued, it is likely that if traders err in valuing the signals of others, they will undervalue these. Most of the propositions are proven only for the situation where each trader overweights his own signals. Often, cor- ollaries can be proven for when traders underweight their priors or under- weight the signals of others. In the interest of parsimony, these corollaries are not stated formally or proven, though the intuition involved is at times discussed.8 The calibration literature discussed above tells us that people overesti- mate the precision of their information. Overconfidence in one’s information is not the only type of overconfidence we might expect to find in the market. Traders could, instead, be overconfident about the way they interpret infor- mation rather than about the information itself. For example, traders of a stockmightlookatsignalssuchastradingmomentum,price0earningsratio, or forecasts of industry trends. These are examples of public information that is available to any trader but is valued differently by different traders. Thus, a Graham-and-Dodd style fundamental investor might be aware of recent changes in a stock’s momentum but consider its price0earnings ratio to be a more important signal; a technical trader who follows momentum might believe otherwise. Each is overconfident in his style of analysis and the signal he utilizes. At the same time, each is aware of the beliefs, and perhaps even the signals, of the other.9 Given people’s tendency to reject information that does not fit their beliefs ~Fiske and Taylor ~1991!!, the differing opinions of others are likely to be undervalued. In the models, traders who believe that their information is more precise than it actually is anticipate greater future utility than it is reasonable to anticipate. In this way these models capture some of the spirit of excessive 8When traders in these models underweight new information, the opinions of others, or priorinformation,themeansoftheirposteriorsdeviatefromtheposteriormeansrationaltrad- ers would form. As discussed above, these deviations are consistent with how people process differenttypesofinformation.However,underweightinganyofthesethreesourcesofinforma- tioncausestraderstounderestimatetheprecisionoftheirposteriors.Suchunderconfidenceis not consistent with generally observed behavior. Even when they discount valid information, peopleusuallymaintainstronglyheldbeliefs~e.g.,Lordetal.~1979!!.Weaklyheldposteriorsdo notmotivatetheresultsinthispaperand,whentheyarise,shouldnotbeconsideredrealistic implications of the models. 9Evensophisticatedinvestorsmayagreetodisagree.TheWashingtonPost~January7,1992, p. C2, bylineAllan Sloan! reports that, during the same time period, the nation’s most prom- inent long-term investor, Warren Buffett, and its most prominent short sellers, the Feshbach brothers, held, respectively, long and short positions worth hundreds of millions of dollars in WellsFargoBank.~BuffettcontrolstheinvestmentsofBerkshireHathawayInc.;theFeshbachs runaninvestmentfund.!Ostensibly,BuffettandtheFeshbachsdisagreedabouthowmuchthe bankwouldbehurtbyitsweakloanportfolio.Theyalsodifferedintheirinvestmenthorizons. Despitebeingrightabouttheloans,theFeshbachslost$50millionwhentheyhadtoclosetheir positions.As of January 1992, Buffett was about even.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 48,
    "chunk_index": 13,
    "word_count": 425,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "reports that, during the same time period, the nation’s most prom- inent long-term investor, Warren Buffett, and its most prominent short sellers, the Feshbach brothers, held, respectively, long and short positions worth hundreds of millions of dollars in WellsFargoBank.~BuffettcontrolstheinvestmentsofBerkshireHathawayInc.;theFeshbachs runaninvestmentfund.!Ostensibly,BuffettandtheFeshbachsdisagreedabouthowmuchthe bankwouldbehurtbyitsweakloanportfolio.Theyalsodifferedintheirinvestmenthorizons. Despitebeingrightabouttheloans,theFeshbachslost$50millionwhentheyhadtoclosetheir positions.As of January 1992, Buffett was about even.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 48,
    "chunk_index": 14,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "1896 The Journal of Finance optimism which psychologists have documented. However, optimism is not limited to an inflated opinion of the precision of unbiased signals. A trader mightalsohavefalseconfidenceinabiased~misinterpreted!signalortheory. D. Overconfidence in Financial Markets Why might we expect those trading in financial markets to be overconfi- dent? The foremost reason is that people usually are overconfident. The ex- ceptions to overconfidence mentioned in Section II.A generally do not apply to financial markets. Most of those who buy and sell financial assets try to choose assets that will have higher returns than similar assets. This is a difficulttaskanditispreciselyinsuchdifficulttasksthatpeopleexhibitthe greatestoverconfidence.Notonlynovicesexhibitoverconfidence.Griffinand Tversky ~1992! write that when predictability is very low, as in the stock market, experts may even be more prone to overconfidence than novices, because experts have theories and models ~e.g., of market behavior! which they tend to overweight.10 Securities markets are difficult and slow places in which to calibrate one’s confidence. Learning is fastest when feedback is quick and clear, but in se- curities markets the feedback is often slow and noisy. There may even be a trade-off between speed and clarity of feedback whereby short-term traders getquicker,butnoisier,feedback,andlong-termtradersreceiveclearerfeed- back but must wait for it. The problem of noisy feedback can be exacerbated by the endogeneity of the evaluation period. Shefrin and Statman ~1985! propose and Odean ~1998b! confirms that investors prefer to sell winners and hold losers. If investors judge their original purchase decisions on the basis of the returns realized, rather than those accrued, then, by holding losers, they will judge themselves to have made fewer poor decisions. Fur- thermore, the feedback from losses will be delayed more than that from gains, further facilitating positive self-evaluations. Selection bias may cause those participating actively in financial markets to be more overconfident than the general population. People vary in ability and those who believe they have more ability to trade may be more likely to seek jobs as traders or to trade actively on their own account. If people are uncertain judges of their own ability, then we might expect financial mar- kets to be populated by those with the most ability and by those who most overestimate their ability. Survivorship bias can also lead to overconfidence by market participants. Unsuccessfultradersmaylosetheirjobsorchoosetodropoutofthemarket; unsuccessful traders who survive will, on average, control less wealth than successful traders. If traders overestimate the degree to which they were responsiblefortheirownsuccesses—aspeopledoingeneral~MillerandRoss ~1975!, Langer and Roth ~1975!; Nisbett and Ross ~1980!!—successful trad- ers may grow overconfident and more wealth will be controlled by overcon- 10This observation may not apply to experts who adhere to computer-based quantitative models ~see Dawes, Faust, and Meehl ~1989!!.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 48,
    "chunk_index": 15,
    "word_count": 432,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "traders overestimate the degree to which they were responsiblefortheirownsuccesses—aspeopledoingeneral~MillerandRoss ~1975!, Langer and Roth ~1975!; Nisbett and Ross ~1980!!—successful trad- ers may grow overconfident and more wealth will be controlled by overcon- 10This observation may not apply to experts who adhere to computer-based quantitative models ~see Dawes, Faust, and Meehl ~1989!!.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 48,
    "chunk_index": 16,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "When All Traders Are Above Average 1897 fident traders. In Gervais and Odean ~1997! this self-enhancing bias causes wealthytraders,whoareinnodangerofbeingdrivenfromthemarketplace, to be overconfident. It is not that overconfidence makes them wealthy, but the process of becoming wealthy contributes to their overconfidence. An old Wall Street adage, “Don’t confuse brains with a bull market,” warns traders ofthedangerofbecomingoverconfidentduringamarketrally;nodoubtthis warning is given for good reason. This paper finds overconfident traders have lower expected utility.11 It does not necessarily follow that the overconfident traders lose their wealth andleavethemarketplace.Anoverconfidenttradermakesbiasedjudgments thatmayleadtolowerreturns.However,anoverconfidentrisk-aversetrader also chooses a riskier portfolio than he would otherwise hold and may be rewarded for risk-bearing with greater expected returns. It is possible that theprofitsofgreaterrisktolerancewillmorethancompensateforthelosses of biased judgments. Thus, as a group, overconfident traders could have higher expected returns, though lower expected utility, than properly cali- brated traders, as is the case in De Long et al. ~1990!. III. The Interaction between Overconfidence and Market Structure A. Price Takers Throughout this paper, expectations taken using the distributions that traders believe to be correct are indicated by a subscript “b” ~e.g., var !. b Expectations taken using the distributions that are actually correct are in- dicated by a subscript “a” ~e.g., var !. In equilibrium, overconfident traders a believe that they are acting optimally, and so they do not depart from the equilibrium. The traders could, in actuality, improve their expected utilities by acting differently, so the equilibria achieved here are not rational expec- tations equilibria. Themodelofprice-takingtradersisbasedonDiamondandVerrecchia~1981! andHellwig~1980!.Arisklessassetandoneriskyassetareexchangedinthree roundsoftradingattimest51,t52,andt53.Consumptiontakesplaceonly att54,atwhichtimetherisklessassetpays1unitpershareandeachshare oftheriskyassetpaysvI,wherevI ;N~vS,h21!.Therisklessinterestrateisas- v sumedtobe0.ThereareNinvestors~i51,...,N!.Asamodelingconvenience weanalyzethelimiteconomywhereNr‘.Thuseachinvestorcorrectlyas- sumesthathisowndemanddoesnotaffectprices.Att50eachtraderhasan endowmentoff oftherisklessassetandx oftheriskyasset.Intradinground 0i 0i t, trader i’s demands for the riskless asset and the risky asset are f and x . ti ti xS is the per capita supply of the risky asset; it is fixed, known to all, and un- changing.ThisdiffersfromDiamondandVerrecchia~1981!andHellwig~1980! where a stochastic supply of the risky asset provides an exogenous source of noise.P isthepriceoftheriskyassetintradingrounds1,2,and3.Traderi’s t 11When objectively measured, expected utility is lower for overconfident traders. However, overconfident traders believe that they are maximizing expected utility.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 48,
    "chunk_index": 17,
    "word_count": 328,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "supply of the risky asset; it is fixed, known to all, and un- changing.ThisdiffersfromDiamondandVerrecchia~1981!andHellwig~1980! where a stochastic supply of the risky asset provides an exogenous source of noise.P isthepriceoftheriskyassetintradingrounds1,2,and3.Traderi’s t 11When objectively measured, expected utility is lower for overconfident traders. However, overconfident traders believe that they are maximizing expected utility.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 48,
    "chunk_index": 18,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "1898 The Journal of Finance wealthisW 5f 1P x ,fort51,2,and3,andW 5f 1vI x .Thereisno ti ti t ti 4i 3i 3i signalpriortothefirstroundoftradingatt51.Priortotradingatt52and, again,priortotradingatt53,traderireceivesoneofM privatesignals,yI 5 ti vI 1eI ,where eI ;N~0,h21!and eI ,...,eI ,eI ,..., eI aremutuallyinde- tm tm e 21 2M 31 3M pendent. Each signal is received by the same number of traders. ~N is as- sumed to be a multiple of M.! YP 5 (N y 0N 5 (M y 0M is the average t i51 ti m51 tm signal at time t. The assumption that there are M , N signals in any time period is mo- tivated by the observation that when the number of traders is large there are likely to be fewer pieces of information about an asset than there are traders. Each trader knows that N0M 2 1 other traders are receiving the same two signals as she is. She believes the precision of these two signals to be kh , k $ 1. She believes the precision of the other 2M 2 2 signals to be e gh , g # 1. All traders believe that the precision of vI is hh , h # 1; that is, e v traders underestimate, or correctly estimate, the precision of their prior information. Let F 5 $ %, F 5 @y P #T, and F 5 @y y P P #T. 1i 2i 2i 2 3i 2i 3i 2 3 Thus, F represents the information available to trader i ~in addition to ti prior beliefs! at time t. Note that a trader’s posterior is more precise than that of a rational trader if, after receiving both of her signals, hh 1 2~k 1 v ~M 2 1!g! h $ h 1 2Mh . e v e Trader i’s utility function is 2exp~2aW !, thus traders have constant ab- it soluteriskaversion~CARA!witharisk-aversioncoefficientofa.Tradersare assumed to be myopic, that is, they look only one period ahead when solving their trading problem. Thus, at times t 51, 2, 3, trader i solves maxE@2exp~2a~W !6F # subjecttoP x 1f #P x 1f . ~1! t11i ti t ti ti t t21i t21i xti The traders in this model correctly conjecture that they do not affect prices, thus the only effect of assuming myopia is to eliminate hedging demands ~see Brown and Jennings ~1989!!. As others, including Singleton ~1987! and Brown and Jennings ~1989!, have found, this simplifies the analysis. When solving their maximization problems, traders conjecture that prices are linear functions of the average signals: P 5a 1a YP 1a YP ~2! 3 31 32 2 33 3 P 5a 1a YP . ~3! 2 21 22 2 The conjectures are identical for all traders and the coefficients determine an equilibrium in which the conjectures are fulfilled. Equilibrium is ob- tainedbecausetradersbelievethattheyarebehavingoptimallyeventhough, in fact, they are not. This equilibrium and the proofs for this section are presented in Appendix A.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 48,
    "chunk_index": 19,
    "word_count": 480,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "5a 1a YP . ~3! 2 21 22 2 The conjectures are identical for all traders and the coefficients determine an equilibrium in which the conjectures are fulfilled. Equilibrium is ob- tainedbecausetradersbelievethattheyarebehavingoptimallyeventhough, in fact, they are not. This equilibrium and the proofs for this section are presented in Appendix A.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 48,
    "chunk_index": 20,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "When All Traders Are Above Average 1899 There is no exogenous noise in this model. The purpose of noise is often to keep traders from using price and aggregate demand to make perfect infer- ences about the information of others. If rational traders with common pri- ors infer the same aggregate signal, they form identical posterior beliefs, and, if their endowments and preferences are also identical, they will not trade. If preferences and endowments differ, trading may occur but it might not occur in response to information, and this runs contrary to what we observe in markets.12 The absence of exogenous noise in this model demon- strates that, with overconfidence, orderly trading can take place in response to information even when no noise is present. ~Varian ~1989! has a similar result when traders disagree about the mean of the prior.! Each trader can infer the aggregate signal, but each values his portion of the aggregate dif- ferently, arrives at a different posterior belief, and is willing to trade. In this model, traders can perfectly infer the aggregate signal from price. Inpractice,tradersdonotusuallymakethisperfectinference.Thecertainty inthemodelwouldbedispelledifrandomlytradingnoisetraderswereadded to the economy. However, this certainty results not so much from the lack of noise trading as from the conventional assumption that traders are able to know the preferences of all other traders, to know the distributions of all random variables in the economy ~though here these are distorted by over- confidence!, and to make perfect inferences from their information. In ad- ditiontoknowingeachother’spreferences,whentradersarenotriskneutral and do not have constant absolute risk aversion, they must also know each other’swealthtoinferthesignalsbehindtrades.AsArrow~1986!pointsout, the information gathering and computational demands put on traders in models such as this would, in a more realistic setting, “imply an ability at information processing and calculation that is far beyond the feasible and cannot be well justified as the result of learning and adaptation.” It may be thattheprincipalsourceofnoiseinmarketsisnotthatafew~noise!traders donotattempttooptimizetheirutility,butthatmosttradersarenotcertain how best to do so. In its lack of exogenous noise, this model is similar to that of Grossman ~1976!. But in Grossman’s model, a trader can infer the aggregate signal yS from price and, having done so, can ignore his private signal y when deter- i mininghisdemand.AsBeja~1976!observes,thiscreatesaparadoxinwhich fully informative prices arise from an aggregate demand function that is without information because if prices are fully informative, traders have no incentive to consider their private signals when formulating their demand. When traders are overconfident, they can still infer the average signal from price, but they do not ignore their own signal when determining their de- mand. Each trader considers his signal to be superior to those of others, and because the average signal weights all traders’ signals equally, it is not a sufficient statistic to determine an individual trader’s demand. 12See Varian ~1989! for a discussion of no-trade theorems.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 48,
    "chunk_index": 21,
    "word_count": 459,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "own signal when determining their de- mand. Each trader considers his signal to be superior to those of others, and because the average signal weights all traders’ signals equally, it is not a sufficient statistic to determine an individual trader’s demand. 12See Varian ~1989! for a discussion of no-trade theorems.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 48,
    "chunk_index": 22,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "1900 The Journal of Finance This model is also related to Figlewski’s ~1978! model where price-taking traders with different posterior beliefs interact. Figlewski’s model does not have an exogenous noise source. To avoid the no-trade dilemma, he assumes traders are unable to infer the information of others from price. Were these traders overconfident, this assumption could be eased and results similar to the ones presented here would follow. In Jaffe and Winkler ~1976!, risk- neutral informed traders decide to trade after observing a risk-neutral mar- ketmaker’s bid and ask. The marketmaker can expect to lose to all rational investors,andsothismarketisunstable.JaffeandWinklersuggestthatthe introduction of liquidity traders or traders who misperceive their ability— suchastheoverconfidenttradersmodeledhere—couldstabilizethismarket. As discussed above, overconfidence causes traders to have differing pos- terior beliefs. The more overconfident traders are, the more differing these beliefs. This leads to the first proposition. PROPOSITION 1: When traders are price takers, expected volume increases as overconfidence increases (if M $ 2!. In all of the propositions, expectations are taken over the true probability distributions. Here we see that as overconfidence increases, traders increas- inglyweighttheirownsignalsmoreheavilythantheyweightthoseofothers when calculating their posterior beliefs. Their posterior beliefs are therefore more dispersed and more trading takes place.13 There is one exception to this pattern. If M 51 there is only one ~effectively public! signal received by all traders. And because all traders overvalue that signal equally, their be- liefsremainhomogeneousandnotradetakesplacethoughpricemaychange. ~If traders varied in their overconfidence in the public signal, they would trade.! Expected volume also increases when traders underweight common priors or the signals of others. PROPOSITION 2: When traders are price takers, volatility of prices increases as overconfidence increases. Whentradersareoverconfident,eachovervalueshisownpersonalsignal.This resultsintheaggregatesignalbeingovervaluedrelativetothecommonprior inthepricingfunctions~equations~2!and~3!!wherethecoefficientsa ,a , 22 32 and a are increasing in k. Overweighting the error in the aggregate signal 33 increases the volatility of prices. Decreasing h has the same effect and de- creasingglowerstheweightontheaggregatesignalandlowersvolatility.An- otherconsequenceofbiasedexpectationsisthattheyincreasethevarianceof thedifferencebetweenpriceandunderlyingvalue,var~P2vI!.Usingthisvari- ance as a measure of the quality of prices we have the following proposition. PROPOSITION3: Whentradersarepricetakers,overconfidenceworsensthequal- ity of prices. 13In a dynamic setting, such as that of Shefrin and Statman ~1994!, volume is determined not simply by differences in beliefs but by the rate of change of those differences ~see Karpoff ~1986!!.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 48,
    "chunk_index": 23,
    "word_count": 357,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "a measure of the quality of prices we have the following proposition. PROPOSITION3: Whentradersarepricetakers,overconfidenceworsensthequal- ity of prices. 13In a dynamic setting, such as that of Shefrin and Statman ~1994!, volume is determined not simply by differences in beliefs but by the rate of change of those differences ~see Karpoff ~1986!!.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 48,
    "chunk_index": 24,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "When All Traders Are Above Average 1901 We will see in the next model that when a strategic insider is overconfident, overconfidence can improve the quality of prices. These two models differ in that the next model has noise traders, but, more important, they differ in how information is distributed. Here all traders receive a signal, in the next model information is concentrated in the hands of a single insider. Even if noise is added to the current model, overconfidence will continue to distort prices,notimprovethem.ThisismosteasilyseenwhenM51,thatis,when thereisonepublicsignal.Ifthesignalispublic,noisydemandwillobviously not affect traders’ information, but overconfidence will continue to distort traders’ posterior expectations and, thereby, prices. Price quality also wors- ens when traders underweight common priors or the signals of others. Distortedexpectationsreduceexpectedutilities.Whentradersareovercon- fident, their expected utility is lower than when their probabilities are prop- erlycalibrated.Thisishardlysurprisingbecausetraderschoosetheiractions inordertooptimizeexpectedutility,andwhentheyareoverconfident,thisat- tempttooptimizeisbasedonincorrectbeliefs.~Similarly,expectedutilityalso declines as h and g decrease.!And so we have Proposition 4. PROPOSITION 4: When price-taking traders are overconfident, their expected utility is lower than if their beliefs are properly calibrated. There are no noise traders to exploit in this model, so the aggregate ex- pected returns from trading must be zero. Overconfidence decreases ex- pected utilities because it results in nonoptimal risk sharing. Overconfident traders hold underdiversified portfolios. Those who receive the highest sig- nals hold too much of the risky asset and too little of the risk-free asset; others hold too little of the risky asset and too much of the risk-free asset ~given their preferences and the true distributions of signals!. Of course each trader believes that she is optimally positioned.14 Tomodeloverconfidence,Iassumethattradersoverestimatetheprecision of their private signals. Doing so leads traders to hold differing beliefs and tooverestimatetheprecisionoftheirownposteriorbeliefs.Diverseposterior beliefs that are held too strongly are sufficient to promote excessive trading, increasevolatility,distortprices,andreduceexpectedutility.Fortime-series results though, how posteriors are constructed matters.Assuming that peo- ple always overweight private signals implies that they always overweight new information. But, as discussed in Section II.B, people do not always overweight new information. They usually overrespond to salient informa- tion and underrespond to abstract information. They underweight valuable information and overweight irrelevant information. To examine time-series implicationsofthemodel,wethereforelookatbothover-andunderweighted signals.Forprice-takingtraders,overvaluingnewinformationleadstoprice reversals, undervaluing it leads to price trends. 14If traders are overconfident and M 51, expected utilities will not be affected ~although prices will change!. Beliefs will be homogeneous, albeit mistaken, and traders will hold the same optimal portfolios they would hold if they valued their information correctly.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 48,
    "chunk_index": 25,
    "word_count": 390,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "time-series implicationsofthemodel,wethereforelookatbothover-andunderweighted signals.Forprice-takingtraders,overvaluingnewinformationleadstoprice reversals, undervaluing it leads to price trends. 14If traders are overconfident and M 51, expected utilities will not be affected ~although prices will change!. Beliefs will be homogeneous, albeit mistaken, and traders will hold the same optimal portfolios they would hold if they valued their information correctly.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 48,
    "chunk_index": 26,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "1902 The Journal of Finance PROPOSITION 5: When price-taking traders overvalue (undervalue) new infor- mation, price changes exhibit negative (positive) serial correlation. Any prediction based on this proposition requires an analysis of the type of information traders are receiving. Note that the serial correlation of returns and of price changes will have the same sign. Up to this point, all of the traders in this model are overconfident. What would happen if some traders were rational? In general, rational traders would mitigate but not eliminate the effects of the overconfident traders ~just as rational traders do not eliminate the effects of trader errors in De Long et al. ~1990! or Shefrin and Statman ~1994!!. In markets such as the one modeled here, traders vote with their dollars.As Figlewski ~1978! points out, “a trader with superior information but little wealth may have his in- formation undervalued in the market price.” Due to the assumption of con- stant absolute risk aversion, wealthy traders in the model trade no more than poor ones and so the impact on price of traders with particular view- points depends here on their numbers, not wealth. The mere presence of rational traders does not drive price to its rational value. To change price, traders must be willing to trade. Willingness to trade generally depends on strengthofbeliefs,risktolerance,andwealth.Thoughpossiblyendowedwith superior information, rational traders may trust their beliefs no more ~and possibly less! than overconfident traders. Their wealth and risk tolerance may not exceed those of others. Introducing rational traders into the model reduces trading volume ~per trader!, volatility, and the inefficiency of prices. The expected utility of rational traders is greater than that of overconfident traders. Introducing additional overconfident traders who are less overcon- fident than the existing ones has similar, though less extreme, results. In the preceding proposition, whether price changes are negatively or pos- itively correlated depends on whether traders overvalue or undervalue new information. In the following proposition, rational traders are added to the economy ~as described in Appendix A!. When rational traders trade with overconfident traders who undervalue the signals of others ~g #1!, the in- formation of rational traders will be underrepresented in price. Thus prices may trend. PROPOSITION 6: When rational traders trade with overconfident traders who (sufficiently)undervaluethesignalsofothers,pricechangeswillbepositively serially correlated. Positiveserialcorrelatedpricechangesaremostlikelywhentheprecisionof the rational traders’ signal is high and when overconfident traders signifi- cantly undervalue the signals of others. The specific region where price changes are positively serially correlated is identified in the proof of Prop- osition 6 ~Appendix A!. B. An Insider This model of insider trading is based on Kyle ~1985!. Other than nota- tional differences, the only changes made to Kyle’s original model are that",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 48,
    "chunk_index": 27,
    "word_count": 443,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "others. The specific region where price changes are positively serially correlated is identified in the proof of Prop- osition 6 ~Appendix A!. B. An Insider This model of insider trading is based on Kyle ~1985!. Other than nota- tional differences, the only changes made to Kyle’s original model are that",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 48,
    "chunk_index": 28,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "When All Traders Are Above Average 1903 the insider’s private signal of the terminal value is noisy and that the in- sider is overconfident. This is a one-period model in which a risk-neutral, privately informed trader ~the insider! and irrational noise traders submit market orders to a risk-neutral marketmaker. There are two assets in the economy, a riskless asset and one risky asset. The riskless interest rate is assumed to be 0. The terminal value of the risky asset is vI ; N~vS,h21!. vS is assumed to equal 0; v this simplifies notation without affecting the propositions. Prior to trading, a risk-neutral insider receives a private signal yI 5 vI 1 eI. eI is normally dis- tributed with mean zero and precision h . The insider believes the precision e of eI to be kh , where k $ 1, and the precision of vI to be hh , where h # 1. e v After observing yI, the insider demands ~submits a market order for! x units of the risky asset. Without regard for price or value, noise traders demand zI units of the risky asset, where zI ; N~0,h21!. The marketmaker observes z only the total demand x 1 zI and sets the price ~P!. The marketmaker cor- rectly assumes that the precision of eI is h and that the precision of vI is h . e v ~The propositions do not change if the marketmaker, like the insider, be- lievestheprecisionofthepriortobehh .!Aftertrading,theriskyassetpays v its terminal value vI. The insider and the marketmaker know the true dis- tribution of zI and are aware of each other’s beliefs about the precisions of vI and yI. The insider conjectures that the marketmaker’s price-setting function is a linear function of x 1 zI, P5H1L~x1zI!. ~4! He chooses x to maximize his expected profit, x~vI 2 P!, conditional on his signal, yI, and given his beliefs about the distributions of vI, yI, and zI and the conjectured price function. It is assumed, as in Kyle ~1985!, that the mar- ketmaker earns zero expected profits. The marketmaker conjectures that the insider’s demand function is a linear function of yI, x5A1ByI. ~5! She sets price to be the expected value of vI conditional on total demand ~x1 zI!,givenherbeliefsaboutthedistributionsof vI, yI,and zI andtheconjectured demand function. In Kyle’s original model, a linear equilibrium always exists in which the conjectured price and demand functions are fulfilled. Given the assump- tions of overconfidence made here, a linear equilibrium exists whenever kh 1 2 hh . kh . ~The equilibrium and the proofs for this section are e v v presented inAppendix B.! The intuition behind the equilibrium condition is the following. The marketmaker sets price to be the expectation of vI condi- tional on the order flow she observes and on her conjecture about the insid- er’sdemandfunction.Theinsideristryingtomaximizehisprofit.Hisprofit increases if he trades more with the same profit margin or if he trades the same amount with a larger margin. If the insider increases his demand, the",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 48,
    "chunk_index": 29,
    "word_count": 496,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "to be the expectation of vI condi- tional on the order flow she observes and on her conjecture about the insid- er’sdemandfunction.Theinsideristryingtomaximizehisprofit.Hisprofit increases if he trades more with the same profit margin or if he trades the same amount with a larger margin. If the insider increases his demand, the",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 48,
    "chunk_index": 30,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "1904 The Journal of Finance marketmaker shifts the price and thus lowers the insider’s expected profit margin. Equilibrium exists at the demand-price pair where the insider be- lieves that, if he increases his demand, the negative effect of the lower ex- pected profit margin will just offset the gains of greater trading and, if he lowers demand, the losses from trading less will just offset gains from a higher expected profit margin. If the insider and the marketmaker disagree too much about the relative precisions of the prior and the private signal, there is no equilibrium; for any given insider demand function ~A,B!, the marketmaker will choose a pricing function ~H,L! such that the insider will prefer a yet steeper demand function ~i.e., greater B!. As in Kyle’s ~1985! model, the insider can only influence price through his demand. This assumption is particularly critical when overconfidence is in- troduced to the model. If the insider could credibly reveal his private signal to the marketmaker, then, due to the different weights each attaches to the prior and to the signal, the insider and the marketmaker would have dif- ferent posterior beliefs about the expected value of the terminal payoff.And because they are both risk neutral, they would each be willing to trade an infinite amount. Infinite trading is a possible problem whenever risk- neutral traders value common information differently. In Harris and Raviv ~1993!, risk-neutral traders attribute different density functions to a public signal ~Harris and Raviv avoid infinite trading by assuming a fixed number ofsharesareavailableandthatshortsalesarenotallowed!.JaffeandWink- ler ~1976! avoid infinite trading by assuming only one asset share can be exchanged. The willingness to trade infinitely is inherent in risk neutrality, not in overconfidence. Risk neutrality is assumed here for tractability. Allofthepropositionsinthissectionaretruewhenhisdecreasinginstead of k increasing. PROPOSITION 7: Expected volume increases as the insider’s overconfidence increases. Expected volume is measured as the expected value of the sum of the abso- lute values of insider demand and noise trader demand. When the insider is overconfident, he believes that he has received a stronger private signal, yI, than is actually the case. In calculating his posterior expectation of the final value of the risky asset, he overweights his signal and derives a posterior expectation farther from the prior than he should. Based on this posterior belief,hetradesmoreaggressivelythanisoptimal,thusincreasingexpected volume. PROPOSITION8: Marketdepthincreasesastheinsider’soverconfidenceincreases. PROPOSITION 9: Volatility of prices increases as the insider’s overconfidence increases. PROPOSITION10: Thequalityofpricesimprovesastheinsider’soverconfidence increases.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 48,
    "chunk_index": 31,
    "word_count": 398,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "calculating his posterior expectation of the final value of the risky asset, he overweights his signal and derives a posterior expectation farther from the prior than he should. Based on this posterior belief,hetradesmoreaggressivelythanisoptimal,thusincreasingexpected volume. PROPOSITION8: Marketdepthincreasesastheinsider’soverconfidenceincreases. PROPOSITION 9: Volatility of prices increases as the insider’s overconfidence increases. PROPOSITION10: Thequalityofpricesimprovesastheinsider’soverconfidence increases.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 48,
    "chunk_index": 32,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "When All Traders Are Above Average 1905 Overconfidence causes prices to be more sensitive to changes in value ~vI! and in the insider’s signal ~yI !, and less sensitive to changes in informed demand ~xI! and noise trader demand ~zI!. The marketmaker sets price to be the expectation of vI conditional on observed orderflow and her conjecture about the insider’s demand function. She realizes that the insider is over- confident and that he will trade more in response to any given signal than he would if he were rational. She therefore moves price less in response to changes in total order flow ~xI 1zI! than she would if the insider were ratio- nal. That is, she flattens her supply curve, thereby increasing market depth ~which is measured as the inverse of the derivative of price with respect to order flow!. Because the overconfident insider trades more in response to any given signal than he would if he were rational, his expected trading increasesrelativetothatofnoisetraders.Thereforethesignal-to-noiseratio in total order flow increases and the marketmaker is able to make better inferences about the insider’s signal. This enables her to form a more accu- rate posterior expectation of vI and to set a price that is, on average, closer to vI. This improves the quality of prices, which is measured, as in the previous model, as the variance of the difference of price ~P! and value ~vI!. Because the marketmaker can better infer the insider’s signal, yI, the price she sets varies more in response to changes in yI than if the insider were rational. Thisincreasesthevarianceofprice~volatility!.Fromadifferentperspective, although the marketmaker has flattened her supply curve, thus dampening volatility for any given level of expected order flow, the increased order flow generated by the overconfident insider more than offsets this dampening, and results in increased volatility. Thus both market depth and volatility rise with overconfidence. PROPOSITION 11: The expected profits of the insider decrease as his overconfi- dence increases. The insider’s expected profits, E ~x~vI 2 P!!, are equivalent to his expected a utility because he is risk neutral. The insider submits a demand ~to buy or to sell! that is optimal given his beliefs about the distributions of vI and yI, a demand that he believes will maximize his expected profits. He is mistaken about the precision of his knowledge, but conditional on his beliefs he be- haves optimally. The demand he submits is not, however, the same demand he would submit were he not overconfident, and it is not optimal given the true distributions of vI and yI. Therefore the insider’s expected profits are lower than they would be if he were not overconfident.15 15Kyle and Wang ~1997! show that under particular circumstances when both a rational insiderandanoverconfidentinsidertradewithamarketmaker,theoverconfidentinsidermay earn greater profits than the rational insider. The overconfident insider earns greater profits by“precommitting”totradingmorethanhisshareinaCournotequilibrium.Forthisresultto hold,tradersmusttradeoncorrelatedinformation,havesufficientresourcesandrisktolerance to trade up to the Cournot equilibrium, know each other’s overconfidence, and trade with a thirdparty~e.g.,themarketmaker!.Furthermore,ifonetradercantradebeforetheother,the result may not hold.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 48,
    "chunk_index": 33,
    "word_count": 488,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "overconfident.15 15Kyle and Wang ~1997! show that under particular circumstances when both a rational insiderandanoverconfidentinsidertradewithamarketmaker,theoverconfidentinsidermay earn greater profits than the rational insider. The overconfident insider earns greater profits by“precommitting”totradingmorethanhisshareinaCournotequilibrium.Forthisresultto hold,tradersmusttradeoncorrelatedinformation,havesufficientresourcesandrisktolerance to trade up to the Cournot equilibrium, know each other’s overconfidence, and trade with a thirdparty~e.g.,themarketmaker!.Furthermore,ifonetradercantradebeforetheother,the result may not hold.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 48,
    "chunk_index": 34,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "1906 The Journal of Finance Thismodelincludesanoverconfidentinsider,noisetraders,andarational marketmaker who expects to earn zero profits. Whatever profits the over- confident insider gives up are passed on to the noise traders in the form of lower losses. Were the rational marketmaker not constrained by assumption to earn zero profits, she would benefit from the insider’s overconfidence. This model ~and the next one! require a source of uncertain demand for the risky asset so that the insider’s information is not perfectly deducible from totaldemand.Noisetraderswhotraderandomlyandwithoutregardtoprice ~as in Kyle ~1985!!, though they may lack perfect real world analogues, pro- vide an analytically tractable source of uncertain demand. Overconfident, risk-averse, price-taking traders with private signals, such as the traders described in the previous section, could also provide uncertain demand in a market. In that case, if the insider were not too overconfident, he would profit at the expense of the overconfident price takers. Unfortunately, re- placing noise traders with overconfident price takers greatly complicates the model. C. Marketmakers and Costly Information The next model examines the behavior of overconfident marketmakers. It alsooffersanexplanationforwhyactivemoneymanagersunderperformpas- sivemoneymanagers:Activemanagersmaybeoverconfidentintheirability to beat the market and spend too much time and money trying to do so. The model is based on Grossman and Stiglitz ~1980!. Risk-averse traders decide whether or not to pay for costly information about the terminal value of the risky asset; those who buy information receive a common signal; and a single round of trading takes place. The participants in this trading are the traders who buy information ~informed traders!, traders who do not buy theinformation~uninformedtraders!,andnoisetraderswhobuyorsellwith- outregardtopriceorvalue.16Asinthepreviousmodels,arisklessassetand oneriskyassetaretraded;therisklessinterestrateisassumedtobe0;each share of the risky asset pays vI, where vI ; N~vS,h21!. Traders believe the v precision of vI to be hh , where h #1; that is, they undervalue the common v prior. There are N investors ~i 5 1,...,N!. As a modeling convenience we analyze the limit economy where N r ‘. Thus each investor correctly as- sumes that his own demand does not affect prices. Each trader has an en- dowment of f of the riskless asset and x of the risky asset. xS 5~( x !0N 0i 0i N 0i is the average endowment. As a notational convenience it is assumed that xS 5 0 and vS 5 0. Prior to trading, traders choose whether or not to pay cost c in order to receive a signal yI 5 vI 1 eI, where eI ; N~0,h21!. Noise trader e 16In this section “traders” refers to informed traders and to uninformed traders but not to noise traders who are referred to explicitly as “noise traders.”As in the insider model, noise traders could be replaced with overconfident price takers, such as those discussed in Sec- tion III.A. Overconfidence would motivate trading and the model’s results would not change significantly. However replacing noise traders with overconfident price takers greatly compli- cates the equilibrium without adding much intuition.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 48,
    "chunk_index": 35,
    "word_count": 473,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "in the insider model, noise traders could be replaced with overconfident price takers, such as those discussed in Sec- tion III.A. Overconfidence would motivate trading and the model’s results would not change significantly. However replacing noise traders with overconfident price takers greatly compli- cates the equilibrium without adding much intuition.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 48,
    "chunk_index": 36,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "When All Traders Are Above Average 1907 demand per ~nonnoise! trader is zI, where zI ; N~0,h21!. Thus 2zI is the z supply of the risky asset per trader at the time of trading. In equilibrium, l* is the fraction of traders who choose to become informed. All traders, even those who remain uninformed, are overconfident about the signal, which they believe to have precision kh , where k $ 1. In the e previous models, traders were overconfident about their own signals but not those of others. Here everyone believes the information is better than it is, but some decide the cost is still too high. It is as if all money managers overestimate their ability to manage money actively, but some decide the costs of doing so are too high and so, despite their overconfidence, choose to manage passively.17 In real markets one would expect traders to hold a spec- trum of beliefs about the value of costly information. Those who were more overconfident about the information would be more likely to buy it. One could alternatively specify in this model that those traders who do not buy the signal value it rationally.18 Trader i’s demand for the risky asset is x and for the risk-free asset is 1i f . So his final wealth is W 5 x vI 1 f . Trader i’s utility function is 1i 1i 1i 1i U~W ! 5 2exp~2aW !, where a is the common coefficient of absolute risk 1i 1i aversion. He maximizes his expected utility by choosing whether or not to become informed, and then, conditional on his information, by choosing his optimal demand subject to the budget constraint. That is, if he is informed, he solves maxE @2exp~2aW !6yI # subjecttox P1f #x P1f , ~6! b 1I 1I 1I 0I 0I x1I and if he is uninformed he solves maxE @2exp~2aW !6P# subjecttox P1f #x P1f , ~7! b 1U 1U 1U 0U 0U x1U 17Inpractice,somepractitionersofpassiveinvestingtouttheirownskillsassuperioractive managers. For example, Barclays Global Investment Advisors, the largest manager of index funds, has a GlobalAdvancedActive Group that actively manages more than $70 billion.And George Sauter who oversees $61 billion in stock-index mutual funds at Vanguard Group also actively manages Vanguard Horizon FundAggressive Growth Portfolio ~The Wall Street Jour- nal, February 25, 1997, p. C1, byline Robert McGough!. 18Assuming that traders who do not purchase the signal value it correctly will result in a rangeofpossibleequilibriaratherthanasingleequilibriumpoint.Atoneendoftherangethe samefractionoftradersbecomesinformedaswhenalltradersarerational.Heretherational uninformed traders believe that the fraction of traders who are informed is optimal, and the overconfident informed traders believe that the fraction of traders who are informed is too small.Tradersinneithergroupbelievetheywouldbenefitfromchanginggroups.Attheother endoftherange,thesamefractionoftradersbecomesinformedaswhenalltradersareover- confident. Here the rational uninformed traders believe that the fraction of traders who are informedisgreaterthantheoptimum,andtheoverconfidentinformedtradersbelievethatthe fraction of traders who are informed is optimal.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 48,
    "chunk_index": 37,
    "word_count": 459,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "the fraction of traders who are informed is optimal, and the overconfident informed traders believe that the fraction of traders who are informed is too small.Tradersinneithergroupbelievetheywouldbenefitfromchanginggroups.Attheother endoftherange,thesamefractionoftradersbecomesinformedaswhenalltradersareover- confident. Here the rational uninformed traders believe that the fraction of traders who are informedisgreaterthantheoptimum,andtheoverconfidentinformedtradersbelievethatthe fraction of traders who are informed is optimal.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 48,
    "chunk_index": 38,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "1908 The Journal of Finance wherei5Iandi5Uindicateprototypicalinformedanduninformedtraders and P is the endogenously determined price of the risky asset. In equilib- rium all traders believe that the expected utility of the informed traders is equal to that of the uninformed. Because all traders believe the precision of yI is kh and the precision of vI is hh , and because the equilibrium is deter- e v mined by the traders’beliefs, the equilibrium obtained is the same as would occur in a model without overconfidence where the precision of e was actu- ally kh and that of vI was hh . Once again equilibrium holds because the e v traders believe that they are behaving optimally, though, in fact, they are not. The equilibrium and the proofs for this section are presented in Appen- dix C. In the previous two models, expected utility drops as overconfidence in- creases.Inthismodel,wheretradersareoverconfidentaboutacostlysignal, it is those who buy the signal who are most hurt by their overconfidence. PROPOSITION12: Formanysetsoftheparametersspecifyingthiseconomy(and perhaps for all sets), when traders overvalue costly information, the expected utility of informed traders is lower than that of uninformed traders. When traders overestimate the value of the costly signal, too many of them arewillingtobuyit.Itsbenefitsarethereforespreadtoothin,resultinginlower expectedutilitiesfortheinformedtraders.Thepropositionstatesonlythatthis istrueformanysetsoftheparametersthatspecifytheeconomy.Explicitso- lutions for the expected utilities of the informed and uninformed traders are given inAppendix C. I evaluate these for a wide variety of parameter values andfindthatineverycasetheexpectedutilityoftheinformedislessthanthat of the uninformed if k . 1 or h , 1 ~and 0 , l , 1!.19 When some traders buy information and others do not ~i.e., 0 , l , 1!, individual informed traders trade, on average, more than individual un- informed traders. ~This is the case even when there is no overconfidence. Uninformed traders as a group, however, may trade more than informed traders as a group when their numbers are sufficiently larger.! When trad- ers are overconfident, the expected utility of informed traders is lower than that of uninformed traders, therefore it follows that the expected utility of those who, on average, trade more is lower than that of those who, on av- erage, trade less. This is consistent with Barber and Odean’s ~1998! finding that individual investors who turn over their common stocks at higher rates earn, on average, lower net returns. Whensometradersbuyinformationandothersdonot,thismodeldoesnot offer much intuition about how overconfidence affects total trading volume and volatility. Volume and volatility can increase, decrease, or remain un- changed as overconfidence increases. Even when there is no overconfidence, volume and volatility rise or fall in response to increases in other parameter 19Iftheuninformedtradersarerationalratherthanoverconfident,theyoptimizecorrectly. Inthiscaseitistrivialtoshowthattheirexpectedutilityisatleastashighasthatofinformed traders. If it were not, they would become informed.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 48,
    "chunk_index": 39,
    "word_count": 427,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "overconfidence affects total trading volume and volatility. Volume and volatility can increase, decrease, or remain un- changed as overconfidence increases. Even when there is no overconfidence, volume and volatility rise or fall in response to increases in other parameter 19Iftheuninformedtradersarerationalratherthanoverconfident,theyoptimizecorrectly. Inthiscaseitistrivialtoshowthattheirexpectedutilityisatleastashighasthatofinformed traders. If it were not, they would become informed.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 48,
    "chunk_index": 40,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "When All Traders Are Above Average 1909 values such as the coefficient of risk aversion and the precision of yI. Volume and volatility vary in response to changes in the fraction of investors be- coming informed, l, which is itself extremely sensitive to changes in the various parameter values. These patterns appear to be idiosyncracies of the model rather than generalizations about markets.20 When all traders are informed, they act as marketmakers who have some information about the terminal value of the risky asset.21 The supply sched- ule they set is: P 5 E ~vI6yI ! 1 avar ~vI6yI !Q. There are two separate compo- b b nents to this price: avar ~vI6yI !Q is a response to noise trader demand ~since b Q 5 zI! and hedges traders in their capacity as marketmakers against in- ventory risk. E ~vI6yI ! is a response to the signal yI and represents traders’ b speculations about terminal value. If there were no signal, price would be completely determined by inventory risk; if there were a signal, but no noise trader demand, price would be completely determined by the signal. A de- crease in h means that these marketmakers perceive themselves as having less reliable prior information and therefore facing greater risk. Thus, lower h steepens the supply curve, decreasing market depth and increasing the inventory-risk component of volatility. On the other hand, when k increases thesemarketmakersseethemselvesashavingmorereliableinformationand their perception of the risk of holding inventory is diminished. An increase in k therefore flattens the supply curve, increasing market depth and de- creasing the inventory-risk component of volatility. Overconfidence in- creases market depth because it lowers a marketmaker’s perceived risk. Increasing k moves E ~vI6yI ! closer to yI and farther from vS 5 0, thereby in- b creasing the speculative component of volatility while decreasing its inven- tory risk component. When expected noise trader demand is low, the speculativecomponentofvolatilitydominatesandincreasingkincreasesvol- atility. When expected noise trader demand is high, inventory-risk domi- nates and increasing k decreases volatility. Figure 1 graphs supply curves in two economies. The dashed line repre- sentsaneconomywherek51andthesolidlineaneconomywherek52.All other parameter values are the same in both economies and all traders are informed. The supply curves are conditional on traders receiving a signal of yI 52 ~one standard deviation above the mean signal!. The solid line is flat- 20Tounderstandwhy,inthismodel,expectedvolumecanriseorfallwithoverconfidenceit is helpful to look at boundary cases. When cost is so high that all traders remain uninformed ~i.e., l* 5 0!, the traders do not trade with each other and all trading is done between the uninformedtradersandthenoisetraders.Thus,expectedvolumeequalstheexpecteddemand ofthenoisetraders~i.e.,%20ph !.Whenoverconfidenceincreasessufficiently,sometraders,but z notall,willbecomeinformed.Informedanduninformedtraderswillnowtradewitheachother andtheywillalsocontinuetofillthedemandofthenoisetraders,soexpectedvolumewillrise. Asoverconfidencecontinuestorise,alltradersmayeventuallybecomeinformed~dependingon the other parameter values!, in which case expected volume will fall back to the expected de- mand of noise traders. 21Notethatwhenalltradersareinformed,thismodelisanalogoustoaone-periodversion of the model in Section III.Awith noise traders added and M 51.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 48,
    "chunk_index": 41,
    "word_count": 461,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "with each other and all trading is done between the uninformedtradersandthenoisetraders.Thus,expectedvolumeequalstheexpecteddemand ofthenoisetraders~i.e.,%20ph !.Whenoverconfidenceincreasessufficiently,sometraders,but z notall,willbecomeinformed.Informedanduninformedtraderswillnowtradewitheachother andtheywillalsocontinuetofillthedemandofthenoisetraders,soexpectedvolumewillrise. Asoverconfidencecontinuestorise,alltradersmayeventuallybecomeinformed~dependingon the other parameter values!, in which case expected volume will fall back to the expected de- mand of noise traders. 21Notethatwhenalltradersareinformed,thismodelisanalogoustoaone-periodversion of the model in Section III.Awith noise traders added and M 51.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 48,
    "chunk_index": 42,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "1910 The Journal of Finance Figure 1. Supply curves when all traders are informed. P 5 E ~vI6yI! 1 avar ~vI6yI!Q b b wherePispriceandQisquantity,foreconomiesinwhichk52~solidline!andk51~dashed line! and where, for both economies, signal yI 5 2 has been received, h 51, h 5 2, h 51, v e h 50.25, a52, c50.09, and l51. z ter, which means that market depth is greater when k 5 2. The two supply curves cross at about Q 5 2. If demand is less than 2 and greater than approximately21.5, price will be closer to its unconditional expected value, 0, when k 5 1 than when k 5 2. But when the magnitude of noise trader demand is high ~i.e., zI . 2 or zI , 21.5! price will be closer to its expected value when k 5 2 than when k 51. When expected noise trader demand is low, demand will more often fall into the area where the magnitude ~and volatility! of price is smaller for k51. When expected noise trader demand is high, the economy with k 5 2 will have lower volatility. The following proposition summarizes the above discussion. PROPOSITION 13: Market depth is increasing in the overconfidence of a risk- averse marketmaker. Volatility increases when expected noise trader demand is high and decreases when it is low. (Precise definitions of high and low expected noise trader demand are given in Appendix C.) IV. Discussion This paper examines the effects of overconfidence in a variety of market settings. These settings differ principally in how information is distributed and how prices are determined. For some market measures, such as trading volume, overconfidence has a similar effect in each setting. For others, such",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 48,
    "chunk_index": 43,
    "word_count": 280,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "Appendix C.) IV. Discussion This paper examines the effects of overconfidence in a variety of market settings. These settings differ principally in how information is distributed and how prices are determined. For some market measures, such as trading volume, overconfidence has a similar effect in each setting. For others, such",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 48,
    "chunk_index": 44,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "When All Traders Are Above Average 1911 as market efficiency, it does not. Which set of predictions is appropriate to a marketdependsontheinformationalstructureandpricesettingmechanism of that market. For example, if, for a particular market, crucial information is first obtained by well-capitalized insiders and marketmakers are primar- ily concerned about trading against informed insiders, then the model of the overconfident insider ~Section III.B! is appropriate. However, if relevant in- formation is usually publicly disclosed and then interpreted differently by a large number of traders each of whom has little market impact, the over- confidentprice-takermodel~SectionIII.A!applies.Theobservationthatover- confidenttraderswillpaytoomuchforinformation~SectionIII.C!appliesto markets in which traders choose between investing passively and expending resources on information and other costs of active trading. We find the fol- lowing effects of overconfidence on different market measures. Overconfidenceincreasestradingvolume.Overconfidentpricetakers~Sec- tion III.A! form differing posterior beliefs and trade speculatively with each other. Were these traders rational they would hold identical posteriors and trade only to initially balance their portfolios. Overconfident insiders ~Sec- tion III.B! also trade more aggressively than if they were rational. And, as seen in the model of marketmakers ~Section III.C!, overconfident market- makers set a flatter supply curve. A flatter supply curve encourages more trading when traders are price sensitive. Thus, in all three settings, over- confidence leads to greater trading volume. Though there is anecdotal evi- dence of excessive trading—for example, roughly one-quarter of the annual international trade and investment flow is traded each day in foreign ex- change markets ~Dow and Gorton ~1997!!; the average annual turnover rate ontheNewYorkStockExchangeiscurrentlygreaterthan60percent~NYSE Fact Book for 1996!—without an adequate model of what trading volume in rational markets should be, it is hard to prove that aggregate market vol- ume is excessive. Odean ~1998a! looks at the buying and selling activities of individual investors at a discount brokerage. Such investors could quite rea- sonably believe that their trades have little price impact. On average, the stocks these investors buy subsequently underperform those they sell ~gross of transactions costs!, even when liquidity demands, risk management, and tax consequences are considered. As predicted by the model of price-taker overconfidence,theseinvestorstradetoomuch.However,overconfidenceabout the precision of private signals alone is not enough to explain why these investors make such poor trading decisions. In addition to overvaluing their information, these investors must also misinterpret it. Statman and Thorley ~1998! find that trading volume increases subsequent to market gains. If success in the market leads traders to become overconfident—as Gervais and Odean ~1997! find—these increases in volume may be driven by overconfidence. Whether overconfidence improves or worsens market efficiency depends on how information is distributed in the market. On the one hand, when information is distributed in small amounts to many traders or when it is publicly disclosed and then interpreted differently by many traders, over- confidence causes the aggregate signal to be overweighted ~Section III.A!.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 48,
    "chunk_index": 45,
    "word_count": 462,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "worsens market efficiency depends on how information is distributed in the market. On the one hand, when information is distributed in small amounts to many traders or when it is publicly disclosed and then interpreted differently by many traders, over- confidence causes the aggregate signal to be overweighted ~Section III.A!.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 48,
    "chunk_index": 46,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "1912 The Journal of Finance This leads to prices further from the asset’s true value, vI, than would other- wise be the case. Though all available information is revealed in such a market, it is not optimally incorporated into price. On the other hand, when information is held exclusively by an insider and then inferred by a market- makerfromorderflow~SectionIII.B!,overconfidencepromptstheinsiderto reveal, through aggressive trading, more of his private information than he otherwise would, thereby enabling the marketmaker to set prices closer to the asset’s true value. If, however, the insider’s information is time sensitive and becomes public soon after he trades, this gain in efficiency is short- lived. Given the broad disclosure of information in U.S. equity markets and the brevity of gains in efficiency from overconfident insiders, we would ex- pect overconfidence, in net, to decrease efficiency in these markets. Traders’ overconfidence increases volatility; marketmaker’s overconfi- dence may lower it. By overweighting the aggregate signal of the price tak- ers~SectionIII.A!,overconfidencedrivespricefurtherfromitstrueunderlying value, vI, and further from its unconditional mean, vS. This results in in- creasedvolatility.Bypromptingtheinsidertorevealmoreofhissignal~Sec- tion III.B!, overconfidence enables the marketmaker to move price closer to the true underlying value, vI, and further from its unconditional value, vS. This, too, increases volatility. In the first case, overconfidence increases vol- atility by distorting the prices implied by public, or broadly disseminated, information;inthesecond,overconfidenceincreasesvolatilitybymovingprices closertothevaluesimpliedbyhighlyconcentrated,privateinformation.Pri- vately informed, risk-averse marketmakers ~Section III.C! flatten their sup- ply curves when they are overconfident, just as they would if they were less risk averse, because overconfidence leads them to perceive less risk in hold- ing inventory. Flattening the supply curve dampens volatility. The influence of a group of traders on price will depend on their numbers, wealth, risk tolerance, overconfidence, and information. In a market with many traders and few marketmakers it is unlikely that dampening of volatility by over- confident marketmakers will offset increases in volatility due to overconfi- denttraders.Someresearchsuggeststhatmarketvolatilityisexcessive~Shiller ~1981, 1989!, LeRoy and Porter ~1981!!, but this is a difficult proposition to prove~MarshandMerton~1986!,Kleidon~1986!!.Pontiff~1997!findsexcess volatility for closed-end funds. Overconfidence increases market depth. When an insider is overconfident, he trades more aggressively ~for any given signal!. The marketmaker ad- justs for this additional trading ~in response to the same signal! by increas- ing market depth ~Section III.B!. Overconfident risk-averse marketmakers perceive that their estimate of the security’s true value is more precise than it is and that they face less risk by holding inventory. So they flatten their supply curves, which also increases market depth ~Section III.B!. Overconfidencelowersexpectedutilities.Overconfidenttradersdonotprop- erly optimize their expected utilities, which are therefore lower than if the traders were rational. Overconfident traders hold underdiversified portfo- lios. When information is costly, those who choose to become informed trade more and fare worse than those who remain uninformed ~Section III.C!. In",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 48,
    "chunk_index": 47,
    "word_count": 454,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "increases market depth ~Section III.B!. Overconfidencelowersexpectedutilities.Overconfidenttradersdonotprop- erly optimize their expected utilities, which are therefore lower than if the traders were rational. Overconfident traders hold underdiversified portfo- lios. When information is costly, those who choose to become informed trade more and fare worse than those who remain uninformed ~Section III.C!. In",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 48,
    "chunk_index": 48,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "When All Traders Are Above Average 1913 practice, the cost of active managers’information must be reflected in their fees. Thus, this finding is consistent with many studies of the relative per- formance of active ~informed! and passive ~uninformed! money managers.22 It is also consistent with the lower net returns earned by individual inves- tors whose portfolio turnover is high ~Barber and Odean ~1998!!. Overconfident traders who discount the opinions of others can cause mar- ketstounderreacttotheinformationofrationaltraders~SectionIII.A!.Mar- kets also underreact when traders underweight their own new information and overreact when they overweight it. The degree of under- or overreaction depends on what fraction of all traders receives the information and on how willingthesetradersaretotrade.~Bloomfield,Libby,andNelson~1997!find that traders in experimental markets undervalue the information of others; Bloomfield and Libby ~1996! find that the impact of a signal on price, in an experimental market, depends on what fraction of traders receive that sig- nal.! Underreactions occur when all traders undervalue a signal or when only a small fraction of traders overvalue it, but others discount their opin- ion. Overreactions require that a significant fraction of active traders ~those most willing to trade! significantly overvalue a signal. Some documented market return anomalies indicate overreactions to pub- lic events, but most find underreactions.23 Fama ~1997! points out that if markets occasionally overreact and at other times underreact this could be due to simple chance. Like markets, people, too, sometimes overvalue infor- mationandatothertimesundervalueit.Thoughthesevaluationerrorsmay appear due to chance, psychologists find that they are systematic. People typicallyoverreacttosalient,attention-grabbinginformation,overvaluecases, anecdotes, and extreme realizations, and overweight irrelevant data. They underreact to abstract statistical information, underestimate the impor- tance of sample size, and underweight relevant data. Markets appear to reflect the same systematic biases as their participants. Reactions to announcements are considered underreactions when returns in periods following the announcement are of the same sign as returns on the day of the announcement. One of the most robust underreaction anom- aliesispost-earningsannouncementdrift~BernardandThomas~1989,1990!!. 22In an early study, Jensen ~1968! finds underperformance by mutual funds. Lakonishok et al. ~1992! document that as a group active equity managers consistently underperformed S&P 500 index funds over the period 1983 to 1989. They conclude that, after factoring in management fees, active management subtracts value. Using a variety of benchmarks and benchmarkless tests, Grinblatt and Titman ~1993, 1994! find that, at least before fees, some fund managers earn abnormal returns. Malkiel ~1995! claims that such results are heavily influencedbysurvivorshipbias.Carhart~1997!alsofindslittleevidenceofskilledmutualfund management. Lakonishok et al. ask why pension funds continue to give their money to active managerswhenindexfundsoutperformactivemanagement.Theysuggestanumberofreasons based on agency relationships. They also point out that the pension fund employees may be overconfident in their ability to pick superior money managers. 23I wrote the following discussion of market underreactions nearly two and one-half years aftertheoriginaldraftofthispaper~November1994!andsubsequenttoreadingmorerecent workingpapersonthistopic~Barberis,Shleifer,andVishny~1997!,Danieletal.~1998!,Fama ~1997!!.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 48,
    "chunk_index": 49,
    "word_count": 453,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "pension funds continue to give their money to active managerswhenindexfundsoutperformactivemanagement.Theysuggestanumberofreasons based on agency relationships. They also point out that the pension fund employees may be overconfident in their ability to pick superior money managers. 23I wrote the following discussion of market underreactions nearly two and one-half years aftertheoriginaldraftofthispaper~November1994!andsubsequenttoreadingmorerecent workingpapersonthistopic~Barberis,Shleifer,andVishny~1997!,Danieletal.~1998!,Fama ~1997!!.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 48,
    "chunk_index": 50,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "1914 The Journal of Finance Corporateearningssummarizetheoperationsofacompanyintoasinglesta- tistic.Thisstatisticisbasedonalargesampleofinformationandishighlyrel- evanttothevalueofthecompany.Itisprototypicaloftheinformationthatpeople typically undervalue:Abstract, relevant, and based on a large sample. Mar- kets also underreact to dividends omissions and initiations ~Michaely et al. ~1995!!. The decision to omit dividends is generally made reluctantly and in responsetosignificantcorporatedifficulties.Theomission~orinitiation!ofdiv- idendsisappreciatedbyinvestors,butitmaynotbefullyappreciatedbecause thebad~orgood!newscontainedintheomission~orinitiation!hasbeencon- densedintoasingleevent.Wemightexpectagreaterreactionwhenanomis- sion~orinitiation!isaccompaniedbyawell-publicizedgraphicportrayalofa company’s woes ~or good fortune!. Like dividend initiations, open-market re- purchases ~Ikenberry et al. ~1995!! are positive signals that abstract from a wealthofmoresalientinformation.Inadditiontopossiblysignalingmanage- ment’ssanguineoutlook,theannouncementofopen-marketrepurchasesstates thatthesupplyofsharesinacompanywillbereduced.Investorswhodonot realize that firms face upward-sloping supply curves when they repurchase shares~Bagwell~1992!!,andthatpriceisthereforelikelytorise,mayunder- react to the announcement. Most of the documented long-run return patterns following information events are underreactions. Fama ~1997! classifies the poor long-term perfor- mance following initial public offerings ~IPOs! ~Ritter ~1991!, Loughran and Ritter ~1995!! and seasoned equity offerings ~SEOs! ~Loughran and Ritter ~1995!, Spiess and Affleck-Graves ~1995!! as “in the over-reaction camp.” Using the definition of underreaction given above, however, SEOs would be classifiedasunderreactionsbecausetheusuallynegativemarketreactionat the announcement of the SEO is followed by underperformance. Using the above definition, IPOs are unclassifiable because no market reaction is ob- servable following the announcement of an IPO. As discussed in Sec- tionIII.C,pricereflectstheopinionsofthosemostwillingtotrade.Generally, if a minority of traders overreacts to information and the majority discounts the minority’s opinion or underreacts to the same information, price will underreact. Negative opinions are incorporated into stock prices when in- vestors sell securities they already own and when they sell short. The ma- jority of investors, however, are unwilling to sell short. The first day’s price for IPOs is therefore determined by the minority of investors that is most sanguine about a company’s prospects: those investors who subscribe to the IPO—some with the intention of flipping it on the first day—and those who buy it on the first day. No one with a bad opinion of the company owns an IPO on the first day and it can be difficult to short the stock so soon. Thus, thehighfirst-daypriceforanIPOmayreflectanoverreactionbyaminority of market participants to the optimistic stories and scenarios that accom- pany the IPO’s promotion. Marketsoftenunderreacttoannouncementsofabstract,highlystatistical, or highly relevant information. Earnings changes, dividend omissions, and brokerage recommendations are all examples of such information. However,",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 48,
    "chunk_index": 51,
    "word_count": 346,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "the first day and it can be difficult to short the stock so soon. Thus, thehighfirst-daypriceforanIPOmayreflectanoverreactionbyaminority of market participants to the optimistic stories and scenarios that accom- pany the IPO’s promotion. Marketsoftenunderreacttoannouncementsofabstract,highlystatistical, or highly relevant information. Earnings changes, dividend omissions, and brokerage recommendations are all examples of such information. However,",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 48,
    "chunk_index": 52,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "When All Traders Are Above Average 1915 behind each of these events lie many concrete, salient stories: new products succeed, others fail, ad campaigns are waged, employees are fired, scandals emerge. Though the sum of these stories is underweighted, the individual parts may, in fact, be overweighted. ~As Joseph Stalin put it, “The death of a single Russian soldier is a tragedy. A million deaths is a statistic.”! If markets do systematically overreact, they may do so to highly publicized, graphic news and to rumors.24 Though brokerage recommendations are delivered in their salient form only to customers, some recommendations are both widely disseminated and attention grabbing. The Wall Street Journal’s monthly “Dartboard” column pits the recommendations of four analysts against the random selections of a dart. The analysts, whose portraits are featured, explain the reasons for theirpicks.Manyreadersfollowthiscontest,andBarberandLoeffler~1993! show that the market overreacts to these recommendations. Similarly, the market overreacts to recommendations made on the popular TV show Wall Street Week ~Pari ~1987!!. Another signal to which we might expect overreactions is price change. Price change may be the most salient signal received by investors because, unlike other signals such as earnings, it directly, rather than indirectly, con- tributes to changes in their wealth. It is also the most publicized signal, instantly available on many computer screens, reported daily in newspapers and other media, and mailed monthly to investors in brokerage statements. Furthermore, many investors may overweight the predictive value of price changes; they may see deterministic patterns where none exist,25 overex- trapolate those that do ~e.g., momentum!, and put too much faith in techni- cal trading rules—though not necessarily the same technical trading rules as each other. As we saw in the model of price-taking traders, the impact of a private signal depends on how many people receive that signal ~and, as Figlewski ~1978! points out, on the wealth and risk tolerance of those traders!. The impact of traders, even rational traders, depends on their numbers and on their willingness to trade. The mere presence of a few rational traders in a market does not guarantee that prices are efficient; rational traders may be no more willing or able to act on their beliefs than biased traders. It is markets with higher proportions of rational traders that will be more effi- cient. So, if information processing biases are more pronounced in individ- 24There is some evidence of short-term mean-reversion in returns ~Lehmann ~1990!, Je- gadeesh~1990!!.Suchreversionspossiblycouldbeduetooverreactiontosalientnewsstories, butthishasnotbeenshown.Meanreversionhasalsobeenfoundatlongerhorizons~DeBondt and Thaler ~1985, 1987!!. Returns tend to be positively serially correlated at intermediate ho- rizons~JegadeeshandTitman~1993!!.Positivelyseriallycorrelatedpricescouldbetheresultof underreactions to important information such as earnings changes. They could also be the resultofpricemomentumtradersoverreactingtopriceasasignalandpurchasingstocksthat have risen, thereby driving prices even higher ~as in Hong and Stein ~1997!!. 25Gilovich, Vallone, and Tversky ~1985! show that people hold strong beliefs that random sequences are nonrandom.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 48,
    "chunk_index": 53,
    "word_count": 464,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "positively serially correlated at intermediate ho- rizons~JegadeeshandTitman~1993!!.Positivelyseriallycorrelatedpricescouldbetheresultof underreactions to important information such as earnings changes. They could also be the resultofpricemomentumtradersoverreactingtopriceasasignalandpurchasingstocksthat have risen, thereby driving prices even higher ~as in Hong and Stein ~1997!!. 25Gilovich, Vallone, and Tversky ~1985! show that people hold strong beliefs that random sequences are nonrandom.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 48,
    "chunk_index": 54,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "1916 The Journal of Finance uals than in institutional traders, it should come as no surprise that return anomalies are greatest for small firms ~see Fama ~1997! for a review! which are traded more heavily by individuals. V. Conclusion Overconfidence is costly to society. Overconfident traders do not share risk optimally, they expend too many resources on information acquisition, and they trade too much. These are dead weight losses. Overconfidence in- creasestradingvolumeandmarketdepth,butdecreasestheexpectedutility of overconfident traders. When information is costly, overconfident traders who actively pursue information fare less well than passive traders. Over- confidenttradersincreasevolatility,thoughoverconfidentmarketmakersmay dampen it. Price-taking traders, who are overconfident about their ability to interpret publicly disclosed information, reduce market efficiency; overcon- fident insiders temporarily increase it. When there are many overconfident traders, markets tend to underreact to the information of rational traders. Markets also underreact to abstract, statistical, and highly relevant infor- mation and overreact to salient, but less relevant, information. Like those who populate them, markets are predictable in their biases. Appendix A: Price Takers LEMMA 1: An equilibrium exists in which the linear price conjectures, equa- tions(2)and(3),leadtolineardemandfunctions.Thecoefficientsoftheprice conjectures are hh vS 2axS v a 5 , ~A1! 31 hh 12~k1gM2g!h v e ~k1gM2g!h e a 5a 5 , ~A2! 32 33 hh 12~k1gM2g!h v e a 5a 1~a 1a !vS 2axS var ~P 6F ! 21 31 32 33 b 3 2 vS~a ~g1gM2k!h 1a ~hh 1~k1gM2g!h !! 1 33 e 32 v e , ~A3! hh 1~k1gM2g!h v e ~k1gM2g!h e a 5 , ~A4! 22 hh 1~k1gM2g!h v e and S D 1 g1kM2k P 5a 1a vS 2axSa2 1 . ~A5! 1 21 22 22 hh kgh M2 v e",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 48,
    "chunk_index": 55,
    "word_count": 276,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "~g1gM2k!h 1a ~hh 1~k1gM2g!h !! 1 33 e 32 v e , ~A3! hh 1~k1gM2g!h v e ~k1gM2g!h e a 5 , ~A4! 22 hh 1~k1gM2g!h v e and S D 1 g1kM2k P 5a 1a vS 2axSa2 1 . ~A5! 1 21 22 22 hh kgh M2 v e",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 48,
    "chunk_index": 56,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "When All Traders Are Above Average 1917 Proof: We first solve the equilibrium for the third round of trading. Trader i believes F has a multivariate normal distribution. We calculate 3i the mean and the covariance matrix of this distribution which are E ~F ! 5 @vS vS a 1 a vS a 1 ~a 1 a !vS#T and b 3i 21 22 31 32 33 3 4 1 1 1 a a a 1a a 1 22 1 22 32 331 32 hhv khe hhv hhv kheM hhv kheM 1 1 1 a a 1a a 1 22 32 331 33 hhv hhv khe hhv hhv kheM C5 , a a a a2 a2 ~g1kM2k! 22 1 22 22 22 1 22 C hhv kheM hhv hhv kgheM2 1 a 1a a a 1a a 32 331 32 32 331 33 C C hhv kheM hhv kheM 1 2 ~A6! where S D a a 1 g1gM2k C 5 22 33 1a a 1 , 1 hh 22 32 hh kgh M2 v v e ~a a !2 ~a2 1a2 !~g1gM2k! C 5 311 33 1 32 33 . ~A7! 2 hh kgh M2 v e Let AT [cov ~vI,F !5@~hh !21 ~hh !21 a ~hh !21 ~a 1a !~hh !21#T. b 3i v v 22 v 32 33 v Then, by the projection theorem, E ~vI6F !5 vS 1AC21~F 2E ~F !! b 3i 3i b 3i ~y 1y !~k2g!h 1~YP 1YP !~gh M!1hh vS 5 2i 3i e 2 3 e v ~A8! hh 12~k1gM2g!h v e and var ~vI6F !5~hh !212AC21AT b 3 v 1 5 . ~A9! hh 12~k1gM2g!h v e",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 48,
    "chunk_index": 57,
    "word_count": 276,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "E ~vI6F !5 vS 1AC21~F 2E ~F !! b 3i 3i b 3i ~y 1y !~k2g!h 1~YP 1YP !~gh M!1hh vS 5 2i 3i e 2 3 e v ~A8! hh 12~k1gM2g!h v e and var ~vI6F !5~hh !212AC21AT b 3 v 1 5 . ~A9! hh 12~k1gM2g!h v e",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 48,
    "chunk_index": 58,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "1918 The Journal of Finance The conditional variance of vI is the same for all traders and so the subscript i is dropped in var ~vI6F !. Following Grossman ~1976!, we can solve equa- b 3 tion ~1! and get demand function E ~vI6F !2P x 5 b 3i 3 . ~A10! 3i avar ~vI6F ! b 3 Wecalculatetheaveragedemandpertraderandequatethistothepertrader supply, xS. Then solving for P , we can match coefficients to those of the 3 conjectured second-period price function to obtain a , a , and a as given 31 32 33 in equations ~A1! and ~A2!. Thus the linear price conjectures are fulfilled and equilibrium exists at t 5 3. To solve the equilibrium at t 5 2, we again use the projection theorem, calculating E ~P 6F ! b 3 2i 2~k1gM2g!he vS 1hhv vS 2axS 5 hhv 12~k1gM2g!he 1 ~k1gM2g!~he ~hhv 1~k12gM2g!he !~YP 2 2vS!1he 2~k2g!~y 2i 2vS!! ~hhv 1~k1gM2g!he !~hhv 12~k1gM2g!he ! ~A11! and var ~P 6F ! b 3 2 ~k1gM2g!2h ~h~g1kM2k!h 1~~k2g!2~M21!12gkM2!h ! e v e 5 . gkM2~hh 1~k1gM2g!h !~hh 12~k1gM2g!h !2 v e v e ~A12! Since traders are myopic, trader i’s second round demand is E ~P 6F !2P x 5 b 3 2i 2 . ~A13! 2i avar ~P 6F ! b 3 2 Equatingpertraderdemandandpertradersupply,solvingforP ,andmatch- 2 ing coefficients gives us the equilibrium values for a and a given in 21 22 equations ~A3! and ~A4!. Using the unconditional expectation and variance of P , we can follow the same steps as above to calculate P as given in 2 1 equation ~A5!. Q.E.D.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 48,
    "chunk_index": 59,
    "word_count": 264,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "Equatingpertraderdemandandpertradersupply,solvingforP ,andmatch- 2 ing coefficients gives us the equilibrium values for a and a given in 21 22 equations ~A3! and ~A4!. Using the unconditional expectation and variance of P , we can follow the same steps as above to calculate P as given in 2 1 equation ~A5!. Q.E.D.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 48,
    "chunk_index": 60,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "When All Traders Are Above Average 1919 To simplify the exposition, Propositions 1 to 5 are proven for the case of h 5 1 and g 5 1. Proposition 1 states that expected volume increases as overconfidence increases. This is restated formally and proven in terms of trading round 2 volume. It is also true for round 3 expected volume. PROPOSITION 1: If k . 1, and M $ 2 then S D N 6x 2x 6 E ( 2i 1i ~A14! a i51 N is an increasing function of k. Proof: The first step of the proof is to calculate equation ~A14!, the per capita expected trading volume in trading round 2. Traders have negative exponential utility functions, which means that their demand for the risky asset does not depend on their wealth. They have the same prior beliefs aboutthedistributionofvI.Becausetheyhavethesamebeliefsaswellasthe same risk aversion, all traders have the same first period demand: x 5 xS. 1i Coefficients from equations ~A3! and ~A4! are substituted into equation ~3!; equations~3!,~A11!,and~A12!arethensubstitutedintoequation~A13!which is substituted into equation ~A14!. The expectation operator is moved inside thesummationandthedenominator Nismovedoutsidetheexpectation.We have then the average expectation of N identical half-normal distributions. Taking expectations and simplifying gives us S D N 6x 2x 6 ( 2i 1i E a i51 N !2~M21!h e 5 Mp ~k21!kM2~h 12~k1M21!h ! v e 3 . a~k1M21!~~12k1kM!h 1~~k222k11!~M21!12kM2!h ! v e ~A15! Bearing in mind that M $ 2, and k . 1, one can show that, in the given parameter range, the derivative of equation ~A15! with respect to k is posi- tive and so equation ~A15! is increasing in k. Q.E.D. Proposition 2 states that volatility increases when overconfidence increases andwhentradersundervaluetheirpriorbeliefs.Threealternativemeasures ofvolatilityarevar ~P !,var ~P !,andvar ~P 2P !.Thepropositionistrue a 2 a 3 a 3 2 for all three measures. It is proven for var ~P !. a 3 PROPOSITION 2: If k $1 then var a ~P 3 ! is an increasing function of k.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 48,
    "chunk_index": 61,
    "word_count": 323,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "increases when overconfidence increases andwhentradersundervaluetheirpriorbeliefs.Threealternativemeasures ofvolatilityarevar ~P !,var ~P !,andvar ~P 2P !.Thepropositionistrue a 2 a 3 a 3 2 for all three measures. It is proven for var ~P !. a 3 PROPOSITION 2: If k $1 then var a ~P 3 ! is an increasing function of k.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 48,
    "chunk_index": 62,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "1920 The Journal of Finance Proof: Substituting coefficients from equations ~A1! and ~A2! into equa- tion ~A3!, we can calculate 2h ~k1M21!2~h 12h M! e v e var ~P !5 . ~A16! a 3 h M~h 12h ~k1M21!!2 v v e In the given parameter range, the derivative of equation ~A16! with respect to k is positive. Q.E.D. The quality of prices can be measured as var ~P 2 vI! for t52 or 3.As this a t variance increases, the quality of prices worsens. Proposition 4 and its proof are given here in terms of t 5 3. The proposition is also true for t 5 2; the proof is analogous. PROPOSITION 3: If k $1, var a ~P 3 2 vI! is an increasing function of k. Proof: Substituting coefficients from equations ~A1! and ~A2! into equa- tion ~2!, we can calculate h M12h ~~k21!222M12kM1M2! v e var ~P 2vI!5 . ~A17! a 3 M~h 12~k211M!h !2 v e In the given parameter range, the derivative of equation ~A17! with respect to k is positive. Q.E.D. PROPOSITION 4: If M $ 2 traders’ expected utilities will be lower when k . 1 than when k 51. Proof: In this model, traders can infer the aggregate signal. So if they have perfectly calibrated probability beliefs ~i.e., k5h5g51! their poste- rior beliefs will be identical. Because they have the same beliefs as well as CARAutilityfunctionswiththesameriskaversion,perfectlycalibratedtrad- ers will hold the same amount of the risky asset in equilibrium ~i.e., xS!; this maximizes their utility. This is the position to which traders, whether over- confident or perfectly calibrated, trade in the first round of trading where there is no signal ~i.e., x 5 xS!. Following steps similar to those used to 1i obtain equation ~A15!, we can calculate the expected net trading subsequent to the first round of trading. This is S D N 6x 2x 6 2~k21!!~M21!h E ( 3i 1i 5 e . ~A18! a i51 N a Mp We see that when traders are perfectly calibrated, they do not trade in later rounds and continue to hold their optimal portfolio of the risky asset, xS. However, if traders are overconfident ~i.e., k . 1! and if M $ 2, they are",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 48,
    "chunk_index": 63,
    "word_count": 371,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": ". ~A18! a i51 N a Mp We see that when traders are perfectly calibrated, they do not trade in later rounds and continue to hold their optimal portfolio of the risky asset, xS. However, if traders are overconfident ~i.e., k . 1! and if M $ 2, they are",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 48,
    "chunk_index": 64,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "When All Traders Are Above Average 1921 expected to trade in later rounds, thus departing from their optimal portfo- lio and reducing their expected utility. Q.E.D. PROPOSITION 5: Cov a ~~P 3 2 P 2 !,~P 2 2 P 1 !! is a decreasing function of k and cov ~~P 2 P !,~P 2 P !! 5 0 when k 5 h 5 g 51. a 3 2 2 1 Proof: NotingthatP isaconstantandsubstitutingcoefficientsfromequa- 1 tions ~A1!, ~A2!, ~A3!, and ~A4! into equations ~2! and ~3!, we can calculate cov ~~P 2P !,~P 2P !! a 3 2 2 1 ~k2g1gM!2~k1~M21!g2~Mh!!h2 e 52 , ~A19! M~hh 1~k2g1gM!h !2~hh 12~k2g1gM!h ! v e v e which has the opposite sign of k 2 g 1 M ~g 2 h!. So equation ~A19! is 0 if k5g5h51,negativeifk2g.M~h2g!,andpositiveifk2g,M~h2g!. Notethatwhenh5g51,thesignofexpression~A19!istheoppositeofk21. The derivative of equation ~A19! with respect to k is negative. Q.E.D. Adding rational traders to the economy greatly complicates the expression for covariance. For simplicity, and without altering the basic finding that returns may be positively serially correlated when overconfident traders trade with rational traders, the following proposition is proven for an econ- omy with N overconfident traders and N0M rational traders in which trad- ers receive private signals in period 2 and vI is publicly revealed in period 3; therefore P 5 vI. As above, in period 2 each overconfident trader re- 3 ceives one of M possible signals, yI 5 vI 1 eI ; rational traders receive 2i 2m signal y 5 vI 1 rI , where rI ; N~0,h21! and rI is independent of eI for 2r 2 t r 2 2m m 5 1,...,M. Overconfident traders believe that rI ; N~0,~gh ! 21!; ratio- t r nal traders hold correct distributional beliefs about their signals and those of others. PROPOSITION 6: Let h 5 0. If rational traders trade with overconfident trad- ers, then cov ~P 2 P ,P 2 P ! is positive if ~1 2 g!~1 1 gM! h . a 3 2 2 1 r ~k 11 1 g~M 21!!~k 1 g~M 21! 2 M!h . e Proof: We can determine the equilibrium as was done in Lemma 1. Then we can calculate cov ~P 2P ,P 2P ! a 3 2 2 1 M~~12g!~11gM!h 2~k1g~M21!11!~k1g~M21!2M!h ! r e 5 ~M~k1g~M21!11!h !1~11gM!h 1~11M!h !2 e r v ~A20!",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 48,
    "chunk_index": 65,
    "word_count": 391,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "g~M 21!!~k 1 g~M 21! 2 M!h . e Proof: We can determine the equilibrium as was done in Lemma 1. Then we can calculate cov ~P 2P ,P 2P ! a 3 2 2 1 M~~12g!~11gM!h 2~k1g~M21!11!~k1g~M21!2M!h ! r e 5 ~M~k1g~M21!11!h !1~11gM!h 1~11M!h !2 e r v ~A20! 1922 The Journal of Finance which is positive when ~1 2 g!~1 1 gM!h . ~k 1 g~M 2 1! 1 1!~k 1 r g~M 21! 2 M!h . Q.E.D. e Appendix B: An Insider LEMMA 2: If kh e 1 2hh v . kh v , an equilibrium exists in which the insider’s linear price conjecture, equation (4), and the market-maker’s linear demand conjecture, equation (5), are fulfilled. In equilibrium the coefficients of equa- tions (4) and (5) are A50, ~B1! ! kh h v e B5 , ~B2! h ~kh 12hh 2kh ! z e v v H50, ~B3! 1 !kh h ~kh 12hh 2kh ! L5 e z e v v . ~B4! 2~hh 1kh ! h v e v Proof: The insider submits a demand, x, that he believes will maximize his expected profit. To do this he solves maxE ~x~vI 2P!6y!5maxE ~x~vI 2~H1L~x1z!!!6y!, ~B5! b b x x where equation ~4! has been substituted for P. Taking first-order conditions and solving for x we have E ~vI6y!2H x5 b . ~B6! 2L We can calculate kh y e E ~vI6y!5 . ~B7! b hh 1kh v e Substituting equation ~B7! into equation ~B6! we get 2H kh e x5 1 y. ~B8! 2L 2L~hh 1kh ! v e",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 48,
    "chunk_index": 66,
    "word_count": 263,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "conditions and solving for x we have E ~vI6y!2H x5 b . ~B6! 2L We can calculate kh y e E ~vI6y!5 . ~B7! b hh 1kh v e Substituting equation ~B7! into equation ~B6! we get 2H kh e x5 1 y. ~B8! 2L 2L~hh 1kh ! v e",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 48,
    "chunk_index": 67,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "When All Traders Are Above Average 1923 And so, if the linear conjectures hold, 2H kh e A5 and B5 . ~B9! 2L 2L~hh 1kh ! v e The marketmaker sets price equal to the expected value of vI given the order flow she observes. We can calculate 2ABh h Bh h P5E ~vI6x1zI!5 e z 1 e z ~x1zI!. a B2h ~h 1h !1h h B2h ~h 1h !1h h z e v e v z e v e v ~B10! So, if the conjectures hold, 2ABh h Bh h H5 e z and L5 e z . ~B11! B2h ~h 1h !1h h B2h ~h 1h !1h h z e v e v z e v e v The four equations in ~B9! through ~B11! have four unknowns. When kh 1 e 2hh $kh , they have one real nonnegative solution: equations ~B1! through v v ~B4!. Thus the conjectures are fulfilled and an equilibrium exists. Q.E.D. Expected trading volume is E ~6x6 1 6zI6!: a PROPOSITION 7: If k$1, h#1, and kh e 12hh v . kh v , then E a ~6x616zI6! is an increasing function of k. Proof: Substituting equations ~B3! and ~B4! into equation ~B8!, and sub- stituting equation ~B8! for x, we can calculate ! 2k~h 1h ! ! 2 e v E ~6x616zI6!5 1 . ~B12! a ph ~kh 12hh 2kh ! ph z e v v z When kh 12hh . kh , the derivative of equation ~B12! with respect to k is e v v positive. Q.E.D. Market depth is measured as the inverse of the derivative of price with respect to order flow ~i.e., ~x 1 zI!!: PROPOSITION 8: If k$1, h#1, and kh e 12hh v . kh v , then ~dP0d~x1zI!!21 is an increasing function of k.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 48,
    "chunk_index": 68,
    "word_count": 300,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "k is e v v positive. Q.E.D. Market depth is measured as the inverse of the derivative of price with respect to order flow ~i.e., ~x 1 zI!!: PROPOSITION 8: If k$1, h#1, and kh e 12hh v . kh v , then ~dP0d~x1zI!!21 is an increasing function of k.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 48,
    "chunk_index": 69,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "1924 The Journal of Finance Proof: Substituting equations ~B3! and ~B4! into equation ~4!, and differ- entiating with respect to ~x 1 zI! gives us S D dP 21 510L. ~B13! d~x1zI! Substituting equation ~B4! for L, the derivative of 10L with respect to k is positive when kh 1 2hh . kh . Q.E.D. e v v Volatility is measured as the variance of price. PROPOSITION 9: If k $ 1, h # 1, and kh e 1 2hh v . kh v , then var a ~P! is an increasing function of k. Proof: Substituting equations ~B1! and ~B2! into equation ~5!, and equa- tions ~5!, ~B3!, and ~B4! into equation ~4!, we can calculate kh e var ~P!5 . ~B14! a 2h ~kh 1hh ! v e v The derivative of equation ~B14! with respect to k is positive. Q.E.D. Quality of prices is measured as the variance of the difference between price and true underlying value. PROPOSITION 10: If k $1, h #1, and kh e 12hh v . kh v , then var a ~P2vI! is a decreasing function of k. Proof: Substituting equations ~B1! and ~B2! into equation ~5!, and equa- tions ~5!, ~B3!, and ~B4! into equation ~4!, and then into var ~P2vI!, we can a calculate kh 12hh e v var ~P2vI!5 . ~B15! a 2h ~kh 1hh ! v e v The derivative of equation ~B15! with respect to k is negative. Q.E.D. PROPOSITION 11: If k $1, h #1, and kh e 1 2hh v . kh v , then E a ~x~vI 2 P!! is a decreasing function of k.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 48,
    "chunk_index": 70,
    "word_count": 271,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "~B15! a 2h ~kh 1hh ! v e v The derivative of equation ~B15! with respect to k is negative. Q.E.D. PROPOSITION 11: If k $1, h #1, and kh e 1 2hh v . kh v , then E a ~x~vI 2 P!! is a decreasing function of k.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 48,
    "chunk_index": 71,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "When All Traders Are Above Average 1925 Proof: Substitutingequations~B1!through~B4!intoequations~4!and~5!, and then into E ~x~vI 2 P!!, we have a 1 !kh ~kh 12hh 2kh ! e e v v E ~x~vI 2P!!5 . ~B16! a 2~kh 1hh ! h h e v v z When kh 1 2hh . kh , the derivative of ~B16! with respect to k is nega- e v v tive. Q.E.D. Appendix C: Marketmakers and Costly Information The following expectation ~Toft ~1996!! is needed in this section. Let x be a normally distributed random variable with mean m and variance s2, then H S D J 1 1 2~m1Bs2!2 E~eAx21Bx1C!5 exp 2 1m2 1C . ~C1! %~122As2! 2s2 122As2 These expectations can be easily calculated: kh h e e E ~vI6yI !5 yI [m , E ~vI6yI !5 yI [m , ~C2! b hh 1kh b a h 1h a v e v e 1 1 var ~vI6yI !5 [r , var ~vI6yI !5 [r , ~C3! b hh 1kh ib a h 1h ia v e v e kh k2h ~h 1h ! e e v e var ~m !5 [S , var ~m !5 [S . ~C4! b b ~hh 1kh !~hh ! b a b h ~hh 1kh !2 a v e v v v e Because yI is normally distributed, m is also normally distributed. Define b r var ~vI6P! rS [ ib b . ~C5! lvar ~vI6P!1~12l!r b ib LEMMA 3: There exists an equilibrium in which each informed trader’s de- mand for the risky asset is E ~vI6yI !2P x 5 b , ~C6! 1I avar ~vI6yI ! b",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 48,
    "chunk_index": 72,
    "word_count": 270,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "is also normally distributed. Define b r var ~vI6P! rS [ ib b . ~C5! lvar ~vI6P!1~12l!r b ib LEMMA 3: There exists an equilibrium in which each informed trader’s de- mand for the risky asset is E ~vI6yI !2P x 5 b , ~C6! 1I avar ~vI6yI ! b",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 48,
    "chunk_index": 73,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "1926 The Journal of Finance each uninformed trader’s demand for the risky asset is E ~vI6P!2P x 5 b , ~C7! 1U avar ~vI6P! b price is S D m E ~vI6P! P5 rS l b 1~12l! b 1arSzI, ~C8! r var ~vI6P! ib b and the fraction of traders who choose to become informed is S D 5 r ~e2ac21! 0 if 12 ib #0, S S D S b D F G ! r ~e2ac21! r r ~e2ac21! ~e2ac21!h l*5 a 12 ib ib if 12 ib [ 0, z , S b ~e2ac21!h z S S b D a2r ib r ~e2ac21! ~e2ac21!h 1 if 12 ib $ z . S a2r b ib ~C9! Proof: The derivation of this equilibrium roughly follows Grossman and Stiglitz ~1980! and Demski and Feltham ~1994!. Solving equation ~6! gives us equation ~C6! ~see Grossman ~1976!!.Assume for the moment that, given traders’ distributional beliefs and conditional on observing P, vI is normally distributed. ~We will see below that the assumption is self-fulfilling.! Then solving equation ~7! gives us equation ~C7!. Informedtraderdemandpertradertimesthefractionoftraderswhoarein- formedplusuninformedtraderdemandpertradertimesthefractionoftrad- ers who are uninformed must equal noise trader supply per trader. That is, E ~vI6yI !2P E ~vI6P!2P l b 1~12l! b 52zI. ~C10! avar ~vI6yI ! avar ~vI6P! b b Solving equation ~C10! for P gives us equation ~C8!. Let ar zD [ mI 1 ib zI. ~C11! l Substituting equation ~C11! into equation ~C8! gives us rSl rS~12l! P5C zD where C [ 1 G , 1 1 r var ~vI6P! 1 Sib D b S ar 2 G [ b , and D[ ib h21. ~C12! 1 S 1D l z b",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 48,
    "chunk_index": 74,
    "word_count": 276,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "1 ib zI. ~C11! l Substituting equation ~C11! into equation ~C8! gives us rSl rS~12l! P5C zD where C [ 1 G , 1 1 r var ~vI6P! 1 Sib D b S ar 2 G [ b , and D[ ib h21. ~C12! 1 S 1D l z b",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 48,
    "chunk_index": 75,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "When All Traders Are Above Average 1927 If equation ~C8! holds, then P is a linear function of zD and the two are informationally equivalent. zD is a linear combination of two normally dis- tributedrandomvariablesandisnormallydistributeditself.Therefore,given traders’ distributional beliefs, ~vI6P! 5 ~vI6zD! is normally distributed, as was assumed, and has mean and variance. 1 E ~vI6zD!5G zD, and var ~vI6zD!5 2G S [r . ~C13! b 1 b hh 1 b u v To solve for l* we observe that in equilibrium traders are indifferent be- tween buying and not buying information; thus, E @U~W !#5E @U~W !#. ~C14! b 1I b 1U Bearing in mind that zD has the same information content as P, we can calculate E @U~W !#5E @E @E @2exp$2aW %6yI #6zD,l## ~C15! b 1i b b b 1I F F H J GG a2 * 5E E 2exp 2aE @W 6yI #1 var @W 6yI # zD,l ~C16! b b b 1I b 1I 2 F F H S DJ GG ~m 2P!2 * 5E E 2exp 2a f 1x P2c1 b zD,l ~C17! b b 0I 0I 2ar ib F H S DJG !r ~E~vI6zD,l!2P!2 5E 2eac ib exp 2a f 1x P1 ~C18! b 0i 0i r 2ar u u !r 5eac ib E @U~W !#. ~C19! b 1U r u Equation ~C17! is obtained from equation ~C16! by substituting f 1x P1 0I 0I x ~vI 2 P! for W , equation ~C6! for x , and taking expectations. To obtain iI 1I 1i equation ~C18! we multiply out ~m 2 P!2, apply equation ~C1!, substitute b from~C3!and~C13!,andnotethatE ~vI6zD!5E ~m 6zD!.Fromequations~C14! b b b and ~C19! we have !r 15eac ib . ~C20! r u Substituting for r and r in equation ~C20!, solving for l, and noting that ib u l cannot be negative or larger than 1 gives us equations ~C9!. Q.E.D.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 48,
    "chunk_index": 76,
    "word_count": 311,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "~C1!, substitute b from~C3!and~C13!,andnotethatE ~vI6zD!5E ~m 6zD!.Fromequations~C14! b b b and ~C19! we have !r 15eac ib . ~C20! r u Substituting for r and r in equation ~C20!, solving for l, and noting that ib u l cannot be negative or larger than 1 gives us equations ~C9!. Q.E.D.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 48,
    "chunk_index": 77,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "1928 The Journal of Finance PROPOSITION 12: There exist values of h v , h e , h z , a, and c, such that if h 51 and k . 1, or if h , 1 and k 5 1, and 0 , l* , 1, then E @U~W !# , a 1I E @U~W !#, where i 5 I, and i 5 U represent prototypical informed and a 1U uninformed traders. Proof: To calculate the actual expected utility of the informed trader, we take iterative expectations using the actual distributions of vI and eI. Equa- tion ~C1! is used to solve each expectation. The result is: E @U~W !# 5E @E @E @U~W !6yI #|zD,l## a 1I a a a 1I 52~122C var ~m 6zD!!2102~122C var ~zD!!2102 3 a b 4 a 3exp$a~c2f !1~aC x !2var ~zD!0~2~122C var ~zD!!!%, 0I 1 0I a 4 a ~C21! where S D ~hh 1kh ! ~hh 1kh !2 v e v e C 5 11 ~hh 1kh !2 , 2 k~h 1h ! v e h 1h v e v e ~k22!~hh 1khe!2 v C 5 , ~C22! 3 2k~h 1h ! v e r 22r ~G 1C C var ~m 6zD!!2 G2 C 5 ia ib C21 2 2 1 a b 2 2 , ~C23! 4 2r2 1 2var ~m 6zD!~12C var ~m 6zD!! 2var ~m 6zD! ib a b 3 a b a b S G 5 a , var ~m 6zD!5S ~12G !, and var ~zD!5S 1D. ~C24! 2 S 1D a b a 2 a a a Similarlywecancalculatetheactualexpectedutilityoftheuninformedtrader: E @U~W !#5E @E @E @U~W !6yI #|zD,l## a 1U a a a 1U 52~122C var ~zD!!2102 5 a 3exp$2af 1~aC x !2var ~zD!0~2~122C var ~zD!!!%, ~C25! 0I 1 0U a 5 a where ~G 2C !2 ~G 2C !~G 2C ! C 5 1 1 var ~vI6zD!2 1 1 3 1 , ~C26! 5 2r2 a r u u hS 1 h2S2 G 5 b , and var ~vI6zD!5 2 b . ~C27! 3 S 1D a h S 1D a v a",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 48,
    "chunk_index": 78,
    "word_count": 346,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "~G 2C !2 ~G 2C !~G 2C ! C 5 1 1 var ~vI6zD!2 1 1 3 1 , ~C26! 5 2r2 a r u u hS 1 h2S2 G 5 b , and var ~vI6zD!5 2 b . ~C27! 3 S 1D a h S 1D a v a",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 48,
    "chunk_index": 79,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "When All Traders Are Above Average 1929 Ifequation~C21!islessthanequation~C25!foranyparametersetforwhich h51,k.1,and0,l* ,1,andforanyparametersetforwhichh,1,k51, and 0 , l* , 1, then the proposition is true. I evaluate equations ~C21! and ~C25!forawidevarietyofparametervaluesandfindequation~C21!tobeless thanequation~25!whenevertheseparameterconditionsaretrue,suggesting that the expected utility of informed traders is always less than than of un- informedtradersiftradersareoverconfidentoriftheyundervaluetheirprior information. Q.E.D. In the final proposition l* and P are written as functions of the economy’s parameter values ~i.e., l*~k,h,h ,h ,h ,a,c! and P~k,h,h ,h ,h ,a,c!!. As in v e z v e z Proposition 10, market depth is measured as the inverse of the derivative of price with respect to order flow. PROPOSITION 13: Let k 2 . k 1 $ 1, then, for any choice of parameter values h, h , h , h , a, and c such that l*(k ,h,h ,h ,h ,a,c) 5 1 and v e z 2 v e z l*(k ,h,h ,h ,h ,a,c) 51, 1 v e z S D S D dP~k ,h,h ,h ,h ,a,c! 21 dP~k ,h,h ,h ,h ,a,c! 21 2 v e z . 1 v e z ~C28! dzI dzI and var a ~P~k 2 ,h,hv,he,h z ,a,c!!.var a ~P~k 1 ,h,hv,he,h z ,a,c!! ifE a ~6zI6!,%2f0p, ~C29! var a ~P~k 2 ,h,hv,he,h z ,a,c!!5var a ~P~k 1 ,h,hv,he,h z ,a,c!! ifE a ~6zI6!5%2f0p, ~C30! and var a ~P~k 2 ,h,hv,he,h z ,a,c!!,var a ~P~k 1 ,h,hv,he,h z ,a,c!! ifE a ~6zI6!.%2f0p, ~C31! where h~h 1h !~~k 1k !hh 12k k h ! f5 v e 1 2 v 1 2 e . ~C32! a2~2hh 1~k 1k !h ! v 1 2 e Proof: Substitutingl*51intoequation~C5!,andequation~C5!andl*51 intoequation~C12!,wefindthatP5zD.DifferentiatingPwithrespecttozI,tak- ing the inverse, and substituting from equation ~C3! gives us market depth: S D dP 21 hh 1kh v e 5 , ~C33! dzI a",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 48,
    "chunk_index": 80,
    "word_count": 291,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "h ! f5 v e 1 2 v 1 2 e . ~C32! a2~2hh 1~k 1k !h ! v 1 2 e Proof: Substitutingl*51intoequation~C5!,andequation~C5!andl*51 intoequation~C12!,wefindthatP5zD.DifferentiatingPwithrespecttozI,tak- ing the inverse, and substituting from equation ~C3! gives us market depth: S D dP 21 hh 1kh v e 5 , ~C33! dzI a",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 48,
    "chunk_index": 81,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "1930 The Journal of Finance whichisincreasingink.BearinginmindthatE ~6zI6!5%20ph ,wefindthat a z P5 zD, equations ~C4! and ~C24!, and algebraic manipulations give us equa- tions ~C29! through ~C31!. Q.E.D. REFERENCES Alpert,Marc,andHowardRaiffa,1982,Aprogressreportonthetrainingofprobabilityasses- sors; in Daniel Kahneman, Paul Slovic, andAmos Tversky, eds.: Judgment Under Uncer- tainty: Heuristics and Biases ~Cambridge University Press, Cambridge and NewYork!. Arrow, Kenneth J., 1986, Rationality of self and others in an economic system, Journal of Business 59, 385–399. Bagwell, Laurie, 1992, Dutch auction repurchases: An analysis of shareholder heterogeneity, Journal of Finance 47, 71–105. Barber, Brad M., and Douglas Loeffler, 1993, The “Dartboard” column: Second-hand informa- tion and price pressure, Journal of Financial and Quantitative Analysis 28, 273–284. Barber, Brad M., and Terrance Odean, 1998, The common stock investment performance of individual investors, Working paper, University of California, Davis. Barberis,Nicholas,AndreiShleifer,andRobertW.Vishny,1997,Amodelofinvestorsentiment, Working paper, University of Chicago. Bar-Hillel, Maya, 1980, The base-rate fallacy in probability judgments, Acta Psychologica 44, 211–233. Bar-Hillel,Maya,andBaruchFischhoff,1981,Whendobaseratesaffectpredictions?,Journal of Personality and Social Psychology 41, 671–680. Baumann, Andrea O., Raisa B. Deber, and Gail G. Thompson, 1991, Overconfidence among physiciansandnurses:The“Micro-Certainty,Macro-Uncertainty”phenomenon,SocialSci- ence & Medicine 32, 167–174. Beja,Avraham, 1976, The limited information efficiency of market processes, Working paper no. 43, Research Program in Finance, University of California at Berkeley. Benos,Alexandros V., 1998,Aggressiveness and survival of overconfident traders, Journal of Financial Markets, forthcoming. Bernard, Victor L., and Jacob K. Thomas, 1989, Post-earnings-announcement drift: Delayed price response or risk premium?, Journal of Accounting Research 27 supplement, 1–48. Bernard,VictorL.,andJacobK.Thomas,1990,Evidencethatstockpricesdonotfullyreflect the implications of current earnings for future earnings, Journal of Accounting and Eco- nomics 13, 305–340. Bernoulli,Daniel,1954,Expositionofanewtheoryonthemeasurementofrisk,trans.L.Som- mer, Econometrica 22, 23–36. Translated from an article originally published in 1738. Bloomfield, Robert J., and Robert Libby, 1996, Market reactions to differentially available in- formation in the laboratory, Journal of Accounting Research 34, 183–207. Bloomfield,RobertJ.,RobertLibby,andMarkW.Nelson,1997,Confidenceandthewelfareof less-informed investors, Working paper, Cornell University. Brown, David P., and Robert H. Jennings, 1989, On technical analysis, Review of Financial Studies 2, 527–551. Carhart, Mark, 1997, On persistence in mutual fund performance, Journal of Finance 52, 57–82. Christensen-Szalanski,JayJ.,andJamesB.Bushyhead,1981,Physicians’useofprobabilistic informationinarealclinicalsetting,JournalofExperimentalPsychology:HumanPercep- tion and Performance 7, 928–935. Clark,NoelK.,andDerekR.Rutter,1985,Socialcategorization,visualcues,andsocialjudge- ments, European Journal of Social Psychology 15, 105–119. Constantinides,GeorgeM.,1979,Multiperiodconsumptionandinvestmentbehaviorwithcon- vex transactions costs, Management Science 25, 1127–1137. Cooper,ArnoldC.,CarolynY.Woo,andWilliamC.Dunkelberg,1988,Entrepreneurs’perceived chances for success, Journal of Business Venturing 3, 97–108.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 48,
    "chunk_index": 82,
    "word_count": 359,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "2, 527–551. Carhart, Mark, 1997, On persistence in mutual fund performance, Journal of Finance 52, 57–82. Christensen-Szalanski,JayJ.,andJamesB.Bushyhead,1981,Physicians’useofprobabilistic informationinarealclinicalsetting,JournalofExperimentalPsychology:HumanPercep- tion and Performance 7, 928–935. Clark,NoelK.,andDerekR.Rutter,1985,Socialcategorization,visualcues,andsocialjudge- ments, European Journal of Social Psychology 15, 105–119. Constantinides,GeorgeM.,1979,Multiperiodconsumptionandinvestmentbehaviorwithcon- vex transactions costs, Management Science 25, 1127–1137. Cooper,ArnoldC.,CarolynY.Woo,andWilliamC.Dunkelberg,1988,Entrepreneurs’perceived chances for success, Journal of Business Venturing 3, 97–108.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 48,
    "chunk_index": 83,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "When All Traders Are Above Average 1931 Daniel,Kent,DavidHirshleifer,andAvanidharSubrahmanyam,1998,Investorpsychologyand security market under- and overreactions, Journal of Finance, this issue, 1839–1885. Dawes, Robyn M., David Faust, and Paul E. Meehl, 1989, Clinical versus actuarial judgment, Science 243, 1668–1674. DeBondt,WernerF.M.,andRichardH.Thaler,1985,Doesthestockmarketoverreact?,Jour- nal of Finance 40, 793–807. De Bondt, F. M. Werner, and Richard H. Thaler, 1987, Further evidence on investor overreac- tion and stock market seasonality, Journal of Finance 42, 557–581. DeLong,J.Bradford,AndreiShleifer,LawrenceH.Summers,andRobertJ.Waldmann,1990, Noise trader risk in financial markets, Journal of Political Economy 98, 703–738. Demski,JoelS.,andGeraldA.Feltham,1994,Marketresponsetofinancialreports,Journalof Accounting and Economics 17, 3–40. Diamond, Douglas W., and Robert E. Verrecchia, 1981, Information aggregation in a noisy rational expectations economy, Journal of Financial Economics 9, 221–235. Dow,James,andGaryGorton,1997,Noisetrading,delegatedportfoliomanagement,andeco- nomic welfare, Journal of Political Economy 105, 1024–1050. Dowie, Jack, 1976, On the efficiency and equity of betting markets, Economica 43, 139–150. Fama,EugeneF.,1997,Marketefficiency,long-termreturns,andbehavioralfinance,Working paper, University of Chicago. Feiger, George, 1978, Divergent rational expectations equilibrium in a dynamic model of a futures market, Journal of Economic Theory 17, 164–178. Figlewski, Stephen, 1978, Market “efficiency” in a market with heterogeneous information, Journal of Political Economy 86, 581–597. Fischhoff,Baruch,1982,Forthosecondemnedtostudythepast:Heuristicsandbiasesinhind- sight;inDanielKahneman,PaulSlovic,andAmosTversky,eds.: JudgmentUnderUncer- tainty: Heuristics and Biases ~Cambridge University Press, Cambridge and NewYork!. Fischhoff, Baruch, Paul Slovic, and Sarah Lichtenstein, 1977, Knowing with certainty: The appropriateness of extreme confidence, Journal of Experimental Psychology 3, 552–564. Fiske, Susan T., and Shelley E. Taylor, 1991, Social Cognition ~McGraw-Hill, Inc., NewYork!. Frank,JeromeD.,1935,Somepsychologicaldeterminantsofthelevelofaspiration, American Journal of Psychology 47, 285–293. Gervais,Simon,andTerranceOdean,1997,Learningtobeoverconfident,Workingpaper,Uni- versity of Pennsylvania. Gilovich,Thomas,RobertVallone,andAmosTversky,1985,Thehothandinbasketball:Onthe misperceptions of random sequences, Cognitive Psychology 17, 295–314. Greenwald,Anthony G., 1980, The totalitarian ego: Fabrication and revision of personal his- tory, American Psychologist 35, 603–618. Grether,DavidM.,1980,Bayes’ruleasadescriptivemodel:Therepresentativeheuristic,Quar- terly Journal of Economics 95, 537–557. Griffin,Dale,andAmosTversky,1992,Theweighingofevidenceandthedeterminantsofcon- fidence, Cognitive Psychology 24, 411–435. Grinblatt,Mark,andSheridanTitman,1993,Performancemeasurementwithoutbenchmarks: An examination of mutual fund returns Journal of Business, 66, 47–68. Grinblatt, Mark, and Sheridan Titman, 1994, A study of monthly mutual fund returns and performance evaluation techniques, Journal of Financial and Quantitative Analysis 29, 419–444. Grossman,SanfordJ.,1976,Ontheefficiencyofcompetitivestockmarketswheretradershave diverse information, Journal of Finance 31, 573–585. Grossman, Sanford J., and Joseph E. Stiglitz, 1980, On the impossibility of informationally efficient markets, American Economic Review 70, 393–408. Hamill, Ruth, Timothy D. Wilson, and Richard E. Nisbett, 1980, Insensitivity to sample bias: Generalizing from atypical cases, Journal of Personality and Social Psychology 39, 578– 589. Harris, Milton, and Artur Raviv, 1993, Differences of opinion make a horse race, Review of Financial Studies 6, 473–506.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 48,
    "chunk_index": 84,
    "word_count": 383,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "Economic Review 70, 393–408. Hamill, Ruth, Timothy D. Wilson, and Richard E. Nisbett, 1980, Insensitivity to sample bias: Generalizing from atypical cases, Journal of Personality and Social Psychology 39, 578– 589. Harris, Milton, and Artur Raviv, 1993, Differences of opinion make a horse race, Review of Financial Studies 6, 473–506.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 48,
    "chunk_index": 85,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "1932 The Journal of Finance Hausch,DonaldB.,WilliamT.Ziemba,andMarkRubinstein,1981,Efficiencyofthemarketfor racetrack betting, Management Science 27, 1435–1452. Hellwig,MartinF.,1980,Ontheaggregationofinformationincompetitivemarkets,Journalof Economic Theory 22, 477–498. Hirshleifer, David,Avanidhar Subrahmanyam, and Sheridan Titman, 1994, Security analysis and trading patterns when some investors receive information before others, Journal of Finance 49, 1665–1698. Hong, Harrison, and Jeremy C. Stein, 1997, A unified theory of underreaction, momentum trading and overreaction in asset markets, Working paper, MIT. Ikenberry, David L., Josef Lakonishok, and Theo Vermaelen, 1995, Market underreaction to open market share repurchases, Journal of Financial Economics 39, 181–208. Irwin,FrancisW.,1953,Statedexpectationsasfunctionsofprobabilityanddesirabilityofout- comes, Journal of Personality 21, 329–335. Ito, Takatoshi, 1990, Foreign exchange rate expectations: Micro survey data, American Eco- nomic Review 80, 434–449. Jaffe,JeffreyF.,andRobertL.Winkler,1976,Optimalspeculationagainstanefficientmarket, Journal of Finance 31, 49–61. Jegadeesh,Narasimhan,1990,Evidenceofpredictablebehaviorofsecurityreturns,Journalof Finance 45, 881–898. Jegadeesh, Narasimhan, and Sheridan Titman, 1993, Returns to buying winners and selling losers: Implications for stock market efficiency, Journal of Finance 48, 65–91. Jensen,MichaelC.,1968,Theperformanceofmutualfundsintheperiod1945–1964,TheJour- nal of Finance 23, 389–416. Kahneman,Daniel,andAmosTversky,1972,Subjectiveprobability:Ajudgmentofrepresenta- tiveness, Cognitive Psychology 3, 430–454. Kahneman, Daniel, and Amos Tversky, 1973, On the psychology of prediction, Psychological Review 80, 237–251. Kahneman, Daniel, and Amos Tversky, 1979, Prospect theory: An analysis of decision under risk, Econometrica 47, 263–291. Kandel, Eugene, and Neil D. Pearson, 1995, Differential interpretation of public signals and trade in speculative markets, Journal of Political Economy 103, 831–872. Karpoff, Jonathan, 1986,Atheory of trading volume, Journal of Finance 41, 1069–1088. Keren, Gideon B., 1987, Facing uncertainty in the game of bridge:Acalibration study, Orga- nizational Behavior and Human Decision Processes 39, 98–114. Kidd, John B., 1970, The utilization of subjective probabilities in production planning, Acta Psychologica 34, 338–347. Kleidon, Allan W., 1986, Variance bounds tests and stock price valuation models, Journal of Political Economy 94, 953–1001. Kunda,Ziva,1987,Motivatedinference:Self-servinggenerationandevaluationofcausaltheo- ries, Journal of Personality and Social Psychology 53, 636–647. Kyle, Albert S., 1985, Continuous auctions and insider trading, Econometrica 53, 1315– 1335. Kyle,AlbertS.,andF.AlbertWang,1997,Speculationduopolywithagreementtodisagree:Can overconfidence survive the market test?, Journal of Finance 52, 2073–2090. Lakonishok,Josef,AndreiShleifer,andRobertW.Vishny,1992,Thestructureandperformance of the money management industry, Brookings Papers: Microeconomics, 339–391. Langer,EllenJ.,andJaneRoth,1975,HeadsIwin,tailsit’schance:Theillusionofcontrolas afunctionofthesequenceofoutcomesinapurelychancetask,JournalofPersonalityand Social Psychology 32, 951–955. Lehmann,BruceN.,1990,Fads,martingales,andmarketefficiency,TheQuarterlyJournalof Economics 105, 1–28. Leland, Hayne E., 1985, Option pricing and replication with transactions costs, Journal of Finance 40, 1283–1301. LeRoy, Stephen F., and Richard D. Porter, 1981, Stock price volatility: Tests based on implied variance bounds, Econometrica 49, 97–113.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 48,
    "chunk_index": 86,
    "word_count": 364,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "Brookings Papers: Microeconomics, 339–391. Langer,EllenJ.,andJaneRoth,1975,HeadsIwin,tailsit’schance:Theillusionofcontrolas afunctionofthesequenceofoutcomesinapurelychancetask,JournalofPersonalityand Social Psychology 32, 951–955. Lehmann,BruceN.,1990,Fads,martingales,andmarketefficiency,TheQuarterlyJournalof Economics 105, 1–28. Leland, Hayne E., 1985, Option pricing and replication with transactions costs, Journal of Finance 40, 1283–1301. LeRoy, Stephen F., and Richard D. Porter, 1981, Stock price volatility: Tests based on implied variance bounds, Econometrica 49, 97–113.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 48,
    "chunk_index": 87,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "When All Traders Are Above Average 1933 Lichtenstein, Sarah, Baruch Fischhoff, and Lawrence Phillips, 1982, Calibration of probabili- ties:Thestateoftheartto1980;inDanielKahneman,PaulSlovic,andAmosTversky,eds.: Judgment Under Uncertainty: Heuristics and Biases ~Cambridge University Press, Cam- bridge and NewYork!. Loewenstein,George,1992,Thefallandriseofpsychologicalexplanationsintheeconomicsof intertemporalchoice;inGeorgeLowensteinandJonElster,eds.:ChoiceOverTime~Russell Sage Foundation: NewYork!. Loewenstein, George, and Drazen Prelec, 1991, Negative time preference, American Economic Review 81, 347–352. Lord,CharlesG.,LeeRoss,andMarkR.Lepper,1979,Biasedassimilationandattitudepolar- ization: The effects of prior theories on subsequently considered evidence, Journal of Per- sonality and Social Psychology 37, 2098–2109. Loughran, Tim, and Jay R. Ritter, 1995, The new issues puzzle, Journal of Finance 50, 23–51. Malkiel,Burton,1995,Returnsfrominvestinginequitymutualfunds1971to1991,Journalof Finance 50, 549–572. Marks, Rose, 1951, The effect of probability, desirability, and “privilege” on the stated expec- tations of children, Journal of Personality 19, 332–351. Marsh, TerryA., and Robert C. Merton, 1986, Dividend variability and variance bounds tests for the rationality of stock market prices, American Economic Review 76, 483–498. Marsh,TerryA.,andRobertC.Merton,1987,Dividendbehaviorfortheaggregatestockmar- ket, Journal of Business 60, 1–40. Michaely, Roni, Richard H. Thaler, and Kent L. Womack, 1995, Price reactions to dividend initiations and omissions, Journal of Finance 50, 573–608. Miller,DaleT.,andMichaelRoss,1975,Self-servingbiasesinattributionofcausality:Factor fiction? Psychological Bulletin 82, 213–225. Murphy,AllanH.,andRobertL.Winkler,1984,Probabilityforecastinginmeteorology,Journal of the American Statistical Association 79, 489–500. Neale, Margaret A., and Max H. Bazerman, 1990, Cognition and Rationality in Negotiation ~The Free Press, NewYork!. Nisbett, Richard E., and Lee Ross, 1980, Human Inference: Strategies and Shortcomings of Social Judgment ~Prentice-Hall, Englewood Cliffs, N.J.!. Odean,Terrance,1998a,Doinvestorstradetoomuch?,Workingpaper,UniversityofCalifornia, Davis. Odean,Terrance,1998b,Areinvestorsreluctanttorealizetheirlosses?,JournalofFinance53, 1775–1798. Oskamp,Stuart,1965,Overconfidenceincase-studyjudgments,JournalofConsultingPsychol- ogy 29, 261–265. Pari, Robert, 1987, Wall $treet week recommendations:Yes or no?, Journal of Portfolio Man- agement 13, 74–76. Pontiff, Jeffrey, 1997, Excess volatility and closed-end funds, American Economic Review 87, 155–169. Ritter,JayR.,1991,Thelong-runperformanceofinitialpublicofferings,JournalofFinance46, 3–27. Roll,Richard,1986,Thehubrishypothesisofcorporatetakeovers,JournalofBusiness59,197– 216. Russo,J.Edward,andPaulJ.H.Schoemaker,1992,Managingoverconfidence,SloanManage- ment Review 33, 7–17. Shefrin, Hersh, and Meir Statman, 1985, The disposition to sell winners too early and ride losers too long: Theory and evidence, Journal of Finance 40, 777–790. Shefrin, Hersh, and Meir Statman, 1994, Behavioral capital asset pricing theory, Journal of Financial and Quantitative Analysis 29, 323–349. Shiller, Robert J., 1981, Do stock prices move too much to be justified by subsequent changes in dividends?, American Economic Review 71, 421–498. Shiller, Robert J., 1989, Market Volatility ~MIT Press, Cambridge, Mass.!.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 48,
    "chunk_index": 88,
    "word_count": 341,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "and Meir Statman, 1994, Behavioral capital asset pricing theory, Journal of Financial and Quantitative Analysis 29, 323–349. Shiller, Robert J., 1981, Do stock prices move too much to be justified by subsequent changes in dividends?, American Economic Review 71, 421–498. Shiller, Robert J., 1989, Market Volatility ~MIT Press, Cambridge, Mass.!.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 48,
    "page_range": "p.48",
    "total_pages": 48,
    "chunk_index": 89,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "1934 The Journal of Finance Singleton, Kenneth J., 1987, Asset prices in a time series model with disparately informed, competitivetraders;inWilliamA.BarnettandKennethJ.Singleton,eds.:NewApproaches to Monetary Economics ~Cambridge University Press, Cambridge and NewYork!. Spiess, D. Katherine, and JohnAffleck-Graves, 1995, Underperformance in long-run stock re- turns following seasoned equity offerings, Journal of Financial Economics 19, 425–442. Staël von Holstein, Carl-Axel S., 1972, Probabilistic forecasting:An experiment related to the stock market, Organizational Behavior and Human Performance 8, 139–158. Statman,Meir,andStevenThorley,1998,Overconfidenceandtradingvolume,Workingpaper, Santa Clara University. Svenson, 0la, 1981,Are we all less risky and more skillful than our fellow drivers?, Acta Psy- chologica 47, 143–148. Taylor, Shelley, and Johathon D. Brown, 1988, Illusion and well-being:Asocial psychological perspective on mental health, Psychological Bulletin 103, 193–210. Taylor, Shelley E., and Suzanne Thompson, 1982, Stalking the elusive “vividness” effect, Psy- chological Review 89, 155–191. Toft, Klaus B., 1996, Exact formulas for expected hedging error and transactions costs in op- tions replication, Journal of Financial and Quantitative Analysis, 31, 233–263. Tversky,Amos,andDanielKahneman,1971,Beliefinthelawofsmallnumbers,Psychological Bulletin 2, 105–110. Tversky,Amos, and Daniel Kahneman, 1982, Evidential impact of base rates; in Daniel Kah- neman,PaulSlovic,andAmosTversky,eds.:JudgmentUnderUncertainty:Heuristicsand Biases ~Cambridge University Press, Cambridge and NewYork!. Varian, Hal R., 1989, Differences of opinion in financial markets; in Courtenay C. Stone, ed.: Financial Risk: Theory, Evidence and Implications ~Proceedings of the Eleventh Annual Economic Policy Conference of the Federal Reserve Bank of St. Louis, Boston!. Wagenaar, Willem, and Gideon B. Keren, 1986, Does the expert know? The reliability of pre- dictionsandconfidenceratingsofexperts;inErikHollnagel,GiuseppeMancini,andDavid D. Woods, eds.: Intelligent Decision Support in Process Environments ~Springer, Berlin!. Wang,F.Albert,1995,Strategictrading,asymmetricinformationandheterogeneouspriorbe- liefs, Working paper, Columbia University. Weinstein,NeilD.,1980,Unrealisticoptimismaboutfuturelifeevents,JournalofPersonality and Social Psychology 39, 806–820. Womack,KentL.,1996,Dobrokerageanalysts’recommendationshaveinvestmentvalue?,Jour- nal of Finance 51, 137–167. Yates,J.Frank,1990, JudgmentandDecisionMaking ~Prentice-Hall,EnglewoodCliffs,N.J.!.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 48,
    "page_range": "p.48",
    "total_pages": 48,
    "chunk_index": 90,
    "word_count": 267,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  },
  {
    "text": "Louis, Boston!. Wagenaar, Willem, and Gideon B. Keren, 1986, Does the expert know? The reliability of pre- dictionsandconfidenceratingsofexperts;inErikHollnagel,GiuseppeMancini,andDavid D. Woods, eds.: Intelligent Decision Support in Process Environments ~Springer, Berlin!. Wang,F.Albert,1995,Strategictrading,asymmetricinformationandheterogeneouspriorbe- liefs, Working paper, Columbia University. Weinstein,NeilD.,1980,Unrealisticoptimismaboutfuturelifeevents,JournalofPersonality and Social Psychology 39, 806–820. Womack,KentL.,1996,Dobrokerageanalysts’recommendationshaveinvestmentvalue?,Jour- nal of Finance 51, 137–167. Yates,J.Frank,1990, JudgmentandDecisionMaking ~Prentice-Hall,EnglewoodCliffs,N.J.!.",
    "title": "No Job Name",
    "source_type": "pdf",
    "document_id": "28317243f8d9",
    "source_file": "Odean (1998) Volume, volatility, price, and profit when all traders are above average.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 48,
    "chunk_index": 91,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LIII,NO.6•DECEMBER1998 (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:19981029113631Z",
    "duration": null
  }
]