[
  {
    "text": "Option Momentum∗ Steven L. Hestona,† Shuaiqi Lib,‡ a R.H. Smith School of Business, University of Maryland, College Park, MD, 20742, USA bR.H. Smith School of Business, University of Maryland, College Park, MD, 20742, USA Abstract Thispaperimprovescontinuous-timevarianceswapapproximationformulasto derive exact returns on benchmark VIX option portfolios. The new methodology preserves the variance swap interpretation that decomposes returns into realized variance and option implied-variance. We apply this new methodology to explore return momentum on option port- folios across di(cid:27)erent S&P 500 stocks. We (cid:28)nd that stock options with high historical returns continue to outperform options with low returns. This pre- dictability has a quarterly pattern, resembling the pattern of stock momentum found by Heston and Sadka (2008). In contrast to stock momentum, option mo- mentum lasts for up to (cid:28)ve years, and does not reverse. JEL Classi(cid:28)cation Codes: G13; G14; G41 Keywords: Options; Momentum; Behavioral (cid:28)nance. ∗We are grateful for comments by the discussant, Bjorn Eraker, and other participants at the American Finance Association meetings, and from Juhani Linnainmaa, Dilip Madan, Peter Carr, Liuren Wu, and participants in seminars at University of Maryland, Baruch College, NYU Tandon, and The Virtual Derivatives Workshop. †Tel.: +1-240-305-7260. E-mail address: sheston@rhsmith.umd.edu. ‡Tel.: +1-240-271-9243. E-mail address: shuaiqi.li@rhsmith.umd.edu. Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 40,
    "chunk_index": 0,
    "word_count": 204,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "other participants at the American Finance Association meetings, and from Juhani Linnainmaa, Dilip Madan, Peter Carr, Liuren Wu, and participants in seminars at University of Maryland, Baruch College, NYU Tandon, and The Virtual Derivatives Workshop. †Tel.: +1-240-305-7260. E-mail address: sheston@rhsmith.umd.edu. ‡Tel.: +1-240-271-9243. E-mail address: shuaiqi.li@rhsmith.umd.edu. Electronic copy available at: https://ssrn.com/abstract=3705573 1 Introduction Early tests of market e(cid:30)ciency examined autocorrelation of stock returns (Fama and French, 1988) as well as predictability of market variance (Canina and Figlewski (1993), Day and Lewis (1992), Lamoureux and Lastrapes (1993), Fleming (1998), and Chris- tensen and Prabhala (1998)). While autocorrelation of aggregate stock market returns is weak, Jegadeesh (1990) and Jegadeesh and Titman (1993) document strong momen- 1 tum in the cross-section of U.S. stock returns. Moskowitz and Grinblatt (1999) and Grundy and Martin (2001) extended that cross-sectional predictability to stock indus- 2 try returns, and Jostova et al (2013) extended it to bond returns. Predictability in the cross-section implies that at least some assets have predictable returns. Despite the relevance and success of momentum strategies across asset classes, the literature has not yet investigated momentum in the cross-section of option returns across di(cid:27)erent stocks. Inordertoinvestigateoptionmomentum,weneedtocalculatereturnsonbenchmark option portfolios. The standard published benchmarks for option volatility are the Chicago Board of Options Exchange (CBOE) VIX portfolio of S&P 500 index options, andthecorrespondingequity-VIX portfoliosforoptionsonindividualstocks. Carrand Madan (1998) and Britten-Jones and Neuberger (2000) derived formulas that link VIX to the value of swaps on realized variance. But these formulas are only approximate, because they require a continuum of strike prices, and because they make additional 1 Rouwenhorst(1998)andGri(cid:30)n,JiandMartin(2003)con(cid:28)rmedthiscross-sectionale(cid:27)ectinother countries. 2 Asness et al (2013) and Jegadeesh and Titman (2011) also review evidence of momentum across countries, currencies, and commodity futures. Our focus is on the cross-section of U.S. stock options. 2 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 40,
    "chunk_index": 1,
    "word_count": 297,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "a continuum of strike prices, and because they make additional 1 Rouwenhorst(1998)andGri(cid:30)n,JiandMartin(2003)con(cid:28)rmedthiscross-sectionale(cid:27)ectinother countries. 2 Asness et al (2013) and Jegadeesh and Titman (2011) also review evidence of momentum across countries, currencies, and commodity futures. Our focus is on the cross-section of U.S. stock options. 2 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 40,
    "chunk_index": 2,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "continuous-time di(cid:27)usion approximations. For empirical work, it is di(cid:30)cult to verify the adequacy of these approximations across hundreds of di(cid:27)erent stocks. This paper derives a new formula to calculate exact returns on tradable option strategies. These strategies employ equity-VIX portfolios of options on individual stocks, constructed by CBOE’s standard \"model-free\" VIX weighting methodology. We calculate monthly returns on these portfolios, including daily dynamic hedges in the underlying stocks. The advantages of our approach are: 1) It provides exact returns on standard benchmark equity-VIX portfolios, 2) It uses a daily \"model-free\" hedge thatdoesnotrequireestimatinganymodelparameters,and3)Itexplainsoptionreturns with a simple \"variance swap\" decomposition into realized variance and option implied- variance. In other words, our methodology is the (cid:28)rst to translate continuous-time variance swap intuition into exact predictions for discrete option data. This paper explores predictability of monthly returns on equity-VIX portfolios of options across di(cid:27)erent S&P 500 stocks. It (cid:28)nds that positive returns (in the cross- section) strongly continue for 12 months. Unlike stock returns, option returns show no tendency to reverse the gains from momentum (DeBondt and Thaler, 1985, 1987). Instead, momentum continues periodically for up to 60 months. In particular, option momentum displays a quarterly pattern of continuation. This periodic pattern matches the quarterly pattern of stock momentum over the past year, documented by Heston and Sadka (2008). Our new methodology allows a variance decomposition of momentum returns. The cross-section of realized variance is persistent, with a strong quarterly pattern. But the cross-section of option implied-variance is even more persistent than realized variance. 3 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 40,
    "chunk_index": 3,
    "word_count": 256,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "the past year, documented by Heston and Sadka (2008). Our new methodology allows a variance decomposition of momentum returns. The cross-section of realized variance is persistent, with a strong quarterly pattern. But the cross-section of option implied-variance is even more persistent than realized variance. 3 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 40,
    "chunk_index": 4,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "In other words, overpriced options tend to stay overpriced, and underpriced options tend to stay underpriced. The cross-section of option implied-variance has a smaller seasonal pattern than realized variance, suggesting that markets do not fully anticipate the seasonality of market volatility. Even after we eliminate (cid:28)rm-month observations with dividend payments and earnings announcements, the momentum and seasonality patternsremainstrong. Thissuggeststhatreturnsmightberelatedtobehavioralbiases in forecasting volatility, rather than information or cash (cid:29)ow events. The option momentum e(cid:27)ect is correlated with previous anomalies. For example, it is well-known that option returns have a (negative) variance premium, and this variance premium extends to the cross-section. Speci(cid:28)cally, Carr and Wu (2009) and Goyal and Saretto (2009) showed that stock options with high prices, relative to their historical volatility, have lower subsequent returns than options with low prices. In other words, there is a variance premium associated with option value, as measured by historicalvariancedividedbycurrentprice. Incontrast, optionmomentum isessentially a measure of historical variance divided by historical price. While returns to option momentum and option value are correlated, multivariate analysis shows that these two e(cid:27)ects are distinct. In addition to being distinct from option value, the returns to historical option momentum also remain largely unexplained by risks and other option returnpredictors,donotliewithinthebid-askspread,andsurvivemarginrequirements. Section 2 discusses the data used in our analysis. Section 3 explains how the theo- retical link between variance swaps and option strategies inspires pro(cid:28)table momentum strategies. Section 4 controls for option value, risk, and a wide range of option return predictors. Section 5 examines the impact of option bid-ask spreads to the pro(cid:28)tability 4 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 40,
    "chunk_index": 5,
    "word_count": 261,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "3 explains how the theo- retical link between variance swaps and option strategies inspires pro(cid:28)table momentum strategies. Section 4 controls for option value, risk, and a wide range of option return predictors. Section 5 examines the impact of option bid-ask spreads to the pro(cid:28)tability 4 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 40,
    "chunk_index": 6,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "of option momentum strategies, and a (cid:28)nal section concludes. 2 Data and Methodologies We begin by constructing option strategies across individual stocks, and later analyze the returns on these strategies. There are competing methodologies for accommodat- ing options with di(cid:27)erent strike prices. Bakshi and Kapadia (2003) use delta-hedged returns on selected option series, and Jones, Khorram, and Mo (2020) use delta-hedged straddle returns. The gains of their delta-hedged option portfolio qualitatively repre- sent a volatility risk premium that depends on the options being used. In contrast, the most prominent published benchmarks for option prices are the Chicago Board of Op- tions Exchange VIX index for S&P 500 options (CBOE, 2019 3 ) and the corresponding equity-VIX indices for options on individual stocks. These indices are based on portfo- lios of options, weighted by the squared reciprocals of their strike prices. Carr and Wu (2008) interpolated option prices to measure an idealized continuous VIX portfolio, and then used a continuous-time variance swap approximation to the returns on their portfolio. Although it is not literally a tradable option strategy, the variance swap approach has an intuitive advantage of decomposing returns into risk-neutral variance and realized variance. We construct returns on a discrete daily-hedged analog of the continuous variance swap option strategy. This method provides a tradable strategy, while preserving the intuition of the variance swap decomposition. The CBOE (2019) VIX index is based on the (interpolated) market value of a 3 CBOE White Paper used to construct the VIX index can be found at: https://www.cboe.com/micro/vix/vixwhite.pdf 5 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 40,
    "chunk_index": 7,
    "word_count": 259,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "This method provides a tradable strategy, while preserving the intuition of the variance swap decomposition. The CBOE (2019) VIX index is based on the (interpolated) market value of a 3 CBOE White Paper used to construct the VIX index can be found at: https://www.cboe.com/micro/vix/vixwhite.pdf 5 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 40,
    "chunk_index": 8,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "portfolio at time t comprising options expiring at time T. (cid:88) O(K ,t;T)∆ i i V(t;T) = 2 , (1) K2 i i where O(K,t;T) represents time t price of an out-of-the-money call or put option with strike price K and expiration T, and ∆ represents the gap between adjacent strike i prices. 4 Importantly, VIX portfolios are \"model-free\" because their construction does not depend on any model parameters. Carr and Madan (1998) showed that we can approximate the VIX price with a continuous integral over strike prices. 5 (cid:90) ∞ O(K,t;T) ˆ V(t;T) = 2 dK. (2) K2 0 GiventhespotpriceS(T)atexpiration,theoptionpayo(cid:27)O(K,T;T)equalsMax(S(T)−K,0) for a call option and Max(K −S(T),0) for a put option. In the absence of intermedi- ate dividends, integrating these option payo(cid:27)s over strike prices (2) shows the terminal payo(cid:27) of the idealized VIX portfolio. (cid:18) (cid:19) S(T) S(T) ˆ V(T;T) = −2log( )+2 −1 , (3) S(t)(1+r )T−t S(t)(1+r )T−t f f where r is the daily risk-free interest rate. The (cid:28)rst term in the payo(cid:27) (3) represents f selling two units of the \"log-portfolio\". The second term represents a costless static 4 The sum uses out-of-the-money options with respect to the forward value of the strike price, K(1+r )T−t. f 5 See also Demeter(cid:28) et al. (1999), Britten-Jones and Neuberger (2000), and Jiang and Tian (2005) for various continuous-time derivations. Breeden and Litzenberger (1978) (cid:28)rst expressed the risk- neutral density in terms of the second derivative of the option price with respect to the strike price. Carr and Madan (1998) then derived the formula (2) using integration by parts twice. 6 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 40,
    "chunk_index": 9,
    "word_count": 269,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "for various continuous-time derivations. Breeden and Litzenberger (1978) (cid:28)rst expressed the risk- neutral density in terms of the second derivative of the option price with respect to the strike price. Carr and Madan (1998) then derived the formula (2) using integration by parts twice. 6 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 40,
    "chunk_index": 10,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "hedge that leverages (the present value of) two dollars of stock at time t, and holds this hedge position constant until expiration at time T. The combined payo(cid:27) is a U-shaped function of the stock price, resembling a squared stock return. Therefore, the price of this portfolio represents the approximate (risk-neutral) variance of return. Since the S&P 500 VIX index and equity-VIX indices on individual stocks represent standard deviation, they are proportional to the square-root of the portfolio value V(t;T). Due to their U-shaped payo(cid:27)s, the equity-VIX portfolios have (approximately) zero delta when they are constructed. In other words, they are locally insensitive to movements in the underlying stock price. But over time, the stock price will drift away from the center of the U-shaped payo(cid:27), and the equity-VIX portfolios will become sensitive to the stock price. Instead of using a (cid:28)xed static hedge, we can further reduce risk of the VIX portfolios by dynamic hedging. This replaces the second term of (3) with delta-hedging of the log-portfolio. The elasticity of option value with respect to the stock price generally depends on a model. But due to the log-payo(cid:27) (3), the delta of the idealized continuous-strike VIX portfolio does not. Instead, the delta-hedge of the log-portfolio buys 1/S(t) shares of stock for a price of S(t), and rebalances to maintains a constant hedge exposure of one dollar. So, not only is the value of the VIX portfolio model-free, but its dynamic-hedge is also model-free. This dynamic hedge keeps the delta of the discrete equity-VIX approximately equal to zero, and reduces the volatility of returns (relative to using a (cid:28)xed static hedge). The dynamically hedged payo(cid:27) is T S(T) (cid:88) V (T;T) = −2log( )+2 (r (u)−r ), (4) hedged S(t)(1+r )T−t S f f u=t+1 7 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 40,
    "chunk_index": 11,
    "word_count": 301,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "the discrete equity-VIX approximately equal to zero, and reduces the volatility of returns (relative to using a (cid:28)xed static hedge). The dynamically hedged payo(cid:27) is T S(T) (cid:88) V (T;T) = −2log( )+2 (r (u)−r ), (4) hedged S(t)(1+r )T−t S f f u=t+1 7 Electronic copy available at: https://ssrn.com/abstract=3705573 where r (u) represents the stock return on day u. We can replace the stock price in S equation (4) to express the V (T;T) payo(cid:27) in terms of a telescoping series of daily hedged stock returns r (u) at times u between t and T: S T T (cid:88) 1+r (u) (cid:88) S V (T;T) = −2 log( )+2 (r (u)−r ). (5) hedged S f 1+r f u=t+1 u=t+1 When daily returns on the stock and risk-free rate are small, a second-order Taylor series expansion shows that the dynamically hedged option portfolio (5) approximates the payo(cid:27) of variance swap contract in Carr and Wu (2009): T (cid:88) V (T;T) ≈ (r (u)−r )2. (6) hedged S f u=t+1 The return on the unhedged VIX portfolio from equation (1) is simply the propor- tional change in its value V(T;T)−V(t;T) r (t;T) = . (7) unhedged V(t;T) The return on the dynamically hedged VIX portfolio is adjusted by the di(cid:27)erence between the static hedge term in (3) and the dynamic risk term in (4). (cid:18) (cid:19) T V(T;T)−V(t;T)−2 S(T) −1− (cid:80) (r (u)−r ) S(t)(1+r )T−t S f f u=t+1 r (t;T) = . (8) hedged V(t;T) A comparison of the hedged return (8) with the Taylor Series approximation (6) shows that the dynamically hedged return on the VIX portfolio is approximately the realized 8 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 40,
    "chunk_index": 12,
    "word_count": 280,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "(cid:80) (r (u)−r ) S(t)(1+r )T−t S f f u=t+1 r (t;T) = . (8) hedged V(t;T) A comparison of the hedged return (8) with the Taylor Series approximation (6) shows that the dynamically hedged return on the VIX portfolio is approximately the realized 8 Electronic copy available at: https://ssrn.com/abstract=3705573 variance relative to the VIX portfolio price. T (cid:80) (r (u)−r )2 S f u=t+1 r (t;T) ≈ −1. (9) hedged V(t;T) Carr and Wu (2009) used the variance swap approximation to analyze variance premiums in the cross-section of option returns, and Bollerslev, Tauchen, and Zhou (2009) used it implicitly when forecasting returns variance premium. Giglio and Kelly (2017)laterappliedittomultipleassetclasses. Inunreporteddiagnostics,wefoundthat the exact return on the underlying S&P 500 index VIX portfolio is 99% correlated with the variance swap approximation (6). In other words, the dynamically hedged payo(cid:27) on the index VIX portfolio is very close to the realized variance over the month. But with individual stocks, the correlations of options returns with realized variance can be lower. Using returns on hedged option portfolios (8) is consistent with previous research that measured delta-hedged returns, while preserving compatibility with the variance swap literature (9). Anadditionaladvantageofourbenchmarkapproachisthatitmeasuresoptionport- folios with all available strike prices. These portfolios maintain consistent sensitivity to volatility because they always include at-the-money options. In a certain sense, a VIX portfolio is always at-the-money. In contrast, Bakshi and Kapadia’s (2003) approach of delta-hedging a single option will generally lose vega sensitivity when the option drifts away from the money. This paper uses data from the OptionMetrics Ivy DB database from January 1996 to December 2017. These data provide daily closing bid and ask quotes for U.S. equity 9 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 40,
    "chunk_index": 13,
    "word_count": 281,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "a single option will generally lose vega sensitivity when the option drifts away from the money. This paper uses data from the OptionMetrics Ivy DB database from January 1996 to December 2017. These data provide daily closing bid and ask quotes for U.S. equity 9 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 40,
    "chunk_index": 14,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "options. We use the T-bill rate of appropriate maturity (interpolated when necessary) 6 from OptionMetrics as the risk-free rate. Finally, we obtain information about stock returns, dividends, and (cid:28)rm characteristics from CRSP and COMPUSTAT. We apply a series of (cid:28)lters on the option data. First, we use only options on S&P 500 constituent stocks within the sample period. This leaves us with a total of 995 (cid:28)rms. Following Driessen, Maenhout, and Vilkov (2009), we remove all observations for which the option open interest is equal to zero, in order to eliminate options with no liquidity. We discard options with zero bid prices, and with missing implied volatility or delta(whichoccursforoptionswithnonstandardsettlementorforoptionswithintrinsic value above the current mid price). We delete all observations whose ask price is lower thanthebidprice, andeliminateoptionswhosepricesviolatearbitragebounds. Wealso require the mid-point bid-ask option quote to be at least $0.125, and the underlying stock price to be at least $5. We delete (cid:28)rm-month observations containing stock splits. Following Christo(cid:27)ersen, Fournier, and Jacobs (2017), we remove (cid:28)rm-month observations for which the present value of dividends before expiration is larger than 4% of the stock price. Following Conrad, Dittmar and Ghysels (2013), we use an equal number of calls and puts to construct VIX portfolios, using the midpoint of bid-ask quotes. Our (cid:28)nal sample includes 79,845 (cid:28)rm-month observations with 535,722 option contracts. On average, each equity VIX portfolio consists of 6.71 option contracts. The o(cid:30)cial CBOE VIX methodology combines options with di(cid:27)erent expiration dates to achieve a 30-day weighted-average maturity. Our analysis uncovers tempo- 6 Since average interest rates over this period were less than 2% per year, they had little e(cid:27)ect on our calculations with monthly returns. 10 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 40,
    "chunk_index": 15,
    "word_count": 280,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "o(cid:30)cial CBOE VIX methodology combines options with di(cid:27)erent expiration dates to achieve a 30-day weighted-average maturity. Our analysis uncovers tempo- 6 Since average interest rates over this period were less than 2% per year, they had little e(cid:27)ect on our calculations with monthly returns. 10 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 40,
    "chunk_index": 16,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "ral periodicity in option prices and returns. To measure returns accurately, we must calculate portfolio values without interpolating option prices across di(cid:27)erent maturi- ties. Therefore, we establish option position in equity-VIX portfolios on a Friday of each month, with exactly 28 days to expiration on the third Friday of the subse- 7 quent month. This avoids interpolation by using exact option prices instead of 30-day weighted-averages used by the CBOE (2019) VIX methodology. We calculate returns to expiration on the underlying equity-VIX portfolio (1), hedged daily according to (8),withoutusinganyapproximationsnorinterpolations. Theresultingoptionportfolio value and its returns are model-free. Panel A of Table 1 compares exact equity-VIX returns (8) with variance swap returns (9) at the individual (cid:28)rm level. The gross variance swap return is de(cid:28)ned as the realized monthly variance of a stock return divided by the equity-VIX price. Options have a negative variance premium, with equity-VIX returns averaging a loss of 4.19% per month. While this seems large compared to average equity returns, equity- VIX portfolios are risky and highly levered. The standard deviation of return exceeds 85% per month. There is a particularly fat right tail, where returns exceed 115% on the upper 5% of observations. The variance swap return averages a loss of 2.64% per month. Overall, the two measures of return have similar distributions, but the average equity-VIX return is more negative than the average variance swap return. Panel B shows the di(cid:27)erence between cross-sectional average equity-VIX returns and variance swap returns in an equally weighted portfolio across all (cid:28)rms at each 7 We usually establish the option positions on the third Friday of a month. In months with (cid:28)ve Fridays, we postpone the portfolio formation by one week to keep a holding period of exactly 28 days. This procedure had little e(cid:27)ect on our empirical results. 11 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 40,
    "chunk_index": 17,
    "word_count": 305,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "We usually establish the option positions on the third Friday of a month. In months with (cid:28)ve Fridays, we postpone the portfolio formation by one week to keep a holding period of exactly 28 days. This procedure had little e(cid:27)ect on our empirical results. 11 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 40,
    "chunk_index": 18,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "month. This is e(cid:27)ectively a portfolio of option portfolios. By exploiting the bene- (cid:28)t of a large cross section, this approach diversi(cid:28)es the approximation error between equity-VIX returns and variance swap returns. The average di(cid:27)erence between equally weighted variance swap returns and equally weighted equity-VIX returns is only 0.23% per month. Overall, equity-VIX returns are much less negative than index VIX returns, whose monthly average equals −23.24%. This is consistent with the (cid:28)ndings in Carr and Wu (2009) and Driessen, Maenhout, and Vilkov (2009). To reliably calculate correlations and risk-exposures, Panel C of Table 1 restricts the sample to 650 stocks which had data available to calculate equity-VIX prices for at least 30 monthly observations. Panel C shows that across these 650 stocks, the average within-(cid:28)rm correlation between equity-VIX return and variance swap return is 75%, andthemediancorrelationis87%. Anequallyweightedportfolioofallequity-VIX’sas in Panel B gives an even higher correlation of 92%. By comparison, the S&P 500 Index VIX produced a 99% correlation between the variance swap return and the exact daily hedged VIX return. The variance swap methodology produces a higher correlation for the S&P 500 Index VIX returns because there are more strike prices available to construct the option portfolios. While the correlation between variance swap returns and equity-VIX returns is lower at the individual (cid:28)rm level than that at the index level, much of the discrepancy gets diversi(cid:28)ed away in large portfolios. It is reassuring to know that the two measures are similar enough to support comparison of our new results with previous research. The last row of Table 1 Panel A shows the Black-Scholes deltas, i.e., elasticities with respect to the stock price. The deltas of the idealized continuous VIX portfolios (3) 12 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 40,
    "chunk_index": 19,
    "word_count": 288,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "two measures are similar enough to support comparison of our new results with previous research. The last row of Table 1 Panel A shows the Black-Scholes deltas, i.e., elasticities with respect to the stock price. The deltas of the idealized continuous VIX portfolios (3) 12 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 40,
    "chunk_index": 20,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "are exactly zero, and Table 1 shows that the deltas of the equity-VIX portfolios are nearly zero. Under the Black-Scholes assumptions, the equity-VIX portfolios should be uncorrelated with stock returns. Panel C shows this is not the case. Equity-VIX returns have strong negative betas with respect to the stock return and even stronger negative betas with respect to S&P 500 returns. This is because of negative correlation between stock returns and innovations in variance. The (cid:28)nal row of Panel C shows that equity-VIX returns have an average positive beta of 0.4 with respect to returns on S&P 500 index-VIX returns. In other words, equity-VIX returns share exposure to systematic market variance. Options on individual equities have an additional American early exercise feature. While there are many numerical methods and approximations to the optimal exercise policy, a simple approximation is to exercise options early when their exercise value exceeds a certain threshold of the ask prices of options. Table A1 in the Appendix performs sensitivity analysis to show that the early exercise premium (0.36%) is small compared to the variance premiums in Table 1 and to the returns of our momentum 8 strategies. As an additional robustness check, we form option momentum strategy each month using only non-dividend paying (cid:28)rms and compare the result with that in Table 4. The monthly average return of momentum strategy only changes slightly from 16.13% with a t-statistics of 8.42 to 16.23% with a t-statistics of 8.14. Therefore, we ignore early exercise when computing returns in subsequent tables. 8 By using a binomial tree method, Driessen, Maenhout, and Vilkov (2009) (cid:28)nd that the early exercisepremiumisbetween0.3%and1.1%forthe1-monthoptionprice. Ourresultliesinthisrange. 13 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 40,
    "chunk_index": 21,
    "word_count": 277,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "slightly from 16.13% with a t-statistics of 8.42 to 16.23% with a t-statistics of 8.14. Therefore, we ignore early exercise when computing returns in subsequent tables. 8 By using a binomial tree method, Driessen, Maenhout, and Vilkov (2009) (cid:28)nd that the early exercisepremiumisbetween0.3%and1.1%forthe1-monthoptionprice. Ourresultliesinthisrange. 13 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 40,
    "chunk_index": 22,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "3 Option Portfolio Strategies The previous section described construction of returns on our monthly equity-VIX portfolios. We use returns to expiration on these discrete model-free option portfolios. In the rest of this paper, when we form momentum strategies each month, we only con- sider (cid:28)rms that were included in the S&P 500 Index at that month, so that our strategy does not have forward-looking bias. Bakshi, Kapadia, and Madan (2003) used 31 in- dividual stocks, and Carr and Wu (2009) used 35 individual stocks. Our substantially larger cross-section allows exploration of many di(cid:27)erent investment strategies. Jegadeesh and Titman (1993) developed the simplest benchmark for stock momen- tumstrategies. Their\"relativestrength\"strategiessortstocksbasedonhistoricalreturn over 3-, 6-, 9-, or 12-month periods, and then hold the equally weighted top decile of winner stocks and short the bottom decile of loser stocks for subsequent 3-, 6-, 9, or 12-month periods. We measure the corresponding option strategy that buys the equally weighted top decile of equity-VIX option portfolios and shorts the equally weighted bottom decile of losers every month. Following Jegadeesh and Titman, we rebalance these portfolio each month to maintain equal weights. Table2showstheresultsofsimpledecilespreadstrategiesbasedonallcombinations of 3-, 6-, 9-, and 12-month formation periods and 3-, 6-, 9-, or 12-month holding periods. The results are consistently pro(cid:28)table. Across all formation periods and all holding periods up to one year, the top decile of winners outperformed the bottom decile of losers. For example, with the 3-month-formation/3-month-hold strategies, the top decile of winners earned an average of 2.74% per month, while the bottom decile 14 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 40,
    "chunk_index": 23,
    "word_count": 257,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "all formation periods and all holding periods up to one year, the top decile of winners outperformed the bottom decile of losers. For example, with the 3-month-formation/3-month-hold strategies, the top decile of winners earned an average of 2.74% per month, while the bottom decile 14 Electronic copy available at: https://ssrn.com/abstract=3705573 of losers lost 7.88% per month. This di(cid:27)erence exceeds 10% per month. Across all strategies, the option decile spreads are economically large and statistically signi(cid:28)cant. The strategies in Table 2 were not optimized for options. Table 2 merely represents an out-of-sample test of Jegadeesh and Titman’s original strategies on an entirely new asset class. To understand why these strategies might be pro(cid:28)table, we decompose the option portfolio returns according to the variance swap approximation of the previous section. Equation (9) shows that the gross return on an equity-VIX portfolio for the ith stock over month t is approximately the realized variance, RV (t), divided by the cost i of the equity-VIX portfolio VIX2(t−1). In logarithms, this relationship is i log(1+r (t)) ≈ log(RV (t))−log(VIX2(t−1)). (10) i i i This return decomposition shows that predictability in equity-VIX returns re(cid:29)ects predictabilityinrealizedvariancerelativetoequity-VIX prices. Todiagnosethesources of momentum pro(cid:28)ts, we run the cross-sectional regression log(RV (t)) = γ +γ ·log(RV (t−k))+(cid:15) (t). (11) i 0,t k,t i i The coe(cid:30)cient estimate γ shows the extent to which the cross-section of realized k,t variance in one month is predicted by the previous cross-section lagged by k-months. The average of γ over all months t shows the average relationship. Figure 1 (a) shows k,t that the cross-section of realized variance is persistent, with coe(cid:30)cients exceeding 0.6 forshortmonthlylags, anddecliningaslagsgrowto(cid:28)veyears. Figure1(a)alsodisplays 15 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 40,
    "chunk_index": 24,
    "word_count": 278,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "in one month is predicted by the previous cross-section lagged by k-months. The average of γ over all months t shows the average relationship. Figure 1 (a) shows k,t that the cross-section of realized variance is persistent, with coe(cid:30)cients exceeding 0.6 forshortmonthlylags, anddecliningaslagsgrowto(cid:28)veyears. Figure1(a)alsodisplays 15 Electronic copy available at: https://ssrn.com/abstract=3705573 thecorrespondingaveragecoe(cid:30)cientsfortheanalogousregressionofthecross-sectionof logarithmsofequity-VIX priceslog(VIX2(t))ontheirownlags. Optionpricesareeven i more persistent than realized variance, with average coe(cid:30)cients exceeding 0.8 for short monthly lags, and remaining above 0.5 even for lags of (cid:28)ve years. Across di(cid:27)erent lags, boththerealizedvarianceandVIX2 coe(cid:30)cientsexhibitastrikingquarterlyperiodicity. It appears that variance has a quarterly seasonal pattern across stocks, and to a large extent, option prices anticipate the pattern in future variance. To ascertain whether option prices properly anticipate the persistence and season- ality of realized variance, we run the cross-section regression using continuously com- pounded variance swap returns, log(1+r˜(t)) = γ +γ ·log(1+r˜(t−k))+(cid:15) (t), (12) i 0,t k,t i i wherer˜(t)denotesthevarianceswapreturn. Whilecompoundedvarianceswapreturns i are not exactly equal to returns, they are a good approximation. Figure 1 (b) shows that the resulting pattern of average γ coe(cid:30)cients across di(cid:27)erent lags remains positive and visibly seasonal for at least (cid:28)ve years. Figure 1 (b) suggests that option prices fail to properly anticipate the persistence and periodicity of realized variance. Table 3 shows the coe(cid:30)cients of (cid:28)rst year lags from Figure 1 (b). The univariate columns shows that coe(cid:30)cient estimates are all highly signi(cid:28)cant at all lags, with t- statistics ranging from 6 to 11. To measure the incremental statistical signi(cid:28)cance of individual lags, the multivariate column of Table 3 reports average (of time-series) coef- (cid:28)cients from multivariate cross-sectional regression that includes a full year of monthly 16 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 40,
    "chunk_index": 25,
    "word_count": 277,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "signi(cid:28)cant at all lags, with t- statistics ranging from 6 to 11. To measure the incremental statistical signi(cid:28)cance of individual lags, the multivariate column of Table 3 reports average (of time-series) coef- (cid:28)cients from multivariate cross-sectional regression that includes a full year of monthly 16 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 40,
    "chunk_index": 26,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "lags. The multivariate t-statistics are at least 3 at the quarterly lags of 3-, 6-, 9-, and 12-months. But they are mostly statistically insigni(cid:28)cant at other lags. This indicates that persistence in the cross-section of option returns is primarily a quarterly seasonal phenomenon. To recap, Table 2 provides simple and robust evidence that momentum strategies are pro(cid:28)table across options on di(cid:27)erent stocks. Figure 1 and Table 3 indicate this predictability has a quarterly pattern that lasts for up to (cid:28)ve years. This suggests that we investigate strategies that exploit momentum and speci(cid:28)cally quarterly momentum for various horizons up to (cid:28)ve years. Inspired by Table 3 and Figure 1, Table 4 reports returns on one-month equally weighted decile portfolios of equity-VIX option strategies ranked according to di(cid:27)erent historical measures of variance swap momentum. The Year 1 \"All\" deciles are sorted based on the geometric average of all 12 monthly variance swap returns over the past year; the Year 2 \"All\" deciles are sorted based on monthly lags 12-24, and so forth. The Year 1 quarterly decile portfolios are sorted only based on monthly lags 3, 6, 9, and 12. The Year 2 quarterly portfolio uses lags 15, 18, 21, and 24, and similarly for Years 3, 4, and 5. The nonquarterly decile portfolios are sorted on the monthly lags of a given year that are not quarterly, e.g., lags 1, 2, 4, 5, 7, 8, 10, and 11 for Year 1. Table 4 shows that average monthly returns are nearly monotonic across momentum deciles sorted based on the past year of returns. Using all months in the past year, the lowest decile lost 13.47% per month, while the highest decile gained 2.65% per month. The di(cid:27)erence exceeds 16% per month, and is highly statistically signi(cid:28)cant. Sorting deciles using only four lags of 3-, 6-, 9-, and 12-months is nearly as pro(cid:28)table, 17 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 40,
    "chunk_index": 27,
    "word_count": 316,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "past year, the lowest decile lost 13.47% per month, while the highest decile gained 2.65% per month. The di(cid:27)erence exceeds 16% per month, and is highly statistically signi(cid:28)cant. Sorting deciles using only four lags of 3-, 6-, 9-, and 12-months is nearly as pro(cid:28)table, 17 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 40,
    "chunk_index": 28,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "with a decile spread of 14.77%. The quarterly e(cid:27)ect must be quite strong for a noisy momentum strategy using only 4 lagged months to be nearly as pro(cid:28)table as a strategy using all 12 lagged months within the past year. In fact, the t-statistic for this quarterly winner-loser strategy exceeds the t-statistic for the full-year strategy. The Year 1 Non- Quarterly strategy is also pro(cid:28)table; the corresponding 10-1 decile spread exceeds 11%. The Year 1 Quarterly decile spread outperforms the Non-Quarterly decile spread by 3.42% per month. Toexaminethesourceofpro(cid:28)tsofmomentumstrategies, wereporttherisk-adjusted returns for the short- and long-leg in the portfolio Year 1 \"All\", controlling for the VIX returns of S&P 500 Index, (cid:28)ve Fama and French (2015) factors, and stock momentum factor. Results are reported in Table 5. In terms of raw returns, the short leg (13.47%) contributes most to total pro(cid:28)t (16.13%), as shown in the (cid:28)rst row of Table 4. After adjusting for the risk exposure to index VIX returns, which is largely negative, the winner portfolio contributes 70.4% to total risk-adjusted pro(cid:28)ts (11.9% out of 16.9%). ThisresemblesthepatternofstockmarketmomentuminJegadeeshandTitman(1993). The pattern of quarterly continuation in Table 4 relates to previous patterns of momentum in stock returns. Heston and Sadka (2008) found a quarterly pattern of continuation when using lagged stock returns less than one year. But beyond one year, this quarterly pattern disappeared. Instead, long-term stock returns exhibit long-term reversal (DeBondt and Thaler, 1985, 1987), with continuation at annual lags. The cross-section of option returns shares the quarterly pattern of continuation. While the quarterly pattern of options gets weaker and statistically less signi(cid:28)cant as the horizon recedes, it de(cid:28)nitely does not turn into reversal within (cid:28)ve years. 18 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 40,
    "chunk_index": 29,
    "word_count": 282,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "1985, 1987), with continuation at annual lags. The cross-section of option returns shares the quarterly pattern of continuation. While the quarterly pattern of options gets weaker and statistically less signi(cid:28)cant as the horizon recedes, it de(cid:28)nitely does not turn into reversal within (cid:28)ve years. 18 Electronic copy available at: https://ssrn.com/abstract=3705573 We have explored variables that might be related to the quarterly seasonality in option returns. These include (cid:28)rms’ earnings months, ex-dividend months, calendar month, and length of trading-month. These variables are easy to diagnose by simply analyzing subsamples of monthly return observations. Unreported tables resemble full- sample results, and show that none of these variables explain the seasonal pattern in realized variance or in option returns. Jones, Khorram, and Mo (2020) (cid:28)nd similar seasonal momentum e(cid:27)ects in straddle returns, and conclude that these e(cid:27)ects remain strong after controlling for characteristics and factor risk. A behavioral explanation is that markets fail to fully anticipate seasonality in volatility. This resembles the behav- ioral bias across expiration dates documented by Eisdorfer, Sadka, and Zhdanov (2017). Alternatively, there might be a distinct risk premium associated with quarterly seasonal volatility. Similar patterns remain unexplained in the stock momentum literature, and present questions for future research. 4 Control for Risk and Option Return Predictors Ifmarketsaree(cid:30)cient, thenexcessreturnsofoptionsstrategiesshouldbecompensation for systematic risk. While our equity-VIX portfolios are hedged to be insensitive to stock risk, they are constructed to be very sensitive to variance risk. Systematic market variance has a well-known negative risk premium (Bakshi and Kapadia, 2003). The existence of a variance premium makes it plausible that past returns are correlated with exposure to variance. For example, stocks with high past variance swap returns might have high future comovement with systematic market variance. 19 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 40,
    "chunk_index": 30,
    "word_count": 290,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "well-known negative risk premium (Bakshi and Kapadia, 2003). The existence of a variance premium makes it plausible that past returns are correlated with exposure to variance. For example, stocks with high past variance swap returns might have high future comovement with systematic market variance. 19 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 40,
    "chunk_index": 31,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "Table 4 controls for risk by regressing the long-short momentum strategy returns on (cid:28)ve Fama and French (2015) factors and the momentum factor of Carhart (1997). It also includes the VIX returns of S&P 500 Index as an additional risk factor. The intercept \"alpha\" from this regression represent risk-adjusted average returns. These risk-adjusted means are generally close to the average decile spreads, and do not al- ter their statistical signi(cid:28)cance. There is little indication that momentum returns in the cross-section of options are related to stock factors (including momentum) or to covariance with systematic market volatility. Given the pro(cid:28)tability of momentum strategies in options, a concern is whether the momentum return e(cid:27)ect is truly new, or just a disguised manifestation of existing anomalies. In particular, Goyal and Saretto (2009) and Carr and Wu (2009) docu- mented a signi(cid:28)cant negative return premium on options with high implied variance, relative to their historical variances. We de(cid:28)ne option value as rolling 1-year historical variance divided by current equity-VIX price. Option momentum is similar to option value, because option momentum is historical realized variance divided by historical equity-VIX price. Table 6 distinguishes option momentum from option value using a double-sort. The rows (cid:28)rst sort stocks into equally weighted quintiles by 12-month option value. Then, the columns sorts by option momentum. The value e(cid:27)ect is quite strong, and returns are almost monotonic in every column. But they are also almost monotonic in every row. The average excess return on the quintile spread of high momentum minus low momentum across all stocks exceeds 12% per month, and is largely unchanged when adjusted for risk factors. It appears that the e(cid:27)ect of option momentum is distinct from 20 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 40,
    "chunk_index": 32,
    "word_count": 286,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "in every row. The average excess return on the quintile spread of high momentum minus low momentum across all stocks exceeds 12% per month, and is largely unchanged when adjusted for risk factors. It appears that the e(cid:27)ect of option momentum is distinct from 20 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 40,
    "chunk_index": 33,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "previously documented pro(cid:28)tability of option value. While option momentum is not subsumed by option value, it may capture some e(cid:27)ects overlapped with previously documented option return predictors. To control for these variables, we put them along with option momentum into a vector Z (t−1), which i is known at month t−1. We then run a cross-section regression r (t) = γ +γ(cid:48) Z (t−1)+(cid:15) (t), (13) i 0,t k,t i i where: r (t) is the excess return of equity-VIX portfolio over risk-free rate; the vector i γ(cid:48) represents coe(cid:30)cients for the option return predictors. The controlled variables k,t include HV-IV (volatility deviation in Goyal and Saretto (2009)), IVOL (idiosyncratic volatility in Cao and Han (2013)), Slope_VTS (slope of implied volatility term struc- tures in Vasquez (2017)), VOV (volatility of volatility constructed using option implied volatilities in Cao et al. (2019)), RN_Skew (risk-neutral skewness in Bakshi et al. (2003)), Option Demand (option demand pressure calculated as the ratio of the av- erage option open interest times |∆| of option contracts over the past week to the total stock trading volume over the past week), Amihud (Amihud illiquidity measure (Amihud (2002))), and stock characteristics including (cid:28)rm size, book-to-market ratio, past one month stock return, stock return momentum, analyst forecast dispersion, cash holding, pro(cid:28)tability, and stock issues constructed as Cao et al. (2020). To check the robustnessofresults, wealsousedelta-hedgedat-the-money(ATM)callandputreturns (calculated as Bakshi and Kapadia (2003)) as the dependent variable, respectively. Table 7 reports the time-series averages of γ coe(cid:30)cients and their t-statistics, cor- 21 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 40,
    "chunk_index": 34,
    "word_count": 256,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "analyst forecast dispersion, cash holding, pro(cid:28)tability, and stock issues constructed as Cao et al. (2020). To check the robustnessofresults, wealsousedelta-hedgedat-the-money(ATM)callandputreturns (calculated as Bakshi and Kapadia (2003)) as the dependent variable, respectively. Table 7 reports the time-series averages of γ coe(cid:30)cients and their t-statistics, cor- 21 Electronic copy available at: https://ssrn.com/abstract=3705573 rectedforautocorrelationfollowingNeweyandWest(1987)withthreelags. Controlling for all of these option return predictors only moderately reduces the option momentum coe(cid:30)cient from 0.152 to 0.115. Results using delta-hedged call and put returns display very similar pattern. Option momentum remains highly pro(cid:28)table and statistically sig- ni(cid:28)cant. We conclude that returns to option momentum are substantially independent of the option return predictors documented in previous literature. 5 Transaction Cost Analysis Equity options have large trading costs. The median percentage bid-ask spread of our equity-VIX portfolios, de(cid:28)ned as absolute bid-ask spread divided by the mid-point price of equity-VIX portfolio, is 14%. Such large trading costs might eliminate the pro(cid:28)ts on option strategies if mispricing lies entirely within the bid-ask spread. Margin requirements are another type of friction. Santa-Clara and Saretto (2009) show that margin requirements limit the notional amount of capital that can be invested in option strategies. Therefore, Table 8 evaluates the e(cid:27)ect of these two trading frictions. Table 8 uses the decile spread strategies from the (cid:28)rst row of Table 4, forming monthly momentum portfolio based on \"All\" returns within the last year. The \"0%\" in the (cid:28)rst column of Table 8 measures option prices at the mid-point of bid-ask quotes, just as in Table 4. The last column uses the full quoted bid-ask spreads. The inter- mediate columns use 50% and 75% of the quoted bid-ask spread around the mid-point prices. Table 8, Panel A shows that the \"All\", \"Quarterly\", and \"Non-Quarterly\" strategies 22 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 40,
    "chunk_index": 35,
    "word_count": 294,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "quotes, just as in Table 4. The last column uses the full quoted bid-ask spreads. The inter- mediate columns use 50% and 75% of the quoted bid-ask spread around the mid-point prices. Table 8, Panel A shows that the \"All\", \"Quarterly\", and \"Non-Quarterly\" strategies 22 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 40,
    "chunk_index": 36,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "remain pro(cid:28)table for trading costs equal to 50% of the quoted bid-ask spread. When costs exceed 75% of the bid-ask spread, the \"All\" and \"Quarterly\" strategies earn insigni(cid:28)cant pro(cid:28)ts, and the \"Non-Quarterly\" strategy loses insigni(cid:28)cant money. When paying full bid-ask spreads, all the strategies lose money. Muravyev and Pearson (2019) show that the average e(cid:27)ective bid-ask spread ratio for trades taking into account of high frequency trade timing ability is around 50%. In the presence of bid-ask spreads, one could just trade the cheaper options. A simple strategy is to restrict trades to equity-VIX portfolio with percentage bid-ask spreads below the sample median of 14%. Panel B shows that this restriction hardly changes average pro(cid:28)ts when trading at the mid-point of the bid-ask spread. Indeed, this restriction insubstantially improves the mid-point pro(cid:28)ts from momentum based on \"All\" months from 16.1% to 17.0%. Using mid-point returns, restricting the sample increases the volatility and lowers the t-statistic due to a smaller sample of available (cid:28)rms. But it substantially improves pro(cid:28)ts when paying transactions costs. Even when paying the full bid-ask spread, the \"All\" strategy earns 9.1% per month, and the \"Quarterly\" strategy earns 7.1% per month. These post-trading-cost pro(cid:28)ts are positive at the 1% level of statistical signi(cid:28)cance. We conclude that with appropriate trade execution, the post-transactions cost momentum strategies preserve about half the mid-point trading pro(cid:28)ts. Since our option momentum strategy sells options in loser portfolios, we investigate the impact of margin requirements. We compute margins of the option positions in loser portfolios following the CME margin system, which is applied to institutional investors’ margin accounts. Speci(cid:28)cally, we implement the scenario analysis algorithm 23 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 40,
    "chunk_index": 37,
    "word_count": 278,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "momentum strategy sells options in loser portfolios, we investigate the impact of margin requirements. We compute margins of the option positions in loser portfolios following the CME margin system, which is applied to institutional investors’ margin accounts. Speci(cid:28)cally, we implement the scenario analysis algorithm 23 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 40,
    "chunk_index": 38,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "used in Goyal and Saretto (2009). Each day, we use ±15% as the range for stock price movement, with progressive increments of 3%, and ±10% as the range for level of volatility. We then calculate option positions using the Black and Scholes (1973) model under each scenario, and determine the margin by the largest loss among those scenarios. The initial margin haircut ratio is de(cid:28)ned as M0−V0, where M is the initial margin V0 0 of option positions in the (cid:28)rm’s VIX portfolio when the trade is implemented, and V 0 equals the sum of option prices when the position is opened. Since additional margin calls may occur after the position is established, we also report the maximum haircut ratio during the holding month. Since the loser portfolio is equally weighted, we cal- culate the portfolio-level margin haircut by taking an equal-weighted average of the haircuts for individual (cid:28)rms. Panel C reports the margin haircut ratio of shorting the loser portfolio in our \"All\" 9 strategy. The initial haircut ratio has an average of 3.18 and maximum value of 6.64. For each dollar of written options, investors need to borrow $3.18, on average, to satisfy the initial margin requirement, which limits investors’ option exposure to 31% of their capital. Duringtheholdingperiodafterportfolioformation, themaximumhaircutratio has an average of 4.77 and maximum value of 8.94. To further explore the impact of margins on option momentum returns, we check the correlation between initial haircut andthemomentumstrategyreturnduringthesubsequentholdingperiod. Thetwohave a correlation of -0.27, which means initial haircuts tend to be high when the subsequent 9 As a benchmark, Santa-Clara and Saretto (2009) (cid:28)nd that the initial margin of writing an ATM index put has an average of 2.6 and maximum value of 11.6. 24 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 40,
    "chunk_index": 39,
    "word_count": 291,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "a correlation of -0.27, which means initial haircuts tend to be high when the subsequent 9 As a benchmark, Santa-Clara and Saretto (2009) (cid:28)nd that the initial margin of writing an ATM index put has an average of 2.6 and maximum value of 11.6. 24 Electronic copy available at: https://ssrn.com/abstract=3705573 strategy returns are low. In this sense, the initial margins actually lower investors’ ex- posure to potential negative momentum returns and alleviate the \"momentum crashes\" documented by Daniel and Moskowitz (2016). To measure the joint impact of bid-ask spreads and margin requirements faced by institutional investors, we compute monthly returns from investing the inverse initial margin ratio, V0 , in our 12-month option momentum strategy, and allocating the M0−V0 remainder to the risk-free asset. We also assume investors face 50% e(cid:27)ective bid-ask spread. Panel C reports the results in the \"Return (%)\" column. The average monthly return equals 4.53% with a t-statistic of 4.59. The minimum return is -31.17%. The annual Sharpe Ratio is 1.00. Therefore, option momentum strategies are pro(cid:28)table after considering both margins and reasonable bid-ask spreads, with a mild monthly maximum loss. 6 Conclusions This paper develops a new methodology to calculate exact returns on model-free VIX portfolios with a model-free dynamic hedge. This allows us to explore a large panel of option returns across di(cid:27)erent stocks. The new methodology preserves the intuition of continuous-time variance swaps; it decomposes returns into realized variance and implied variance. This enables a comparison of the dynamics of realized variance with the dynamics of implied variance. We (cid:28)nd that a variety of momentum strategies are pro(cid:28)table across options on individual stocks. Option momentum is a measure of historical option returns, i.e., 25 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 40,
    "chunk_index": 40,
    "word_count": 286,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "and implied variance. This enables a comparison of the dynamics of realized variance with the dynamics of implied variance. We (cid:28)nd that a variety of momentum strategies are pro(cid:28)table across options on individual stocks. Option momentum is a measure of historical option returns, i.e., 25 Electronic copy available at: https://ssrn.com/abstract=3705573 realized variance relative to historical option prices. A related measure of option value is realized variance relative to current option prices. Returns to option momentum are distinct from returns to option value, and are not explained by standard risk factors, stock characteristics, or bid-ask spreads. Option momentum has intriguing commonalities and contrasts with stock momen- tum. Momentum in options across S&P 500 (cid:28)rms displays a strong quarterly periodic- ity that matches the Heston and Sadka (2008) pattern of momentum within one year, but does not match the Heston and Sadka annual pattern for long-term momentum. Unlike stocks, options do not show long-term reversal of momentum pro(cid:28)ts. Instead, option momentum, particularly quarterly momentum, remains pro(cid:28)table for up to (cid:28)ve years. It is tempting to speculate about risk factors or behavioral biases that might explain returns to option momentum. A successful theory would explain the quarterly pattern in options, and why the patterns of momentum pro(cid:28)ts are di(cid:27)erent in stocks and options. 26 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "Document",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 40,
    "chunk_index": 41,
    "word_count": 216,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "to (cid:28)ve years. It is tempting to speculate about risk factors or behavioral biases that might explain returns to option momentum. A successful theory would explain the quarterly pattern in options, and why the patterns of momentum pro(cid:28)ts are di(cid:27)erent in stocks and options. 26 Electronic copy available at: https://ssrn.com/abstract=3705573 [1] Amihud, Y., 2002. Illiquidity and stock returns: cross-section and time-series e(cid:27)ects. Journal of Financial Markets, 5(1), pp.31-56. [2] Asness, C.S., Moskowitz, T.J. and Pedersen, L.H., 2013. Value and momentum everywhere. The Journal of Finance, 68(3), pp.929-985. [3] Bakshi, G. and Kapadia, N., 2003. Delta-hedged gains and the negative market volatility risk premium. The Review of Financial Studies, 16(2), pp.527-566. [4] Bakshi, G., Kapadia, N. and Madan, D., 2003. Stock return characteristics, skew laws, and the di(cid:27)erential pricing of individual equity options. The Review of Financial Studies, 16(1), pp.101- 143. [5] Black, F. and Scholes, M., 1973. The pricing of options and corporate liabilities. Journal of Political Economy, 81(3), pp.637-654. [6] Britten-Jones,M.andNeuberger,A.,2000.Optionprices,impliedpriceprocesses,andstochastic volatility. The Journal of Finance, 55(2), pp.839-866. [7] Cao, J. and Han, B., 2013. Cross section of option returns and idiosyncratic stock volatility. Journal of Financial Economics, 108(1), pp.231-249. [8] Cao, J., Han, B., Tong, Q. and Zhan, X., 2020, June. Option return predictability. In 27th An- nual Conference on Financial Economics and Accounting Paper, Rotman School of Management Working Paper (No. 2698267). [9] Cao, J., Vasquez, A., Xiao, X. and Zhan, X., 2019. Volatility uncertainty and the cross-section of option returns. Available at SSRN 3178263. [10] Carhart,M.M.,1997.Onpersistenceinmutualfundperformance.TheJournalofFinance,52(1), pp.57-82. [11] Carr, P., and D.Madan. 1998. Towards a Theory of Volatility Trading, in R. Jarrow (ed.), Risk Book on Volatility. New York: Risk, pp. 417-27. 27 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "References",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 40,
    "chunk_index": 42,
    "word_count": 282,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "and Zhan, X., 2019. Volatility uncertainty and the cross-section of option returns. Available at SSRN 3178263. [10] Carhart,M.M.,1997.Onpersistenceinmutualfundperformance.TheJournalofFinance,52(1), pp.57-82. [11] Carr, P., and D.Madan. 1998. Towards a Theory of Volatility Trading, in R. Jarrow (ed.), Risk Book on Volatility. New York: Risk, pp. 417-27. 27 Electronic copy available at: https://ssrn.com/abstract=3705573 [12] Carr,P.andWu,L.,2009.VarianceRiskPremiums.ReviewofFinancialStudies,22(3),pp.1311- 1341. [13] Canina, L. and Figlewski, S., 1993. The informational content of implied volatility. The Review of Financial Studies, 6(3), pp.659-681. [14] CBOE, 2019, VIX White Paper. Chicago Board of Options Exchange. [15] Christensen,B.J.andPrabhala,N.R.,1998.Therelationbetweenimpliedandrealizedvolatility. Journal of Financial Economics, 50(2), pp.125-150. [16] Christo(cid:27)ersen,P.,Fournier,M.andJacobs,K.,2017.Thefactorstructureinequityoptions.The Review of Financial Studies, 31(2), pp.595-637. [17] Conrad, J., Dittmar, R.F. and Ghysels, E., 2013. Ex ante skewness and expected stock returns. The Journal of Finance, 68(1), pp.85-124. [18] Daniel, K. and Moskowitz, T.J., 2016. Momentum crashes. Journal of Financial Economics, 122(2), pp.221-247. [19] Day, T.E. and Lewis, C.M., 1992. Stock market volatility and the information content of stock index options. Journal of Econometrics, 52(1-2), pp.267-287. [20] DeBondt,W.F.andThaler,R.,1985.Doesthestockmarketoverreact?.TheJournalofFinance, 40(3), pp.793-805. [21] De Bondt, W.F. and Thaler, R.H., 1987. Further evidence on investor overreaction and stock market seasonality. The Journal of Finance, 42(3), pp.557-581. [22] Demeter(cid:28), K., Derman, E., Kamal, M. and Zou, J., 1999. A guide to volatility and variance swaps. The Journal of Derivatives, 6(4), pp.9-32. [23] Driessen, J., Maenhout, P.J. and Vilkov, G., 2009. The price of correlation risk: Evidence from equity options. The Journal of Finance, 64(3), pp.1377-1406. [24] Eisdorfer,AssafandSadka,RonnieandZhdanov,Alexei,MaturityDrivenMispricingofOptions (April 1, 2017). 28 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "References",
    "page_number": 28,
    "page_range": "p.28-29",
    "total_pages": 40,
    "chunk_index": 43,
    "word_count": 246,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.28-29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "J., 1999. A guide to volatility and variance swaps. The Journal of Derivatives, 6(4), pp.9-32. [23] Driessen, J., Maenhout, P.J. and Vilkov, G., 2009. The price of correlation risk: Evidence from equity options. The Journal of Finance, 64(3), pp.1377-1406. [24] Eisdorfer,AssafandSadka,RonnieandZhdanov,Alexei,MaturityDrivenMispricingofOptions (April 1, 2017). 28 Electronic copy available at: https://ssrn.com/abstract=3705573 [25] Fama, E.F. and French, K.R., 1988. Permanent and temporary components of stock prices. Journal of Political Economy, 96(2), pp.246-273. [26] Fama, E.F. and French, K.R., 2015. A (cid:28)ve-factor asset pricing model. Journal of Financial Eco- nomics, 116(1), pp.1-22. [27] Fleming, J., 1998. The quality of market volatility forecasts implied by S&P 100 index option prices. Journal of Empirical Finance, 5(4), pp.317-345. [28] Giglio, S. and Kelly, B., 2017. Excess volatility: Beyond discount rates. The Quarterly Journal of Economics, 133(1), pp.71-127. [29] Goyal,A.andSaretto,A.,2009.Cross-sectionofoptionreturnsandvolatility.JournalofFinancial Economics, 94(2), pp.310-326. [30] Gri(cid:30)n, J.M., Ji, X. and Martin, J.S., 2003. Momentum investing and business cycle risk: Evi- dence from pole to pole. The Journal of Finance, 58(6), pp.2515-2547. [31] Grundy, B.D. and Martin, J.S.M., 2001. Understanding the nature of the risks and the source of the rewards to momentum investing. The Review of Financial Studies, 14(1), pp.29-78. [32] Heston, S.L. and Sadka, R., 2008. Seasonality in the cross-section of stock returns. Journal of Financial Economics, 87(2), pp.418-445. [33] Jegadeesh,N.,1990.Evidenceofpredictablebehaviorofsecurityreturns.TheJournalofFinance, 45(3), pp.881-898. [34] Jegadeesh, N. and Titman, S., 1993. Returns to buying winners and selling losers: Implications for stock market e(cid:30)ciency. The Journal of Finance, 48(1), pp.65-91. [35] Jegadeesh, N. and Titman, S., 2011. Momentum. Annual Review of Financial Economics, 3(1), pp.493-509. [36] Jiang, G.J. and Tian, Y.S., 2005. The model-free implied volatility and its information content. The Review of Financial Studies, 18(4), pp.1305-1342. [37] Jones, Christopher S. and Khorram, Mehdi and Mo, Haitao, Momentum, Reversal, and Season- ality in Option Returns (November 16, 2020). 29 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "References",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 40,
    "chunk_index": 44,
    "word_count": 305,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "pp.493-509. [36] Jiang, G.J. and Tian, Y.S., 2005. The model-free implied volatility and its information content. The Review of Financial Studies, 18(4), pp.1305-1342. [37] Jones, Christopher S. and Khorram, Mehdi and Mo, Haitao, Momentum, Reversal, and Season- ality in Option Returns (November 16, 2020). 29 Electronic copy available at: https://ssrn.com/abstract=3705573 [38] Jostova, G., Nikolova, S., Philipov, A. and Stahel, C.W., 2013. Momentum in corporate bond returns. The Review of Financial Studies, 26(7), pp.1649-1693. [39] Lamoureux, C.G. and Lastrapes, W.D., 1993. Forecasting stock-return variance: Toward an understanding of stochastic implied volatilities. The Review of Financial Studies, 6(2), pp.293- 326. [40] Moskowitz, T.J. and Grinblatt, M., 1999. Do industries explain momentum?. The Journal of Finance, 54(4), pp.1249-1290. [41] Muravyev, D. and Pearson, N.D., 2019. Option trading costs are lower than you think. Available at SSRN 2580548. [42] Newey,W.,West,K.,1987.Asimple,positivesemi-de(cid:28)nite,heteroskedasticityandautocorrelation consistent covariance matrix. Econometrica 55, 703-708. [43] Rouwenhorst, K.G., 1998. International momentum strategies. The Journal of Finance, 53(1), pp.267-284. [44] Santa-Clara, P. and Saretto, A., 2009. Option strategies: Good deals and margin calls. Journal of Financial Markets, 12(3), pp.391-417. [45] Vasquez, A., 2017. Equity volatility term structures and the cross section of option returns. Journal of Financial and Quantitative Analysis, 52(6), pp.2727-2754. 30 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "References",
    "page_number": 30,
    "page_range": "p.30-31",
    "total_pages": 40,
    "chunk_index": 45,
    "word_count": 204,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.30-31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "pp.267-284. [44] Santa-Clara, P. and Saretto, A., 2009. Option strategies: Good deals and margin calls. Journal of Financial Markets, 12(3), pp.391-417. [45] Vasquez, A., 2017. Equity volatility term structures and the cross section of option returns. Journal of Financial and Quantitative Analysis, 52(6), pp.2727-2754. 30 Electronic copy available at: https://ssrn.com/abstract=3705573 Table 1: Summary Statistics of Equity-VIX Returns The sample data are from January 1996 to December 2017. We select (cid:28)rms that were included in the S&P 500 index during that period. There are 263 months of returns and 79,854 (cid:28)rm-month observations in total. Equity-VIX Return is the actual realized return of underlying equity-VIX portfolio, constructed as a static position in a basket of options plus a daily rebalanced position in the underlying stock. Variance Swap Return (VSR) is de(cid:28)ned as the realized variance of the stock return dividedbythepriceoftheequity-VIX portfoliominus1. Equity-VIX Return-VSRisthedi(cid:27)erence between equity-VIX return and variance swap return. Index-VIX Return is the VIX return of S&P 500 Index. EW Equity-VIX Return is the cross sectional average of equity-VIX returns each month. EW Variance Swap Return is the cross sectional average of (cid:28)rms’ variance swap returns each month. Black-Scholes Delta Elasticity is the elasticity of equity-VIX portfolio with respect to the underlying stock price at the formation date. β is the exposure of the (cid:28)rm equity VIX return to its stock Stock return;β istheexposureof(cid:28)rms’equity-VIX returnstotheS&P 500indexreturn;β is SP500 MKT VIX the exposure of (cid:28)rm equity-VIX returns to the S&P 500 index VIX return. Correlation(Equity VIX Return,VSR) is the (cid:28)rm level time-series correlation between equity-VIX returns and variance swap returns. When calculating β , β , β and Correlation(Equity-VIX Return, VSR), we Stock SP500 MktVIX require (cid:28)rms to have at least 30 observations. There are 650 (cid:28)rms meeting this requirement. Mean Std 5% 25% 50% 75% 95% Panel A: Individual (cid:28)rms. Number of Firms Each Month 304 111 147 203 293 411 468 Number of Strikes 6.71 4.90 4.00 4.00 6.00 8.00 14.00 Equity-VIX Return (%) -4.19 85.52 -69.18 -42.78 -19.49 14.73 115.1 Variance Swap Return (VSR) (%) -2.64 101.9 -71.66 -48.74 -24.73 11.73 126.3 Black-Scholes Delta Elasticity -0.05 0.09 -0.17 -0.07 -0.04 -0.02 0.00 Panel B: Time series of S&P 500 Index and equally weighted (EW) portfolio. Index-VIX Return(%) -23.24 72.66 -73.10 -56.43 -37.18 -13.80 65.52 Index Variance Swap Return(%) -24.35 74.19 -74.72 -58.32 -38.75 -13.11 60.02 EW Equity-VIX Return (%) -3.46 32.85 -38.03 -22.88 -9.87 6.64 56.13 EW Variance Swap Return (%) -3.23 44.19 -39.80 -26.13 -12.02 5.66 67.08 Panel C Correlation(Equity-VIX Return, VSR) 0.75 0.31 0.13 0.69 0.87 0.95 0.99 β -2.24 2.55 -6.37 -3.36 -2.07 -0.98 1.06 Stock β -4.02 3.50 -9.75 -5.98 -3.82 -1.96 1.18 SP500 β 0.40 0.31 -0.06 0.24 0.38 0.55 0.85 MktVIX 31 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "References",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 40,
    "chunk_index": 46,
    "word_count": 454,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "-39.80 -26.13 -12.02 5.66 67.08 Panel C Correlation(Equity-VIX Return, VSR) 0.75 0.31 0.13 0.69 0.87 0.95 0.99 β -2.24 2.55 -6.37 -3.36 -2.07 -0.98 1.06 Stock β -4.02 3.50 -9.75 -5.98 -3.82 -1.96 1.18 SP500 β 0.40 0.31 -0.06 0.24 0.38 0.55 0.85 MktVIX 31 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "References",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 40,
    "chunk_index": 47,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "Table 2: Option Momentum Strategy Returns The momentum portfolios are formed based on J-month lagged equity-VIX returns and held for K months as in Jegadeesh and Titman (1993). In addition, we require the (cid:28)rms to have non-missing equity-VIX returns for at least 2J past months. The values of J and K for the di(cid:27)erent strategies 3 are indicated in the (cid:28)rst column and row, respectively. To avoid forward-looking bias, we only include (cid:28)rms that are included in the S&P 500 index when we form the portfolio. The portfolios are equally weighted. The average monthly returns of these portfolios are presented in this table. The t-statistics are reported in parentheses. Portfolio returns are expressed in percent. The sample period is from January 1996 to December 2017. J K= 3 6 9 12 3 Loser -7.88 -6.81 -6.41 -6.42 (-3.53) (-3.09) (-2.95) (-2.94) 3 Winner 2.74 0.52 -0.93 -1.46 (1.00) (0.21) (-0.39) (-0.62) 3 Winner-Loser 10.63 7.32 5.49 4.96 (5.90) (5.44) (4.67) (4.43) 6 Loser -8.15 -7.69 -7.03 -7.10 (-3.48) (-3.36) (-3.08) (-3.15) 6 Winner 1.93 0.37 -0.74 -1.02 (0.69) (0.14) (-0.30) (-0.41) 6 Winner-Loser 10.08 8.05 6.29 6.08 (5.09) (4.93) (4.06) (4.22) 9 Loser -7.89 -7.61 -7.65 -7.17 (-3.07) (-3.16) (-3.27) (-3.09) 9 Winner 1.63 1.05 -0.01 -0.31 (0.60) (0.40) (-0.00) (-0.12) 9 Winner-Loser 9.52 8.67 7.64 6.86 (4.67) (4.82) (4.34) (4.19) 12 Loser -5.60 -7.18 -6.91 -7.15 (-2.22) (-2.91) (-2.83) (-3.02) 12 Winner 1.21 0.40 -0.17 -0.91 (0.43) (0.15) (-0.07) (-0.36) 12 Winner-Loser 7.21 7.58 6.74 6.24 (3.27) (3.95) (3.68) (3.57) 32 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "References",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 40,
    "chunk_index": 48,
    "word_count": 257,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "(0.60) (0.40) (-0.00) (-0.12) 9 Winner-Loser 9.52 8.67 7.64 6.86 (4.67) (4.82) (4.34) (4.19) 12 Loser -5.60 -7.18 -6.91 -7.15 (-2.22) (-2.91) (-2.83) (-3.02) 12 Winner 1.21 0.40 -0.17 -0.91 (0.43) (0.15) (-0.07) (-0.36) 12 Winner-Loser 7.21 7.58 6.74 6.24 (3.27) (3.95) (3.68) (3.57) 32 Electronic copy available at: https://ssrn.com/abstract=3705573 (a) Coe(cid:30)cients of log(RV ) and log(VIX2 ) i,t−k i,t−k (b) Coe(cid:30)cients of log(1+VSR ) i,t−k Figure 1. Monthly univariate cross-sectional regression of the form x = α +γ ·x +ε , i,t k,t k,t i,t−k i,t are calculated for each month t and lag k, where x is either the logarithm of realized variance (RV), i,t logarithm of the price of equity-VIX portfolio, or the logarithm of the variance swap return (VSR) of (cid:28)rmiinmontht. TheregressioniscalculatedforeverymonthtfromJanuary1996throughDecember 2017 and for lag k values of 1 through 60. Figures (a) and (b) plot the time-series averages of γ . k,t 33 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "References",
    "page_number": 33,
    "page_range": "p.33-34",
    "total_pages": 40,
    "chunk_index": 49,
    "word_count": 154,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.33-34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "variance (RV), i,t logarithm of the price of equity-VIX portfolio, or the logarithm of the variance swap return (VSR) of (cid:28)rmiinmontht. TheregressioniscalculatedforeverymonthtfromJanuary1996throughDecember 2017 and for lag k values of 1 through 60. Figures (a) and (b) plot the time-series averages of γ . k,t 33 Electronic copy available at: https://ssrn.com/abstract=3705573 Table 3: Univariate and Multivariate Cross-sectional Regressions of Vari- ance Swap Returns Monthly univariate cross-sectional regression of the form r =α +γ ·r +ε , are calculated i,t k,t k,t i,t−k i,t for each month t and lag k, where r is the continuously compounded variance swap return of (cid:28)rm i,t i in month t. The regression is calculated for every month t from January 1996 through December 2017andforlagk values1through12. Monthlymultivariatecross-sectionalregressiontakestheform: r = α + (cid:80)12 γ ·r +ε . To avoid forward-looking bias, we only include (cid:28)rms that are i,t k,t k=1 k,t i,t−k i,t includedintheS&P 500 indexwhenweformtheportfolio. Thetime-seriesaveragesofγ alongwith k,t their t-statistics, are reported in the table. Univariate Multivariate Lag Coe(cid:30)cient t-statistic Coe(cid:30)cient t-statistic 1 0.085 7.85 0.043 2.24 2 0.089 9.65 0.026 1.93 3 0.125 11.26 0.053 3.10 4 0.087 8.74 0.049 2.34 5 0.073 6.93 0.030 2.21 6 0.099 9.83 0.046 2.95 7 0.073 9.24 0.013 0.51 8 0.080 9.35 0.023 1.05 9 0.092 10.46 0.078 3.93 10 0.068 6.93 0.027 1.42 11 0.068 7.51 0.019 1.49 12 0.099 11.30 0.050 3.73 34 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "References",
    "page_number": 34,
    "page_range": "p.34-35",
    "total_pages": 40,
    "chunk_index": 50,
    "word_count": 232,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.34-35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "0.087 8.74 0.049 2.34 5 0.073 6.93 0.030 2.21 6 0.099 9.83 0.046 2.95 7 0.073 9.24 0.013 0.51 8 0.080 9.35 0.023 1.05 9 0.092 10.46 0.078 3.93 10 0.068 6.93 0.027 1.42 11 0.068 7.51 0.019 1.49 12 0.099 11.30 0.050 3.73 34 Electronic copy available at: https://ssrn.com/abstract=3705573 Table 4: Returns of Strategies Based on Past Variance Swap Returns Every month (cid:28)rms are grouped into ten portfolios according to various categories based on the geo- metric average of past variance swap returns. To avoid forward-looking bias, we only include (cid:28)rms thatareincludedintheS&P 500indexwhenweformtheportfolio. Forexample,thetradingstrategy that is formed based on past quarterly returns during Year 2 ranks (cid:28)rms according to their average log variance swap returns over historical monthly lags 15, 18, 21, and 24. The trading strategy \"All\" in a given year is formed based on each (cid:28)rm’s average log variance swap return over that lagged year. The equity-VIX’s in each portfolio are equally weighted across (cid:28)rms, and portfolios are rebalanced monthly. To calculate alpha, we control for the VIX return of the S&P 500 index, (cid:28)ve Fama and French (2015) risk factors, and the Carhart (1997) stock momentum factor. The average monthly re- turnsoftheseportfoliosarepresentedinpercent,witht-statisticsreportedinparentheses. Thesample period is from January 1996 through December 2017. Strategy 1 2 3 4 5 6 7 8 9 10 10-1 Alpha Year1 All -13.47 -7.82 -4.82 -3.56 -4.86 -1.58 -1.77 0.00 1.44 2.65 16.13 16.92 (8.42) (8.21) Quarterly -12.56 -6.97 -5.62 -2.26 -3.23 -2.47 0.72 -0.10 -0.67 2.21 14.77 15.39 (8.75) (8.71) Non-Quarterly -11.51 -6.57 -5.56 -2.73 -2.61 -1.31 -2.17 -0.84 0.71 0.13 11.64 11.52 (6.49) (5.99) Year2 All -9.10 -4.24 -5.13 -3.45 -2.32 -3.78 -3.97 -2.96 -1.75 -1.20 7.90 5.75 (3.98) (2.74) Quarterly -7.26 -6.95 -2.98 -4.23 -4.62 -2.94 -1.23 -1.09 -3.85 0.54 7.80 8.27 (4.21) (4.15) Non-Quarterly -5.92 -5.09 -6.36 -2.31 -3.52 -3.25 -1.17 -3.51 -3.50 -2.63 3.29 1.34 (1.48) (0.57) Year3 All -7.72 -5.87 -5.67 -3.70 -6.22 -4.87 -2.65 -5.45 -3.66 -3.63 4.09 2.01 (2.03) (0.94) Quarterly -7.05 -7.91 -6.08 -6.67 -5.44 -4.10 -2.16 -2.38 -2.56 -3.84 3.21 2.88 (1.83) (1.52) Non-Quarterly -6.95 -4.60 -4.26 -4.58 -4.37 -5.44 -4.30 -3.79 -4.47 -5.21 1.73 0.06 (0.97) (0.03) Year4 All -7.15 -5.63 -5.42 -4.95 -4.61 -4.76 -5.33 -4.81 -6.36 -4.21 2.94 3.11 (1.68) (1.65) Quarterly -7.12 -5.41 -4.02 -5.71 -4.85 -5.78 -7.31 -5.47 -3.75 -1.81 5.31 4.85 (2.96) (2.50) Non-Quarterly -6.11 -6.13 -4.35 -4.85 -4.46 -7.06 -4.64 -4.56 -5.45 -5.84 0.26 -0.67 (0.15) (-0.34) Year5 All -6.54 -7.66 -8.57 -8.07 -5.62 -7.73 -6.14 -6.84 -5.25 -3.55 2.99 0.18 (1.26) (0.07) Quarterly -9.89 -8.51 -6.82 -5.93 -7.63 -5.58 -7.55 -5.78 -5.99 -3.89 6.00 5.39 (3.46) (2.86) Non-Quarterly -6.24 -6.42 -6.60 -10.19 -8.13 -6.51 -7.45 -5.39 -3.91 -4.90 1.34 -0.94 (0.65) (-0.343) 35 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "References",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 40,
    "chunk_index": 51,
    "word_count": 454,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "-6.54 -7.66 -8.57 -8.07 -5.62 -7.73 -6.14 -6.84 -5.25 -3.55 2.99 0.18 (1.26) (0.07) Quarterly -9.89 -8.51 -6.82 -5.93 -7.63 -5.58 -7.55 -5.78 -5.99 -3.89 6.00 5.39 (3.46) (2.86) Non-Quarterly -6.24 -6.42 -6.60 -10.19 -8.13 -6.51 -7.45 -5.39 -3.91 -4.90 1.34 -0.94 (0.65) (-0.343) 35 Electronic copy available at: https://ssrn.com/abstract=3705573 Table 5: Risk-adjusted Option Momentum Returns Optionmomentumportfoliosareformedbysorting(cid:28)rms’geometricaverageofall12monthlyvariance swap returns over the past year, the same as the (cid:28)rst row in Table 4. The table presents results from the following time-series regression: r =α +β ·F +ε , where r is the monthly excess return p,t p p t p,t p,t of loser, winner, and long-short portfolio, respectively. F is a vector of risk factors including: the t return of S&P 500 Index VIX portfolio in excess of the risk-free rate, the Fama and French (2015) (cid:28)ve factors (MKT-Rf, SMB, HML, RMW, and CMA), and the Carhart (1997) momentum factor (Stock MOM). Coe(cid:30)cient estimates are reported with the associated t-statistics in parentheses. ***, **, and * denote signi(cid:28)cance at 1%, 5%, and 10%, respectively. Loser Winner W-L Alpha -0.051∗∗∗ 0.119∗∗∗ 0.169∗∗∗ (-3.63) (5.99) (8.21) Index VIX Ret-Rf 0.345∗∗∗ 0.395∗∗∗ 0.050 (15.85) (12.81) (1.56) MKT-Rf -0.397 -0.002 0.395 (-1.05) (-0.00) (0.71) SMB -0.962∗ -1.237 -0.275 (-1.82) (-1.65) (-0.35) HML -0.653 0.141 0.794 (-1.34) (0.20) (1.10) RMW -0.096 0.543 0.639 (-0.15) (0.61) (0.69) CMA -0.049 -1.231 -1.182 (-0.06) (-1.04) (-0.95) Stock MOM 0.022 -0.047 -0.069 (0.11) (-0.17) (-0.24) Adj.R2 0.637 0.517 -0.004 36 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "References",
    "page_number": 36,
    "page_range": "p.36-37",
    "total_pages": 40,
    "chunk_index": 52,
    "word_count": 245,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.36-37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "0.395 (-1.05) (-0.00) (0.71) SMB -0.962∗ -1.237 -0.275 (-1.82) (-1.65) (-0.35) HML -0.653 0.141 0.794 (-1.34) (0.20) (1.10) RMW -0.096 0.543 0.639 (-0.15) (0.61) (0.69) CMA -0.049 -1.231 -1.182 (-0.06) (-1.04) (-0.95) Stock MOM 0.022 -0.047 -0.069 (0.11) (-0.17) (-0.24) Adj.R2 0.637 0.517 -0.004 36 Electronic copy available at: https://ssrn.com/abstract=3705573 Table 6: Average Monthly Returns on Equity-VIX Portfolios Sorted on Value and then Momentum Each month, we (cid:28)rst sort (cid:28)rms into quintiles based on option value, de(cid:28)ned as log(RVi,t−12,t), where VIX2 i,t log(RV ) is the geometric average of (cid:28)rm i’s realized variance over the past 12 months. Then, i,t−12,t within each quintile, we sort (cid:28)rms based on option momentum, which is the compound variance swap return over the past 12 months. The \"All\" row shows statistics for portfolios sorted by momentum only, without controlling for value. Portfolios are equally weighted. Portfolio 1 has the lowest value or momentum. To avoid forward-looking bias, we only include (cid:28)rms in the S&P 500 index when we form the portfolio. To compute the alpha of portfolio returns, we control for the Fama and French (2015) (cid:28)ve factors, the Carhart (1997) momentum factor, and the VIX return of the S&P 500 index. Returns are expressed in percent, with t-statistics in parentheses. Momentum Value 1 (Low) 2 3 4 5 (High) 5-1 Alpha 1 (Low) -19.98 -13.66 -12.55 -9.63 -5.84 14.13 15.46 (5.21) (5.48) 2 -9.50 -8.14 -4.14 -5.83 -2.85 6.64 10.15 (2.95) (4.35) 3 -4.41 -4.40 -5.58 -2.90 1.07 5.48 2.99 (2.18) (1.13) 4 -3.23 0.19 0.89 -0.19 2.70 5.93 7.56 (2.04) (2.42) 5 (High) -1.07 5.23 5.39 3.03 7.42 8.49 9.56 (3.00) (3.11) All -10.62 -4.20 -3.22 -0.87 2.04 12.67 12.69 (8.48) (7.93) 37 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "References",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 40,
    "chunk_index": 53,
    "word_count": 286,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "10.15 (2.95) (4.35) 3 -4.41 -4.40 -5.58 -2.90 1.07 5.48 2.99 (2.18) (1.13) 4 -3.23 0.19 0.89 -0.19 2.70 5.93 7.56 (2.04) (2.42) 5 (High) -1.07 5.23 5.39 3.03 7.42 8.49 9.56 (3.00) (3.11) All -10.62 -4.20 -3.22 -0.87 2.04 12.67 12.69 (8.48) (7.93) 37 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "References",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 40,
    "chunk_index": 54,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "Table 7: Option Momentum Controlling for Other Predictors Weestimatethecross-sectionalregression: r =α +γ ·Z +ε ,wherer isthemonthlyequity- i,t t t i,t−1 i,t i,t VIX returns in excess of risk-free rate, and Z(cid:48)s are option return predictors including Option MOM (continuouslycompoundedvarianceswapreturnoverthepast12months),HV-IV(volatilitydeviation in Goyal and Saretto (2009)), IVOL (idiosyncratic volatility in Cao and Han (2013)), Slope_VTS (slope of implied volatility term structures in Vasquez (2017)), VOV (volatility of volatility in Cao et al. (2020)),RN_Skew(risk-neutralskewnessinBakshietal. (2003)),OptionDemand(optiondemand pressure), Amihud (Amihud illiquidity measure over the previous month), and stock characteristics in Cao et al. (2017). Results using delta-hedged ATM call and put returns calculated as Bakshi and Kapadia (2003) are also reported. The associated t-statistics using Newey and West (1987) with three lags are reported in parentheses. ***, **, and * denote signi(cid:28)cance at 1%, 5%, and 10%, respectively. The sample period is from January 1997 to December 2017. Equity-VIX Return Delta-hedged Call Delta-hedged Put (1) (2) (3) (4) (5) (6) Option MOM 0.152∗∗∗ 0.115∗∗∗ 0.007∗∗∗ 0.005∗∗∗ 0.007∗∗∗ 0.005∗∗∗ (7.18) (5.75) (5.52) (6.23) (6.37) (6.13) HV-IV 0.113∗∗ 0.009∗∗∗ 0.009∗∗∗ (2.26) (3.67) (3.74) IVOL -2.629∗∗∗ -0.171∗∗∗ -0.120∗∗∗ (-2.67) (-4.02) (-2.77) Slope_VTS 0.640∗∗∗ 0.046∗∗∗ 0.048∗∗∗ (4.23) (6.93) (7.33) VOV -0.664∗∗∗ -0.012 -0.028∗∗∗ (-3.03) (-1.11) (-2.87) RN_Skew 0.017 -0.001∗∗ 0.002∗∗∗ (1.18) (-2.50) (3.23) Option Demand -0.005∗∗∗ -0.000∗∗∗ -0.000∗∗ (-3.72) (-2.89) (-1.98) Amihud 88.835 1.960 3.350 (1.45) (0.82) (1.29) Size 0.003 -0.000 -0.000 (0.34) (-0.23) (-0.19) Book-to-Market 0.001 0.000 -0.000 (0.18) (0.62) (-0.74) RET -0.171∗∗ -0.009∗∗∗ -0.012∗∗∗ t−1,t (-2.48) (-2.75) (-4.27) RET 0.019 -0.002∗ -0.001 t−12,t−1 (0.72) (-1.90) (-1.27) Analyst Dispersion -0.052 0.002 0.002 (-0.83) (0.69) (0.77) Cash Holding 0.029 -0.000 0.002∗ (1.08) (-0.26) (1.92) Pro(cid:28)tability -0.016 0.001∗ 0.001 (-0.80) (1.81) (0.70) Issue 0.082 0.005∗ 0.005∗∗ (1.62) (1.95) (2.35) Intercept -0.003 0.012 0.001 0.004 -0.003∗∗∗ 0.000 (-0.12) (0.08) (0.63) (0.79) (-3.14) (0.07) adj. R2 0.016 0.072 0.017 0.109 0.019 0.106 38 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "References",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 40,
    "chunk_index": 55,
    "word_count": 306,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "(0.77) Cash Holding 0.029 -0.000 0.002∗ (1.08) (-0.26) (1.92) Pro(cid:28)tability -0.016 0.001∗ 0.001 (-0.80) (1.81) (0.70) Issue 0.082 0.005∗ 0.005∗∗ (1.62) (1.95) (2.35) Intercept -0.003 0.012 0.001 0.004 -0.003∗∗∗ 0.000 (-0.12) (0.08) (0.63) (0.79) (-3.14) (0.07) adj. R2 0.016 0.072 0.017 0.109 0.019 0.106 38 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "References",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 40,
    "chunk_index": 56,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "Table 8: Impact of Transaction Costs Option momentum portfolios are formed as in Table 4. The portfolio returns are computed from the mid-point price and from the e(cid:27)ective bid-ask spread, estimated to be equal to 50%, 75%, and 100% of the quoted spread. In panel B, if the percentage bid-ask spread of VIX portfolio price of a (cid:28)rm is larger than the sample median, we don’t trade the (cid:28)rm that month. All returns are expressed in percent, with t-statistics in parentheses. Panel C reports the margin haircut ratio of shorting loser portfolios. The initial margin haircut is de(cid:28)ned as (M − V )/V , where M is the initial margin 0 0 0 0 of option positions in equity-VIX portfolios when the trade is implemented, and V equals the sum 0 of option prices when the position is opened. Max haircut is the maximum haircut ratio during the month. Correlationbetweeninitialhaircutratioandthesubsequentoptionmomentumstrategyreturn of the month is also reported. The column \"Return (%)\" in Panel C reports the monthly return of momentumstrategy \"All\"with50% e(cid:27)ectivespreadscombined withinitialmarginrequirements. The t-statistics are reported in parenthesis. Panel A: Option momentum returns Percentage of Quoted Bid-Ask Spread 0% 50% 75% 100% All 16.13 6.74 1.86 -3.22 (8.42) (3.62) (1.00) (-1.69) Quarterly 14.77 5.85 1.24 -3.53 (8.75) (3.55) (0.75) (-2.08) Non-Quarterly 11.64 2.52 -2.31 -7.46 (6.49) (1.44) (-1.30) (-4.08) Panel B: Percentage bid-ask spread lower than median. All 17.05 13.25 11.17 9.08 (5.66) (4.48) (3.78) (3.08) Quarterly 13.91 11.53 9.35 7.17 (5.52) (4.08) (3.31) (2.53) Non-Quarterly 11.95 8.13 6.03 3.93 (4.90) (3.43) (2.54) (1.65) Panel C: Margin haircut ratio of loser portfolio. Initial haircut Max haircut Correlation Return (%) Mean 3.18 4.77 -0.27 4.53 (4.59) Std 1.29 1.59 15.64 Min 0.68 1.23 -31.17 Max 6.64 8.94 39 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "References",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 40,
    "chunk_index": 57,
    "word_count": 292,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "(4.08) (3.31) (2.53) Non-Quarterly 11.95 8.13 6.03 3.93 (4.90) (3.43) (2.54) (1.65) Panel C: Margin haircut ratio of loser portfolio. Initial haircut Max haircut Correlation Return (%) Mean 3.18 4.77 -0.27 4.53 (4.59) Std 1.29 1.59 15.64 Min 0.68 1.23 -31.17 Max 6.64 8.94 39 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "References",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 40,
    "chunk_index": 58,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "7 Appendix Table A1: Early Exercise Premium Thistableexaminesthedi(cid:27)erencebetweentheEuropeanoptionreturn-to-expirationandtheAmerican early exercise return of our equity-VIX portfolios. We consider approximate policies that exercise optionsatendofeachdayiftheexercisevalueishigherthan95%, 96%, 97%, 98%and99%oftheask price of the option. Using these policies, there are up to 17,000 (cid:28)rm-month observations with early exercise. To calculate the early-exercise payo(cid:27) of a call option, we borrow the strike price at risk-free rate and hold the stock position to option maturity; to calculate the early exercised payo(cid:27) of a put option, we short-sell the stock and reinvest the payo(cid:27) to maturity at risk-free rate. All dividends are reinvested to maturity at the risk-free rate. TheMeancalculatesthemonthlyaverageerrorbetweentheEuropeanreturnandtheAmericanreturn. All returns are expressed in percent. The standard error (Std) calculates the standard deviation of the error. The mean absolute error (MAE) calculates the monthly average absolute error. Correlation reports the correlation between European return and American return. Panel B shows that the maxi- mum American exercise premium of .355% is achieved with an early-exercise threshold of 96%. This is smaller, by an order of magnitude, than the average European return-to-expiration of -4.19% in the (cid:28)rst row of Table 1 Panel A. We conclude that early exercise is not quantitatively important to our analysis. Panel A: Summary Statistics of European Return and American Return Mean Std 5% 25% 50% 75% 95% European -4.195 85.52 -69.18 -42.78 -19.49 14.73 115.10 American 99% -3.970 85.59 -69.06 -42.56 -19.22 15.01 115.45 American 98% -3.895 85.58 -69.01 -42.49 -19.12 15.11 115.53 American 97% -3.849 85.51 -69.02 -42.42 -19.04 15.19 115.47 American 96% -3.839 85.47 -69.00 -42.38 -19.02 15.20 115.38 American 95% -3.854 85.43 -69.02 -42.38 -19.02 15.19 115.43 Panel B: Early Exercise Premium Mean Std MAE t-statistic Correlation 99% 0.225 4.35 0.627 14.59 0.999 98% 0.299 5.00 0.782 16.91 0.998 97% 0.346 5.77 0.959 16.93 0.998 96% 0.355 6.40 1.099 15.68 0.997 95% 0.341 6.89 1.237 13.98 0.997 40 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "References",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 40,
    "chunk_index": 59,
    "word_count": 311,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  },
  {
    "text": "-42.38 -19.02 15.19 115.43 Panel B: Early Exercise Premium Mean Std MAE t-statistic Correlation 99% 0.225 4.35 0.627 14.59 0.999 98% 0.299 5.00 0.782 16.91 0.998 97% 0.346 5.77 0.959 16.93 0.998 96% 0.355 6.40 1.099 15.68 0.997 95% 0.341 6.89 1.237 13.98 0.997 40 Electronic copy available at: https://ssrn.com/abstract=3705573",
    "title": "Option Momentum",
    "source_type": "pdf",
    "document_id": "54431de6770e",
    "source_file": "Option Momentum.pdf",
    "section": "References",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 40,
    "chunk_index": 60,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210131112732-05'00'",
    "duration": null
  }
]