[
  {
    "text": "Option Pricing in the Real World: A Generalized Binomial Model with Applications to Real Options 1 Tom Arnold|Robins School of Business, University of Richmond.2 Timothy Falcon Crack|Barclays Global Investors, London. Abstract Weextendapopularbinomialmodeltoallowforoptionpricingus- ing real-world rather than risk-neutral world probabilities. There are three beneflts. First, our model allows direct inference about relevant real-world probabilities (e.g., of success in a real-option project, of default on a corporate bond, or of an American-style option flnishing in the money). Second, practitioners using our model for corporate real-option applications completely avoid the managerial anxiety that competing risk-neutral models generate when they use risk-free dis- count rates for risky cash (cid:176)ows. Third, our model simplifles option pricing when higher moments (e.g., skewness and kurtosis) appear in asset pricing models. JEL Classiflcation: A23, G13. Keywords: Binomial Option Pricing, Real Options. 1WethankRaviBansal, AlexButler, RobertHauswald, JimmyHilliard, StewartMay- hew, Susan Monaco, Sanjay Nawalkha, Mark Rubinstein, Louis Scott, Richard Shockley, andseminarparticipantsattheUniversityofGeorgiaandthe1999SouthwesternFinance Association Meetings. Views expressed in this paper are not necessarily those of Barclays Global Investors nor of its parent Barclays PLC. Any errors are ours. 2Corresponding Author: Tom Arnold, Department of Finance, The E. Claiborne Robins School of Business, University of Richmond, Richmond, VA 23173, e-mail tmarnol@lsu.edu, tel. 225-578-6369, fax. 225-578-6366. Non-corresponding author: Tim- othy Crack, Barclays Global Investors, London, UK (on sabbatical during 2003). This version: April 15, 2003.",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 55,
    "chunk_index": 0,
    "word_count": 220,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "PLC. Any errors are ours. 2Corresponding Author: Tom Arnold, Department of Finance, The E. Claiborne Robins School of Business, University of Richmond, Richmond, VA 23173, e-mail tmarnol@lsu.edu, tel. 225-578-6369, fax. 225-578-6366. Non-corresponding author: Tim- othy Crack, Barclays Global Investors, London, UK (on sabbatical during 2003). This version: April 15, 2003. Option Pricing in the Real World: A Generalized Binomial Model with Applications to Real Options Abstract Weextendapopularbinomialmodeltoallowforoptionpricingus- ing real-world rather than risk-neutral world probabilities. There are three beneflts. First, our model allows direct inference about relevant real-world probabilities (e.g., of success in a real-option project, of default on a corporate bond, or of an American-style option flnishing in the money). Second, practitioners using our model for corporate real-option applications completely avoid the managerial anxiety that competing risk-neutral models generate when they use risk-free dis- count rates for risky cash (cid:176)ows. Third, our model simplifles option pricing when higher moments (e.g., skewness and kurtosis) appear in asset pricing models. JEL Classiflcation: A23, G13. Keywords: Binomial Option Pricing, Real Options.",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2-3",
    "total_pages": 55,
    "chunk_index": 1,
    "word_count": 168,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2-3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "applications completely avoid the managerial anxiety that competing risk-neutral models generate when they use risk-free dis- count rates for risky cash (cid:176)ows. Third, our model simplifles option pricing when higher moments (e.g., skewness and kurtosis) appear in asset pricing models. JEL Classiflcation: A23, G13. Keywords: Binomial Option Pricing, Real Options. I Introduction Weshowhowtopriceoptionsinthe\\realworld\"ratherthaninarisk-neutral world. That is, we demonstrate option pricing without using the change of probability measure required to price in the risk-neutral world. Our method is appealing to researchers and practitioners faced with real-option valua- tion problems where risk-neutral pricing may only serve to create practical problems on the one hand or conceptual problems on the other. Practical problems with risk-neutral pricing arise when inferred option pricing param- eters do not apply to the real world. For example, the probability of success of a real-option project, the probability of default on a corporate bond, the probability that an American-style option will flnish in the money, and the likelihood of a jump in a jump process are each difierent in the real and risk- neutral worlds.1;2 Similarly, if higher moments (e.g., skewness and kurtosis) play a part in the asset pricing model, then practical problems arise because the variance and higher moments can difier between the real and risk-neutral worlds. Ontheotherhand, conceptualproblemsarisebecauseitisdi–cultto understand why we need event probabilities from an economy that does not compensate risk bearing, even though we are pricing assets from a real-world 1",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3-4",
    "total_pages": 55,
    "chunk_index": 2,
    "word_count": 237,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3-4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "in the asset pricing model, then practical problems arise because the variance and higher moments can difier between the real and risk-neutral worlds. Ontheotherhand, conceptualproblemsarisebecauseitisdi–cultto understand why we need event probabilities from an economy that does not compensate risk bearing, even though we are pricing assets from a real-world 1 economy that does compensate risk bearing. By performing the real-option analysis using the probability distributions of the real-world economy, we avoid these di–culties|the flnal answer is, of course, the same (Cox et al. (1985)). In Section II we derive the model (with details relegated to Appendix A). Section III discusses implications of the model. Section IV discusses risk- neutral versus real-world option pricing when higher moments (e.g., skewness andkurtosis)appearintheassetpricingmodel. Wegiveanumericalexample of a real-option application in Section V. Section V also includes a pedagog- ical by-product of our model|a simple illustration of why non-option based NPV rules are di–cult to implement in real-option settings. Section VI con- cludes with a summary of our flndings and potential future research topics. Appendix A contains mathematical derivations and an extended numerical example. II The Model A continuous-time option pricing model under the real-world probability measure requires a stochastic risk-adjusted discount rate; no single risk- 2",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4-5",
    "total_pages": 55,
    "chunk_index": 3,
    "word_count": 201,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4-5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "real-option settings. Section VI con- cludes with a summary of our flndings and potential future research topics. Appendix A contains mathematical derivations and an extended numerical example. II The Model A continuous-time option pricing model under the real-world probability measure requires a stochastic risk-adjusted discount rate; no single risk- 2 adjusteddiscountratewilldothejob.3 BlackandScholesrecognizethiswith their \\instantaneous CAPM\" approach to deriving the Black-Scholes PDE (Black and Scholes (1973)). However, the Black-Scholes model that results is di–cult to interpret with respect to the real world because the real-world probability measure parameters fall out. Our model is a discretized version of the original Black-Scholes instantaneous CAPM derivation that allows for changing risk-adjusted discount rates. The discretization allows us to infer real-worldparameters|aninferencenotexplicitlyavailableinthecontinuous time limit of the model. Our model|in both its one-period and multi-period forms|is a direct generalization of the Cox, Ross, and Rubinstein (CRR) binomial option pric- ing model (Cox et al. (1979)). CRR do not give enough information to price options in the real world. Cox and Rubinstein (1985), however, do give enough information to deduce real-world option pricing (see discussion in our Appendix A.3), but the information is not used explicitly for that purpose. Rather, they present the information to help evaluate option performance in a portfolio theory context (Cox and Rubinstein (1985), p. 185). We take their analysis one step further and generalize their model in the sense that options are priced under any discount rate. Using the risk-free rate em- 3",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5-6",
    "total_pages": 55,
    "chunk_index": 4,
    "word_count": 240,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5-6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "purpose. Rather, they present the information to help evaluate option performance in a portfolio theory context (Cox and Rubinstein (1985), p. 185). We take their analysis one step further and generalize their model in the sense that options are priced under any discount rate. Using the risk-free rate em- 3 ploys the probability measure for the risk-neutral economy that yields the CRR model; using the underlying security’s actual discount rate employs the probability measure for the actual economy (i.e., the \\real world\").4 Like theCRRmodel, ourgeneralizedmodelpricesbothEuropean-andAmerican- style options. Inferring probabilistic information from option prices is not new. Like us, Stutzer (1996) also infers \\subjective\" (i.e., real world) probability densities from options data. He difiers from us, however, in that he uses difiusions instead of binomial trees, he uses historical data which we do not need, and he uses the subjective density to estimate the risk-neutral density for risk-neutral pricing (the focus of his paper), whereas we price in the real- world. Like us, Jackwerth and Rubinstein (1996) infer probabilities from option prices using binomial trees. They difier from us because they use risk- neutral probabilities. They also use nonparametric techniques that require large data sets, whereas our methods require very little data. Ait-Sahalia and Lo (1998) and Jackwerth (2000) also infer probabilities densities from option prices. They difier from us in that they use difiusions rather than binomial trees, they infer risk-neutral densities not real-world ones, and they use nonparametric techniques. 4",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6-7",
    "total_pages": 55,
    "chunk_index": 5,
    "word_count": 241,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6-7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "large data sets, whereas our methods require very little data. Ait-Sahalia and Lo (1998) and Jackwerth (2000) also infer probabilities densities from option prices. They difier from us in that they use difiusions rather than binomial trees, they infer risk-neutral densities not real-world ones, and they use nonparametric techniques. 4 Our model is derived in three difierent ways in Appendix A: a general proofinAppendixA.1; acertaintyequivalentargumentrelatedtobutslightly difierent from that in Constantinides (1978) and Bogue and Roll (1974) in Appendix A.2; and a CAPM-based proof using the fact that the Sharpe ratio of asecurityandtheSharperatioofacall optionon thesecurityarethe same in a one-period binomial model in Appendix A.3 (c.f. Cox and Ross (1976), Equation (15)).5 A similar argument can be given using Treynor measures (also in Appendix A.3). Let S and S be the underlying asset price at time t = 0, and time 0 T t = T, respectively. Assume the asset pays no dividends,6 then R · S T S S 0 is the total (or \\gross\") discretely-compounded return on the asset from time 0 to time T (e.g., a realized value of R = 1:15 indicates 15 per- S cent growth). R is similarly the total risk-free rate from time 0 to time F T (so R = 1:10 represents 10 percent growth). Let SD(¢) denote stan- F dard deviation, E(¢) denote expectation under real-world probability, and E⁄(¢) denote expectation under the risk-neutral measure. Following Cox and Rubinstein (1985), we use \\”\" to denote standard deviation of total discretely-compounded return to distinguish it from (cid:190), which we reserve for standard deviation of continuously-compounded returns. Let r be the an- F 5",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 55,
    "chunk_index": 6,
    "word_count": 269,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "denote expectation under real-world probability, and E⁄(¢) denote expectation under the risk-neutral measure. Following Cox and Rubinstein (1985), we use \\”\" to denote standard deviation of total discretely-compounded return to distinguish it from (cid:190), which we reserve for standard deviation of continuously-compounded returns. Let r be the an- F 5 nualized continuously-compounded risk-free rate [so that er F T = R F ], k S be the annualized continuously-compounded expected return on the stock (so p p that ek S T = E(R S )), and use u = e(cid:190) T and d = e¡(cid:190) T as the one-period mul- tiplicative stock price growth factors as per the CRR speciflcation.7 With these deflnitions, Appendices A.1 through A.3 derive the one-period option pricing formulae in Equations (1) and (2). • (cid:181) ¶ ‚ 1 V ¡V V = E(V )¡ u d (E(R )¡R ) (1) 0 R T u¡d S F F \" ˆ ! # V ¡V ‡ · V 0 = e¡r F T E(V T )¡ p u d p ek S T ¡er F T : (2) e(cid:190) T ¡e¡(cid:190) T Note that although Equations (1) and (2) involve discounting at the risk- free rate, this is not risk-neutral pricing. There is no change of probability measure. Theexpectedcash(cid:176)owE(V )isintherealworld,notarisk-neutral T world, and it is not directly discounted at the risk-free rate. Rather, the risk- adjusted expected cash (cid:176)ow (i.e., the certainly equivalent) is discounted at the risk-free rate. This risk-adjusted expected cash (cid:176)ow is the real-world expected cash (cid:176)ow less a risk premium. The relationships we use to derive our option pricing formula hold only for the one-period case of the binomial option pricing model. A multi-stage 6",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 55,
    "chunk_index": 7,
    "word_count": 282,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "(i.e., the certainly equivalent) is discounted at the risk-free rate. This risk-adjusted expected cash (cid:176)ow is the real-world expected cash (cid:176)ow less a risk premium. The relationships we use to derive our option pricing formula hold only for the one-period case of the binomial option pricing model. A multi-stage 6 binomial tree is a set of iterative single-period binomial models. Thus, we may apply our generalized one-period option pricing model (GOPOP) in an iterative manner to create a multi-stage binomial tree that prices American- and European-style options.8 The expectation operator E(¢) in all of the equations is evaluated un- der the probability measure that exists in the real-world economy, assum- ing we have the correct discount rate for the underlying security. As will be seen shortly, the probability measure|and consequently the expectation operator|are dependent on the discount rate assigned to the underlying asset. Technically, many difierent discount rates produce the correct option price because the probability measure changes endogenously to adjust for the discount rate. If the discount rate is set to the risk-free rate then the model reduces to a risk-neutral option pricing model [set R to R and k to r in S F S F Equations (1) and (2), and replace E(¢) by E⁄(¢)]. As long as the discount rate for the underlying security is the real-world discount rate, we are using the real-world probability measure to value options. Any other discount rate changes the probability measure to that of a difierent economy (i.e., an econ- omy in which the agents have difierent risk preferences). However, the option price is correct no matter which discount rate (and its related economy) we 7",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 55,
    "chunk_index": 8,
    "word_count": 275,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "the real-world probability measure to value options. Any other discount rate changes the probability measure to that of a difierent economy (i.e., an econ- omy in which the agents have difierent risk preferences). However, the option price is correct no matter which discount rate (and its related economy) we 7 are using. We can assume a risk-neutral world to price options correctly but we flnd it di–cult to make inferences about the real-world economy based on the probability density function of prices and returns in this risk-neutral world. Further, we may flnd it di–cult to explain the risk-neutral pricing logic to non-academics. We now apply the GOPOP model in a multi-stage CRR binomial model form, creating a generalized multi-period option pricing model (GMPOP). The main difierence between GMPOP and CRR is the use of the real-world underlying security discount rate in place of the risk-free rate in the assess- ment of the two probability measures that allow the underlying security price to increase and decrease at a given stage in the binomial tree.9 GivenalloftheassumptionsoftheCRRmodel, thereal-worldprobability ‡ · of a price increase in the one-step binomial model is p · ekST¡d where k u¡d S is the continuously-compounded annualized risk-adjusted expected rate of returnfortheunderlyingsecurity,T istheproportionofayearforonestageof p p the binomial tree, and u = e(cid:190) T and d = e¡(cid:190) T are the multiplicative growth factors for one stage of the binomial tree. Allowing S to denote the current price of the underlying security, we develop a flve-stage binomial tree in Table I. To value an option on this security, we go to the possible underlying 8",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 55,
    "chunk_index": 9,
    "word_count": 265,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "d = e¡(cid:190) T are the multiplicative growth factors for one stage of the binomial tree. Allowing S to denote the current price of the underlying security, we develop a flve-stage binomial tree in Table I. To value an option on this security, we go to the possible underlying 8 security prices in the terminal period and determine the option value at each one of these security prices. We can consider the option payofis to be V , uuuuu V , V , V , V , and V (where the subscript denotes what duuuu dduuu ddduu ddddu ddddd has occurred to the security price over the flve periods without respect to ordering). We can calculate the option prices in period four recursively. For example, we can flnd V using p, 1¡p, R , u, d, k, V , and V in uuuu F uuuuu duuuu the GOPOP model. ( V = e¡r F T [pV +(1¡p)V ]¡ uuuu uuuuu duuuu ˆ ! ) V ¡V ‡ · uu p uuu du p uuu ek S T ¡er F T : (3) e(cid:190) T ¡e¡(cid:190) T More formally, we let \\i\" be the number of upward price movements and \\j\" be the number of downward price movements. Then for stage \\i + j\" (where i+j is less than the terminal stage), the option price V(i;j) follows the recursive scheme given in Equation (4). ( V(i;j) = e¡r F T [pV(i+1;j)+(1¡p)V(i;j +1)] ˆ ! ) V(i+1;j)¡V(i;j +1) ‡ · ¡ p p ek S T ¡er F T : (4) e(cid:190) T ¡e¡(cid:190) T 9",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 55,
    "chunk_index": 10,
    "word_count": 264,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "i+j is less than the terminal stage), the option price V(i;j) follows the recursive scheme given in Equation (4). ( V(i;j) = e¡r F T [pV(i+1;j)+(1¡p)V(i;j +1)] ˆ ! ) V(i+1;j)¡V(i;j +1) ‡ · ¡ p p ek S T ¡er F T : (4) e(cid:190) T ¡e¡(cid:190) T 9 By using the GOPOP model iteratively we generate the GMPOP model shown in Table II. Again, the probabilities generated for the price movements are from the actual economy and not a risk-neutral economy. If we generate the model using the risk-free rate r instead of the underlying security’s discount rate, F k , the GMPOP model becomes risk neutral and is the same as the CRR S model. TheGMPOPmodelinEquation(4)issetuptopriceaEuropean-styleop- tion. However,ifateachnodewetakethemaximumbetweentheGOPOPso- lution V(i;j) and the option’s immediate exercise value, the GMPOP model can price American-style options. This added condition at each node is the same condition for pricing American-style options under the CRR model. It follows that our model can give traders real-time, real-world probabili- ties that individual American-style options will flnish in the money. On a Bloomberg terminal, for example, our model builds on Bloomberg’s beta function to get the expected return on the underlying (you can deflne your own market index proxy and confldence intervals on the estimated beta then (cid:176)ow through to confldence intervals on option value and on probability of success). 10",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12-13",
    "total_pages": 55,
    "chunk_index": 11,
    "word_count": 226,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12-13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "a Bloomberg terminal, for example, our model builds on Bloomberg’s beta function to get the expected return on the underlying (you can deflne your own market index proxy and confldence intervals on the estimated beta then (cid:176)ow through to confldence intervals on option value and on probability of success). 10 We conclude this section with a numerical example (adapted from Hull (1997), pp. 346{347) of a European put and an American put using the GMPOP model. Let the current price for a non-dividend paying stock be $50, thecontinuously-compoundedannualizedrisk-freerateber = 0:10, the F stock’s annualized continuously-compounded expected return be k = 0:15, S and the annualized volatility of continuously compounded stock returns be (cid:190) = 0:40. We value the flve-month put option with strike price $50 using a flve-stage tree. The European put appears in Table III and the American put is in Table IV. Table VIII is an extended version of Table III with further details of the calculation (see discussion in Appendix A.4). Let us remind the reader that the tree for the underlying is the same whether we use real-world or risk-neutral world valuation. The probabilities and discount rates are, of course, difierent. III Some Implications Note the difierence between the real-world economy probability measure of future events and the risk-neutral economy probability measure of future events in Tables III and IV. Given that the underlying security’s discount 11",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13-14",
    "total_pages": 55,
    "chunk_index": 12,
    "word_count": 231,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13-14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "real-world or risk-neutral world valuation. The probabilities and discount rates are, of course, difierent. III Some Implications Note the difierence between the real-world economy probability measure of future events and the risk-neutral economy probability measure of future events in Tables III and IV. Given that the underlying security’s discount 11 rate is greater than the risk-free rate (i.e., a positive risk premium), risk- neutral valuation takes probability from higher value states and redistributes the probability to lower value states (where \\higher\" and \\lower\" refer to the price of the underlying security). The proof of this implication is seen in the constructionoftheprobabilityofapriceincreaseintheunderlyingsecurityin a single period of the binomial tree. Compare the price increase probability p under the GOPOP model using the real-world security return to the price increase probability q under the GOPOP model using the risk-free return (i.e., the CRR model). ˆ ! ˆ ! ekT ¡d er F T ¡d k > r ) p = > = q: (5) F u¡d u¡d The inequality in Equation (5) is reversed if the underlying security’s risk premium is negative. This means that research concerned with parameters inferred from option prices such as tail probabilities (e.g., \\value at risk\"), jump models, skewness in return distributions, and kurtosis in return distributions is susceptible to error if a risk-neutralized option pricing model is employed (assuming these parameters/measuresaredesiredforthereal-worldeconomy). Theamountof 12",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14-15",
    "total_pages": 55,
    "chunk_index": 13,
    "word_count": 226,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14-15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "premium is negative. This means that research concerned with parameters inferred from option prices such as tail probabilities (e.g., \\value at risk\"), jump models, skewness in return distributions, and kurtosis in return distributions is susceptible to error if a risk-neutralized option pricing model is employed (assuming these parameters/measuresaredesiredforthereal-worldeconomy). Theamountof 12 errorisafunctionoftheabsolutevalueoftheriskpremiumfortheunderlying security.10 IV Beyond Mean-Variance We have discussed several beneflts of pricing options under the real-world probability measure. When the goal is merely to price the option, however, then it may seem that the GOPOP/GMPOP model provides no beneflt be- yond those already provided by risk-neutral valuation, because the pricing is the same. In fact, there is an additional beneflt to pricing options under the real-world measure, but it does not become apparent until we move beyond the traditional mean-variance framework used for asset returns in continuous time (e.g., beyond the Black-Scholes world). If we are working in a Black-Scholes framework (i.e., geometric Brownian motion with constant difiusion coe–cient) then the instantaneous variance takes the same value in both the real and risk-neutral worlds and no higher moments matter, so risk-neutral pricing is not di–cult to implement. If the only goal is to price the option, then, in this case, there is little incentive to modeling risk premia using the real-world probability measure. 13",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15-16",
    "total_pages": 55,
    "chunk_index": 14,
    "word_count": 214,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15-16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "the same value in both the real and risk-neutral worlds and no higher moments matter, so risk-neutral pricing is not di–cult to implement. If the only goal is to price the option, then, in this case, there is little incentive to modeling risk premia using the real-world probability measure. 13 For more than a decade, however, continuous-time option pricing mod- els have incorporated higher-order moments, such as skewness and kurtosis, in the underlying data generating process via stochastic volatility with or without jumps (Hull and White (1987); Scott (1987); Wiggins (1987); Bates (1996a); Bakshi and Chen (1997); Scott (1997)). In this case, the instanta- neous variance is not necessarily the same in the real and risk-neutral worlds, and higher order moments can also difier (Cont (1997), Section 6; Madan et al. (1998), Footnote 14).11 Risk-neutralization of these models is more prob- lematic than in the Black-Scholes world. It depends upon the selection of a utility function rather than incorporating a model for risk premiums for the underlying asset and the option (Bates (1996b), Section 2.1; Jackwerth (2000)).12 A second problem with risk-neutral pricing when higher-order moments matter is that the risk-neutral moments must be inferred from, rather than matched to, the associated real-world moments and might depend upon the utility function used. In other words, the risk-neutralized variance, skewness, andkurtosiscannotbecalculateddirectlyfromreal-worldreturns. Thisissue is not new. There is now, however, a movement toward the use of statistical moments 14",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16-17",
    "total_pages": 55,
    "chunk_index": 15,
    "word_count": 237,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16-17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "is that the risk-neutral moments must be inferred from, rather than matched to, the associated real-world moments and might depend upon the utility function used. In other words, the risk-neutralized variance, skewness, andkurtosiscannotbecalculateddirectlyfromreal-worldreturns. Thisissue is not new. There is now, however, a movement toward the use of statistical moments 14 beyond the second moment in models of asset returns (e.g., Harvey and Siddique (2000); Leland (1999)). The GOPOP/GMPOP framework allows such asset pricing models to be incorporated directly into the pricing of options. This provides a rich context for option pricing and has distinct advantages over risk-neutral pricing. The primary advantages are the ability to use real-world moments from which our data are generated and to avoid the use of utility functions. The GOPOP/GMPOP model relies upon only two conditions (the same two conditions it always requires) to be valid with three or more moments in the asset return distribution: (1) the underlying discount rate correctly incorporatescompensationforthemoments, and(2)theassetpricingprocess canbegeneratedbyabinomialtree(thetreeneednotnecessarilyrecombine). This result follows from the existence of certainty equivalents and the form of the elasticity of the option price relative to the underlying price in the one-period binomial framework (see Appendix A.1). In other words, given the two conditions mentioned, Equations (1) and (2) hold. It follows that the GOPOP model and, iteratively, the GMPOP model, are both valid. There are asset pricing models that incorporate skewness (mentioned ear- lier in this section) and there is a risk-neutral binomial option pricing model 15",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17-18",
    "total_pages": 55,
    "chunk_index": 16,
    "word_count": 242,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17-18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "other words, given the two conditions mentioned, Equations (1) and (2) hold. It follows that the GOPOP model and, iteratively, the GMPOP model, are both valid. There are asset pricing models that incorporate skewness (mentioned ear- lier in this section) and there is a risk-neutral binomial option pricing model 15 thatincorporatesskewness(Johnson,Pawlukiewicz,andMehta(1997)). Blend- ing these models under the GOPOP/GMPOP framework can provide an op- tion pricing model in the real world|assuming the real world compensates variance and skewness in the asset return. Once one moves beyond the mean- variance framework, difierences between real and risk-neutral world moments imply that the GOPOP/GMPOPmodels are necessary to be able to incorpo- rate directly information readily available from real-world data (Rubinstein (1998), for example, allows only for risk-neutral higher moments). V Real Options and Why Discounted Cash Flow Methods Fail Real-option analysis has many decision tree applications where risk-neutral pricing and risk-free discount rates are at odds with practitioners’ \\gut instincts.\" At a minimum, management prefers that a risk-adjusted rate (e.g., the cost of capital) be used as a discount rate. Management may also be interested in the probability of the success of a project being val- ued as a real option. A risk-neutral option pricing model does not provide 16",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18-19",
    "total_pages": 55,
    "chunk_index": 17,
    "word_count": 206,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18-19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "At a minimum, management prefers that a risk-adjusted rate (e.g., the cost of capital) be used as a discount rate. Management may also be interested in the probability of the success of a project being val- ued as a real option. A risk-neutral option pricing model does not provide 16 the probability of success in the real-world economy. However, the GMPOP model can provide this probability. We demonstrate this using a product development decision tree example. Supposeaflrmisconsideringenteringaparticularlyvolatileproductmar- ket. Once a product hits the market, it must recoup all of its investment in the initial year because the industry is prone to fads where the product must be difierent from what customers already own in order to be marketable. If the product is introduced today, it will generate $200 million in sales, but at a production cost of $300 million. There are also initial development and design costs to add to the production costs, so entering the market today is certaintoleadtoflnancialfailure. Whatiftheflrmdevelopstheproductnow, but delays going into production until the market has had the opportunity to expand? The downside to immediate development is that the developmental and design costs must be incurred now; the upside is that patents will be obtained ahead of competitors, thus establishing a toehold. The beneflt to delaying production is that the uncertain dollar value of sales in the future has at least the potential to cover the future production costs. Let us ignore taxes (or assume that all cash (cid:176)ows are calculated after taking account of taxes). Suppose the continuously-compounded expected 17",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 55,
    "chunk_index": 18,
    "word_count": 255,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "toehold. The beneflt to delaying production is that the uncertain dollar value of sales in the future has at least the potential to cover the future production costs. Let us ignore taxes (or assume that all cash (cid:176)ows are calculated after taking account of taxes). Suppose the continuously-compounded expected 17 growth in dollar sales available to the flrm in this market is 18 percent per annum, with the standard deviation estimate for the growth rate being 60 percent per annum. The expected growth rate of sales and its associated standard deviation are the return and volatility of the \\underlying\" in the model. The product market payofis are an asset available for future purchase if the appropriate development expenditure is made today. Given a 5 percent annual risk-free rate, we need todetermine the value of establishing a toehold by developing the product now. If this value exceeds the developmental and design costs, then the project has a positive NPV. The development of this product provides the right, but not the obli- gation, to take the product to market in the future. Suppose we restrict ourselves to considering a flve-year horizon at which time the costs of going into production will be $400 million. Then development now provides us with a flve-year, European-style call option on the annual sales with a strike price of $400 million (we get the sales if we spend the production costs). To value the option, we flrst model the sales using a flve-stage binomial tree (Table V). The tree of possible annual sales levels is displayed using both the real-world and risk-neutral world probability measures. In Table VI we determine the value of the European call option (i.e., the 18",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 55,
    "chunk_index": 19,
    "word_count": 283,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "costs). To value the option, we flrst model the sales using a flve-stage binomial tree (Table V). The tree of possible annual sales levels is displayed using both the real-world and risk-neutral world probability measures. In Table VI we determine the value of the European call option (i.e., the 18 value of developing the product) using the GMPOP model: $73.25 million. If development and design expenditures are less than $73.25 million, then the flrm should develop the product. The probability that the product will produce proflt is 19.92 percent. Let us emphasize that the GMPOP model in this application requires only forecast growth rate of sales, forecast standard deviationofthisgrowthrate, therisk-freerate, andfutureproductioncosts| each arguably available to an experienced manager. The sales growth is the \\discount rate\" consistent with the actual probability measure. Using the CRR model (and thus the risk-neutral probability measure) produces the same option value. However, the CRR model does not provide the real-world probability that the product will be profltable. By setting our GMPOP model flrmly in the real world, we make real-option analysis more lucid to skeptical managers. We also gain probabilistic information about the actual economy.13 In addition to comparing the GMPOP model to the CRR model, we can use the GMPOP model to illustrate the advantage of real-option analysis over traditional non-option-based DCF analysis. Traditional DCF analysis generally fails in a real-option based project analysis for one of two reasons: 19",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21-22",
    "total_pages": 55,
    "chunk_index": 20,
    "word_count": 236,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21-22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "about the actual economy.13 In addition to comparing the GMPOP model to the CRR model, we can use the GMPOP model to illustrate the advantage of real-option analysis over traditional non-option-based DCF analysis. Traditional DCF analysis generally fails in a real-option based project analysis for one of two reasons: 19 1. DCFdoesnotmodelmanagement’sabilitytoexitaproject. Inessence, traditional DCF assumes the option must be exercised. 2. Even if the DCF analysis is rigged to capture the option-like nature of the project, the appropriate discount rate is not the cost of capital, nor is it the discount rate for the underlying security. Rather, it is the path-dependent stochastic discount rate of the option. For us to value the product development decision using a traditional DCF, we must take a weighted average of all 32 possible future values (FVs) where negative FVs are set to zero when poor market conditions would lead us to abort production (24 such cases).14 The discounting varies between each of thesixpositiveFVcases,butallofthecasesusesingle-periodoptiondiscount rates. The calculation is summarized in Table VII: No particular discount rate is appropriate for each of the cases where the FV is positive. Using real- world probabilities, there does exist a single discount rate that discounts the FVs to give the correct present value, but it is a peculiar non-linear weighted average of the path-dependent discount rates.15 One major (cid:176)aw with the traditional DCF analysis is that we had to perform the real-option analysis to generate the correct discount factors for 20",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22-23",
    "total_pages": 55,
    "chunk_index": 21,
    "word_count": 243,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22-23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "discount rate that discounts the FVs to give the correct present value, but it is a peculiar non-linear weighted average of the path-dependent discount rates.15 One major (cid:176)aw with the traditional DCF analysis is that we had to perform the real-option analysis to generate the correct discount factors for 20 the DCF valuation. That is, we had to flnd the real option’s value only to re- flnd it using traditional DCF methods. It is this (cid:176)aw that makes real-option analysis a better alternative to traditional DCF analysis in the flrst place. The GOPOP and GMPOP models illustrate this issue clearly. VI Conclusion and Extensions We develop generalized one-period and multi-period binomial option pricing models (GOPOP and GMPOP) that can employ difierent probability mea- sures, including those of the real-world economy and of the risk-neutral world economy. Our model allows parameter inference from the real-world proba- bility density function of the underlying security (e.g., real-world likelihood ofsuccessofareal-optionproject, real-worldasopposedtorisk-neutralworld likelihood of default by a bond issuer, real-world likelihood of bankruptcy in a model of a venture-capital-backed startup, real-world probability that an American-style option flnishes in the money). Similarly, our model allows real-world statistical information (e.g., historical or forecast volatility) to be incorporated into option pricing. This is particularly important when higher moments appear in the asset pricing model and variance and higher moments 21",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23-24",
    "total_pages": 55,
    "chunk_index": 22,
    "word_count": 222,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23-24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "a venture-capital-backed startup, real-world probability that an American-style option flnishes in the money). Similarly, our model allows real-world statistical information (e.g., historical or forecast volatility) to be incorporated into option pricing. This is particularly important when higher moments appear in the asset pricing model and variance and higher moments 21 need not be the same in the real and risk-neutral worlds even in continuous time. In addition, our model allows stochastic parameters throughout the option’s life, which are here omitted for clarity of presentation. We give three proofs. The flrst proof is general enough that the CAPM, APT, or multifactor empirical asset pricing models (e.g., Fama and French (1996); Carhart (1997)) apply. The second proof applies in a general mean- variance framework. The third proof applies only to the CAPM. 22 VII References Ait-Sahalia, Yacine and Andrew W. Lo, 1998. Nonparametric estimation of state-price densities implicit in flnancial asset prices. Journal of Finance 53, 499{547. Bates, D.S., 1996a. Jumps and stochastic volatility: Exchange rate processes implicit in Deutsche mark options. Review of Financial Studies 9, 69{107. Bates, D.S., 1996b. Testing option pricing models. In: Maddala, G.S., Rao, C.R. (Eds.), Handbook of Statistics: Statistical Methods in Finance, Vol. 14. Elsevier, Amsterdam, pp. 567{611. Bakshi, Gurdip and Zhiwu Chen, 1997. An alternative model for contingent claims. Journal of Financial Economics 44, 123{165. Baxter, M. and A. Rennie, 1996. Financial Calculus: An Introduction to Derivative Pricing. Cambridge University Press, New York, NY. Baz, J. and R. Strong, 1997. The bias in delta as an indicator of the actual likelihood of option exercise. Finance Practice and Education 7, 91{94. Black, F. and M. Scholes, 1973. The pricing of options and corporate liabil- ities. Journal of Political Economy 81, 637{659. 23",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 24,
    "page_range": "p.24-25",
    "total_pages": 55,
    "chunk_index": 23,
    "word_count": 286,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.24-25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "New York, NY. Baz, J. and R. Strong, 1997. The bias in delta as an indicator of the actual likelihood of option exercise. Finance Practice and Education 7, 91{94. Black, F. and M. Scholes, 1973. The pricing of options and corporate liabil- ities. Journal of Political Economy 81, 637{659. 23 Bogue,MarcusC.andRichardRoll,1974. Capitalbudgetingofriskyprojects with‘imperfect’marketsforphysicalcapital. JournalofFinance29, 601{613. Carhart, Mark M., 1997. On persistence in mutual fund performance. Jour- nal of Finance 52, 57{82. Constantinides, George M., 1978. Market risk adjustment in project valua- tion. Journal of Finance 33, 603{616. Cont, Rama, 1997. Beyond implied volatility: Extracting information from option prices. Lecture presented at E˜otvo˜s University, Budapest, July 1997. ToappearinKertesz,J.,Kondor,I.(Eds.) Econophysics,Kluwer,Dordrecht. Cox, John C., Jonathan E. Ingersoll, Jr., and Stephen A. Ross, 1985. An intertemporal general equilibrium model of asset prices. Econometrica 53, 363{384. Cox, J. and S. Ross, 1976. The valuation of options for alternative stochastic processes. Journal of Financial Economics 3, 145{166. Cox, J., S. Ross, and M. Rubinstein, 1979. Option pricing: A simplifled approach. Journal of Financial Economics 7, 229{263. Cox, J. and M. Rubinstein, 1985. Options Markets. Prentice-Hall, Inc. Englewood Clifis, NJ. 24",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 26,
    "page_range": "p.26-27",
    "total_pages": 55,
    "chunk_index": 24,
    "word_count": 184,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.26-27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "S. Ross, 1976. The valuation of options for alternative stochastic processes. Journal of Financial Economics 3, 145{166. Cox, J., S. Ross, and M. Rubinstein, 1979. Option pricing: A simplifled approach. Journal of Financial Economics 7, 229{263. Cox, J. and M. Rubinstein, 1985. Options Markets. Prentice-Hall, Inc. Englewood Clifis, NJ. 24 Fama, Eugene F. and Kenneth French, 1996. Multifactor explanations of asset pricing anomalies. Journal of Finance 51, 55{84. Ferguson, Michael and Richard Shockley, 1999. Equilibrium Anomalies. Un- published working paper, Indiana University Kelley School of Business. Garman, Mark, 1989. Semper tempus fugit. RISK Magazine (May). Harvey, C. and A. Siddique, 2000. Conditional skewness in asset pricing tests. Journal of Finance 55, 1263{1296. Hull, J., 1997. Options, Futures, and Other Derivative Securities. 3rd Ed., Prentice-Hall, Inc. Upper Saddle River, NJ. Hull, John and Alan White, 1987. The pricing of options on assets with stochastic volatilities. The Journal of Finance 42, 281{300. Ingersoll, JonathanE., 1987. TheoryofFinancialDecisionMaking. Rowman and Littlefleld Publishers. Savage, MD. Jackwerth J. and Rubinstein, 1996. Recovering probability distributions from option prices. Journal of Finance 51, 1611{1631 Jackwerth, JensCarsten, 2000. RecoveringRiskAversionfromOptionPrices and Realized Returns. Review of Financial Studies 13, 433{451. 25",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 27,
    "page_range": "p.27-28",
    "total_pages": 55,
    "chunk_index": 25,
    "word_count": 190,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.27-28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "assets with stochastic volatilities. The Journal of Finance 42, 281{300. Ingersoll, JonathanE., 1987. TheoryofFinancialDecisionMaking. Rowman and Littlefleld Publishers. Savage, MD. Jackwerth J. and Rubinstein, 1996. Recovering probability distributions from option prices. Journal of Finance 51, 1611{1631 Jackwerth, JensCarsten, 2000. RecoveringRiskAversionfromOptionPrices and Realized Returns. Review of Financial Studies 13, 433{451. 25 Johnson, R.H., J.Pawlukiewicz, andJ.Mehta, 1997. Binomialoptionpricing with skewed asset returns. Review of Quantitative Finance and Accounting 9, 89{101. Leland, H., 1999. Beyond mean-variance: Performance measurement in a nonsymmetrical world. Financial Analysts Journal 55, 27{36. Luenberger, David G., 1998. Investment Science. Oxford University Press, Oxford, UK. Madan, Dilip B., Peter Carr, and Eric C. Chang, 1998. The variance gamma process and option pricing. Unpublished working paper University of Mary- land, Morgan Stanley, Georgia Institute of Technology. Merton, Robert C., 1976. Option pricing when underlying stock returns are discontinuous. The Journal of Financial Economics 3, 125{144. Rubinstein, M., 1976. The valuation of uncertain income streams and the pricing of options. Bell Journal of Economics 7, 407{425. Rubinstein, M., 1994. Implied binomial trees. Journal of Finance 49, 771{ 818. Rubinstein, M., 1998. Edgeworth binomial trees. Journal of Derivatives 5, 20{27. 26 Scott, Louis O., 1987. Option pricing when the variance changes randomly: Theory, estimation, and an application. The Journal of Financial and Quan- titative Analysis 22, 419{438. Scott, Louis O., 1997. Pricing stock options in a jump-difiusion model with stochastic volatility and interest rates: Applications of Fourier inversion methods. Mathematical Finance 7, 413{426. Stutzer, Michael, 1996. A simple nonparametric approach to derivative se- curity valuation. Journal of Finance 51, 1633{1652. Tian, Yisong, 1993. A modifled lattice approach to option pricing. The Journal of Futures Markets 13, 563{577. Wiggins, James B., 1987. Option values under stochastic volatility. The Journal of Financial Economics 19, 351{372. 27",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 28,
    "page_range": "p.28-29",
    "total_pages": 55,
    "chunk_index": 26,
    "word_count": 291,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.28-29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "Michael, 1996. A simple nonparametric approach to derivative se- curity valuation. Journal of Finance 51, 1633{1652. Tian, Yisong, 1993. A modifled lattice approach to option pricing. The Journal of Futures Markets 13, 563{577. Wiggins, James B., 1987. Option values under stochastic volatility. The Journal of Financial Economics 19, 351{372. 27 VIII Footnotes 1. The potential future values of a particular security’s price afiect the value of an option on that security. However, the probability measure of those future values does not, and it is adjustable (Baxter and Ren- nie (1996), p. 30). If a researcher infers the probability density of the underlying security using implied binomial trees (Rubinstein (1994); Jackwerth and Rubinstein (1996)) then the derived parameter and dis- tributional information may apply only to a risk-neutral economy and not the real-world economy. 2. In rare cases, a simple correction already exists. For example, N(d ) 2 of the Black-Scholes model (Black and Scholes (1973)) provides the probability that the European call option flnishes in the money under the risk-neutral measure and can be adjusted directly to a real-world probability (Baz and Strong (1997))|but most traded options and most real options are American style, so their applications are limited. In other cases, the real-world and risk-neutral world parameters are the same: beta, implied volatility, and the optimal exercise boundary for an American-style option are some that come to mind|at least in 28",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 30,
    "page_range": "p.30-31",
    "total_pages": 55,
    "chunk_index": 27,
    "word_count": 232,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.30-31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "Strong (1997))|but most traded options and most real options are American style, so their applications are limited. In other cases, the real-world and risk-neutral world parameters are the same: beta, implied volatility, and the optimal exercise boundary for an American-style option are some that come to mind|at least in 28 continuous-time models. 3. Other things being equal, as the stock price rises (falls), the degree of leverageimplicitwithinacalloptiononthatstockfalls(rises), andthus the risk-adjusted discount rate for the call option also falls (rises). It follows that the risk-adjusted discount rate for the option that applies over the entire life of the option is a path-dependent random variable driven by the randomness of the stock price, and no single determinis- tic number can capture this real-world required rate of return on the option. 4. We make these assertions because, conditional upon the binomial na- ture of the model, the measure is uniquely determined. We note, how- ever, that the measure is \\unique\" only up to the structure of the binomial model. Other binomial representations exist and each has a slightly difierent measure (Tian (1993)). The binomial model is an ap- proximation to an assumed real-world difiusion or pure jump process, and our \\real-world\" probability measure is, similarly, just such an ap- proximation. Difierent approximations give slightly difierent measures. 5. Simple intuition tells you that in a one-period binomial model (or in an 29",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 31,
    "page_range": "p.31-32",
    "total_pages": 55,
    "chunk_index": 28,
    "word_count": 228,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.31-32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "(1993)). The binomial model is an ap- proximation to an assumed real-world difiusion or pure jump process, and our \\real-world\" probability measure is, similarly, just such an ap- proximation. Difierent approximations give slightly difierent measures. 5. Simple intuition tells you that in a one-period binomial model (or in an 29 inflnitesimaltimestepincontinuoustime)thecalloptionasaleveraged investment in the underlying must have the same Sharpe ratio. The leveragesimplymovestheassetalongastraightlineinexpectedreturn- standard deviation space. For graphical illustration, see Figure 5-1 in Cox and Rubinstein (1985). 6. Dividends|either continuous or lump-sum|can be incorporated quite easily (Jackwerth and Rubinstein (1996); Hull (1997)). 7. Cautionmustbeexercisedintranslatingbetweendiscretelyandcontinuously- compounded returns. The Sharpe ratio equality result that drives our model is exactly true only for discretely-compounded returns. If we begin with parameters based on continuously-compounded returns, then they must be translated to their discretely-compounded counter- parts before employing this equality. For example, if (cid:190) is the stan- dard deviation of annualized continuously-compounded returns on a stock, then SD(S ) = p(Su¡E(S ))2 +(1¡p)(Sd¡E(S ))2, where T T T p p E(S ) = pSu+(1¡p)Sd, u = e(cid:190) T, d = e¡(cid:190) T and p = ekST¡d . T u¡d 8. We get a closed-form formula in the limit as step size tends to zero only in the same cases that the risk-neutral version of the model leads 30",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 32,
    "page_range": "p.32-33",
    "total_pages": 55,
    "chunk_index": 29,
    "word_count": 213,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.32-33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "p p E(S ) = pSu+(1¡p)Sd, u = e(cid:190) T, d = e¡(cid:190) T and p = ekST¡d . T u¡d 8. We get a closed-form formula in the limit as step size tends to zero only in the same cases that the risk-neutral version of the model leads 30 to a closed-form formula|because the pricing is the same. Our work is related to Rubinstein (1976) but difiers on two dimensions. First, he gets exact pricingformulae assumingageometric Brownian motionand discrete trading opportunities, whereas we provide approximations by simplifying to a binomial world. Second, his analysis is demonstrated only in the European-style option case, whereas we demonstrate our analysis for both European- and American-style options. If we restrict attentiononlytoEuropean-styleoptionsandletourstepsizegotozero, then we get the same result as Rubinstein (1976): the Black-Scholes formulae. 9. We can use a stochastic underlying stock return and/or risk-free rate at any given stage within the GMPOP model. We omit this for clarity of presentation. 10. One special property of our model is that the pricing is completely robust to the choice of k. That is, any k used leads to the correct derivative price because the measure adjusts endogenously. The real- world inferences, however, like probability of success, are not robust in this fashion and incorrect discount rates lead to incorrect inferences. 31",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 33,
    "page_range": "p.33-34",
    "total_pages": 55,
    "chunk_index": 30,
    "word_count": 216,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.33-34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "the pricing is completely robust to the choice of k. That is, any k used leads to the correct derivative price because the measure adjusts endogenously. The real- world inferences, however, like probability of success, are not robust in this fashion and incorrect discount rates lead to incorrect inferences. 31 11. If prices are driven solely by difiusion processes (e.g., the Black-Scholes world, or a stochastic volatility model without jumps) then instanta- neous volatility is the same in both the real and risk-neutral worlds. With stochastic volatility, however, the expected future path of volatil- ity is not necessarily the same in both worlds. If the process is discon- tinuous, then the instantaneous variance, skewness, and kurtosis can difier between real and risk-neutral worlds. Of course, even in the CRR model the real-world and risk-neutral world variances are not the same in the one-step model. They do, however, coincide in the limit as the step sizes go to zero if the process becomes a continuous-state difiusion (Cox et al. (1979), p. 253). 12. If the jump process is a pure jump (i.e., a Poisson jump process with no difiusion coe–cient) and if the jump size is non-random, then the jump can be perfectly hedged without a utility function or any risk adjustment (Cox and Ross (1976)). Similarly, if the jump process is a jump-difiusion with a diversiflable jump, then the non-jump portion of the process can be hedged, and the remainder has risk-free required return and a PDE can be solved (Merton (1976)). Otherwise, either 32",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 55,
    "chunk_index": 31,
    "word_count": 255,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "utility function or any risk adjustment (Cox and Ross (1976)). Similarly, if the jump process is a jump-difiusion with a diversiflable jump, then the non-jump portion of the process can be hedged, and the remainder has risk-free required return and a PDE can be solved (Merton (1976)). Otherwise, either 32 a utility function or an adjustment for a risk premium is needed. The former is standard practice, but the latter is not|because asset pric- ing models for the risk premium can create problems with risk-neutral pricing (Bates (1996), p. 571). 13. Conversely, experienced management may have a good estimate of the actual probability of success of a project being valued as a real op- tion. The GMPOP model may be calibrated to this probability and a discount rate for the underlying may be inferred directly. A risk- neutral model has no use for such information and does not allow such \\real-world\" information to in(cid:176)uence valuation. 14. A flve-step binomial tree has 25 = 32 paths from the initial node to the possible ending nodes. The payofi to this option is not path-dependent: the future value at a given ending node is the same no matter which path was followed to get there. However, the discount rates in the GMPOP model are path-dependent: they difier depending upon the path followed through the tree. Thus, a traditional DCF analysis in this setting must separate the cases path-by-path before discounting. 15. In the case of a European-style option, Cox and Rubinstein (1985, 33",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 55,
    "chunk_index": 32,
    "word_count": 250,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "get there. However, the discount rates in the GMPOP model are path-dependent: they difier depending upon the path followed through the tree. Thus, a traditional DCF analysis in this setting must separate the cases path-by-path before discounting. 15. In the case of a European-style option, Cox and Rubinstein (1985, 33 p. 324) give a closed-form formula for the real-world expected return on the option. A related, but difierent concept, is Mark Garman’s \\fugit\" of an option (Garman (1989)). This is the risk-neutral expected time until exercise. 16. Cox and Rubinstein (1985, pp. 186{187) give some useful formulae: r q ‡ · 2 ” = p(1¡p)(u¡d)2, ” · p(1¡p) Cu¡C d . S C C 17. Unfortunately, we cannot produce a closed-form solution even with Normality because of the stochastic risk premium of the option under the real-world probability measure. 18. Although the Sharpe ratio relationships are all stated for European op- tions, the equality of Sharpe ratios in the one-period model also holds for American-style calls. Of course, if early exercise of the American call is optimal at some node and the optimal strategy is followed, then the American call’s Sharpe ratio is not deflned. This does not, how- ever, have any impact on our pricing technique because we exploit the equality of Sharpe ratios for the European-style call when we value the American-style call. 34",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Document",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 55,
    "chunk_index": 33,
    "word_count": 226,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "optimal at some node and the optimal strategy is followed, then the American call’s Sharpe ratio is not deflned. This does not, how- ever, have any impact on our pricing technique because we exploit the equality of Sharpe ratios for the European-style call when we value the American-style call. 34 the annualized continuously-compounded expected return on an asset is not the same as the expected annualized continuously-compounded return. That is 1 ln[E(R )] 6= E[ 1 ln(R )]. We use the former (de- T S T S noted k ), not the latter. S 35 A Derivations Appendix A.1 presents a general proof that applies to the CAPM, APT, or any multifactor asset pricing model (e.g., Fama and French (1996); Carhart (1997)). In the latter cases, the asset pricing models are neither equilibrium models nor arbitrage-free. It can be argued, however, that the Fama-French three-factor model accounts for an errors-in-variables problem in the tradi- tional CAPM. As such, the extra factors are simply proxies for measurement error in the market index and are being used to get better estimates of the equilibrium CAPM expected return than a single factor model can give (see Ferguson and Shockley (1999)). Appendix A.2 presents a certainty equiva- lentproofthatworksinageneralmean-varianceframework. AppendixA.3is a more traditional proof restricted to the CAPM framework. Appendix A.4 gives a numerical illustration. Each proof uses the following deflnitions. Let S and S be the asset 0 T price at time t = 0, and time t = T, respectively. Assume the asset pays no dividends, then R · S T is the total (or \\gross\") discretely-compounded S S 0 return on the asset from time 0 to time T (e.g., a realized value of R = 1:15 S indicates15percentgrowth). R issimilarlythetotalrisk-freeratefromtime F 36",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "19. Note that nonlinearity of the natural logarithm function implies that",
    "page_number": 37,
    "page_range": "p.37-38",
    "total_pages": 55,
    "chunk_index": 34,
    "word_count": 291,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "19. Note that nonlinearity of the natural logarithm function implies that (p.37-38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "and time t = T, respectively. Assume the asset pays no dividends, then R · S T is the total (or \\gross\") discretely-compounded S S 0 return on the asset from time 0 to time T (e.g., a realized value of R = 1:15 S indicates15percentgrowth). R issimilarlythetotalrisk-freeratefromtime F 36 0 to time T (so R = 1:10 represents 10 percent growth). Let SD(¢) denote F standard deviation, E(¢) denote expectation under real-world probability, and E⁄(¢) denote expectation under the risk-neutral measure. Let ” · S SD(R ). Deflne R , R , ” , ” similarly for calls and puts. Following Cox S C P C P and Rubinstein (1985), we have used \\”\" to denote standard deviation of total discretely-compounded return to distinguish it from (cid:190) which we shall reserve for standard deviation of continuously-compounded returns.16 A.1 General Proof Let V be the price of the derivative at time t. Let R be the total discretely- t V compounded return on the derivative from time 0 to time T. Then, under the assumptions of whichever asset pricing model we are using, we get the following. V E(R ) = E(V ) (6) 0 V T ) V [R +E(R )¡R ] = E(V ) (7) 0 F V F T E(V )¡V [E(R )¡R ] ) V = T 0 V F : (8) 0 R F 37",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "19. Note that nonlinearity of the natural logarithm function implies that",
    "page_number": 39,
    "page_range": "p.39-40",
    "total_pages": 55,
    "chunk_index": 35,
    "word_count": 230,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "19. Note that nonlinearity of the natural logarithm function implies that (p.39-40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "we are using, we get the following. V E(R ) = E(V ) (6) 0 V T ) V [R +E(R )¡R ] = E(V ) (7) 0 F V F T E(V )¡V [E(R )¡R ] ) V = T 0 V F : (8) 0 R F 37 The price elasticity › for a call is given by Equation (9). S¢ S (V ¡V ) (V ¡V ) › = = 0 u d = u d ; (9) C V (u¡d)S V (u¡d) 0 0 0 where ¢ = (Vu¡V d ); and u and d are the multiplicative up and down growth (u¡d)S 0 factors, respectively, for the underlying. In the case of a put, › = S¢; but P the end result is algebraically the same as in Equation (9). Now use the elasticity › from Equation (9) to substitute for the deriva- tive’s risk premium in Equation (8). E(V )¡V ›[E(R )¡R ] V = T 0 S F (10) 0 R ‡ F · E(V )¡ Vu¡V d [E(R )¡R ] ) V = T u¡d S F : (11) 0 R F Equation (11) is the same as Equation (1) from which our model follows. Thus, givenanappropriateassetpricingmodelandabinomialrepresentation of asset price movement, we can always derive the GOPOP model (and, iteratively, the GMPOP model). 38",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "19. Note that nonlinearity of the natural logarithm function implies that",
    "page_number": 40,
    "page_range": "p.40-41",
    "total_pages": 55,
    "chunk_index": 36,
    "word_count": 222,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "19. Note that nonlinearity of the natural logarithm function implies that (p.40-41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": ")¡ Vu¡V d [E(R )¡R ] ) V = T u¡d S F : (11) 0 R F Equation (11) is the same as Equation (1) from which our model follows. Thus, givenanappropriateassetpricingmodelandabinomialrepresentation of asset price movement, we can always derive the GOPOP model (and, iteratively, the GMPOP model). 38 A.2 Certainty Equivalent Proof Thisproofusesthepropertiesofmean-varianceanalysisandcertaintyequiva- lents (e.g., Luenberger (1998), Equation 7.7, p. 189). Under the assumptions of whichever mean-variance asset pricing model we are using, Equation (12) holds. \" # 1 cov(V ;R )[E(R )¡R ] V = E(V )¡ T MKT MKT F ; (12) 0 R T ”2 F MKT where R is the total discretely-compounded return on the market port- MKT folio from time t = 0 to time t = T. We may derive the following using the properties of the covariance operator: cov(V ;R ) = cov(V =V ;R )V = cov(R ;R )V T MKT T 0 MKT 0 V MKT 0 = cov(R ¡R ;R )V = ⁄ cov(›(R ¡R );R )V V F MKT 0 S F MKT 0 = cov((R ¡R );R )›V = cov(R ;R )›V S F MKT 0 S MKT 0 (cid:181) ¶ V ¡V = ⁄⁄ cov(R ;R ) u d ; S MKT u¡d where step ⁄ uses Cox and Rubinstein (1985, p. 189), and step ⁄⁄ uses our Equation (9). If we now plug the latter result into Equation (12), we get 39",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "19. Note that nonlinearity of the natural logarithm function implies that",
    "page_number": 41,
    "page_range": "p.41-42",
    "total_pages": 55,
    "chunk_index": 37,
    "word_count": 238,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "19. Note that nonlinearity of the natural logarithm function implies that (p.41-42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "MKT 0 S MKT 0 (cid:181) ¶ V ¡V = ⁄⁄ cov(R ;R ) u d ; S MKT u¡d where step ⁄ uses Cox and Rubinstein (1985, p. 189), and step ⁄⁄ uses our Equation (9). If we now plug the latter result into Equation (12), we get 39 Equation (13). \" (cid:181) ¶# 1 cov(R ;R )[E(R )¡R ] V ¡V V = E(V )¡ S MKT MKT F u d : (13) 0 R T ”2 u¡d F MKT From Cox and Rubinstein (1985, p. 189) or Ingersoll (1987, p. 90) we know that cov(R ;R )[E(R )¡R ] S MKT MKT F = E(R )¡R ; (14) ”2 S F MKT and plugging this into Equation (13) yields our Equation (1) from which all our analysis may be derived. A.3 Sharpe Ratio Proof For this proof we assume the conditions from Ingersoll (1987, Chapter 4) for the mean-variance problem with a risk-free asset. In our binomial setting we therefore need to assume quadratic utility for the agents in the economy because our asset returns are not from an elliptical distribution. We recog- nize that quadratic utility has some problems (e.g., Constantinides (1978), p. 610). We might argue, however, that although strictly speaking we do need quadratic utility, the binomial model is an approximation to a contin- 40",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "19. Note that nonlinearity of the natural logarithm function implies that",
    "page_number": 42,
    "page_range": "p.42-43",
    "total_pages": 55,
    "chunk_index": 38,
    "word_count": 221,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "19. Note that nonlinearity of the natural logarithm function implies that (p.42-43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "in the economy because our asset returns are not from an elliptical distribution. We recog- nize that quadratic utility has some problems (e.g., Constantinides (1978), p. 610). We might argue, however, that although strictly speaking we do need quadratic utility, the binomial model is an approximation to a contin- 40 uous time model where continuously-compounded returns (which are very close to discretely-compounded ones for small time intervals) are normally distributed.17 As such, if step sizes are small, and thus the approximation is good, our results will hold approximately for general utility functions. This assumes, of course, that the underlying genuinely follows a difiusion or pure jump process. Note that the CAPM used here assumes that the underlying can be sold short. Thus, this proof may apply only to flnancial options and not real options. In a one-period binomial model, Equations (15) through (20) hold from Cox and Rubinstein (1985, Chapter 5-5) altered to our notation. E(R ¡R ) = ›E(R ¡R ) (15) C F S F ” = ›” (16) C S fl = ›fl (17) C S E(R ¡R ) = ›E(R ¡R ) (18) P F S F ” = ¡›” (19) P S fl = ¡›fl (20) P S 41",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "19. Note that nonlinearity of the natural logarithm function implies that",
    "page_number": 43,
    "page_range": "p.43-44",
    "total_pages": 55,
    "chunk_index": 39,
    "word_count": 204,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "19. Note that nonlinearity of the natural logarithm function implies that (p.43-44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "notation. E(R ¡R ) = ›E(R ¡R ) (15) C F S F ” = ›” (16) C S fl = ›fl (17) C S E(R ¡R ) = ›E(R ¡R ) (18) P F S F ” = ¡›” (19) P S fl = ¡›fl (20) P S 41 where › is the elasticity of the option price relative to the current underlying security price (Equation (9)). The Sharpe ratio relationships for a call option and put option follow from our Equation (9) together with Equations (15) through (20).18 E(R )¡R ›(E(R )¡R ) E(R )¡R C F S F S F = = (21) ” ›” ” C S S E(R )¡R ›(E(R )¡R ) E(R )¡R P F = ¡ S F = ¡ S F (22) ” ›” ” C S S The Treynor measure relationships follow similarly. E(R )¡R ›(E(R )¡R ) E(R )¡R C F S F S F = = (23) fl ›fl fl C S S E(R )¡R ›(E(R )¡R ) E(R )¡R P F = ¡ S F = ¡ S F (24) fl ›fl fl C S S TheSharperatioisusuallyexpressedintermsofratesofreturn. However, for our derivation we need the Sharpe ratio expressed in terms of asset prices as in Equation (25). E(R ¡1)¡(R ¡1) S F Sharpe Ratio = ” S E(R )¡R S F = SD(R ) S 42",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "19. Note that nonlinearity of the natural logarithm function implies that",
    "page_number": 44,
    "page_range": "p.44-45",
    "total_pages": 55,
    "chunk_index": 40,
    "word_count": 227,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "19. Note that nonlinearity of the natural logarithm function implies that (p.44-45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "= ¡ S F (24) fl ›fl fl C S S TheSharperatioisusuallyexpressedintermsofratesofreturn. However, for our derivation we need the Sharpe ratio expressed in terms of asset prices as in Equation (25). E(R ¡1)¡(R ¡1) S F Sharpe Ratio = ” S E(R )¡R S F = SD(R ) S 42 ‡ · E S T ¡R S F = 0‡ · SD S T S 0 E(S )¡S R ) Sharpe Ratio = T 0 F: (25) SD(S ) T We now set the call option’s Sharpe ratio equal to the underlying asset’s Sharpe ratio and solve for the call option price C at time t = 0 as in 0 Equation (26). n h io E(C )¡SD(C )£ E(S T )¡S 0 R F C = T T SD(S T ) ; (26) 0 R F where C is the option price at time t = T. In Equation (26), we may T substitute for the following terms: C (C ¡C )” (C ¡C )” SD(C ) = C ›” = 0 u d S = u d S (27) T 0 S C (u¡d) (u¡d) 0 SD(S ) = S ” : (28) T 0 S When these are inserted into Equation (26) we get: ( (cid:181) ¶\" #) 1 C ¡C E(S )¡S R C = E(C )¡ u d T 0 F (29) 0 R T u¡d S F 0 43",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "19. Note that nonlinearity of the natural logarithm function implies that",
    "page_number": 45,
    "page_range": "p.45-46",
    "total_pages": 55,
    "chunk_index": 41,
    "word_count": 235,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "19. Note that nonlinearity of the natural logarithm function implies that (p.45-46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "(u¡d) (u¡d) 0 SD(S ) = S ” : (28) T 0 S When these are inserted into Equation (26) we get: ( (cid:181) ¶\" #) 1 C ¡C E(S )¡S R C = E(C )¡ u d T 0 F (29) 0 R T u¡d S F 0 43 • (cid:181) ¶ ‚ 1 C ¡C = E(C )¡ u d (E(R )¡R ) : (30) R T u¡d S F F We can convert Equation (30) to its continuous-time equivalent in Equa- tion (31). \" ˆ ! # C ¡C ‡ · C 0 = e¡r F T E(C T )¡ p u d p ek S T ¡er F T : (31) e(cid:190) T ¡e¡(cid:190) T The derivation for a put option equates the negative of the put option’s Sharpe ratio to the underlying security’s Sharpe ratio. Let P denote the put option value, then we arrive at Equation (32) which is similar, but not identical, to Equation (26). n h io E(P )+SD(P )£ E(S T )¡S 0 R F P = T T SD(S T ) : (32) 0 R F We may take Equation (28) together with Equation (33) P (P ¡P )” (P ¡P )” SD(P ) = ¡P ›” = ¡ 0 u d S = ¡ u d S (33) T 0 S P (u¡d) (u¡d) 0 and substitute them into Equation (32) to get Equations (34) and (35) for a 44",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "19. Note that nonlinearity of the natural logarithm function implies that",
    "page_number": 46,
    "page_range": "p.46-47",
    "total_pages": 55,
    "chunk_index": 42,
    "word_count": 241,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "19. Note that nonlinearity of the natural logarithm function implies that (p.46-47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "together with Equation (33) P (P ¡P )” (P ¡P )” SD(P ) = ¡P ›” = ¡ 0 u d S = ¡ u d S (33) T 0 S P (u¡d) (u¡d) 0 and substitute them into Equation (32) to get Equations (34) and (35) for a 44 put. • (cid:181) ¶ ‚ 1 P ¡P P = E(P )¡ u d (E(R )¡R ) (34) 0 R T u¡d S F F \" ˆ ! # P ¡P ‡ · P 0 = e¡r F T E(P T )¡ p u d p ek S T ¡er F T : (35) e(cid:190) T ¡e¡(cid:190) T Equations (34) and (35) for a put are of identical functional form to Equations (30) and (31) for a call, so we rewrite these equations using V to denote the value of an option that can be either a call or a put. • (cid:181) ¶ ‚ 1 V ¡V V = E(V )¡ u d (E(R )¡R ) (36) 0 R T u¡d S F F \" ˆ ! # V ¡V ‡ · V 0 = e¡r F T E(V T )¡ p u d p ek S T ¡er F T : (37) e(cid:190) T ¡e¡(cid:190) T Equations (36) and (37) are the same as Equations (1) and (2). We may equate Equation (36) to E(V )=[1 + kdisc] and equate Equa- T V tion (37) to E(V T )e¡k V contT to deduce the option’s total required risk-adjusted discretely-compounded discount rate kdisc and its annualized required risk- V adjusted continuously-compounded expected discount rate kcont in Equa- V 45",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "19. Note that nonlinearity of the natural logarithm function implies that",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 55,
    "chunk_index": 43,
    "word_count": 270,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "19. Note that nonlinearity of the natural logarithm function implies that (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "We may equate Equation (36) to E(V )=[1 + kdisc] and equate Equa- T V tion (37) to E(V T )e¡k V contT to deduce the option’s total required risk-adjusted discretely-compounded discount rate kdisc and its annualized required risk- V adjusted continuously-compounded expected discount rate kcont in Equa- V 45 tions (38) and (39), respectively.19 R kdisc = h F i (38) V 1¡ (Vu¡V d )(E(R S )¡R F ) (u¡d)E(V ) 2 T ‡ ·3 (V u ¡V d ) ek S T ¡er F T • 1 ‚ k V cont = r F ¡ln 4 1¡ ‡ e(cid:190) p T ¡e¡(cid:190) p T · E(V ) 5£ T : (39) T The GOPOP model may also be derived using the Treynor measure. The Treynor measure for a call option is equal to the Treynor measure for the underlying security. The Treynor measure for a put is the negative of the Treynor measure for the underlying security. Thus, the implication above for the Sharpe ratio in a one-period binomial model setting is also true for the Treynor measure. Using the Treynor measure, we can develop an equation similar to Equa- tion (26) for a call option. h i E(C )¡ C 0 fl C £ E(S T )¡S 0 R F C = T S 0 fl S : (40) 0 R F When we substitute ›fl for fl in Equation (40), we arrive at Equation (30). S C 46",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "19. Note that nonlinearity of the natural logarithm function implies that",
    "page_number": 48,
    "page_range": "p.48-49",
    "total_pages": 55,
    "chunk_index": 44,
    "word_count": 243,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "19. Note that nonlinearity of the natural logarithm function implies that (p.48-49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "tion (26) for a call option. h i E(C )¡ C 0 fl C £ E(S T )¡S 0 R F C = T S 0 fl S : (40) 0 R F When we substitute ›fl for fl in Equation (40), we arrive at Equation (30). S C 46 A similar relationship holds for the put option as follows: h i E(P )+ P 0 fl P £ E(S T )¡S 0 R F P = T S 0 fl S : (41) 0 R F Again, we make a similar substitution, ¡›fl for fl , and arrive at Equa- S P tion (34). A.4 Discussion and Numerical Illustration Our derivations are used to develop the GOPOP model and are valid only for a single step within the binomial tree. GMPOP is the iterative multi- period model that uses successive GOPOP calculations. To demonstrate the one-period nature of the GOPOP model, we expanded Table III and created Table VIII to show the one-period risk premium of the option\\RP,\" the one- period standard deviation of the option return \\SD,\" and the one-period Sharpe ratio \\SR.\" Theone-periodSharperatiofortheunderlyingsecurityis0.036429through- out the entire binomial tree and is computed by taking the one-period ex- pected return under the real-world probability less the one-period risk-free rate divided by the standard deviation of the one-period return under the 47",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "19. Note that nonlinearity of the natural logarithm function implies that",
    "page_number": 49,
    "page_range": "p.49-50",
    "total_pages": 55,
    "chunk_index": 45,
    "word_count": 222,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "19. Note that nonlinearity of the natural logarithm function implies that (p.49-50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "standard deviation of the option return \\SD,\" and the one-period Sharpe ratio \\SR.\" Theone-periodSharperatiofortheunderlyingsecurityis0.036429through- out the entire binomial tree and is computed by taking the one-period ex- pected return under the real-world probability less the one-period risk-free rate divided by the standard deviation of the one-period return under the 47 real-world probability. We notice that the relationship for the Sharpe ratio in the GOPOP model is maintained every period whenever the option has value. Using this relationship iteratively, we produce the GMPOP model. Although the single-period Sharpe ratio is constant whenever the option has value, the components for the Sharpe ratio of the option change every period. In particular, the risk premium RP of the option changes every period with a proportionate change in the one-period return volatility SD. Thus, unlike the underlying security, the expected rate of return on the option changes every period. The GOPOP model is a single-period model because of the changing components in the Sharpe ratio of the option every period. Consequently, theGOPOPmodeldoesnotuseasinglediscountratefortheoptionsincethe discount rate changes every period. Instead, we use the one-period Sharpe ratio since it is constant every period (assuming the option has value). In contrast to the Sharpe ratio, the only way to have a constant discount rate for the option every period is to use the risk-neutral measure (the Sharpe ratio and risk premium become zero for all securities). Again, all of these points are also true using the Treynor measure. 48",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "19. Note that nonlinearity of the natural logarithm function implies that",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 55,
    "chunk_index": 46,
    "word_count": 241,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "19. Note that nonlinearity of the natural logarithm function implies that (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "In contrast to the Sharpe ratio, the only way to have a constant discount rate for the option every period is to use the risk-neutral measure (the Sharpe ratio and risk premium become zero for all securities). Again, all of these points are also true using the Treynor measure. 48 1 2 3 4 5 S S S S S S p5 u uu uuu uuuu uuuuu S d S du S duu S duuu S duuuu 5p4(1¡p) S dd S ddu S dduu S dduuu 10p3(1¡p)2 S ddd S dddu S ddduu 10p2(1¡p)3 S dddd S ddddu 5p(1¡p)4 S ddddd (1¡p)5 Table I: Stock Values in Five-Stage Binomial Tree Asset values and terminal probabilities assuming the asset price jumps by a mul- tiplicative factor u with probability p, and by a factor d with probability (1¡p). Thus, S ddu = S £d£d£u, for example. Current Period Period Period Period Period Probability 1 2 3 4 5 V(0;0) V(1;0) V(2;0) V(3;0) V(4;0) V uuuuu p5 V(0;1) V(1;1) V(2;1) V(3;1) V duuuu 5p4(1¡p) V(0;2) V(1;2) V(2;2) V dduuu 10p3(1¡p)2 V(0;3) V(1;3) V ddduu 10p2(1¡p)3 V(0;4) V ddddu 5p(1¡p)4 V ddddd (1¡p)5 Table II: Option Values in Five-Stage Binomial Tree Option values and terminal probabilities assuming the asset price jumps by a multiplicative factor u with probability p, and by a factor d with probability (1¡ p).",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Current Period Period Period Period Period Probability",
    "page_number": 51,
    "page_range": "p.51-52",
    "total_pages": 55,
    "chunk_index": 47,
    "word_count": 225,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Current Period Period Period Period Period Probability (p.51-52)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "V dduuu 10p3(1¡p)2 V(0;3) V(1;3) V ddduu 10p2(1¡p)3 V(0;4) V ddddu 5p(1¡p)4 V ddddd (1¡p)5 Table II: Option Values in Five-Stage Binomial Tree Option values and terminal probabilities assuming the asset price jumps by a multiplicative factor u with probability p, and by a factor d with probability (1¡ p). Current Period Period Period Period Period Real-World Risk-Neutral 1 2 3 4 5 Probability Probability $4.32 $2.11 $0.64 $0.00 $0.00 $0.00 4.01% 3.36% $6.66 $3.67 $1.30 $0.00 $0.00 18.09% 16.32% $9.86 $6.18 $2.66 $0.00 32.67% 31.69% $13.81 $9.90 $5.45 29.50% 30.78% $18.08 $14.64 13.32% 14.95% $21.93 2.41% 2.90% Table III: European Put Option Value in Five-Stage Binomial Tree S = $50, k S = 0:15, (cid:190) = 0:40, X = $50, T = 1=12 (i.e., each step size p is one p month), r F = 0:10. The und p erlying grows with either u = e(cid:190) T = e0:40 1 1 2 = p 1:1224, or d = e¡(cid:190) T = e¡0:40 1 1 2 = 0:8909 over each time step of T = 1=12. The real-world probability of an up move is p = ekST¡d = 0:52551 at each step. u¡d Current Period Period Period Period Period Real-World Risk-Neutral 1 2 3 4 5 Probability Probability $4.49 $2.16 $0.64 $0.00 $0.00 $0.00 4.01% 3.36% $6.96 $3.77 $1.30 $0.00 $0.00 18.09% 16.32% $10.36 $6.38 $2.66 $0.00 32.67% 31.69% $14.64 $10.31 $5.45 29.50% 30.78% $18.50 $14.64 13.32% 14.95% $21.93 2.41% 2.90% Table IV: American Put Option Value in Five-Stage Binomial Tree S = $50, k S = 0:15, (cid:190) = 0:40, X = $50, T = 1=12 (i.e., each step size is one month), r F = 0:10. 50",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Current Period Period Period Period Period Probability",
    "page_number": 52,
    "page_range": "p.52",
    "total_pages": 55,
    "chunk_index": 48,
    "word_count": 279,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Current Period Period Period Period Period Probability (p.52)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "$14.64 $10.31 $5.45 29.50% 30.78% $18.50 $14.64 13.32% 14.95% $21.93 2.41% 2.90% Table IV: American Put Option Value in Five-Stage Binomial Tree S = $50, k S = 0:15, (cid:190) = 0:40, X = $50, T = 1=12 (i.e., each step size is one month), r F = 0:10. 50 Current Period Period Period Period Period Real-World Risk-Neutral 1 2 3 4 5 Probability Probability $200.00 $364.42 $664.02 $1209.93 $2204.64 $4017.11 3.42% 0.96% $109.76 $200.00 $364.42 $664.02 $1209.93 16.50% 7.34% $60.24 $109.76 $200.00 $364.42 31.81% 22.52% $33.06 $60.24 $109.76 30.65% 34.55% $18.14 $33.06 14.77% 26.50% $9.96 2.85% 8.13% Table V: Annual Market Sales Revenue ($ Millions) Annuallevelsofpotentialfuturesalesandterminalprobabilitiesassumingthesales levels jump by a multiplicative factor u with probability p, and by a factor d with p p probability (1¡p), where u = e(cid:190) T , d = e¡(cid:190) T , p = ekT¡d in the real world, and u¡d p = er u F ¡ T d ¡d in the risk-neutral world, where r F = 0:05, (cid:190) = 0:60, k = 0:18, and T = 1 per period. Current Period Period Period Period Period Real-World Risk-Neutral 1 2 3 4 5 Probability Probability $73.25 $170.48 $388.45 $859.73 $1824.14 $3617.11 3.42% 0.96% (25.686%) (24.970%) (24.004%) (22.628%) (20.511%) $16.08 $42.84 $114.12 $304.02 $809.93 16.50% 7.34% (30.500%) (30.500%) (30.500%) (30.500%) $0.00 $0.00 $0.00 $0.00 31.81% 22.52% (0.000%) (0.000%) (0.000%) $0.00 $0.00 $0.00 30.65% 34.55% (0.000%) (0.000%) $0.00 $0.00 14.77% 26.50% (0.000%) $0.00 2.85% 8.13% Table VI: Option Value ($ Millions) with Periodic Option Rate of Return Option values and terminal probabilities using the GMPOP model based on the sales levels in Table V. The probability of success in the real world is 3.42 per- cent+16.50 percent=19.92 percent. 51",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Current Period Period Period Period Period Probability",
    "page_number": 53,
    "page_range": "p.53",
    "total_pages": 55,
    "chunk_index": 49,
    "word_count": 284,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Current Period Period Period Period Period Probability (p.53)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "14.77% 26.50% (0.000%) $0.00 2.85% 8.13% Table VI: Option Value ($ Millions) with Periodic Option Rate of Return Option values and terminal probabilities using the GMPOP model based on the sales levels in Table V. The probability of success in the real world is 3.42 per- cent+16.50 percent=19.92 percent. 51 Panel A: Individual Present Value Calculations Future Value Discount Factor* PV** $3,617.11 exp(¡(25:686%+24:970%+24:004%+22:628%+20:511%)) $1113.70 $809.93 exp(¡(25:686%+24:970%+24:004%+22:628%+20:511%)) $249.38 $809.93 exp(¡(25:686%+30:500%+30:500%+30:500%+30:500%)) $184.95 $809.93 exp(¡(25:686%+24:970%+30:500%+30:500%+30:500%)) $195.46 $809.93 exp(¡(25:686%+24:970%+24:004%+35:500%+35:500%)) $208.58 $809.93 exp(¡(25:686%+24:970%+24:004%+22:628%+35:500%)) $225.67 * see Table VI for the single-period discount rate inputs; exp(¢) is the exponential function **PV= value from Column 1 multiplied by value from Column 2 Panel B: Probability Weighted Present Value Calculations PV Probability Probability*PV $1113.70 3.42427% $38.14 $249.38 3.30014% $8.23 $184.95 3.30014% $6.10 $195.46 3.30014% $6.45 $208.58 3.30014% $6.88 $225.67 3.30014% $7.45 Sum: $73.25 Table VII: Traditional DCF Analysis of Product Development ($ Millions) This table shows the calculations necessary to replicate the real-option valuation using traditional DCF analysis with path-dependent discount rates drawn from Table VI. 52",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Current Period Period Period Period Period Probability",
    "page_number": 54,
    "page_range": "p.54-55",
    "total_pages": 55,
    "chunk_index": 50,
    "word_count": 169,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Current Period Period Period Period Period Probability (p.54-55)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "3.30014% $8.23 $184.95 3.30014% $6.10 $195.46 3.30014% $6.45 $208.58 3.30014% $6.88 $225.67 3.30014% $7.45 Sum: $73.25 Table VII: Traditional DCF Analysis of Product Development ($ Millions) This table shows the calculations necessary to replicate the real-option valuation using traditional DCF analysis with path-dependent discount rates drawn from Table VI. 52 Current: Period Period Period Period Period 1 2 3 4 5 $4.32 $2.11 $0.64 $0.00 $0.00 $0.00 RP: ¡1:9158% RP: ¡2:6124% RP: ¡3:7231% RP: 0:0000% RP: 0:0000% RP: 0:0000% SD: 0.52590 SD: 0.71712 SD: 1.02202 SD: 0.00000 SD: 0.00000 SD: 0.00000 SR: ¡:036429 SR: ¡:036429 SR: ¡:036429 SR: N/A SR: N/A SR: N/A $6.66 $3.67 $1.30 $0.00 $0.00 RP: ¡1:6882% RP: ¡2:4143% RP: ¡3:7231% RP: 0:0000% RP: 0:0000% SD: 0.46342 SD:0.66274 SD: 1.02202 SD: 0.00000 SD: 0.00000 SR: ¡:036429 SR: ¡:036429 SR: ¡:036429 SR: N/A SR: N/A $9.86 $6.18 $2.66 $0.00 RP: ¡1:4096% RP: ¡2:1302% RP: ¡3:7231% RP: 0:0000% SD: 0.38695 SD: 0.58476 SD: 1.02202 SD: 0.00000 SR: ¡:036429 SR: ¡:036429 SR: ¡:036429 SR: N/A $13.81 $9.90 $5.45 RP: ¡1:0779% RP: ¡1:6887% RP: 0:0000% SD: 0.29589 SD: 0.46355 SD: 0.00000 SR: ¡:036429 SR: ¡:036429 SR: N/A $18.08 $14.64 RP: ¡0:7336% RP: 0:0000% SD: 0.20139 SD: 0.00000 SR: ¡:036429 SR: N/A $21.93 RP: 0.0000% SD: 0.00000 SR: N/A Table VIII: Expanded Calculation for European Put Option This table shows more detail for the European put option valuation in Table III. S = $50, k S = 0:15, (cid:190) = 0:40, X = $50, T = 1=12 (i.e., each step size p is one p month), r F = 0:10. The under p lying grows with either u = e(cid:190) T = e0:40 1 1 2 = p 1:1224, or d = e¡(cid:190) T = e¡0:40 1 1 2 = 0:8909 over each time step of T = 1=12. The real-world probability of an up move is p = ekST¡d = 0:52551 at each step. u¡d To aid reader replication and interpretation, note that at the flrst step, S = 50, Su = 56:1200451, Sd = 44:5473626, P u = 2:11412203, P d = 6:66278573, and Equation (4) or (3) is used to get P = 4:319018717. RP = E(R P) ¡ R F = pPu+(1¡p)P d ¡ er F T = 0:989210262 ¡ 1:008368152 = ¡0:0191578903. SD = p P p(Pu¡E(P T ))2+ P (1¡p)(P d ¡E(P T ))2 = 0:525899514, where E(P T) = pP u+(1¡p)P d = 4:2724176357, SR = RP = ¡0:01915789 = ¡0:0364288040. It can be verifled SD 0:525899514 that this is the negative of the Sharpe 53 ratio for the stock: SR = E(R S )¡R F = ” S £p ekST¡erFT ⁄ = 0:004210299 = 0:0364288040 p(Su¡E(S ))2+(1¡p)(Sd¡E(S ))2 =S 0:115576107 T T",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Current Period Period Period Period Period Probability",
    "page_number": 55,
    "page_range": "p.55",
    "total_pages": 55,
    "chunk_index": 51,
    "word_count": 448,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Current Period Period Period Period Period Probability (p.55)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  },
  {
    "text": "4:2724176357, SR = RP = ¡0:01915789 = ¡0:0364288040. It can be verifled SD 0:525899514 that this is the negative of the Sharpe 53 ratio for the stock: SR = E(R S )¡R F = ” S £p ekST¡erFT ⁄ = 0:004210299 = 0:0364288040 p(Su¡E(S ))2+(1¡p)(Sd¡E(S ))2 =S 0:115576107 T T",
    "title": "gopop2.dvi",
    "source_type": "pdf",
    "document_id": "53332542a4ef",
    "source_file": "Option Pricing in the Real World.pdf",
    "section": "Current Period Period Period Period Period Probability",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 55,
    "chunk_index": 52,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Current Period Period Period Period Period Probability (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:191030415100158",
    "duration": null
  }
]