[
  {
    "text": "CHRISTOPHER S. JONES and JOSHUA SHEMESH∗ May 9, 2017 Abstract We find that option returns are significantly lower over nontrading periods, the vast majority of which are weekends. Our evidence suggests that nontrading returns cannot be explained by risk, but are rather the result of widespread and highly persistent option mispricing driven by the incorrect treatment of stock return variance during periods of market closure. The size of the effect implies that the broad spectrum of finance research involving option prices should account for nontrading effects. Our study further suggests how alternative industry practices could improve the efficiency of option markets in a meaningful way. ∗Christopher S. Jones is with the Marshall School of Business at the University of Southern California. Joshua ShemesiswiththeDepartmentofBankingandFinanceattheMonashBusinessSchool. Wearegratefulforcomments fromtheeditors,CamHarveyandKenSingleton,twoanonymousreferees,MikeChernov,DanGalai,BruceGrundy, Larry Harris, Robert Hudson, Blair Hull, Nikunj Kapadia, Spencer Martin, Dmitriy Muravyev, Oguz Ozbas, Yigal Newman, Nick Polson, Allen Poteshman, Eric Renault, David Solomon, Selale Tuzel, Mark Weinstein, Fernando Zapatero, and seminar participants at USC, the University of Queensland, Hebrew University, the 2009 Montreal Financial Econometrics Conference, the 2009 Financial Management Association meetings, and the 2010 American Finance Association meetings. Most of the research was done while Shemesh was affiliated with the University of Melbourne. Shemesh thanks the Sanger Chair of Banking and Risk Management for financial support. Both authors state that their work on this research was not supported financially by any non-academic sources and that no organization or individual has had any right to review this work. Electronic copy available at: https://ssrn.com/abstract=1364721 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "Option Mispricing Around Nontrading Periods",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 86,
    "chunk_index": 0,
    "word_count": 254,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Mispricing Around Nontrading Periods (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "Chair of Banking and Risk Management for financial support. Both authors state that their work on this research was not supported financially by any non-academic sources and that no organization or individual has had any right to review this work. Electronic copy available at: https://ssrn.com/abstract=1364721 Electronic copy available at: https://ssrn.com/abstract=1364721 JEL classification: G12, G13, G14 Keywords: Nontrading, Weekend Effect, Equity Options 2 Electronic copy available at: https://ssrn.com/abstract=1364721 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "Option Mispricing Around Nontrading Periods",
    "page_number": 2,
    "page_range": "p.2-3",
    "total_pages": 86,
    "chunk_index": 1,
    "word_count": 72,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Mispricing Around Nontrading Periods (p.2-3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "by any non-academic sources and that no organization or individual has had any right to review this work. Electronic copy available at: https://ssrn.com/abstract=1364721 Electronic copy available at: https://ssrn.com/abstract=1364721 JEL classification: G12, G13, G14 Keywords: Nontrading, Weekend Effect, Equity Options 2 Electronic copy available at: https://ssrn.com/abstract=1364721 Electronic copy available at: https://ssrn.com/abstract=1364721 A variety of institutional and psychological factors suggest that portfolio risk and return may differ between periods of trading and nontrading. The stock market is more volatile over trading periods than it is over nontrading periods, possibly the result of a lower rate of private information revelation (French and Roll (1986)). It is also profoundly less liquid outside of regular trading hours, which should drive a wedge between average returns over tradingandnontradingperiods(French(1980),Longstaff(1995),KellyandClark(2011),and Cliff, Cooper, and Gulen (2008)). Prolonged periods of nontrading may also give investors with limited attention a chance to process stale information, whether it is firm earnings an- nouncements(DellavignaandPollet(2009))ornewsmoregenerally(Garcia(2013)). Finally, traders may have a strong desire to exit the market over nontrading periods, with no open positions, particularly for more speculative strategies or for longer periods of nontrading (Hendershott and Seasholes (2006)). While all of these effects have been documented to varying degrees in the market for individual stocks or stock indexes, we might expect most or all to be even more impactful in the market for options. Predictable differences in volatility should have first order effects on options prices (see also Dubinsky and Johannes (2006)), while varying liquidity affects not only the option end user but also the market maker who must delta-hedge his under- lying exposure in the stock market (e.g., Cetin et al. (2006)). Limited attention may be more problematic in options markets, where small changes in fundamentals can have large valuation effects. Finally, option trades, particularly for net written option positions, can be extremely risky, pushing some traders to withdraw completely during overnight or weekend 1 Electronic copy available at: https://ssrn.com/abstract=1364721 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "Option Mispricing Around Nontrading Periods",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 86,
    "chunk_index": 2,
    "word_count": 322,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Mispricing Around Nontrading Periods (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "be more problematic in options markets, where small changes in fundamentals can have large valuation effects. Finally, option trades, particularly for net written option positions, can be extremely risky, pushing some traders to withdraw completely during overnight or weekend 1 Electronic copy available at: https://ssrn.com/abstract=1364721 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "Option Mispricing Around Nontrading Periods",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 86,
    "chunk_index": 3,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Mispricing Around Nontrading Periods (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "periods. It is the desire to close positions over the weekend that Chen and Singal (2003) conclude was responsible for the weekend effect in stocks. The weekend effect, or the tendency of stock returns to be low over the weekend, is perhaps the most widely documented nontrading effect (French (1980)). Though evidence of the effect goes back to the early 1900s (Fields (1931)), authors such as Connolly (1989) and Chang, Pinegar, and Ravichandran (1993) showed it started to dissipate in the 1970s or ’80s. Chen and Singal hypothesized that the desire to close positions before the weekend would be most pronounced for short sellers who were deterred by the unbounded downside risk inherent in their positions. When option markets opened in the 1970s and ’80s, the same investors were able to take bearish positions with limited downside risk or hedge downside risk over nontrading periods using options. In support of their hypothesis, Chen and Singal showed that the introduction of options on a firm’s stock coincides with the elimination of the weekend effect for that firm. Writing options also exposes a trader to unbounded downside risk, particularly over nontrading periods. For call options, this comes from the potentially infinite positive payoff that accrues to the option buyer as the stock price rises. While delta hedging reduces that exposure, the inability to perfectly hedge due to transactions costs, price discontinuities, and nontrading periods means that this downside risk cannot be eliminated. That is, a call writer can experience an arbitrarily large loss if the stock price rises high enough before the hedge can be rebalanced. When writing put options, downside risk is bounded but often extremely large, since the maximum payoff (which occurs when the stock price drops to zero) can 2 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "Option Mispricing Around Nontrading Periods",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 86,
    "chunk_index": 4,
    "word_count": 296,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Mispricing Around Nontrading Periods (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "experience an arbitrarily large loss if the stock price rises high enough before the hedge can be rebalanced. When writing put options, downside risk is bounded but often extremely large, since the maximum payoff (which occurs when the stock price drops to zero) can 2 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "Option Mispricing Around Nontrading Periods",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 86,
    "chunk_index": 5,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Mispricing Around Nontrading Periods (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "be orders of magnitude greater than the option’s price. Paradoxically, delta-hedging a put causes this downside to become unbounded, since hedging requires taking a short position in the stock, which is itself unbounded. Thus, if investors are generally averse to holding positions with extreme downside risk over the weekend, then option writers may have an incentive to cover their positions by Friday close. While this should have no effect in a Black-Scholes world in which options can be replicated via continuous trading, Bollen and Whaley (2004) show empirically that demandpressuredoesinfacthaveasubstantialimpactonoptionprices. Garleanu, Pedersen, and Poteshman (2009) add to this evidence and show theoretically that the effect is driven by the inability to perfectly replicate. Since covering net written option positions can be regarded as positive demand pressure, any tendency to do so prior to Friday close should lead to temporarily higher option prices that return to normal by the following Monday. Alternatively, those same investors would be willing to keep their short positions open given some additional compensation for the substantial downside risk they face. Since com- pensation to option writers comes in the form of negative option returns, this argument also suggests that we should see a weekend effect in call and put options, with weekend option returns being significantly lower than returns over the rest of the week. Using a large sample of daily returns on equity options over the period from January 1996 to August 2014, we investigate nontrading effects in the equity option market. We find pervasive, large, and highly statistically significant evidence that nontrading returns on options are lower than trading returns. We focus on average returns on delta-neutral 3 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "Option Mispricing Around Nontrading Periods",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 86,
    "chunk_index": 6,
    "word_count": 279,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Mispricing Around Nontrading Periods (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "over the period from January 1996 to August 2014, we investigate nontrading effects in the equity option market. We find pervasive, large, and highly statistically significant evidence that nontrading returns on options are lower than trading returns. We focus on average returns on delta-neutral 3 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "Option Mispricing Around Nontrading Periods",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 86,
    "chunk_index": 7,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Mispricing Around Nontrading Periods (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "positions, which are highly negative over periods of nontrading, namely weekends and mid- week holidays, but essentially zero on average on other days. There is no evidence of any nontrading effect in underlying stock returns in our sample. We find strong effects in puts and calls and across almost all levels of maturity and moneyness, and results are robust to different sampling methods and weighting schemes. The nontrading effect is negative in each year of our 19-year sample, and it is statistically significant in most. We also find strong evidence of a nontrading effect in S&P 500 Index puts and weaker evidence of nontrading effects in S&P 500 Index calls. We find significant nontrading effects for regular weekends, long weekends, and mid-week holidays. Nontrading effects are also evident in implied volatilities. As noted by French and Roll (1986), the variance of the return over a weekend (Friday close to Monday close) is just slightly greater than the variance over a regular weekday, implying little variance during periods of market closure. However, implied volatilities seem to embed the expectation that stock price variance will remain sizable even when the market is closed. This discrepancy is large and significant for both equity options and S&P 500 Index options. Wethenexplorethreepossibleexplanationsforthesefindings. Thefirstisthatnontrading returnsarelowerbecauseofdifferentiallevelsofriskbetweentradingandnontradingperiods. The second is that aversion to unbounded downside risk rises over nontrading periods, as hypothesized by Chen and Singal (2003). Since this risk is experienced by option writers but not buyers, option writers will require a higher risk premium to keep positions open. Since writers are short options, this means that option returns must be negative over the weekend. 4 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "Option Mispricing Around Nontrading Periods",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 86,
    "chunk_index": 8,
    "word_count": 274,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Mispricing Around Nontrading Periods (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "by Chen and Singal (2003). Since this risk is experienced by option writers but not buyers, option writers will require a higher risk premium to keep positions open. Since writers are short options, this means that option returns must be negative over the weekend. 4 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "Option Mispricing Around Nontrading Periods",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 86,
    "chunk_index": 9,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Mispricing Around Nontrading Periods (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "The last is that the nontrading effect is the result of widespread and highly persistent market mispricing. We find that portfolios of delta-neutral positions do show somewhat greater risk over nontrading periods relative to trading periods. For puts, the effect is modest. The put portfolio’sstandarddeviationisabout10%higherovernontradingperiods(mostlyweekends) than it is over regular trading intervals, and there is no significant change in return skewness or kurtosis. In contrast, the call portfolio’s standard deviation is about 50% higher over nontrading periods, and this is accompanied by a significant increase in kurtosis. Despite the increase in risk over nontrading periods, writing options remains attractive according to a number of performance measures. Short option positions display positive and significant alphas over nontrading periods that far exceed those of trading periods. Sharpe ratios and information ratios are also much higher over nontrading periods. We account for nonnormality in the distribution of option returns by computing certainty equivalent rates under power utility and by computing the performance indexes of Kadan and Liu (2014), which are designed to account for the effects of higher moments. For each of the option portfolios considered, these measures are generally higher for nontrading periods, in most cases by an amount that is both substantial and significant, with the strongest results for delta-hedged puts. In order to examine whether the nontrading effect is associated with a greater aversion to risk, rather than with risk by itself, we examine cross-sectional relations between portfolio risk and the nontrading effect. We find that the magnitude of the effect is highly related to 5 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "Option Mispricing Around Nontrading Periods",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 86,
    "chunk_index": 10,
    "word_count": 261,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Mispricing Around Nontrading Periods (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "order to examine whether the nontrading effect is associated with a greater aversion to risk, rather than with risk by itself, we examine cross-sectional relations between portfolio risk and the nontrading effect. We find that the magnitude of the effect is highly related to 5 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "Option Mispricing Around Nontrading Periods",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 86,
    "chunk_index": 11,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Mispricing Around Nontrading Periods (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "the Black-Scholes “gamma,” which is the second derivative of the option price with respect to the stock price. We verify that higher gammas are strongly associated with greater risk in delta-hedged option portfolios, both over trading and nontrading periods. This is expected given that higher convexity reduces the effectiveness of delta hedging, particularly when underlying price movements are large. Thus, if option writers have a greater aversion to downside risk over nontrading periods, as Chen and Singal’s (2003) hypothesis suggests, then higher gamma options should experience greater negative nontrading returns. Likewise, the same logic would seemingly apply to “vega,” which is the derivative of the optionpricewithrespecttovolatility. Highervegamakesanoptionmoresensitivetochanges in the volatility of the underlying asset and therefore increases the risk of the option position, even if it is delta-hedged. In fact, we find that the risk in delta-hedged option positions is even more strongly related to vega than it is to gamma. Surprisingly, however, greater vega does not seem to result in any additional return over nontrading intervals. Thus, greater risk aversion by option writers can only explain the nontrading effect given a reason why one type of risk exposure (gamma) is undesirable while an even more important type (vega) is not. The explanation that is more consistent with our findings is that investors are pricing options using a method that does not properly account for the difference in the behavior of stock prices when the market is open or closed. As French (1984) demonstrated over 30 years ago, if market participants do not account for the deterministic link between trading time and volatility, then option implied volatilities will tend to be too high just prior to 6 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "Option Mispricing Around Nontrading Periods",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 86,
    "chunk_index": 12,
    "word_count": 282,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Mispricing Around Nontrading Periods (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "prices when the market is open or closed. As French (1984) demonstrated over 30 years ago, if market participants do not account for the deterministic link between trading time and volatility, then option implied volatilities will tend to be too high just prior to 6 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "Option Mispricing Around Nontrading Periods",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 86,
    "chunk_index": 13,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Mispricing Around Nontrading Periods (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "nontrading periods. Furthermore, option prices will embed a rate of time decay that is too large over nontrading periods and too small over trading periods. This would result in a nontrading effect like the one we document, particularly one that is driven by gamma risk but not vega risk, as it is gamma rather than vega that is closely tied to time decay. The result is widespread mispricing in the option market, in which abnormal rates of return on all options – but particularly those with high gamma – are negative over weekends and mid-week holidays. Our results imply that studies analyzing equity options data would benefit from account- ing for nontrading effects, either by controlling for them explicitly or by analyzing data at a frequency (e.g., weekly or intraday) at which the nontrading effect can safely be ignored. Given that the effect of nontrading on expected returns is at least as large as the risk premia generated by traditional option pricing models, our findings also suggest that mispricing may play a larger role in the option market than has been emphasized in the literature thus far. Since option prices are used in many types of research (volatility estimation, reaction to cor- porate events, understanding the risk/return relation) to infer the representative investor’s information set, we believe that our findings should be of broad interest. While a stand-alone trading strategy capturing the entire nontrading effect would be hindered by transactions costs, our results remain useful for improving option-based trading strategies. Most obviously, nontrading effects have clear implications for the timing at which option traders should enter and exit their positions. Our findings should also be useful in quote setting, whether by market makers or other traders using limit orders. 7 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "Option Mispricing Around Nontrading Periods",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 86,
    "chunk_index": 14,
    "word_count": 295,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Mispricing Around Nontrading Periods (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "for improving option-based trading strategies. Most obviously, nontrading effects have clear implications for the timing at which option traders should enter and exit their positions. Our findings should also be useful in quote setting, whether by market makers or other traders using limit orders. 7 Electronic copy available at: https://ssrn.com/abstract=1364721 Onapracticallevel, ourstudysuggeststhatmarketefficiencymaybeimprovedbygreater awareness of the problems associated with option pricing in calendar time. Currently, option pricing models are often implemented in calendar time, rather than in trading time, both in archival datasets (e.g., Ivy DB) and in market data feeds (e.g., the VIX Index). We have rarely seen any discussion of the shortcomings of this approach. Were market participants (traders and data providers) to begin implementing models in trading time, we believe that market efficiency could be improved measurably.1 We know of only one other paper, Sheikh and Ronn (1994), that investigates weekly patterns in options markets. In examining short-term at-the-money options on 30 stocks over a period of just 21 months, Sheikh and Ronn find some evidence of a weekly seasonal in which call returns are highest on Wednesdays, but they do not find a weekend effect in calls or in puts. Furthermore, after adjusting option returns by subtracting Black-Scholes model-implied returns, the pattern in calls disappears, though a significant weekend effect arises in adjusted put returns. Our paper therefore resolves the ambiguity of their findings, showing that weekend effects are present in both calls and puts over a far more extensive sample. The paper is organized as follows. In Section 1, we describe our data, sampling methods, and portfolio construction. Section 2 contains our main results documenting nontrading effects in returns and implied volatilities. Section 3 examines the relationship between non- trading effects and various measures of risk. Section 4 concludes. 8 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "Option Mispricing Around Nontrading Periods",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 86,
    "chunk_index": 15,
    "word_count": 299,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Mispricing Around Nontrading Periods (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "follows. In Section 1, we describe our data, sampling methods, and portfolio construction. Section 2 contains our main results documenting nontrading effects in returns and implied volatilities. Section 3 examines the relationship between non- trading effects and various measures of risk. Section 4 concludes. 8 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "Option Mispricing Around Nontrading Periods",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 86,
    "chunk_index": 16,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Mispricing Around Nontrading Periods (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "Our primary data source is the Ivy DB data set from OptionMetrics. This data set includes all US listed options on equities, indexes, and ETFs. In our paper, we generally restrict our attention to individual equity options on stocks that were members of the S&P 500 as of the end of the prior year, though for some results we examine all equity options or options on the S&P 500 Index itself. Throughout our analysis, we form portfolios of call and put options by taking the equal or value weighted average of the returns, either hedged or unhedged, of each option in that portfolio. Our dataset includes closing bid-ask quotes rather than transaction prices, so we compute values and returns from quote midpoints. Since options have zero net supply, the concept of value weighting must be reinterpreted, and what we call value weighted portfolios are actually weighted by the dollar value of open interest for each option. Excess returns are computed using the shortest maturity yield provided in the Ivy DB zero curve file. In some cases, we form call and put portfolios on the basis of maturity and/or delta. We consider three maturity ranges and six delta ranges so that all options in a given portfolio are roughly comparable and all portfolios have a reasonable number of options included. When we pool calls and puts into a single portfolio, calls and puts are each given a 50% weight, which is a way to make the resulting portfolio approximately delta-neutral and yet model-free.2 Because many option contracts are rarely traded, we choose our sample to alleviate 9 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 86,
    "chunk_index": 17,
    "word_count": 271,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "pool calls and puts into a single portfolio, calls and puts are each given a 50% weight, which is a way to make the resulting portfolio approximately delta-neutral and yet model-free.2 Because many option contracts are rarely traded, we choose our sample to alleviate 9 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 86,
    "chunk_index": 18,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "the concern that our results are driven by untraded contracts. We therefore focus on a relatively liquid subsample, namely those options that have traded with positive volume for five consecutive days as of the formation day. These contracts exhibit much higher trading volume, on average, during our holding period, and they have much smaller bid-ask spreads. Because individual equity options are American, early exercise can be optimal for in-the- money puts and for in-the-money calls that are about to pay dividends, and the investment return based on optimal exercise could be greater than the no-exercise return we compute. To alleviate the problem for calls, we exclude all observations that occur in the five days leading up to and including a stock’s ex-dividend date, a conservative range that includes all dates on which early call exercise is optimal. Early exercise will remain a minor issue for deep in-the-money puts. We impose several additional filters to eliminate a small number of observations that appear to be data errors, that violate arbitrage conditions, or appear to represent non- competitive quotes. First, we eliminate observations where there is a large reversal (2000% followed by -95% or vice versa) in option returns or delta-hedged returns. We also eliminate options that violate arbitrage bounds. For options on equities, which are American, we require that the option price be no less than the current exercise value. For calls, the price must be less than the current stock price. For puts, it must be less than the strike. We also eliminate observations in which the bid price exceeds the ask price or where the bid-ask spread is more than $10 or more than the price of the underlying stock. These might be data recording errors, non-competitive “stub” quotes posted by a market maker who does 10 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 86,
    "chunk_index": 19,
    "word_count": 303,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "observations in which the bid price exceeds the ask price or where the bid-ask spread is more than $10 or more than the price of the underlying stock. These might be data recording errors, non-competitive “stub” quotes posted by a market maker who does 10 Electronic copy available at: https://ssrn.com/abstract=1364721 not want to trade, or undocumented missing value codes (e.g., 999). We also require, at the date of portfolio formation, that the bid price be above zero and that the bid-ask spread be no more than twice the bid. Table I about here The top panel of Table I contains statistics that describe the average cross section in our sample. On average, the Ivy database includes around 60,000 calls and puts per day. About a third of those are on S&P 500 stocks, and around one tenth of those are what we consider to be highly liquid. A small number of those observations are filtered out, leaving us with around 1,800 puts per day and 2,800 calls. The contracts we include have relatively small bid-ask spreads, around 15% on average, compared with 51% and 25% for puts and calls, respectively, for the entire S&P 500 sample. They also trade much more, at roughly 400 contracts per day on average, which is 6-8 times more than the full S&P 500 sample.3 Together, these steps eliminate the largest and most suspicious outliers in our sample and ensure that we are focused primarily on more liquid options. We note that all of our main results are robust to dropping any or all of these filters, and that further tightening of the requirements on trading volume increases the estimated magnitude of the nontrading effect. 11 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 86,
    "chunk_index": 20,
    "word_count": 286,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "we are focused primarily on more liquid options. We note that all of our main results are robust to dropping any or all of these filters, and that further tightening of the requirements on trading volume increases the estimated magnitude of the nontrading effect. 11 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 86,
    "chunk_index": 21,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "These robustness results are reported in Section II.B. Our analysis requires the use of implied volatilities, and unless otherwise noted we use those provided by Ivy DB, which are computed using a binomial tree approach that accounts for dividends. Because they are equivalent to Black-Scholes values for stocks that pay no dividends, we will refer to the implied volatilities and Greeks as “Black-Scholes” values. The option price sensitivities of each option, namely delta, gamma, vega, and theta, are also computed with the Black-Scholes model using the implied volatility from that same option. In about 3% of the observations included in our analysis, the OptionMetrics database does not include an implied volatility. Following Duarte and Jones (2008), we fill in missing implied volatilities with those of similar contracts. If a call option’s implied volatility is missing, thenweusetheimpliedvolatilityoftheputcontractwrittenonthesameunderlying firm with the same maturity and strike price. If both put and call implied volatilities are missing, then we use the value from the same contract on the previous day. It is worth noting that this procedure of filling in missing implied volatilities relies only on current and lagged information. A portfolio strategy that uses the implied volatilities from this procedure for portfolio formation and for computing hedge ratios is therefore fully implementable. Furthermore, our results are robust to filtering out these observations. We compute option returns based on closing bid-ask midpoints, and excess returns ac- count for the number of calendar days within the return holding period.4 The change in 12 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 86,
    "chunk_index": 22,
    "word_count": 253,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "hedge ratios is therefore fully implementable. Furthermore, our results are robust to filtering out these observations. We compute option returns based on closing bid-ask midpoints, and excess returns ac- count for the number of calendar days within the return holding period.4 The change in 12 Electronic copy available at: https://ssrn.com/abstract=1364721 value of a delta-hedged portfolio is C −C −∆ (S −S ), t t−1 t t t−1 where C is the option price, S is the stock price, and ∆ is the Black-Scholes delta. Delta- t t t hedged excess returns are therefore defined as (cid:18) (cid:19) C −C ∆ S S −S t t−1 t t−1 t t−1 −r ND − −r ND , t−1 t−1,t t−1 t−1,t C C S t−1 t−1 t−1 where r is the riskless return per day and ND is the number of calendar days between t t−1,t date t−1 and t. This may be viewed as the excess return on a portfolio that combines one option contract with a zero-cost position in ∆ shares worth of single-stock futures. t For eachdelta-hedgedoption portfolio, thereis acorresponding hedgeportfolio consisting of all the equity positions taken to eliminate delta. This portfolio has weights proportional to ∆ S t t−1 − , C t−1 which will be negative for calls and positive for puts. We examine these portfolios briefly to rule out the possibility that nontrading effects arise from the underlying stock returns. The bottom panel of Table I reports moments on value-weighted portfolios of puts and calls, both separately and combined in a 50/50 portfolio. Several stylized facts are immedi- ately apparent. First, portfolios of unhedged call options have positive average returns, while 13 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 86,
    "chunk_index": 23,
    "word_count": 282,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "underlying stock returns. The bottom panel of Table I reports moments on value-weighted portfolios of puts and calls, both separately and combined in a 50/50 portfolio. Several stylized facts are immedi- ately apparent. First, portfolios of unhedged call options have positive average returns, while 13 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 86,
    "chunk_index": 24,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "unhedged puts have negative average returns, which is consistent with calls having positive market betas and puts having negative betas. Delta-hedging makes all average returns neg- ative, consistent with the vast literature (e.g., Bakshi and Kapadia (2003) and Coval and Shumway (2001)) documenting a negative variance risk premium. A second observation is that delta-hedging dramatically reduces the standard deviations and betas of put and call portfolios. Delta-hedging reduces the standard deviation of the put portfolio by over 80% and reduces the beta of that portfolio from −7.08 to −0.53. Slightly smaller reductions are observed for the call portfolio. On the other hand, little reduction in standard deviation is observed for the combined portfolio of puts and calls, and the beta of that portfolio is actually larger in absolute value as the result of hedging. This is because a 50/50 portfolio of puts and calls is already approximately delta-neutral, so additional delta hedging is not particularly effective. Third, portfoliosofunhedgedoptionpositionshavereturnsthatdisplaypositiveskewness and substantial excess kurtosis. Delta-hedged option returns are even more fat-tailed, the result of delta hedging being more effective for small changes in stock prices. Large changes in stock prices, which are often the source of extreme option returns, cannot be hedged due to the convexity of option payoffs. Tails thicken as the result of a relative decrease in the low volatility returns, for which delta hedging is effective. For the remainder of our paper, we will focus on the delta-hedged call portfolio, the delta- hedged put portfolio, and the unhedged 50/50 portfolio of puts and calls. Because all three are approximately delta-neutral, our analysis will focus on the component of option prices 14 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 86,
    "chunk_index": 25,
    "word_count": 277,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "For the remainder of our paper, we will focus on the delta-hedged call portfolio, the delta- hedged put portfolio, and the unhedged 50/50 portfolio of puts and calls. Because all three are approximately delta-neutral, our analysis will focus on the component of option prices 14 Electronic copy available at: https://ssrn.com/abstract=1364721 that is orthogonal to the underlying stocks. This is desirable given that prior literature has shown that the nontrading effect has vanished in equities during our sample period, a result that we confirm below in our own sample. We view our use of the Black-Scholes model as relatively benign. Even if the delta we use to compute hedged returns is somewhat misspecified, those hedged returns nevertheless represent the returns on a feasible investment strategy (abstracting from transactions costs). Delta hedging, while not perfect, can be expected to remove at least the majority of the option’s exposure to the underlying stock. Hull and Suo (2002) claim, in fact, that Black- Scholes works about as well as any other model in this regard. Any remaining concerns should be lessened when we combine unhedged calls and puts into a single portfolio in a way that is entirely model-free. II. Nontrading effects in option markets A. Main findings Our main finding is that returns in delta-neutral option positions are significantly lower over nontrading periods than trading periods. We define a nontrading period as any period where the interval between subsequent closing prices is longer than one calendar day. The vast majority of these nontrading periods are regular weekends, with a smaller number of mid-week holidays and long weekends. Initially, we pool all types of nontrading periods together. Later, we examine them separately. 15 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 86,
    "chunk_index": 26,
    "word_count": 284,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "between subsequent closing prices is longer than one calendar day. The vast majority of these nontrading periods are regular weekends, with a smaller number of mid-week holidays and long weekends. Initially, we pool all types of nontrading periods together. Later, we examine them separately. 15 Electronic copy available at: https://ssrn.com/abstract=1364721 Table II about here Our main results are presented in Tables II and III. Table II shows results for value- weighted portfolios of all puts and all calls, while Table III shows results for value-weighted portfolios for puts and calls formed on the basis of maturity and delta. When we examine the unhedged call/put portfolio in Table II, we see an average non- trading excess return of -0.76% and an average trading return of -0.08%. The difference between the two, -0.68%, is what we define as the nontrading effect, and under any conven- tion it is highly significant.5 For delta-hedged puts, the average nontrading excess return is -0.82%, relative to an average trading return of 0.03%. The difference, -0.86%, is even more highly significant. For calls, the difference between nontrading and trading returns is -0.51% and again statistically significant. The smaller effect for calls relative to puts is notable but is driven mostly by the fact that the put and call portfolios weight in-the-money versus out-of-the-money options differently, as we show below.6 To gauge if the nontrading portfolio is present in the underlying stocks, Table II shows average excess returns over trading and nontrading periods for the portfolios of underlying stocks that are used to delta-hedge the put and call portfolios. The put portfolio is hedged 16 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 86,
    "chunk_index": 27,
    "word_count": 272,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "To gauge if the nontrading portfolio is present in the underlying stocks, Table II shows average excess returns over trading and nontrading periods for the portfolios of underlying stocks that are used to delta-hedge the put and call portfolios. The put portfolio is hedged 16 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 86,
    "chunk_index": 28,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "by going long the underlying stocks, and we see that the long stock portfolio experienced somewhat higher returns during nontrading periods, though the difference is not significant. Calls are hedged by shorting stocks, so the hedge portfolio for calls earned lower returns over nontrading periods. Given that the differential between trading and nontrading returns in stocks is insignificant and that any differential has opposite effects on puts and calls, it appears unlikely that the nontrading effect in options is driven by one in stocks. Table II also reports averages of unhedged put and call portfolios separately. From Table I, we know that these portfolios are several times more volatile than the corresponding hedged portfolios given their large betas. Because of this, the nontrading effect is much more difficult to detect and is statistically significant only in puts. The right side of the table summarizes average returns by day of the week, where the day given is the day at the end of the holding period. Mondays, of course, represent the vast majority of nontrading period ends, with Tuesdays and Fridays being the next most frequent (typically following three-day weekends and Thanksgiving holidays, respectively). Overall, delta-hedged excess returns are lowest on average on Mondays, consistent with previous results. Smaller negative returns on other days are consistent with a variance risk premium, though the positive average returns observed on Wednesdays and Thursdays are somewhat anomalous. In the internet appendix we observe that using robust estimators, which downweight large outliers, results in the elimination of these positive average returns, while the nontrading effect is extremely robust to a variety of alternative estimators and to the use of block bootstrap standard errors. 17 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 86,
    "chunk_index": 29,
    "word_count": 284,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "the internet appendix we observe that using robust estimators, which downweight large outliers, results in the elimination of these positive average returns, while the nontrading effect is extremely robust to a variety of alternative estimators and to the use of block bootstrap standard errors. 17 Electronic copy available at: https://ssrn.com/abstract=1364721 Table III about here TableIIIexaminesthenontradingeffect,orthedifferencebetweennontradingandtrading returns, for disaggregated portfolios. We form unhedged call/put portfolios on the basis of maturity, measured as the number of trading days until option expiration, and delta-hedged call and put portfolios based on maturity and moneyness, where the lagged option delta is used to measure moneyness.7 In 59 out of the 60 portfolios, average nontrading returns are less than average trading returns, with 54 of those differences being statistically significant. One difference is positive but insignificant. Severalpatternsemergefromthetable. First,thenontradingeffectisstrongerforshorter- term options, being several times higher for options in the 11-53 day range relative to the 119-252 day range. Second is that the effect is much larger for out-of-the-money options (deltas close to zero) than it is for in-the-money options (deltas close to -1 or +1). Both of these patterns suggest a possible relation between the nontrading effect and one or more of the Black-Scholes “greeks,” which measure sensitivity of option values to various factors and which are highly affected by maturity and moneyness. We return to this issue later in Section III.C, where we directly examine the relation between option characteristics and the 18 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 20,
    "page_range": "p.20-21",
    "total_pages": 86,
    "chunk_index": 30,
    "word_count": 242,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.20-21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "or more of the Black-Scholes “greeks,” which measure sensitivity of option values to various factors and which are highly affected by maturity and moneyness. We return to this issue later in Section III.C, where we directly examine the relation between option characteristics and the 18 Electronic copy available at: https://ssrn.com/abstract=1364721 nontrading effect. A final result from Table III is that for the same absolute delta, which is a measure of option moneyness, there is little tendency for the nontrading effect in puts to exceed that of calls. This confirms that the greater nontrading effect found for the aggregated put portfolio in Table II was primarily a composition effect, driven by the fact that open interest in out-of-the-money options is larger for puts than calls. Togaugetheconsistencyofourresults, werecomputethenontradingeffectineachyearof oursample. Figure1plotstheyearlyestimatesfortheunhedgedcall/putportfolioalongwith asymptotic 95% confidence intervals. In each of the 19 years of our sample, the nontrading effect is negative. In 11 out of the 19 years, the effect is statistically significant. We observe similar results in the delta-hedged portfolios, where 18 out of 19 years are negative for puts and 16 out of 19 are negative for calls. Figure 1 about here We do observe that the nontrading effect in the second half of the sample is substantially more volatile and slightly smaller on average relative to the first half. Some of these changes are likely driven by the extreme volatility of the recent financial crisis. It is also possible that 19 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 21,
    "page_range": "p.21-22",
    "total_pages": 86,
    "chunk_index": 31,
    "word_count": 244,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.21-22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "nontrading effect in the second half of the sample is substantially more volatile and slightly smaller on average relative to the first half. Some of these changes are likely driven by the extreme volatility of the recent financial crisis. It is also possible that 19 Electronic copy available at: https://ssrn.com/abstract=1364721 the attenuation of the effect is related to the rise of algorithmic trading and the replacement of traditional market makers by high frequency trading firms, both of which followed the 2003 creation of the Options Linkage, which connected all options exchanges in the U.S. (see Muravyev and Pearson (2016)). It is notable, however, that the last year of the sample displays a larger than average effect, indicating that the effect has survived these changes to market structure. The figure also shows the average three-month London Interbank Offered Rate (LIBOR) rate in each year of the sample to alleviate any potential concern that nontrading effects arise through an interest rate channel. Ex ante, we feel that such an effect is unlikely for several reasons. First, our returns are in excess of the riskless rate, with the correct adjustment for the number of calendar days in the holding period. Any residual effect of interest rates can therefore only arise through risk premia. One might be concerned, for instance, that unhedged risks (vega and gamma) become larger over nontrading periods when interest rates are high. At least under the Black-Scholes model, however, the effects of interest rates on Greeks such as vega and gamma are small for most options, and negligible for options with one month till expiration, where our results are strongest. Second, prior literature, including French (1984), Scott (1997), and Bakshi, Cao, and Chen (1997, 2015), has generally found a very limited role for interest rates in the pricing of equity or equity index options, in that the precise specification of the interest rate process has little effect on option prices or returns. In any case, it is evident from Figure 1 that there is no relation between the two series plotted, providing confirmation that nontrading effects do not arise through any interest 20 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 86,
    "chunk_index": 32,
    "word_count": 358,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "specification of the interest rate process has little effect on option prices or returns. In any case, it is evident from Figure 1 that there is no relation between the two series plotted, providing confirmation that nontrading effects do not arise through any interest 20 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 86,
    "chunk_index": 33,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "rate channel. As discussed in Section I, a potential concern is that our returns are calculated assuming no early exercise. Since we eliminated observations on and immediately prior to dividend ex-days, early exercise will never be optimal for calls, though it could be optimal for some in-the-money puts. For such puts, the value of early exercise comes from accelerating the fixed option premium forward in time. While this can have a significant effect on option value, the loss in value that results from delaying exercise by one day should be small, as it is at most the loss of one day of interest on the strike price. Thus, for these options, our computed returns should at most slightly understate the returns of a strategy in which exercise decisions are made optimally. More importantly, early exercise cannot explain our results because it is never optimal for call and put options that are out of the money. Since we find large nontrading effects across all moneyness levels, early exercise due to dividends or any other factor cannot explain our findings. B. Robustness to portfolio construction and subsamples Table IV examines nontrading effects in different samples to determine whether our results are sensitive to the empirical approach taken. Panel A examines a number of alternative methods for computing option portfolio returns. We first replicate our primary results using ask-to-bid and bid-to-ask returns in addition to the midpoint-based returns that we consider throughout the paper. All three methods for calculating returns lead to similar conclusions 21 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 86,
    "chunk_index": 34,
    "word_count": 257,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "examines a number of alternative methods for computing option portfolio returns. We first replicate our primary results using ask-to-bid and bid-to-ask returns in addition to the midpoint-based returns that we consider throughout the paper. All three methods for calculating returns lead to similar conclusions 21 Electronic copy available at: https://ssrn.com/abstract=1364721 about the strength and significance of the nontrading effect. Table IV about here We then compute portfolio returns using equal weighting instead of weighting by the dollar value of open interest, as we do in the remainder of the paper. Equal weighting has several effects. One is that it puts relatively more weight on less liquid contracts that do not trade as frequently and that hold little open interest. Second, it likely increases the measurement error bias identified by Blume and Stambaugh (1983), though this should affect both the trading and nontrading returns and possibly wash out when computing their difference. Finally, and most importantly, it puts relatively more emphasis on lower-priced contracts, which are typically shorter term and deeper out of the money. Since we previously found that the nontrading effect is most pronounced for short-term deep out-of-the-money contracts, equal weighting should increase the size of the nontrading effect. Consistent with this, we see from the table that equal weighting causes the nontrading effect to more than double. When we instead weight by the open interest in terms of the number of contracts rather than the dollar value, we see results that are very similar to the equal-weighted portfolios. 22 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 86,
    "chunk_index": 35,
    "word_count": 256,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "the table that equal weighting causes the nontrading effect to more than double. When we instead weight by the open interest in terms of the number of contracts rather than the dollar value, we see results that are very similar to the equal-weighted portfolios. 22 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 86,
    "chunk_index": 36,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "This suggests that the larger nontrading effects in the equal-weighted portfolio are not the resultofoverweightingthinlytradedoptions, butratherduetotheequal-weightedportfolio’s greater emphasis on low-priced deep out-of-the-money contracts. In Panel B of Table IV we consider different option samples. We start by examining options on all US-listed equities rather than just those that are members of the S&P 500, and we do not require that contracts trade for five consecutive days. The resulting sample is much larger but substantially less liquid. In this sample, the nontrading effect is reduced somewhat, roughly by a third across the three portfolios, but it remains highly statistically significant. To see if the effect holds in even the most illiquid contracts, we further reduce liquidity by restricting the sample to include only those options with zero trading volume on the portfolio formation day. We find an effect that is again slightly smaller but still highly significant. We also ask whether our use of filters (dividends, reversals, etc.) has any effect on our results. We find that dropping these filters has almost no effect on our main results, though they are likely more important when we analyze less aggregated portfolios. In addition, we ask whether samples that are even more liquid than the one we focus on also show nontrading effects. We construct one such sample by requiring option contracts to have five consecutive days of trading at least 100 contracts, which reduces the sample by about 85% relative to our primary sample (S&P 500 firms, 5 days positive volume).8 The result is that the nontrading effect is amplified, roughly 40% larger for each of the three portfolios considered. Overall, it appears that the effect we document in this paper is 23 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 86,
    "chunk_index": 37,
    "word_count": 286,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "85% relative to our primary sample (S&P 500 firms, 5 days positive volume).8 The result is that the nontrading effect is amplified, roughly 40% larger for each of the three portfolios considered. Overall, it appears that the effect we document in this paper is 23 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 86,
    "chunk_index": 38,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "perhaps twice as large for the most heavily traded options as it is for the least traded ones. We also analyze a subsample of options with bid-ask spreads no greater than 5% of the quote midpoint, which should further minimize any concerns regarding our reliance on bid-ask midpoints in computing returns. For these portfolios, the size of the nontrading effect is about two thirds that of the baseline portfolios, which would appear to go against other results suggesting that the effect is larger in more liquid contracts. The explanation is that low percentage spreads are more common among in-the-money contracts, where the nontrading effect is weaker. Liquidity, in this case, is proxying for moneyness. Panel C examines the presence of a nontrading effect in S&P 500 Index options, where we impose all filters used to construct our primary sample except for the one eliminating dividends. Intuitively, one might expect index options to be driven by the same systematic risk factors that affect individual equity options. However, the two differ significantly in that index options are options on a portfolio rather than a portfolio of options. They are therefore affected by correlations as well as volatilities. Risk factors that drive correlations, as in the model of Driessen, Maenhout, and Vilkov (2009), should therefore affect only options on the index. On the other hand, systematic movements in average idiosyncratic volatility will affect portfolios of individual options but will have little effect on options on the index. Such systematic movements have been documented by Campbell, Lettau, Malkiel, and Xu (2001) and have been found by Goyal and Santa-Clara (2003) to drive aggregate risk premia. If the risk premium on this factor has a weekly seasonal, then this will generate a weekend effect 24 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 86,
    "chunk_index": 39,
    "word_count": 295,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "systematic movements have been documented by Campbell, Lettau, Malkiel, and Xu (2001) and have been found by Goyal and Santa-Clara (2003) to drive aggregate risk premia. If the risk premium on this factor has a weekly seasonal, then this will generate a weekend effect 24 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 86,
    "chunk_index": 40,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "only in individual equity options. Table IV shows that the average nontrading effects for the value-weighted unhedged put/call portfolio and the delta-hedged put portfolio are both slightly larger than the effects measured from equity options, though t-statistics are somewhat lower. We find no significant effect in delta-hedged calls, though the point estimate in index call options is negative and sizable. The reason for the weak results on index calls appears to be related to differences in the levels of open interest of calls and puts across various levels of maturity and moneyness. For example, deep out-of-the-money puts (deltas greater than -0.1), which are commonly used as a means of obtaining portfolio insurance against market risk, comprise about 3% of the total dollar value of puts traded, on average. Deep out-of-the-money calls (deltas below 0.1) comprise only 0.6% of the total amount of calls. Since out-of-the-money contracts exhibit the largest nontrading effects, the average nontrading effect for calls is reduced.9 If we instead form portfolios that are equal weighted, which gives relatively more weight to out-of-the-money contracts, all nontrading effects rise substantially, but the effect is still insignificantforS&P500Indexcalls. However, ifwefocussolelyoncallswithdeltaslessthan 0.1, the effect is statistically significant and, at around -4.5%, extremely large in economic magnitude.10 Panel D of Table IV reports estimates of the nontrading effect for different types of nontrading periods, all of which have been included in our analysis thus far. For each type, the values reported are the average returns on the nontrading period described (e.g., mid- week holidays) minus the average returns over all trading days. If what we are documenting 25 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 86,
    "chunk_index": 41,
    "word_count": 270,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "periods, all of which have been included in our analysis thus far. For each type, the values reported are the average returns on the nontrading period described (e.g., mid- week holidays) minus the average returns over all trading days. If what we are documenting 25 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 86,
    "chunk_index": 42,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "is truly a nontrading effect rather than a weekend effect, then we should also see negative option returns over mid-week holidays, and we might also expect that the effect would be stronger over long weekends. In our sample, there are only 44 mid-week holidays, so the average returns over these periods are estimated imprecisely. Nevertheless, this small subsample shows a highly signif- icant nontrading effect for hedged puts and a marginally significant result for hedged calls, supporting our claim that our findings represent a nontrading rather than weekend effect. On the other hand, the nontrading effect for unhedged options in this small sample is negative but insignificant. The table also examines the difference between the nontrading effect over mid-week holidays and that of regular weekends. No significant difference is observed, but this may again be attributable to the small sample of mid-week holidays. Long weekends, with three or more days of nontrading, are somewhat more common. During these periods, we find significant nontrading effects for unhedged options and hedged puts, though not for hedged calls. As with mid-week holidays, there is no significant differ- ence between the nontrading effect over long weekends and that of regular weekends. Still, the effects appear weaker rather than stronger over long weekends relative to regular week- ends. While the weaker nontrading effect over these periods should be taken with a grain of salt, given the small number of long weekends, it may also be that some options traders are aware of the nontrading effect and try to write options to benefit from it in more conspic- uous cases, such as long weekends. As indirect evidence of this interpretation, we find that average hedged put and call returns are -0.53% and -0.37%, respectively, on the day before 26 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 86,
    "chunk_index": 43,
    "word_count": 298,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "nontrading effect and try to write options to benefit from it in more conspic- uous cases, such as long weekends. As indirect evidence of this interpretation, we find that average hedged put and call returns are -0.53% and -0.37%, respectively, on the day before 26 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 86,
    "chunk_index": 44,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "a long weekend, compared to just -.04% and -.07% on the day before a regular weekend. These differences are statistically significant at the 5% level. All together, the results in Table IV show that the nontrading effect is extremely robust but more pronounced in liquid contracts. While the effect is insignificant in S&P 500 Index calls, it is large and significant in puts. This is notable because the market for index and equity options are substantially different in many respects. One highlighted by Garleanu, Pedersen, and Poteshman (2009) is that the “end users” presumed responsible for variations in option demand are on average buyers of index options but writers of equity options. The fact that both types of options exhibit nontrading effects of the same sign and similar magnitude would appear to challenge demand-based option pricing as an explanation of our findings. Furthermore, we find a strong effect even when there is no apparent change in demand, namely in contracts with zero trading volume. This does not necessarily rule out the demand-based option pricing model as an explanation for the nontrading effect, considering that Garleanu, Pedersen, and Poteshman show that option prices should be affected by trades in other contracts. Nevertheless, the strength of the effect in untraded contracts is surprising. C. Implied and realized variances In this section we assess the significance of nontrading effects in implied variances. Specif- ically, we ask whether the variance of returns over nontrading periods that is implicit in option prices matches the realized variance from stock returns. 27 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 86,
    "chunk_index": 45,
    "word_count": 260,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "surprising. C. Implied and realized variances In this section we assess the significance of nontrading effects in implied variances. Specif- ically, we ask whether the variance of returns over nontrading periods that is implicit in option prices matches the realized variance from stock returns. 27 Electronic copy available at: https://ssrn.com/abstract=1364721 Define the quadratic variation between times u and v as (cid:90) v QV = σ2ds, u,v s s=u where σ is the instantaneous volatility of the log stock price process. Now define the time-t t implied variance of an option with fixed expiration date T as IV = EQ[QV ] = EQ[QV +QV ] t,T t t,T t t,t(cid:48) t(cid:48),T Note that we are measuring the total amount of variance remaining over the option’s lifetime rather than dividing by the time to expiration in order to obtain a variance rate. The change, from time t to time t(cid:48), in implied variance remaining until expiration is IV −IV = EQ[QV ]−EQ[QV ] t(cid:48),T t,T t(cid:48) t(cid:48),T t t,T This change is on average negative as the result of moving closer to expiration, as the quadratic variation between times t and t(cid:48) is eliminated from implied variance at time t(cid:48). In studies of earnings announcements, Patell and Wolfson (1981) and Dubinsky and Johannes (2006) use this change to estimate the announcement day variance for a sample of stocks. If we add the realized quadratic variation of the underlying asset over the same period 28 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 30,
    "page_range": "p.30-31",
    "total_pages": 86,
    "chunk_index": 46,
    "word_count": 247,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.30-31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "t(cid:48). In studies of earnings announcements, Patell and Wolfson (1981) and Dubinsky and Johannes (2006) use this change to estimate the announcement day variance for a sample of stocks. If we add the realized quadratic variation of the underlying asset over the same period 28 Electronic copy available at: https://ssrn.com/abstract=1364721 to offset the effect of moving closer to expiration, we get a variance “differential,” D ≡ IV −IV +QV , (1) t,t(cid:48) t(cid:48),T t,T t,t(cid:48) whichmeasuresthedifferencebetweentheactualvarianceandthedeclineinimpliedvariance remaining until expiration. This differential can be re-expressed as (cid:16) (cid:17) (cid:16) (cid:17) D = EQ[QV ]−EQ[QV ] + QV −EQ[QV ] . (2) t,t(cid:48) t(cid:48) t(cid:48),T t t(cid:48),T t,t(cid:48) t t,t(cid:48) The first term represents the change in the risk-neutral expectation of future variance over the interval (t(cid:48),T), which is equal to the price appreciation on a forward start variance swap. Without a variance risk premium, forward prices are martingales, so this term should be zero in expectation. The second term represents the difference between actual and implied variance. Again, the absence of a variance risk premium would make this term zero in expectation. Thus, if there is no variance risk premium, i.e that implied variance is an unbiased forecast of future realized variance, then the expectation of D should be zero. t,t(cid:48) This statement holds regardless of the length of time between t and t(cid:48) and whether that interval includes a nontrading period or not. To determine whether options embed an expectation of future variance over nontrading periods that is larger than the actual variance over nontrading periods, we measure the variance differential D for each stock and for the S&P 500 Index on each day in our t,t+1 sample. For the equity option sample we average these values across stocks to obtain a 29 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 86,
    "chunk_index": 47,
    "word_count": 298,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "larger than the actual variance over nontrading periods, we measure the variance differential D for each stock and for the S&P 500 Index on each day in our t,t+1 sample. For the equity option sample we average these values across stocks to obtain a 29 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 86,
    "chunk_index": 48,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "single value on each day. If the nontrading variance implicit in option prices exceeds that present in actual returns, then D should on average be negative over nontrading periods. t,t+1 We measure the variance differential using two different methods for computing implied variances, which are either based on the Black-Scholes formula applied to at-the-money options or model-free implied variances. In the former case, the implied variance is the average of the values computed from the call and put with deltas closest to 0.5 and -0.5, respectively. In the latter case, we apply the interpolation method of Hansis, Schlag, and Vilkov (2010) to the calculations proposed in Bakshi, Kapadia, and Madan (2003). In both cases, the implied variances we compute are “to term,” meaning that they are not annualized by dividing by the time remaining until expiration. As is standard (e.g. Andersen et al. (2001)), we proxy for quadratic variation with a realized variance measure computed as the daily sum of all squared 5-minute returns along with the squared overnight return.11 Intraday returns on individual equities are computed using the NYSE Trades and Quotes (TAQ) database, where we use the the last-recorded transaction price within each 5-minute interval between 9:30 am and 4:30 pm EST, a total of 84 observations per day for each firm.12 Realized variances for the S&P 500 Index are from the Oxford-Man Realized Library, to which we add the squared overnight return. We assess the impact of nontrading and risk premia in the following regression: D = a+bNT +cVRP +dNT VRP +e , (3) t,t+1 t+1 t t+1 t t,t+1 30 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 86,
    "chunk_index": 49,
    "word_count": 269,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "500 Index are from the Oxford-Man Realized Library, to which we add the squared overnight return. We assess the impact of nontrading and risk premia in the following regression: D = a+bNT +cVRP +dNT VRP +e , (3) t,t+1 t+1 t t+1 t t,t+1 30 Electronic copy available at: https://ssrn.com/abstract=1364721 where D now represents the average volatility differential computed from time t to t+1. t,t+1 In this regression, NT represents a nontrading indicator, which is one on nontrading days and zero otherwise. VRP represents a variance risk premium proxy similar to that proposed by Bollerslev, Tauchen, and Zhou (2009). Specifically, it represents the demeaned difference between the square of the VIX Index, which is a model-free measure of implied variance, and the 22-day moving average of daily realized variances computed from 5-minute index returns. Demeaning has no effect on the c or d coefficients, but it does affect the estimates of a and b in the specifications in which VRP is included.13 Table V about here The results of these regressions are in Table V. In short, we observe a highly significant nontrading effect (the b coefficient) for both equity options and index options. This indicates that the decrease in implied volatility remaining until expiration is too large over nontrading periods, implying that option prices embed an assumption of nontrading period variance that is significantly higher than what is actually realized. To gauge how much higher, we can compare the estimated b coefficient, which measures the size of the nontrading effect on variance differentials, to the average stock-level realized variance. 31 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 86,
    "chunk_index": 50,
    "word_count": 266,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "an assumption of nontrading period variance that is significantly higher than what is actually realized. To gauge how much higher, we can compare the estimated b coefficient, which measures the size of the nontrading effect on variance differentials, to the average stock-level realized variance. 31 Electronic copy available at: https://ssrn.com/abstract=1364721 Inoursample,theaveragestock-levelrealizedvarianceis0.00082,equivalenttoanaverage dailyvolatilityof2.87%. Forthesameequities, estimatesofthenontradingeffectforvariance differentials (b) ranges from around 0.0006 to 0.0009 (note that the b coefficients in Table V have been multiplied by 1000), numbers that are approximately equal to the average realized variance. This indicates that during the average nontrading period, the excess decline in implied variance is around one full day of realized variance. Similar results are obtained for index options. While the b coefficient is smaller for those options, the average realized variance for the S&P 500 Index is only 0.00012 (an average volatility of 1.08%). Estimated b coefficients from index options are all larger than this value, meaning that the decline in index implied volatilities is at least as excessive on a relative basis. Thus, it appears as if option prices embed a full extra day of variance over each nontrading period. Controlling for variance risk premia has little effect on the nontrading coefficient, though itisinsomecasesahighlysignificantpredictorofvariancedifferentialsfortheS&P500Index. The addition of an interaction term also has very little effect. Were the nontrading effect compensation for variance risk, one might expect that it would increase when risk premia were larger. The insignificance of the interaction term therefore suggests that nontrading effectsdonotstemfromanaversiontovariancerisk. Nevertheless, weexplorethispossibility more thoroughly in the following section. 32 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 86,
    "chunk_index": 51,
    "word_count": 257,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "also has very little effect. Were the nontrading effect compensation for variance risk, one might expect that it would increase when risk premia were larger. The insignificance of the interaction term therefore suggests that nontrading effectsdonotstemfromanaversiontovariancerisk. Nevertheless, weexplorethispossibility more thoroughly in the following section. 32 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "I. Data and methods",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 86,
    "chunk_index": 52,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "I. Data and methods (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "Having established a nontrading effect in option portfolios of all types, we now address whether the differential between trading and nontrading periods is likely the result of dif- ferences in risk or risk aversion. In the results to follow, we document that risk is indeed somewhat higher over nontrading periods, which raises the possibility that the nontrading effect is attributable to risk. Unfortunately, risk adjustment for option returns is notoriously difficult, mainly due to the fact that option returns are highly non-Gaussian. We therefore employ a number of different techniques for risk adjustment that, while individually im- perfect, together make a compelling case that risk is not ultimately the explanation of our findings. We proceed by first analyzing the behavior of option trading volume and open interest around nontrading periods, motivated by the idea that differences in risk or risk aversion over nontrading periods would lead to predictable patterns in trading and open interest as traders rebalance their positions. We then assess the risk of option returns, first by analyzing the time series, then by examining the cross section. We find no patterns in volume or open interest that would indicate that traders or market makers wish to reduce exposure prior to nontrading periods. In the time series, we document that while risk is higher over nontrading periods, various measures of risk-adjusted performance are in agreement that the greater risk is not sufficient to justify the size of the nontrading returns. There is also no apparent time series variation in liquidity. Finally, we show in the cross section that only certain types 33 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 86,
    "chunk_index": 53,
    "word_count": 268,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "various measures of risk-adjusted performance are in agreement that the greater risk is not sufficient to justify the size of the nontrading returns. There is also no apparent time series variation in liquidity. Finally, we show in the cross section that only certain types 33 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 86,
    "chunk_index": 54,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "of option risk are rewarded in terms of more negative nontrading returns. These results undermine any explanation based on the Chen and Singal (2003) hypothesis that aversion to downside risk is higher over nontrading periods. We show instead that the nontrading effect is instead consistent with the particular type of mispricing considered by French (1984). A. Patterns in volume and open interest If option writers are averse to holding their positions over nontrading periods, then it would be reasonable to expect that their positions would shrink prior to those periods. Because options are in zero net supply, a reduction in written positions means a decrease in the overall open interest in the options market. Furthermore, if option writers are particularly averse to maintaining written positions in some types of contracts, say those that are riskier in some sense, then we might expect that the decline would be largest in those contracts. To examine the behavior of open interest around nontrading periods, we compute daily open interest, in terms of numbers of option contracts, for each of the portfolios analyzed in Table III.14 In doing so we do not impose data filters, such as the requirement of five consec- utive days of trading activity. We find that open interest is not prone to measurement error, making these filters unnecessary. More importantly, the variables on which filters are based (i.e. volume) are too closely related to the open interest series we are tracking. The only filter we impose is that contracts have more than five days remaining until expiration. This eliminates option contracts in their final week, which would artificially induce a nontrading effect due to the fact that expiring contracts have zero open interest on the last day of their 34 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 86,
    "chunk_index": 55,
    "word_count": 295,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "impose is that contracts have more than five days remaining until expiration. This eliminates option contracts in their final week, which would artificially induce a nontrading effect due to the fact that expiring contracts have zero open interest on the last day of their 34 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 86,
    "chunk_index": 56,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "expiration week. We compute two weekly open interest series for each portfolio formed by moneyness and maturity. One is the average open interest over all days just prior to a nontrading period, which is most often simply the open interest on the Friday of that week. The other is the average open interest over all other days (usually Monday through Thursday). We then take the ratio of these two series within each week and compute the time series median, which is not sensitive to occasional outliers in the open interest ratio that are due to denominators near zero.15 This median tells us how open interest rises or falls for a particular portfolio prior to nontrading periods. The top panel of Figure 2 plots these medians, on the horizontal axis, against the es- timated nontrading effects from Table III. If option writers are averse to keeping positions open over nontrading periods, we would expect to see two results. One is that open interest should decline prior to nontrading periods. The other is that open interest should decline moreincontractsthatareparticularlyundesirabletowrite, whicharepresumablythosewith the most negative nontrading effects. The figure, however, shows no evidence favoring either prediction. Open interest tends to be higher just prior to nontrading periods, on average by around 2%. Furthermore, there is no relation between open interest and the size of the nontrading effect. Thus, if the nontrading effect is the result of a desire to avoid risk over weekends and holidays, no attempt to avoid that risk by trimming positions is evident. 35 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 86,
    "chunk_index": 57,
    "word_count": 258,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "Furthermore, there is no relation between open interest and the size of the nontrading effect. Thus, if the nontrading effect is the result of a desire to avoid risk over weekends and holidays, no attempt to avoid that risk by trimming positions is evident. 35 Electronic copy available at: https://ssrn.com/abstract=1364721 Figure 2 about here ThebottompanelofFigure2showstheresultofasimilarexaminationoftradingvolume. Since these ratios are all below one, it does not appear that investors are motivated to reduce positionspriortonontradingperiods. Furthermore, thereisnoclearrelationbetweenvolume patterns and nontrading returns. It seems more likely that the decline in option trading is driven by the same forces that have caused equity market volume to decline prior to weekends and holidays for a number of decades (see Lakonishok and Maberly (1990)). Interestingly, the nontrading effect in equities documented by French (1980) has vanished in recent decades, while the volume pattern has not, making it somewhat implausible that there is a causal relation between volume and nontrading returns in stocks, either. B. Risk and liquidity of option strategies Table VI reports a variety of statistics describing the risk and risk-adjusted returns cor- responding to the main strategies examined thus far. One subtle change is that we now examine excess returns from the perspective of the option writer, whose returns are positive when option values decline. Flipping the sign of the option returns is necessary for the va- 36 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 38,
    "page_range": "p.38-39",
    "total_pages": 86,
    "chunk_index": 58,
    "word_count": 229,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.38-39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "to the main strategies examined thus far. One subtle change is that we now examine excess returns from the perspective of the option writer, whose returns are positive when option values decline. Flipping the sign of the option returns is necessary for the va- 36 Electronic copy available at: https://ssrn.com/abstract=1364721 lidity of some of the performance adjustments we consider, which account for asymmetries in the return distribution. Table VI about here The first few rows of the table describe the first four moments of the three strategies we focus on. Since option writers are short options, the nontrading effect is shown in the table as a positive number, but the magnitudes are the same as those reported in Table II. We now see that these higher means are associated with moderately higher standard deviations, somewhat more negative skewness, and substantially higher excess kurtosis. Few of these differences are statistically significant, with the exception of the standard deviation and kurtosis of the hedged call portfolio, but they nevertheless raise the possibility of a relation between risk and return.16 When we undertake the kind of risk adjustment that would be appropriate in a Gaus- sian setting or for investors with mean-variance preferences, we see that the greater risks associated with nontrading returns have little effect on the relative attractiveness of writing options over nontrading rather than trading periods. Sharpe ratios, CAPM alphas, and in- formation ratios are all significantly higher over nontrading periods, with magnitudes that 37 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 86,
    "chunk_index": 59,
    "word_count": 250,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "we see that the greater risks associated with nontrading returns have little effect on the relative attractiveness of writing options over nontrading rather than trading periods. Sharpe ratios, CAPM alphas, and in- formation ratios are all significantly higher over nontrading periods, with magnitudes that 37 Electronic copy available at: https://ssrn.com/abstract=1364721 are economically large. The Sharpe ratio of the unhedged put/call strategy, for example, is 0.301. This daily value corresponds to an annualized figure of 4.9.17 It is well understood, however, that measures such as the Sharpe ratio are generally inappropriate when returns are highly non-Gaussian. This is certainly the case in options, where a nonlinear dependence on the underlying asset will induce non-normality even when the underlying is Gaussian. A number of alternatives have been proposed, and we consider two. The first involves specifying a utility function and measuring the certainty equivalent return, which is defined as the value c such that E[U(1+R)] = U(1+c), where R is the return on the risky asset. We implement this approach using power utility with relative risk aversion γ of 1 (log utility), 3, or 10. The second approach is based on recent work by Kadan and Liu (2014), who show how to evaluate investment performance in a way that accounts for higher moments by using the generalized risk measures of Aumann and Serrano (2008) and Foster and Hart (2009). The performance indexes they construct, PAS and PFS, are the solutions to (cid:2) (cid:0) (cid:1)(cid:3) E exp −PAS(1+R) = 1 and (cid:2) (cid:0) (cid:1)(cid:3) E log 1+PFH(1+R) = 0. As with the other statistics in the table, we estimate them by GMM. Higher values indicate superior performance. 38 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 86,
    "chunk_index": 60,
    "word_count": 280,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "they construct, PAS and PFS, are the solutions to (cid:2) (cid:0) (cid:1)(cid:3) E exp −PAS(1+R) = 1 and (cid:2) (cid:0) (cid:1)(cid:3) E log 1+PFH(1+R) = 0. As with the other statistics in the table, we estimate them by GMM. Higher values indicate superior performance. 38 Electronic copy available at: https://ssrn.com/abstract=1364721 The result of this analysis is that non-Gaussian risk adjustment still cannot explain the nontrading effect. For all three levels of γ, we find that risk-adjusted returns are higher over nontrading periods. The sole exception is in the hedged call portfolio when γ = 10. In this case, risk-adjusted returns are lower over nontrading periods, though by a statistically insignificant amount. Based on the PAS and PFH indexes, risk-adjusted performance over nontrading periods is generally significantly better than that over trading periods. The only exception is for the PFH index for unhedged options, where nontrading performance is better but not significantly so. Overall, the results reported in Table VI suggest that no measure of risk varies enough between trading and nontrading periods to explain the differences in average returns. It is possible that, due to the existence of unobserved low-probability events, true risk over nontrading periods is higher than we have measured, and if the increase is severe enough it might justify a substantial risk premium. As an informal check for the unhedged put/call portfolio, we randomly replace 20 nontrading returns with the worst one-day return in the full sample (-20.3%). Since there are only 16 nontrading periods in the sample with returns lower than -10%, this represents an extremely large increase in the left tail of the return distribution. Yet even with this magnified tail risk, both the PAS and PFH indexes remain reliably positive. 39 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 86,
    "chunk_index": 61,
    "word_count": 292,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "there are only 16 nontrading periods in the sample with returns lower than -10%, this represents an extremely large increase in the left tail of the return distribution. Yet even with this magnified tail risk, both the PAS and PFH indexes remain reliably positive. 39 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 86,
    "chunk_index": 62,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "C. Risk and return in the cross section Thusfarinthissection, wehaveanalyzeddifferencesbetweentradingandnontradingperiods in highly aggregated portfolios of options. We now turn to disaggregated portfolios and further explore some of the patterns related to moneyness and maturity that we observed in Table III. Our goal is to see whether those patterns in the size of the nontrading effect are related to cross-sectional patterns in risk. Option market participants and options researchers often identify three major varieties of price risk in an option contract. The first, delta (∆ ≡ ∂C/∂S), is the sensitivity of the option price to small movements in the underlying security. This risk can be hedged away by taking the appropriate position in the underlying. The second, vega (V ≡ ∂C/∂σ) , measures the sensitivity of the option price to changes in volatility. It can only be eliminated by combining purchasedandwrittenoptionsonthesameunderlying, thoughitcanbediversifiedsomewhat by buying or writing options on multiple underlyings. The last, gamma (Γ ≡ ∂2C/∂S2), measuresthesensitivityoftheoptionpricetolargermovementsinthepriceoftheunderlying security. Like vega, gamma is mainly reduced by buying and writing options on the same underlying, though diversification across underlyings should also provide some benefit. These so-called “Greeks” are the coefficients of the following Taylor expansion of option prices: 1 C ≈ C +∆ (S −S )+ Γ (S −S )2 +V (σ −σ )+Θ , t+1 t t t+1 t t t+1 t t t+1 t t 2 where S is the price of the underlying, σ is its volatility, and Θ ≡ ∂C /∂t is the rate of time t t 40 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 86,
    "chunk_index": 63,
    "word_count": 255,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "−S )2 +V (σ −σ )+Θ , t+1 t t t+1 t t t+1 t t t+1 t t 2 where S is the price of the underlying, σ is its volatility, and Θ ≡ ∂C /∂t is the rate of time t t 40 Electronic copy available at: https://ssrn.com/abstract=1364721 decay, or theta. This expansion can be rearranged to produce an approximate expression for delta-hedged option returns: C −C ∆ S Γ S2 V Θ t+1 t − t t R ≈ t t R2 + t (σ −σ )+ t , (4) C C t+1 2C t+1 C t+1 t C t t t t t where R is the return on the stock.18 The expression shows how delta-hedged returns t+1 depend on “larger” movements in prices (R2 ) and changes in volatility (σ −σ ), specifi- t+1 t+1 t cally that these variables affect delta-hedged returns through normalized versions of gamma and vega. The risk of a diversified option portfolio will therefore in general depend both on option contract-level characteristics (the normalized Greeks) and stock-level risk exposures (the systematic risk in squared returns and volatilities). However, in the current exercise we will examine portfolios formed only on the basis of maturity and moneyness, which are both option-levelcharacteristics, soallportfolioswillincludeessentiallythesamesetofunderlying firms. Thus, the cross-sectional variation in risk of the portfolios we consider will largely be determined by option-level characteristics rather than stock-level risk exposures. Table VII reports results of Fama-Macbeth (1973) regressions in which the dependent variable is the return, squared return, or cubed return of a portfolio of delta-hedged option positions. The independent variables include the portfolio’s normalized gamma (.5Γ S2/C ), t t t vega(V /C ),andtheta(Θ /C ),whicharecomputedbyaveragingthecorrespondingcontract- t t t t levelmeasures. Asbefore,weweightbythelaggeddollarvalueofopeninterestwhencomput- 41 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 86,
    "chunk_index": 64,
    "word_count": 293,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "which the dependent variable is the return, squared return, or cubed return of a portfolio of delta-hedged option positions. The independent variables include the portfolio’s normalized gamma (.5Γ S2/C ), t t t vega(V /C ),andtheta(Θ /C ),whicharecomputedbyaveragingthecorrespondingcontract- t t t t levelmeasures. Asbefore,weweightbythelaggeddollarvalueofopeninterestwhencomput- 41 Electronic copy available at: https://ssrn.com/abstract=1364721 ing portfolio returns. The same weights are also used to calculate portfolio-level normalized Greeks. Table VII about here Because of the close connection between gamma and theta, which we discuss below, these two regressors are highly collinear and are not included in the same regression. Gamma and vegaarealsorelatedandareinfactperfectlyproportionaltoeachotherforagivenexpiration date. Since our option portfolios include both short-dated and long-dated contracts, gamma and vega are not collinear, and we are able to distinguish between their effects as two individual predictors. In our regressions, independent variables are included alone and are also interacted with a nontrading dummy variable, which takes the value of zero during trading periods and one during nontrading periods. Since all independent variables are interacted with the nontrading dummy, the Fama-Macbeth regression coefficients are estimated by running the regression with no interaction terms separately on the trading and nontrading subsamples. The interactive term coefficient is then estimated as the difference between the nontrading and trading coefficients. 42 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 44,
    "page_range": "p.44-45",
    "total_pages": 86,
    "chunk_index": 65,
    "word_count": 212,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.44-45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "variables are interacted with the nontrading dummy, the Fama-Macbeth regression coefficients are estimated by running the regression with no interaction terms separately on the trading and nontrading subsamples. The interactive term coefficient is then estimated as the difference between the nontrading and trading coefficients. 42 Electronic copy available at: https://ssrn.com/abstract=1364721 Our first set of cross-sectional results focuses on risk. Regressions (1) to (3) in Table VII examine the cross section of risk by regressing squared delta-hedged portfolio returns, which represent price changes regardless of their sign, on normalized gammas and vegas. When we include only gamma (by itself and interacted with the nontrading dummy), we see a signifi- cant tendency of higher gamma options to exhibit greater risk, though there is no significant evidence that gamma-related risk rises over nontrading periods. The relation between risk andnormalizedvegaappearstobemuchstrongerandmoresignificant, withanotablyhigher cross-sectional R-square, indicating that vega/volatility risk is more important than gamma risk in our sample.19 Including both gamma and vega terms, in regression (3), leads to a modest improvement in overall fit relative to vega-only specification (2). Thus, overall it appears to be vega rather than gamma that is more responsible for portfolio variance. Incolumns(4)to(6)ofthetablewerepeatthesameregressionswithcubedreturnsasthe dependent variable. The rationale for using cubed returns is that Chen and Singal’s (2003) hypothesis suggests that it is specifically the unbounded downside risk that option sellers are averse to holding over nontrading periods, and this may be reflected more in third moments than in second moments. The results show a tendency of higher gamma and higher vega options to exhibit greater positive skewness, which for the option writer becomes negative skewness. However, there is no evidence that this effect changes over nontrading periods. In regressions (4) and (5), which either include gamma or vega terms, but not both, we see approximately the same goodness of fit and similar statistical significance of slope coefficients. When both gamma and vega terms are included in regression (6), vega is 43 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 86,
    "chunk_index": 66,
    "word_count": 325,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "periods. In regressions (4) and (5), which either include gamma or vega terms, but not both, we see approximately the same goodness of fit and similar statistical significance of slope coefficients. When both gamma and vega terms are included in regression (6), vega is 43 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 86,
    "chunk_index": 67,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "significant but gamma is not, suggesting that volatility risk may also be the more relevant determinant of the option writer’s downside risk. The last five columns of Table VII examine whether the same variables also drive average returns. Regressions (7) to (9) replace the dependent variable with signed delta-hedged portfolio returns. Quite differently from the other regressions, we now see a clear difference between the importance of gamma and vega, with the former turning out to be the more important determinant by far. In regression (7), which does not include vega, we obtain a cross-sectional R-square of 0.80. In contrast, regression (8) shows that vega, by itself, performs relatively poorly in terms of explaining average returns, with an R-squared of just 0.22. When gamma and vega terms are both included, as in regression (9), we continue to see a large and highly significant coefficient on the interaction between the nontrading dummy and the normalized gamma and just a slight improvement in overall fit relative to the gamma-only specification.20 Furthermore, the nontrading interaction with vega is insignificant. Inthedemand-basedoptionpricingtheoryofGarleanu, Pedersen, andPoteshman(2009), fluctuations in demand can impact option prices only to the extent that the option contract cannot be perfectly hedged. Thus, whether the nontrading effect is driven by a greater aversion to risk over nontrading periods or to an uptick in net option demand, we would expect that riskier option contracts would display more negative nontrading returns. In contrast, regressions (1) to (9) show that while the risk of a diversified portfolio of delta- hedged options on individual equities is more determined by its average vega than average 44 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 86,
    "chunk_index": 68,
    "word_count": 272,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "we would expect that riskier option contracts would display more negative nontrading returns. In contrast, regressions (1) to (9) show that while the risk of a diversified portfolio of delta- hedged options on individual equities is more determined by its average vega than average 44 Electronic copy available at: https://ssrn.com/abstract=1364721 gamma, the nontrading effect in average returns is only related to gamma. This result undermines the hypothesis put forth by Chen and Singal (2003) that aversion to downside riskovernontradingperiodsisthereasonunderlyingthenontradingeffectsinaveragereturn. Nevertheless, we cannot completely rule out the possibility that, for some reason, one type of risk (gamma) is priced over nontrading periods while another type (vega) is not. Another interpretation of these results is that they reflect a mispricing caused by an erroneous treatment of the difference between trading and nontrading volatilities. As shown in Section II.C, options appear to be priced as if nontrading periods contained, on average, a complete extra day’s worth of variance, raising the possibility that some investors are pricing options as though variance was proportional to calendar rather than trading time. As demonstrated by French (1984), if this is in fact the error being made, then its effects will depend strongly on the moneyness and maturity of the contract. To gain some intuition about what effects this mistake might have, assume that stock prices are instantaneously lognormal with deterministic volatility. Assuming no dividends, the price C of an option therefore solves the following PDE: t σ2S2 t t Γ +Θ +rS ∆ = rC . t t t t t 2 If the interest rate were equal to zero, then the equation implies an exact relation between theta and gamma, namely that σ2S2 Θ = − t t Γ . t t 2 45 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 86,
    "chunk_index": 69,
    "word_count": 293,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "+Θ +rS ∆ = rC . t t t t t 2 If the interest rate were equal to zero, then the equation implies an exact relation between theta and gamma, namely that σ2S2 Θ = − t t Γ . t t 2 45 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 48,
    "page_range": "p.48",
    "total_pages": 86,
    "chunk_index": 70,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "In other words, time decay would be solely due to the loss in stock price variance (σ2S2) t t remaining until expiration, the value of which is determined by the amount of curvature (Γ ) t in the option price. When interest rates are nonzero, theta includes an additional component, which we dis- cuss below. Although we do not assume zero interest rates in our empirical analysis and therefore include this component, the low levels of interest rates observed during our sample period mean that this component is in general extremely small. In theory, therefore, we should see little if any relation between the theta of an option and its risk-neutral drift, since theta is offset by a gamma effect that is approximately equal in expected value but of the opposite sign. Intuitively, theta mostly comes from the fact that the total volatility remaining until expiration decreases from one trading day to the next, and with less volatility remaining over the life of the contract there is a less of a chance to benefit from positive convexity. By definition, however, that total variance until expiration is reduced exactly by the variance that is realized between these two dates, which, due to positive gamma, tends to lead to higher option values. These effects should cancel out. In practice, however, theta and gamma will not offset if the option pricing model used is inconsistent with actual stock price dynamics. This would occur, for instance, if volatility is assumed constant in calendar time. As French (1984) shows theoretically, an option trader using a calendar time model implicitly assumes that three days of time decay occur between a given Friday and the following Monday. Because actual variance over this three-day period 46 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 48,
    "page_range": "p.48",
    "total_pages": 86,
    "chunk_index": 71,
    "word_count": 293,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "volatility is assumed constant in calendar time. As French (1984) shows theoretically, an option trader using a calendar time model implicitly assumes that three days of time decay occur between a given Friday and the following Monday. Because actual variance over this three-day period 46 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 49,
    "page_range": "p.49",
    "total_pages": 86,
    "chunk_index": 72,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "is much lower than the variance of three trading days, the convexity effect induced by the option’s positive gamma will be muted and will only partially offset the high amount of time decay. The result is a predictable decline in option values over the weekend or any other multi-day period that includes one or more nontrading days. Because theta is driven almost entirely by gamma effects rather than interest rates, normalized gamma and theta are highly collinear in our sample. We find an average cross- sectional correlation between normalized gamma and theta of -0.95 at the portfolio level. Thus, the evidence in regressions (7) to (9), which shows that gamma appears solely respon- sible for the nontrading effect, is also consistent with nontrading effects being the result of excess time decay. Nevertheless, to verify that the nontrading effect can be attributed to theta, we include a regression with only the normalized theta and its interaction with the nontrading dummy as independent variables. The results, in column (10) of the table, show that about 76% of the variation in average returns can be attributed to theta. The interaction term on theta is highly significant, more so than any other interaction term in the table. Thus, the nontrading effects we have doc- umented appear closely related to theta, suggesting that excess time decay over nontrading periods is a primary cause of our main findings. That is, market prices embed a rate of time decay that is too large over nontrading periods because option traders insufficiently account for the difference in stock volatility when the market is open or closed. The finding that nontrading effects are closely tied to theta helps explain the patterns observed in Table III, namely the tendency of the nontrading effect to be stronger in options 47 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 49,
    "page_range": "p.49",
    "total_pages": 86,
    "chunk_index": 73,
    "word_count": 303,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "account for the difference in stock volatility when the market is open or closed. The finding that nontrading effects are closely tied to theta helps explain the patterns observed in Table III, namely the tendency of the nontrading effect to be stronger in options 47 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 86,
    "chunk_index": 74,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "that are further out of the money and closer to expiration. In the Black-Scholes model, gamma shrinks as an option moves more out of the money. However, the option’s price shrinks even faster. The result is that the normalized theta (Θ /C ) is largest for out- t t of-the-money contracts. Intuitively, these contracts will only have value if the underlying price moves significantly, which rapidly becomes less likely as time-to-maturity declines. Normalized theta also tends to be larger for options with short maturities. This is driven by the fact that the passage of a fixed amount of time represents a larger fraction of the total time remaining until maturity. Finally, to rule out the possibility that the results in these regressions were driven by an omittedinterestrateeffect, weestimateafinalregressioninwhichweincludetheinterestrate component of theta along with our main regressors. As discussed above, when interest rates are nonzero (still assuming no dividends), time decay (Θ ) is the sum of two components, t namely σ2S2 r exp(−r τ)KΦ(d ) Θ = − t t Γ − t t 2 ≡ Θσ +Θr, (5) t 2 t C t t t where r is the instantaneous riskless rate. The first component, as discussed above, captures t convexity effects. It depends very little on interest rates, only indirectly through the option’s gamma.21 The second component, Θr, can be interpreted as a pure interest rate component, t as it reflects the cost of borrowing in the option’s replicating portfolio. It is not collinear with gamma, so in regression (11) we add this “interest rate theta” to the gamma and vega terms already considered. 48 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 86,
    "chunk_index": 75,
    "word_count": 272,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "interpreted as a pure interest rate component, t as it reflects the cost of borrowing in the option’s replicating portfolio. It is not collinear with gamma, so in regression (11) we add this “interest rate theta” to the gamma and vega terms already considered. 48 Electronic copy available at: https://ssrn.com/abstract=1364721 The results of this last regression show that including interest rate effects has little bear- ing on our findings. Coefficients on normalized gamma and vega, alone and interacted with the nontrading indicator, are relatively unchanged from their values in regression (9). Vega continues to play a role in explaining trading period returns, while gamma drives all signif- icant nontrading effects. This tells us that the role of gamma in explaining the nontrading effect is not due to a failure to account for differences in the cost of leverage between trading and nontrading periods. Interestingly, while the extremely limited variation in Θr makes precise inference difficult, t the magnitude of the coefficients on Θr and its nontrading interaction are consistent with t the treatment of interest over trading and nontrading periods. Specifically, the coefficient on the interest component over trading periods is insignificantly different from 1.0, consistent with one day of interest accruing over these periods. Over nontrading periods, the coefficient on the interest component of theta is larger by approximately 2.0. Although this estimate is insignificant, the magnitude is consistent with the fact that most nontrading periods, being regular weekends, result in the payment or receipt of two additional days of interest. IV. Conclusion The evolution of modern option markets has paralleled the development of option pricing models. While no existing model is capable of explaining all observed patterns in option prices, models are irreplaceable tools for options hedging and market making activities. 49 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 51,
    "page_range": "p.51",
    "total_pages": 86,
    "chunk_index": 76,
    "word_count": 299,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.51)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "days of interest. IV. Conclusion The evolution of modern option markets has paralleled the development of option pricing models. While no existing model is capable of explaining all observed patterns in option prices, models are irreplaceable tools for options hedging and market making activities. 49 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 52,
    "page_range": "p.52",
    "total_pages": 86,
    "chunk_index": 77,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.52)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "Yet, these models periodically turn out to be wrong, as was the case for Black-Scholes in the October 1987 crash.22 Although the sophistication of option markets has advanced tremendously since then, there is no guarantee that the models in use today are free from such potential shortcomings. We believe that our results suggest a somewhat less dramatic but nevertheless quantita- tively important model misspecification. At the end of our sample period, the total dollar openinterestinexchange-tradedequityoptioncontractswasabout$300billion, whichisjust slightly larger than the average value over our entire sample. Assuming an average alpha of about 0.50% over a single nontrading period, the average dollar transfer from option buyers to option writers is likely close to $1.5 billion over the course of a single weekend. For many option contracts, particularly those that are out of the money and relatively short dated, the alpha is likely much larger.23 The finding of a nontrading effect is highly significant and pervasive among puts and calls of nearly every combination of maturity and moneyness. The finding is robust to sample period, the method of portfolio construction, and different sampling methods and weighting schemes. We find strong evidence of a nontrading effect in S&P 500 Index put returns and weaker evidence in index call returns. Implied volatilities of both equity and index options embed an excessively high expectation of variance over nontrading periods. Option portfolio risk appears to be moderately higher over nontrading periods, but after risk adjustment we find that written option positions offer nontrading returns that are still extremely attractive and significantly better than trading period returns. We interpret these 50 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 52,
    "page_range": "p.52",
    "total_pages": 86,
    "chunk_index": 78,
    "word_count": 269,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.52)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "of variance over nontrading periods. Option portfolio risk appears to be moderately higher over nontrading periods, but after risk adjustment we find that written option positions offer nontrading returns that are still extremely attractive and significantly better than trading period returns. We interpret these 50 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 53,
    "page_range": "p.53",
    "total_pages": 86,
    "chunk_index": 79,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.53)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "results as evidence against a risk-based explanation of our main findings. Cross-sectionally, options with higher gammas show stronger nontrading effects. Since the risk of hedging an option portfolio rises with gamma, this relation seems to suggest that greater aversion towards risk by option writers over nontrading periods could explain why nontrading returns are low. Hedging risk also rises with vega, but higher vegas are not found to be related to average nontrading returns. Thus, our findings appear to contradict the Chen and Singal (2003) hypothesis that investors have a greater aversion to downside risk over weekends or other nontrading periods and also appear inconsistent with a shift in option demand, as in Garleanu, Pedersen, and Poteshman (2009). The alternative hypothesis we bring forth is that some option traders rely on models that do not account for differences in the behavior of stock prices over trading and nontrading periods. Following French (1984), option prices computed in calendar time based on the assumption that volatility is constant will mechanically fall over nontrading periods given that actual volatility drops significantly when markets are closed. This will appear in the data as an excessive rate of time decay. We confirm in our sample that the nontrading effect is in fact strongly related to the rate of time decay. Since bid-ask spreads are often large, it is not feasible to capture the entire nontrading effect in a stand-alone trading strategy based on market orders. That said, Muravyev and Pearson (2016) show that transactions costs by some traders who take liquidity (i.e. trade with market rather than limit orders) may be far smaller than the posted bid-ask spread be- causeofsuperiortradetiming. Thesetraders, whoaremostlikelyusingautomatedexecution 51 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 53,
    "page_range": "p.53",
    "total_pages": 86,
    "chunk_index": 80,
    "word_count": 282,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.53)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "stand-alone trading strategy based on market orders. That said, Muravyev and Pearson (2016) show that transactions costs by some traders who take liquidity (i.e. trade with market rather than limit orders) may be far smaller than the posted bid-ask spread be- causeofsuperiortradetiming. Thesetraders, whoaremostlikelyusingautomatedexecution 51 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 54,
    "page_range": "p.54",
    "total_pages": 86,
    "chunk_index": 81,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.54)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "algorithms, pay costs only one fifth as large as those implied by the bid-ask quotes. Regardless of trading costs, nontrading effects have important implications for quote setting by market makers or other traders and are a determinant of optimal trade timing. Our findings suggest that setting aggressive ask prices and conservative bid prices would be optimal prior to nontrading periods as a means to reduce inventory ahead of declining option values. For an investor who has already written an option, the nontrading effect represents an additional return that would result from keeping that position open for another day. For an option buyer, the nontrading return is the benefit from delaying that purchase by one day. Thus, our results should be useful in improving option-based trading strategies. Our results also imply that it is important to control for nontrading effects in event studies of option returns, such as Cao, Chen, and Griffin (2005) or Xing and Zhang (2013), if events have a tendency to occur on a certain day of the week. Controlling for nontrading effects could also improve the research design for studies whose goal is to explain option pricing regularities such as upward-sloping term structures and smile-shaped cross sections in Black-Scholes implied volatilities. In order to maximize power and to best approximate continuous time theoretical models, this literature commonly analyzes option data on a daily basis (e.g., Bakshi, Kapadia, and Madan (2003) or Broadie, Chernov, and Johannes (2007)). At a daily frequency, the effects we document are likely larger than any risk premia for stochastic volatility or jump risk, for example. It is therefore possible that controlling for nontrading effects explicitly or by analyzing data at a lower frequency could have a material effect on the results reported by previous studies. 52 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 54,
    "page_range": "p.54",
    "total_pages": 86,
    "chunk_index": 82,
    "word_count": 298,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.54)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "likely larger than any risk premia for stochastic volatility or jump risk, for example. It is therefore possible that controlling for nontrading effects explicitly or by analyzing data at a lower frequency could have a material effect on the results reported by previous studies. 52 Electronic copy available at: https://ssrn.com/abstract=1364721 Moreover, we believe that our results should encourage researchers to consider market inefficiency as a potential explanation of option pricing anomalies. Though there are notable exceptions, including the behavioral papers of Stein (1989), Poteshman (2001), and Han (2008), empirical shortcomings of a particular option pricing model are almost always taken as motivation for more an improved stochastic process for the underlying price. While this progression makes sense in many cases, our results suggest that an alternative approach is sometimes called for. If the effects we have documented are due to the widespread use of a misspecified model, there will be no quick fixes. Indeed, the recognition of the issue we have empirically docu- mentedappearstogobackatleast30yearstothepublicationofFrench(1984). Nevertheless, it is the case in the options market that there are a relatively small number of highly in- fluential entities providing a large amount of information to market participants, and if the current practices of these market leaders were changed it might lead to a more efficient market. As an example, the current VIX index, which is computed by the CBOE, is based on a calendar time convention that causes a predictable drop in the level of the index every Monday. This is despite the fact that the original VIX, now known as the VXO, was based on trading time. In fact, Robert Whaley, who was retained by the CBOE to develop the VIX, noted in a 2000 paper that theVIXisbasedontradingdays. Ifthetimetoexpirationismeasuredincalendar days,theimpliedvolatilityisavolatilityratepercalendarday. Thismeans,among 53 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 55,
    "page_range": "p.55",
    "total_pages": 86,
    "chunk_index": 83,
    "word_count": 295,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.55)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "Monday. This is despite the fact that the original VIX, now known as the VXO, was based on trading time. In fact, Robert Whaley, who was retained by the CBOE to develop the VIX, noted in a 2000 paper that theVIXisbasedontradingdays. Ifthetimetoexpirationismeasuredincalendar days,theimpliedvolatilityisavolatilityratepercalendarday. Thismeans,among 53 Electronic copy available at: https://ssrn.com/abstract=1364721 other things, that the return variance of the OEX index over the weekend (from Friday close to Monday close) should be three times higher than it is over any other pair of adjacent trading days during the week (say, Monday close to Tuesday close). Empirically, this is not true. Surprisingly, thisinsightseemstohavebeenlostinthe2003revisionoftheVIXmethodology. Standardacademicdatabases(OptionmetricsIvyDB)andindustrydatafeeds(ISE/Han- wick) currently either report option implied volatilities and Greeks on a calendar time basis or do not specify what convention is used for measuring time to expiration. French’s (1984) work shows that measuring time in trading days is, while not perfect, far superior to the use of calendar days. We believe that adopting this standard and highlighting the issues involved could improve the efficiency of the options market in a meaningful way. 54 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "III. Risk and risk aversion",
    "page_number": 56,
    "page_range": "p.56",
    "total_pages": 86,
    "chunk_index": 84,
    "word_count": 180,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "III. Risk and risk aversion (p.56)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "(1984) work shows that measuring time in trading days is, while not perfect, far superior to the use of calendar days. We believe that adopting this standard and highlighting the issues involved could improve the efficiency of the options market in a meaningful way. 54 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "Notes",
    "page_number": 57,
    "page_range": "p.57",
    "total_pages": 86,
    "chunk_index": 85,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Notes (p.57)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "1As French (1984) discusses, option pricing in trading time is also incorrect given that interest accrues on a calendar time basis. When interest rates are low, the use of trading time is highly preferable even if imperfect. 2Intheinternetappendixweconsideranalternativeportfolioinwhichcallsandputsarematchedonthebasisof maturity, delta, and open interest. We obtain similar results for this portfolio. 3TradingvolumesreportedinTableIarethoseduringtheholdingperiod,whilethefilterrequiringfiveconsecutive daysofpositivevolumeisappliedtothefivedayspriortotheholdingperiod. Thespreadsreportedinthetableare at the start of the holding period. Spreads on the end of the holding period are almost identical. 4As highlighted by French (1984), interest accrues on a calendar time basis. 5Here and elsewhere in the paper, standard errors for mean and difference-in-mean estimates are obtained by regressing returns on a constant and a nontrading dummy, then applying the Newey-West (1987) procedure with 22 lags to account for possible autocorrelation. We have also computed p-values for all our key results using the block bootstrap, and we find these results to be very close. 6Even in an equal weighted portfolio, differences between average call and put returns are possible and do not suggest any violation of put-call parity, which would imply similar effects on the prices of puts and calls rather than on their returns. 7Wedonotdouble-sorttheunhedgedcall/putportfoliobecausethiswouldresultinportfolioswithlargenegative or positive deltas, whose returns were dominated by their underlying stock exposures. 8Requiring 1000 contracts per day reduces the sample much further still. Doing so has little impact on the nontrading effect, raising the effect slightly for calls and lowering it slightly for puts. However, standard errors are larger due to a smaller sample, reducing the significance of the effect. 9We explore the relation between option moneyness and the strength of the nontrading effect in Section III.C, where we provide evidence that the relation is due to a greater amount of excess time decay in out-of-the money options. 10The internet appendix examines S&P 500 Index options in more detail. In short, the evidence is statistically weakerthanthatfortheequityoptionsamplewefocusoninthepaper,butpointestimatesoftheeffectfordifferent 55 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "Notes",
    "page_number": 57,
    "page_range": "p.57",
    "total_pages": 86,
    "chunk_index": 86,
    "word_count": 309,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Notes (p.57)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "nontrading effect in Section III.C, where we provide evidence that the relation is due to a greater amount of excess time decay in out-of-the money options. 10The internet appendix examines S&P 500 Index options in more detail. In short, the evidence is statistically weakerthanthatfortheequityoptionsamplewefocusoninthepaper,butpointestimatesoftheeffectfordifferent 55 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "Notes",
    "page_number": 58,
    "page_range": "p.58",
    "total_pages": 86,
    "chunk_index": 87,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Notes (p.58)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "maturities and deltas are generally similar to those found in equity options. 11We have also examined robustness to using squared daily returns to proxy for quadratic variation. Doing so produces equivalent results for the equity option sample but somewhat weaker results for the S&P 500 Index option sample, though though most significant coefficients remain so. 12TAQdata arefilteredbeforethe 5-minute returnsare computed. Specifically, weexclude observations withzero price or zero size, corrected orders, and trades with condition codes B, G, J, K, L, O, T, W, or Z. Trades on all exchanges are included. We also eliminate observations that result in transaction-to-transaction return reversals of 25% or more and observations that are outside the CRSP daily high/low range. Finally, we compute size-weighted median prices for all transactions with the same time stamp. 13Demeaning the variance risk premia (VRP) is done to eliminate collinearity between the nontrading indicator and its interaction with the VRP. Without detrending, neither regressor would be significant in the unrestricted specifications. 14Results are robust to using dollar open interest instead. 15For most portfolios, there are no such outliers, and there is little difference between means and medians. 16ThroughoutTableVI,estimatesandt-statisticsaretheresultofexactlyidentifiedGMMestimation. T-statistics for nontrading minus trading differences are obtained by estimating a system that includes both trading and non- trading returns and that parameterizes the nontrading parameter (e.g., kurtosis or alpha) as the trading parameter plus a “delta” term. 17It is important to note that all of the calculations in the table do not factor in the effects of transactions costs, both commissions and bid-ask spreads. The returns are therefore not feasible as a stand-alone trading strategy. Instead, what they represent is the additional return that would result from holding already written options for another day. 18For simplicity, in this section we use regular returns rather than excess returns, which would introduce an additional term into the return decomposition. Results are extremely similar when excess returns are used. 19Cross-sectionalR-squaresaredefinedas1− (cid:20) 1 (cid:80)N (cid:16) Y¯ −Y ¯ˆ (cid:17)2 (cid:21) / (cid:20) 1 (cid:80)N (cid:16) Y¯ −Y ¯¯ (cid:17)2 (cid:21) ,whereY¯ istheaverage N i=1 i i N i=1 i i value of the dependent variable for portfolio i, Y ¯ˆ is the average fitted value for that portfolio, and Y ¯¯ is the cross- i 56 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "Notes",
    "page_number": 58,
    "page_range": "p.58",
    "total_pages": 86,
    "chunk_index": 88,
    "word_count": 376,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Notes (p.58)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "(cid:20) 1 (cid:80)N (cid:16) Y¯ −Y ¯¯ (cid:17)2 (cid:21) ,whereY¯ istheaverage N i=1 i i N i=1 i i value of the dependent variable for portfolio i, Y ¯ˆ is the average fitted value for that portfolio, and Y ¯¯ is the cross- i 56 Electronic copy available at: https://ssrn.com/abstract=1364721 sectional average of the Y¯. i 20The relevance of vega in explaining average returns is not new. Volatility risk has been shown by Bakshi, Cao, andChen(1997)andotherstobeanimportantdeterminantofexpectedreturnsonS&P500Indexoptions. However, evidence tying volatility risk to the expected returns on individual equity options is less clear cut (see, for example, Driessen,Maenhout,andVilkov(2009)andChristoffersen,Fournier,andJacobs(2016)). Controllingforanontrading effect may be useful in uncovering this risk premia. 21Under Black-Scholes, the sensitivity of Gamma to interest rates is fairly low for most options and negligible for short-term options, where nontrading effects are largest. In our data sample, the variation in portfolio-level Θσ is t largely driven by the absolute value of option moneyness, with a smaller role for option maturity. Interest rates, in contrast, explain essentially no variation. 22See Coval, Pan, and Stafford (2014) for a compelling account of this episode. 23As an admittedly unfair comparison, large cap stocks with positive momentum comprised roughly $6 trillion in value at the start of our sample and produced an alpha of roughly one basis point per day, implying a daily dollar alpha of $0.6 billion. 57 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "Notes",
    "page_number": 59,
    "page_range": "p.59",
    "total_pages": 86,
    "chunk_index": 89,
    "word_count": 228,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Notes (p.59)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "this episode. 23As an admittedly unfair comparison, large cap stocks with positive momentum comprised roughly $6 trillion in value at the start of our sample and produced an alpha of roughly one basis point per day, implying a daily dollar alpha of $0.6 billion. 57 Electronic copy available at: https://ssrn.com/abstract=1364721 Andersen, Torben G., Tim Bollerslev, Frank X. Diebold, and Heiko Ebens, 2001, The dis- tribution of realized stock return volatility, Journal of Financial Economics 61, 43-76. Aumann, Robert J., and Roberto Serrano, 2008, An economic index of riskiness, Journal of Political Economy 116, 810-836. Bakshi, Gurdip, Charles Cao, and Zhiwu Chen, 1997, Empirical performance of alternative option pricing models, Journal of Finance 52, 2003-2049. Bakshi, Gurdip, Charles Cao, and Zhiwu Chen, 2015, Option pricing and hedging perfor- mance under stochastic volatility and stochastic interest rates, in Cheng F. Lee and John Lee, eds.: Handbook of Financial Econometrics and Statistics, (Springer). Bakshi, Gurdip, and Nikunj Kapadia, 2003, Delta hedged gains and the negative volatility risk premium, Review of Financial Studies 16, 527-566. Bakshi, Gurdip, Nikunj Kapadia, and Dilip Madan, 2003, Stock return characteristics, skew laws, and the differential pricing of individual equity options, Review of Financial Studies 16, 101-143. Blume, Marshall E., and Robert F. Stambaugh, 1983, Bias in computed returns: An appli- cation to the size effect, Journal of Financial Economics 12, 387-553. Bollen, Nicolas P.B., and Robert E. Whaley, 2004, Does net buying pressure affect the shape of implied volatility functions? Journal of Finance 59, 711-53. Bollerslev, Tim, George Tauchen, and Hao Zhou, 2009, Expected stock returns and variance 58 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 60,
    "page_range": "p.60",
    "total_pages": 86,
    "chunk_index": 90,
    "word_count": 266,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.60)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "effect, Journal of Financial Economics 12, 387-553. Bollen, Nicolas P.B., and Robert E. Whaley, 2004, Does net buying pressure affect the shape of implied volatility functions? Journal of Finance 59, 711-53. Bollerslev, Tim, George Tauchen, and Hao Zhou, 2009, Expected stock returns and variance 58 Electronic copy available at: https://ssrn.com/abstract=1364721 risk premia, Review of Financial Studies 22, 4463-4492. Broadie, Mark, Mikhail Chernov, and Michael Johannes, 2007, Model specification and risk premia: Evidence from futures options, Journal of Finance 62, 1453-1490. Campbell, JohnY., MartinLettau, BurtonG.Malkiel, andYexiaoXu, 2001, Haveindividual stocks become more volatile? An empirical exploration of idiosyncratic risk, Journal of Finance 56, 1-43. Cao, Charles, Zhiwu Chen, and John M. Griffin, 2005, Informational content of option volume prior to takeovers, Journal of Business 78, 1073-1109. Carr, Peter, Roger Lee, 2009, Volatility derivatives, Annual Review of Financial Economics 1, 1-21. Cetin, Umut, Robert A. Jarrow, Philip E. Protter, and Mitch Warachka, 2006, Pricing options in an extended Black Scholes economy with illiquidity: Theory and empirical evidence, Review of Financial Studies 19, 493-529. Chang, Eric C., J. Michael Pinegar, and R. Ravichandran, 1993, International evidence on the robustness of the day-of-the-week effect, Journal of Financial and Quantitative Analysis 28, 497-513. Chen, Honghui, and Vijay Singal, 2003, Role of speculative short sales in price formation: The case of the weekend effect, Journal of Finance 58, 685-706. CBOE (Chicago Board Options Exchange), 2009, The CBOE Volatility Index - VIX. Christoffersen, Peter, Mathieu Fournier, and Kris Jacobs, 2016, The factor structure in equity options, working paper. 59 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 61,
    "page_range": "p.61",
    "total_pages": 86,
    "chunk_index": 91,
    "word_count": 256,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.61)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "short sales in price formation: The case of the weekend effect, Journal of Finance 58, 685-706. CBOE (Chicago Board Options Exchange), 2009, The CBOE Volatility Index - VIX. Christoffersen, Peter, Mathieu Fournier, and Kris Jacobs, 2016, The factor structure in equity options, working paper. 59 Electronic copy available at: https://ssrn.com/abstract=1364721 Cliff, Michael, Michael J. Cooper, and Huseyin Gulen, 2008, Return differences between trading and non-trading hours: Like night and day, working paper. Connolly, Robert, 1989, An examination of the robustness of the weekend effects, Journal of Financial and Quantitative Analysis 24, 133-169. Coval, Joshua D., Kevin Pan, and Erik Stafford, 2014, Capital market blind spots, working paper. Coval, Joshua D., and Tyler Shumway, 2001, Expected option returns, Journal of Finance 56, 983-1010. Dellavigna, Stefano, and Joshua M. Pollet, 2009, Investor inattention and Friday earnings announcements, Journal of Finance 64, 709-749. Driessen, Joost, Pascal Maenhout, and Grigory Vilkov, 2009, The price of correlation risk: Evidence from equity options, Journal of Finance 64, 1377-1406. Duarte,Jefferson,andChristopherS.Jones,2008,Thepriceofmarketvolatilityrisk,working paper. Dubinsky, Andrew, and Michael Johannes, 2006, Earnings announcements and equity op- tions, working paper. Fama, Eugene F., and James D. MacBeth, 1973, Risk, return, and equilibrium: Empirical tests, Journal of Political Economy 81, 607-636. Fields, M.J., 1931, Stock prices: A problem in verification, Journal of Business 4, 415-438. Foster, Dean P., and Sergiu Hart, 2009, An operational measure of riskiness, Journal of Political Economy 117, 785-814. 60 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 62,
    "page_range": "p.62-63",
    "total_pages": 86,
    "chunk_index": 92,
    "word_count": 236,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.62-63)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "Risk, return, and equilibrium: Empirical tests, Journal of Political Economy 81, 607-636. Fields, M.J., 1931, Stock prices: A problem in verification, Journal of Business 4, 415-438. Foster, Dean P., and Sergiu Hart, 2009, An operational measure of riskiness, Journal of Political Economy 117, 785-814. 60 Electronic copy available at: https://ssrn.com/abstract=1364721 French, Dan W., 1984, The weekend effect on the distribution of stock prices: Implications for option pricing, Journal of Financial Economics 13, 547-559. French, Kenneth R., 1980, Stock returns and the weekend effect, Journal of Financial Eco- nomics 8, 55-69. French, Kenneth R., and Richard Roll, 1986, Stock return variances: The arrival of infor- mation and the reaction of traders, Journal of Financial Economics 17, 5-26. Garcia, Diego, 2013, Sentiment during recessions, Journal of Finance 68, 1267-1300. Garleanu, Nicolae, Lasse Heje Pedersen, and Allen M. Poteshman, 2009, Demand-based option pricing, Review of Financial Studies 22, 4259-99. Goyal, Amit, and Pedro Santa-Clara, 2003, Idiosyncratic risk matters!, Journal of Finance 58, 975-1007. Han, Bing, 2008, Investor sentiment and option prices, Review of Financial Studies 21, 387- 414. Hansis, Alexandra, Christian Schlag, and Grigory Vilkov, 2010, The dynamics of risk-neutral implied moments: Evidence from individual options, working paper. Hendershott, Terrence, and Mark S. Seasholes, 2006, Market maker inventories and stock prices, American Economic Review Papers and Proceedings 97, 210-214. Hull, John, and Wulin Suo, 2002, A methodology for assessing model risk and its application to the implied volatility function model, Journal of Financial and Quantitative Analysis 37, 297-318. Kadan, Ohad, and Fang Liu, 2014, Performance evaluation with high moments and disaster 61 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 63,
    "page_range": "p.63",
    "total_pages": 86,
    "chunk_index": 93,
    "word_count": 264,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.63)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "97, 210-214. Hull, John, and Wulin Suo, 2002, A methodology for assessing model risk and its application to the implied volatility function model, Journal of Financial and Quantitative Analysis 37, 297-318. Kadan, Ohad, and Fang Liu, 2014, Performance evaluation with high moments and disaster 61 Electronic copy available at: https://ssrn.com/abstract=1364721 risk, Journal of Financial Economics 113, 131-155. Kelly, Michael A., and Stephen P. Clark, 2011, Returns in trading versus non-trading hours: The difference is day and night, Journal of Asset Management 12, 132-145. Lakonishok, Josef, and Edwin Maberly, 1990, The weekend effect: Trading patterns of indi- vidual and institutional investors, Journal of Finance 40, 231-43. Longstaff, Francis A., 1995, How much can marketability affect security values?, Journal of Finance 50, 1767-1774. Muravyev, Dmitriy, and Neil D. Pearson, 2016, Option trading costs are lower than you think, working paper. Newey, Whitney K., and Kenneth D. West, 1987, A simple, positive semi-definite, het- eroskedasticity and autocorrelation consistent covariance matrix, Econometrica 55, 703- 708. Patell, James M., and Mark A. Wolfson, 1981, The ex ante and ex post price effects of quar- terly earnings announcements reflected in option and stock prices, Journal of Accounting Research 19, 434-458. Poteshman, Allen M., 2001, Underreaction, overreaction, and increasing misreaction to in- formation in the options market, Journal of Finance 56, 851-876. Scott, LouisO., 1997, Pricingstockoptionsinajump-diffusionmodelwithstochasticvolatil- ity and interest rates: Applications of Fourier inversion methods, Mathematical Finance 7, 413-426. Sheikh, Aamir M., and Ehud I. Ronn, 1994, A characterization of the daily and intraday 62 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 64,
    "page_range": "p.64",
    "total_pages": 86,
    "chunk_index": 94,
    "word_count": 253,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.64)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "to in- formation in the options market, Journal of Finance 56, 851-876. Scott, LouisO., 1997, Pricingstockoptionsinajump-diffusionmodelwithstochasticvolatil- ity and interest rates: Applications of Fourier inversion methods, Mathematical Finance 7, 413-426. Sheikh, Aamir M., and Ehud I. Ronn, 1994, A characterization of the daily and intraday 62 Electronic copy available at: https://ssrn.com/abstract=1364721 behavior of returns on options, Journal of Finance 49, 557-579. Stein, Jeremy, 1989, Overreactions in the options market, Journal of Finance 44, 1011-1023. Stoll, Hans R., and Robert E. Whaley, 1987, Program trading and expiration day effects, Financial Analysts Journal 43, 16-28. Whaley, Robert E., 2000, The investor fear gauge, Journal of Portfolio Management, Spring, 12-17. Xing, Yuhang, and Xiaoyan Zhang, 2013, Anticipating uncertainty: Straddles around earn- ings announcements, working paper. 63 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 65,
    "page_range": "p.65-66",
    "total_pages": 86,
    "chunk_index": 95,
    "word_count": 127,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.65-66)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "Robert E. Whaley, 1987, Program trading and expiration day effects, Financial Analysts Journal 43, 16-28. Whaley, Robert E., 2000, The investor fear gauge, Journal of Portfolio Management, Spring, 12-17. Xing, Yuhang, and Xiaoyan Zhang, 2013, Anticipating uncertainty: Straddles around earn- ings announcements, working paper. 63 Electronic copy available at: https://ssrn.com/abstract=1364721 Table I Summary statistics This table describes basic summary statistics of our sample and from the larger data set from which our sample is constructed. Panel A shows the average number of observations (contracts observed) per day, average percentage spread, and average volume (in terms of 100-share contracts) for four different samples, each of which is a subset of the previous one. The first sample is the full IvyDB dataset. The second keeps only options on firms that are members of the S&P 500. The third keeps only options with five consecutive days of positive trading volume. The final sample excludes observations that fail one of the remaining filters described in Section I. Panel B reports moments and betas for hedged and unhedged option portfolios constructed from the final sample, where portfolio weights are proportional to lagged dollar open interest. Data are daily from January 4, 1996, through August 28, 2014. Panel A: Sample characteristics Final sample S&P 500 Five days with additional Full dataset constituents positive volume filters Average number of observations per day Puts 61860.0 19588.5 1797.9 1635.0 Calls 60063.7 19322.2 2780.4 2532.9 Average percentage bid/ask spread Puts 52.06 51.38 15.15 14.56 Calls 42.92 25.19 14.69 14.07 Average number of contracts traded Puts 21.67 48.45 380.51 386.56 Calls 35.91 77.34 435.84 422.28 Panel B: Return moments Mean SD Skewness Kurtosis Beta Unhedged excess returns Puts and calls -0.0023 0.0238 1.6841 10.8287 -0.4698 Puts -0.0057 0.1060 0.7548 5.6799 -7.0761 Calls 0.0011 0.0872 0.3924 4.9799 6.1364 Delta-hedged excess returns Puts and calls -0.0012 0.0202 2.6735 29.7915 -0.9342 Puts -0.0015 0.0204 2.1975 17.9576 -0.5344 Calls -0.0008 0.0246 1.9672 51.2985 -1.3339 64 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 66,
    "page_range": "p.66",
    "total_pages": 86,
    "chunk_index": 96,
    "word_count": 325,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.66)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "returns Puts and calls -0.0023 0.0238 1.6841 10.8287 -0.4698 Puts -0.0057 0.1060 0.7548 5.6799 -7.0761 Calls 0.0011 0.0872 0.3924 4.9799 6.1364 Delta-hedged excess returns Puts and calls -0.0012 0.0202 2.6735 29.7915 -0.9342 Puts -0.0015 0.0204 2.1975 17.9576 -0.5344 Calls -0.0008 0.0246 1.9672 51.2985 -1.3339 64 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 67,
    "page_range": "p.67",
    "total_pages": 86,
    "chunk_index": 97,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.67)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "Table II Average returns for trading and nontrading periods and for each day of the week This table reports average excess returns of portfolios of unhedged and delta-hedged equity options. The first three columns of the table show close-to- close returns in trading and nontrading periods as well as the difference between them. The remaining columns show average returns by day of the week. The unhedged put and call portfolio is constructed as the 50/50 average of put and call portfolios that are each weighted according to lagged dollar open interest. Hedged puts and hedged calls are portfolios of delta-hedged options, weighted according to lagged dollar open interest. The stock hedge portfolios for puts and calls are the portfolios of stocks that are used to delta-hedge the put and call options, respectively. Values in parentheses are t-statistics computed from Newey-West standard errors with 22 lags. Data are daily from January 4, 1996, through August 28, 2014. Trading Nontrading Difference Monday Tuesday Wednesday Thursday Friday Unhedged puts and calls -0.0008 -0.0076 -0.0068 -0.0079 -0.0026 -0.0008 0.0017 -0.0021 (-1.76) (-9.30) (-7.86) (-8.18) (-4.16) (-1.14) (1.88) (-2.81) Hedged puts 0.0003 -0.0082 -0.0086 -0.0085 -0.0016 0.0019 0.0025 -0.0023 (0.81) (-11.91) (-11.93) (-10.37) (-2.78) (2.72) (3.30) (-2.99) Hedged calls 0.0003 -0.0048 -0.0051 -0.0049 -0.0022 0.0012 0.0031 -0.0017 (0.69) (-5.08) (-5.11) (-5.34) (-2.69) (1.26) (3.46) (-2.38) Stock hedge for puts 0.0037 0.0058 0.0020 0.0045 0.0073 0.0084 0.0018 -0.0012 (2.25) (1.84) (0.55) (1.25) (2.28) (2.47) (0.56) (-0.43) Stock hedge for calls -0.0015 -0.0036 -0.0020 -0.0021 -0.0059 -0.0037 0.0005 0.0015 (-0.97) (-1.11) (-0.55) (-0.59) (-1.72) (-1.04) (0.17) (0.52) Unhedged puts -0.0034 -0.0140 -0.0106 -0.0130 -0.0089 -0.0066 0.0007 -0.0011 (-1.88) (-4.04) (-2.72) (-3.18) (-2.71) (-1.79) (0.21) (-0.34) Unhedged calls 0.0018 -0.0013 -0.0031 -0.0028 0.0037 0.0049 0.0026 -0.0032 (1.30) (-0.47) (-0.97) (-0.89) (1.23) (1.69) (1.06) (-1.30) 65 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 67,
    "page_range": "p.67",
    "total_pages": 86,
    "chunk_index": 98,
    "word_count": 302,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.67)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "(-0.97) (-1.11) (-0.55) (-0.59) (-1.72) (-1.04) (0.17) (0.52) Unhedged puts -0.0034 -0.0140 -0.0106 -0.0130 -0.0089 -0.0066 0.0007 -0.0011 (-1.88) (-4.04) (-2.72) (-3.18) (-2.71) (-1.79) (0.21) (-0.34) Unhedged calls 0.0018 -0.0013 -0.0031 -0.0028 0.0037 0.0049 0.0026 -0.0032 (1.30) (-0.47) (-0.97) (-0.89) (1.23) (1.69) (1.06) (-1.30) 65 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 68,
    "page_range": "p.68",
    "total_pages": 86,
    "chunk_index": 99,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.68)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "Table III Differences between returns following non-trading days and trading days for portfolios sorted by delta and maturity This table reports the average excess returns on nontrading days minus the average excess returns on trading days for single- and double-sorted portfolios formed on the basis of delta and maturity. Corresponding Newey-West t-statistics are also shown. Portfolios of both unhedged and delta-hedged equity options are considered, though the former are only single-sorted by maturity. All methods are identical to Table II except for the classification into more disaggregated portfolios. All maturities 11-53 days 54-118 days 119-252 days Unhedged puts and calls All deltas -0.0068 -0.0103 -0.0059 -0.0026 (-7.86) (-9.55) (-8.25) (-3.34) Hedged puts All deltas -0.0086 -0.0117 -0.0069 -0.0043 (-11.93) (-12.66) (-11.34) (-7.06) -.90 > Delta ≥ -.99 -0.0020 -0.0020 -0.0007 -0.0007 (-5.90) (-5.51) (-2.09) (-1.93) -.75 > Delta ≥ -.90 -0.0040 -0.0041 -0.0020 -0.0015 (-9.39) (-9.28) (-4.05) (-3.82) -.50 > Delta ≥ -.75 -0.0066 -0.0083 -0.0047 -0.0026 (-10.81) (-11.50) (-9.43) (-5.50) -.25 > Delta ≥ -.50 -0.0104 -0.0158 -0.0080 -0.0049 (-11.75) (-11.60) (-11.62) (-7.01) -.10 > Delta ≥ -.25 -0.0173 -0.0273 -0.0121 -0.0074 (-10.59) (-10.21) (-10.03) (-6.96) -.01 > Delta ≥ -.10 -0.0245 -0.0328 -0.0163 -0.0065 (-7.04) (-7.30) (-6.20) (-2.82) Hedged calls All deltas -0.0051 -0.0076 -0.0051 -0.0031 (-5.11) (-5.57) (-5.57) (-3.44) .01 < Delta ≤ .10 -0.0358 -0.0436 -0.0151 -0.0160 (-4.94) (-5.56) (-2.70) (-2.85) .10 < Delta ≤ .25 -0.0230 -0.0312 -0.0162 -0.0097 (-7.08) (-7.48) (-6.44) (-3.28) .25 < Delta ≤ .50 -0.0106 -0.0159 -0.0087 -0.0051 (-7.25) (-7.54) (-7.15) (-4.50) .50 < Delta ≤ .75 -0.0043 -0.0065 -0.0034 -0.0023 (-5.63) (-5.93) (-5.43) (-3.60) .75 < Delta ≤ .90 -0.0014 -0.0017 -0.0011 0.0000 (-3.19) (-3.02) (-2.96) (-0.01) .90 < Delta ≤ .99 0.0000 -0.0002 0.0001 -0.0001 (-0.06) (-0.59) (0.25) (-0.35) 66 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 68,
    "page_range": "p.68",
    "total_pages": 86,
    "chunk_index": 100,
    "word_count": 296,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.68)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "-0.0051 (-7.25) (-7.54) (-7.15) (-4.50) .50 < Delta ≤ .75 -0.0043 -0.0065 -0.0034 -0.0023 (-5.63) (-5.93) (-5.43) (-3.60) .75 < Delta ≤ .90 -0.0014 -0.0017 -0.0011 0.0000 (-3.19) (-3.02) (-2.96) (-0.01) .90 < Delta ≤ .99 0.0000 -0.0002 0.0001 -0.0001 (-0.06) (-0.59) (0.25) (-0.35) 66 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 69,
    "page_range": "p.69",
    "total_pages": 86,
    "chunk_index": 101,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.69)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "Table IV Nontrading effects in other portfolios and samples This table reports nontrading effects, defined as a nontrading mean minus a trading mean, for alternative portfolio constructions and for changes in the implied volatility of at-the-money options. Unless noted otherwise, all portfolios are constructed from the main sample (S&P 500 stocks, 5 days of positive volume), are weighted by dollar open interest, are based on quote midpoints, and impose filters for dividends, arbitrage violations, price reversals, and maximum spreads. In Panel A, we compute option returns either as midpoint-to-midpoint,ask-to-bid,orbid-to-ask. Resultsbasedonmidpointsareidenticaltothosein TableII. Wealsocomputeequal- weighted portfolios and portfolios weighted by open interest measured in terms of contracts rather than dollars. Panel B shows results for the following alternative data samples: options on all stocks (not just S&P 500 stocks, no trading volume requirement); the main samplebutwithout filters; a morerestricted sampleofoptionswith fiveconsecutive daysoftrading100 contractsormore; and amore restricted sample of options with relative bid-ask spreads of 5% or less. Panel C shows results for S&P 500 Index options, including deep out-of-the-money options with Black-Scholes deltas below 0.1 in absolute value. Panel D reports nontrading effects for different typesofnontradingperiods,namelyregularweekends,midweekholidays,andlongweekendswiththreeormoredaysofmarketclosure. Newey-West t-statistics are in parentheses. Data are daily from January 4, 1996, through August 28, 2014. Panel A: Nontrading using alternative return constructions and portfolio weights --------------- Dollar open interest weighted --------------- Equal Contract Midpoints Ask to bid Bid to ask weighted weighted Unhedged puts and calls -0.0068 -0.0060 -0.0079 -0.0197 -0.0184 (-7.86) (6.99) (8.38) (-14.75) (-13.32) Hedged puts -0.0086 -0.0075 -0.0100 -0.0213 -0.0173 (-11.93) (9.95) (11.02) (-14.54) (-11.06) Hedged calls -0.0051 -0.0045 -0.0059 -0.0162 -0.0160 (-5.11) (3.98) (5.91) (-7.25) (-5.80) Panel B: Alternative data samples Options Zero volume ------------------------- Main sample ------------------------- on all contracts No 5 days of Maximum stocks only filters volume > 100 5% spread Unhedged puts and calls -0.0043 -0.0027 -0.0072 -0.0101 -0.0044 (-8.50) (-8.08) (-8.52) (-6.72) (-4.69) Hedged puts -0.0061 -0.0042 -0.0085 -0.0112 -0.0063 (-15.38) (-16.31) (-12.45) (-8.42) (-9.24) Hedged calls -0.0037 -0.0018 -0.0053 -0.0074 -0.0029 (-5.32) (-4.49) (-5.04) (-4.73) (-4.00) Panel C: Nontrading effects in S&P 500 Index options Value Equal Equal weighted, weighted weighted deep OTM Puts and calls -0.0073 -0.0250 -0.0471 (-3.87) (-4.93) (-4.70) Puts -0.0107 -0.0315 -0.0519 (-4.56) (-5.34) (-4.95) Calls -0.0030 -0.0155 -0.0453 (-0.91) (-1.66) (-2.41) Panel D: Nontrading effects in different nontrading periods Regular Mid-week Long weekends (A) holidays (B) weekends (C) (B)-(A) (C)-(A) Puts and calls -0.0079 -0.0032 -0.0071 0.0048 0.0009 (-8.06) (-0.83) (-3.39) (1.21) (0.40) Puts -0.0087 -0.0062 -0.0056 0.0025 0.0031 (-10.20) (-2.96) (-2.79) (1.04) (1.45) Calls -0.0052 -0.0065 -0.0016 -0.0013 0.0036 (-5.03) (-1.82) (-0.53) (-0.33) (1.11) # of observations 851 44 122 67 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 69,
    "page_range": "p.69",
    "total_pages": 86,
    "chunk_index": 102,
    "word_count": 437,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.69)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "(C) (B)-(A) (C)-(A) Puts and calls -0.0079 -0.0032 -0.0071 0.0048 0.0009 (-8.06) (-0.83) (-3.39) (1.21) (0.40) Puts -0.0087 -0.0062 -0.0056 0.0025 0.0031 (-10.20) (-2.96) (-2.79) (1.04) (1.45) Calls -0.0052 -0.0065 -0.0016 -0.0013 0.0036 (-5.03) (-1.82) (-0.53) (-0.33) (1.11) # of observations 851 44 122 67 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 70,
    "page_range": "p.70",
    "total_pages": 86,
    "chunk_index": 103,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.70)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "Table V The differential between elapsed actual and implied variance This table examines the daily differentials (D ) between elapsed realized variance (RV ) and elapsed implied it it variance (-ΔIV ) . RV is the sum of all squared returns computed over 5-minute intervals within a day plus the it it squared overnight return. -ΔIV , which measures the one-day reduction in risk neutral variance remaining until it the option's expiration, is computed as the τ-day implied variance on day t-1 minus the τ-1-day implied variance on day t, where implied variance is computed on a cumulative non-annualized basis. As described in Section II- C, we use both the Black-Scholes model (BSIV) and the model-free approach (MFIV) of Bakshi, Kapadia, and Madan (2003) with the interpolation scheme of Hansis, Schlag, and Vilkov (2010) to compute these implied variances. In the top panel, we regress the average D across all stocks in the S&P 500 index on a nontrading it indicator, a measure of the variance risk premium, and an interaction term. In the lower panel we regress the S&P 500 Index differential on the same variables. The variance risk premium is equal to the square of the VIX index, converted to represent a daily value, minus the 22-day moving average of realized variances on the S&P 500 index, which are themselves the sum of all squared five-minute returns plus the overnight return. Estimates of the intercept and the nontrading indicator have been multiplied by 1000. Values in parentheses are t - statistics computed from Newey-West standard errors with 22 lags. Data are daily from February 2, 1996, through August 28, 2014. ----- D based on BSIV ----- ----- D based on MFIV ----- it it Panel A: Individual equities Intercept 0.110 0.109 0.108 0.152 0.151 0.150 (2.53) (2.56) (2.58) (3.53) (3.60) (3.62) Nontrading indicator (NT Ind) -0.913 -0.909 -0.925 -0.586 -0.579 -0.589 (-8.76) (-8.73) (-8.39) (-7.37) (-7.28) (-7.07) Variance risk premium (VRP) 0.845 2.061 1.342 2.040 (0.84) (1.36) (1.30) (1.43) NT Ind x VRP -5.861 -3.365 (-1.36) (-1.16) R-square 0.033 0.034 0.046 0.017 0.021 0.026 Panel B: S&P 500 Index Intercept -0.443 -0.440 -0.441 -0.061 -0.059 -0.059 (-10.99) (-10.94) (-11.06) (-2.85) (-2.58) (-2.68) Nontrading indicator (NT Ind) -0.296 -0.309 -0.317 -0.144 -0.156 -0.161 (-3.46) (-3.68) (-3.64) (-2.38) (-2.63) (-2.57) Variance risk premium (VRP) -2.716 -2.098 -2.449 -2.037 (-1.78) (-1.25) (-3.75) (-2.83) NT Ind x VRP -2.982 -1.991 (-1.21) (-0.87) R-square 0.003 0.018 0.021 0.002 0.039 0.043 68 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 70,
    "page_range": "p.70",
    "total_pages": 86,
    "chunk_index": 104,
    "word_count": 413,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.70)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "(-2.68) Nontrading indicator (NT Ind) -0.296 -0.309 -0.317 -0.144 -0.156 -0.161 (-3.46) (-3.68) (-3.64) (-2.38) (-2.63) (-2.57) Variance risk premium (VRP) -2.716 -2.098 -2.449 -2.037 (-1.78) (-1.25) (-3.75) (-2.83) NT Ind x VRP -2.982 -1.991 (-1.21) (-0.87) R-square 0.003 0.018 0.021 0.002 0.039 0.043 68 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 71,
    "page_range": "p.71",
    "total_pages": 86,
    "chunk_index": 105,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.71)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "Table VI Risk and risk-adjusted performance This table reports measures of risk and return and of risk-adjusted performance of option writing strategies. The option portfolios examined are the same as in Table II except that they are from the perspective of an option writer rather than buyer. CE (gamma=g) refers to the certainty equivalent rate for a CRRA investor with a risk aversion of g. P(AS) and P(FH)are the performance indices of Kadan and Liu(2014) using the risk measures ofAumann andSerrano (2008)and Fosterand Hart (2009), respectively. Except for the means, all parameters are estimated using exactly identified GMM with a Newey-West covariance matrix. T-statistics are in parentheses. Written unhedged puts and calls Written hedged puts Written hedged calls Trading Nontrading Difference Trading Nontrading Difference Trading Nontrading Difference Average excess return 0.0008 0.0076 0.0068 -0.0003 0.0082 0.0086 -0.0003 0.0048 0.0051 (1.76) (9.30) (7.86) (-0.81) (11.91) (11.93) (-0.69) (5.08) (5.11) Standard deviation 0.0231 0.0253 0.0022 0.0196 0.0218 0.0023 0.0218 0.0322 0.0103 (31.49) (16.00) (1.60) (24.03) (12.53) (1.41) (10.49) (6.40) (3.05) Skewness -1.5865 -2.1887 -0.6022 -2.1909 -2.7998 -0.6089 -1.2331 -2.9260 -1.6929 (-9.07) (-4.88) (-1.29) (-6.71) (-3.77) (-0.76) (-2.10) (-1.95) (-0.84) Kurtosis 9.4588 15.6314 6.1726 16.4390 25.7372 9.2982 32.3123 56.1377 23.8254 (6.82) (4.73) (1.72) (4.81) (4.19) (1.31) (4.34) (4.78) (2.17) Sharpe ratio 0.0346 0.3010 0.2664 -0.0172 0.3763 0.3935 -0.0125 0.1499 0.1624 (1.70) (6.73) (6.09) (-0.82) (7.05) (7.77) (-0.71) (3.41) (3.64) Alpha 0.0006 0.0076 0.0070 -0.0005 0.0083 0.0088 -0.0008 0.0049 0.0057 (1.41) (10.01) (8.67) (-1.36) (13.22) (13.04) (-2.38) (7.07) (7.62) Beta 0.4406 0.5598 0.1192 0.4912 0.6633 0.1721 1.1988 1.7188 0.5200 (3.52) (3.93) (0.92) (8.56) (6.05) (1.65) (11.04) (7.49) (3.29) Information ratio 0.0275 0.3173 0.2898 -0.0289 0.4163 0.4452 -0.0471 0.2264 0.2734 (1.38) (7.62) (6.97) (-1.39) (8.89) (9.74) (-2.57) (4.70) (5.57) CE (gamma=1) 0.0006 0.0075 0.0069 -0.0005 0.0082 0.0087 -0.0004 0.0045 0.0049 (1.38) (8.90) (8.02) (-1.23) (11.37) (11.96) (-1.18) (4.35) (4.22) CE (gamma=3) 0.0000 0.0068 0.0068 -0.0009 0.0077 0.0085 -0.0010 0.0031 0.0040 (0.05) (7.52) (7.37) (-2.20) (9.79) (10.86) (-2.30) (2.13) (2.71) CE (gamma=10) -0.0023 0.0035 0.0058 -0.0027 0.0050 0.0077 -0.0033 -0.0141 -0.0108 (-4.02) (2.46) (4.14) (-4.89) (3.67) (5.61) (-4.24) (-1.14) (-0.90) P(AS) 0.0288 0.1526 0.1238 -0.0180 0.1763 0.1943 -0.0115 0.0634 0.0749 (1.86) (5.70) (4.38) (-0.91) (5.49) (5.60) (-0.75) (2.97) (2.81) P(FH) 0.0274 0.0503 0.0229 -0.0182 0.0462 0.0644 -0.0113 0.0241 0.0354 (1.90) (32.09) (1.60) (-0.93) (28.72) (3.36) (-0.80) (14.47) (2.47) 69 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 71,
    "page_range": "p.71",
    "total_pages": 86,
    "chunk_index": 106,
    "word_count": 388,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.71)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "(-4.89) (3.67) (5.61) (-4.24) (-1.14) (-0.90) P(AS) 0.0288 0.1526 0.1238 -0.0180 0.1763 0.1943 -0.0115 0.0634 0.0749 (1.86) (5.70) (4.38) (-0.91) (5.49) (5.60) (-0.75) (2.97) (2.81) P(FH) 0.0274 0.0503 0.0229 -0.0182 0.0462 0.0644 -0.0113 0.0241 0.0354 (1.90) (32.09) (1.60) (-0.93) (28.72) (3.36) (-0.80) (14.47) (2.47) 69 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 72,
    "page_range": "p.72",
    "total_pages": 86,
    "chunk_index": 107,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.72)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "Table VII Cross-sectional determinants of risk and return This table reports the results of Fama-Macbeth regressions of portfolio returns, squared returns, and cubed returns on various normalized Greeks and their interactions with a nontrading dummy. The portfolios considered are the double-sorted hedged portfolios previously analyzed in Table III except that returns are not in excess of the riskless rate. The gamma regressor is the dollar open interest-weighted normalized gamma, defined as GS2/2P, whereG is the Black-Scholes gamma, S is the stock price, and P is the option price. The vegaandthetaregressors arethedollaropeninterest-weightednormalizedvegaandtheta,V/PandQ/P,whereVandQaretheBlack-Scholes vegaandtheta,respectively. EachGreek is included alone and interacted with a nontrading dummy variable. Coefficients estimates for the gamma and vega terms have been multiplied by 1000. T-statistics are in parentheses. Squared portfolio returns Cubed portfolio returns Portfolio returns (1) (2) (3) (4) (5) (6) (7) (8) (9) (10) (11) Intercept -0.0012 -0.0027 -0.0027 -0.0001 -0.0005 -0.0006 0.0017 0.0008 0.0008 0.0021 0.0007 (-10.37) (-17.03) (-17.37) (-0.41) (-4.59) (-4.56) (6.49) (4.10) (4.31) (7.74) (4.84) x Nontrading -0.0008 -0.0008 -0.0008 -0.0004 0.0001 0.0000 -0.0017 -0.0006 -0.0008 -0.0022 -0.0006 (-2.36) (-1.61) (-1.66) (-0.82) (0.15) (-0.06) (-3.19) (-1.41) (-1.95) (-3.77) (-1.77) Gamma 0.1995 0.1304 0.0301 0.0095 -0.0008 -0.0432 -0.0389 (7.99) (8.13) (3.57) (0.81) (-0.04) (-2.27) (-1.90) x Nontrading 0.1495 0.1292 0.0036 0.0231 -0.2970 -0.2647 -0.2718 (1.46) (1.73) (0.10) (0.57) (-5.97) (-5.69) (-5.76) Vega 1.6765 0.8011 0.3120 0.2320 0.1140 0.4385 0.4907 (12.25) (8.03) (4.83) (2.49) (0.71) (3.35) (3.73) x Nontrading 0.7940 0.0920 0.0783 -0.1894 -2.0931 -0.3063 -0.3564 (1.53) (0.36) (0.30) (-1.12) (-6.35) (-1.01) (-1.19) Theta 0.0590 (2.21) x Nontrading 0.4893 (8.14) Theta - interest rate component only 0.6340 (0.44) x Nontrading 1.8710 (0.59) Cross-sectional R-squares 0.362 0.566 0.609 0.609 0.594 0.733 0.804 0.222 0.851 0.756 0.900 70 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 72,
    "page_range": "p.72",
    "total_pages": 86,
    "chunk_index": 108,
    "word_count": 286,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.72)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "0.0783 -0.1894 -2.0931 -0.3063 -0.3564 (1.53) (0.36) (0.30) (-1.12) (-6.35) (-1.01) (-1.19) Theta 0.0590 (2.21) x Nontrading 0.4893 (8.14) Theta - interest rate component only 0.6340 (0.44) x Nontrading 1.8710 (0.59) Cross-sectional R-squares 0.362 0.566 0.609 0.609 0.594 0.733 0.804 0.222 0.851 0.756 0.900 70 Electronic copy available at: https://ssrn.com/abstract=1364721 0.010 0.08 nontrading effect (left axis) 0.005 0.07 0.000 0.06 -0.005 0.05 -0.010 0.04 -0.015 0.03 -0.020 0.02 -0.025 0.01 3M LIBOR (right axis) -0.030 0.00 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 9 9 9 9 0 0 0 0 0 0 0 0 0 0 1 1 1 1 1 9 9 9 9 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 Figure 1. Average unhedged put and call portfolio returns in each calendar year. This graph depicts the average return on the unhedged put and call portfolio in each year of our sample. The solid line denotes the average, and the two dashed lines denote the upper and lower bounds of a 95% confidence interval constructed using Newey-West standard errors. The shaded area shows the average 3-month LIBOR rate within each calendar year. 71 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 73,
    "page_range": "p.73-74",
    "total_pages": 86,
    "chunk_index": 109,
    "word_count": 230,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.73-74)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "year of our sample. The solid line denotes the average, and the two dashed lines denote the upper and lower bounds of a 95% confidence interval constructed using Newey-West standard errors. The shaded area shows the average 3-month LIBOR rate within each calendar year. 71 Electronic copy available at: https://ssrn.com/abstract=1364721 0.01 t c e f 0 f e g n -0.01 id a r t -0.02 n o n Puts d -0.03 e t Calls a m -0.04 it s E -0.05 1 1.01 1.02 1.03 1.04 Open interest prior to nontrading periods relative to other days 0.01 t c e f f 0 e g n id -0.01 a r t n -0.02 o n d -0.03 e t a m -0.04 it s E -0.05 0.6 0.7 0.8 0.9 1 Volume prior to nontrading periods relative to other days Figure 2: Volume, open interest, and the nontrading effect. The plots below show the relation between the estimated nontrading effect and volume and volatility. For each of the maturity and moneyness-sorted portfolios analyzed in Table III, we compute the median ratio of either volume or open interest on days prior to nontrading periods to the same variable on all other days. These ratios appear on the horizontal axis. On the vertical axis we show the nontrading effect estimates from Table III. 72 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 74,
    "page_range": "p.74-75",
    "total_pages": 86,
    "chunk_index": 110,
    "word_count": 228,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.74-75)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "compute the median ratio of either volume or open interest on days prior to nontrading periods to the same variable on all other days. These ratios appear on the horizontal axis. On the vertical axis we show the nontrading effect estimates from Table III. 72 Electronic copy available at: https://ssrn.com/abstract=1364721 Internet appendix for Option Mispricing Around Nontrading Periods Christopher S. Jones Joshua Shemesh Marshall School of Business Department of Banking and Finance University of Southern California Monash Business School christopher.jones@marshall.usc.edu joshua.shemesh@monash.edu I. Additional results A. Robust estimators To gauge whether any of our main results are due to outliers, we redo the analysis in Table II usingrobustestimators. Standarderrorsarecomputedusing1000samplesfromtheblockbootstrap using a one-year block size. Panel A of Table A-I replicates the sample means shown in Table II but computes t-statistics using the bootstrap rather than the the Newey-West procedure. Use of the bootstrap lowers t- statistics slightly, but our main results remain highly significant. 1 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 75,
    "page_range": "p.75-76",
    "total_pages": 86,
    "chunk_index": 111,
    "word_count": 159,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.75-76)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "a one-year block size. Panel A of Table A-I replicates the sample means shown in Table II but computes t-statistics using the bootstrap rather than the the Newey-West procedure. Use of the bootstrap lowers t- statistics slightly, but our main results remain highly significant. 1 Electronic copy available at: https://ssrn.com/abstract=1364721 Panel B reports medians rather than means. Median returns are generally lower than mean returns, consistent with the positive skewness in option returns. However, the size and significance of the nontrading effect remains relatively unaffected. Panels C and D report robust estimates that downweight the impact of return outliers. Panel C uses Huber weight, while Panel D uses bisquare weights. Both are implemented with Matlab’s robustfit function using default tuning parameters. As with medians, robust estimates of average returns are lower, but the size and significance of the nontrading effect remain close to the values reported in Table II. Another result from Table A-I is that the significance of the positive average returns observed on Wednesdays and Thursdays for some portfolios is eliminated with robust estimates, suggesting that these findings were primarily due to outliers on those days of the week. B. Disaggregated S&P 500 Index option portfolios Table IV showed that highly aggregated portfolios of S&P 500 Index options displayed a some- what weaker nontrading effect relative to that observed in equity options. While the effect was nevertheless significant for the unhedged call and put portfolio and the hedged put portfolio, it was insignificant for the hedged call portfolio unless that portfolio was restricted to hold only deep out-of-the-money contracts. In Table A-II we show the complete set of portfolios of S&P 500 Index options formed on the basisofmaturityandmoneyness. SimilartoTableIII,weobserveasignificantnontradingeffectfor the unhedged put and call portfolio and the hedged put portfolio for many different ranges of delta and maturity. For hedged calls, similar to what was shown in Section II-B, only the deep out-of- the-money hedged calls display a significant nontrading effects. That said, the point estimates for hedged calls are generally large and comparable in magnitude to the hedged stock options reported in the paper. Thus, the weakness of the hedged call portfolios for index options is mainly the result of standard errors being large. 2 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 76,
    "page_range": "p.76",
    "total_pages": 86,
    "chunk_index": 112,
    "word_count": 373,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.76)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "That said, the point estimates for hedged calls are generally large and comparable in magnitude to the hedged stock options reported in the paper. Thus, the weakness of the hedged call portfolios for index options is mainly the result of standard errors being large. 2 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 77,
    "page_range": "p.77",
    "total_pages": 86,
    "chunk_index": 113,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.77)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "C. Portfolios with matching on maturity, delta, and open interest In this section we consider an alternative version of the unhedged portfolio of puts and calls analyzedthroughoutthepaper. Inthisversion, putsandcallsarematchedonthebasisofmaturity, moneyness, and open interest. Specifically, we subdivide each of the maturity/moneyness bins in Table III into six subgroups according to the level of open interest. We then form value-weighted portfolios for calls and puts using this triple sort. We then compute the 50/50 average return for each corresponding pair of call and put portfolios. These 50/50 averages are then value weighted across all of the maturity/moneyness/open interest bins using the sum of the value of the calls and puts within each bin to construct weights. Table A-III replicates the primary results of our paper using this alternative portfolio construc- tion. In Panel A we see that the alternative portfolio has a less negative mean, with slightly smaller standard deviation, skewness, and kurtosis estimates. The beta of the alternative portfolio is also smaller, at -0.17, when compared to the -0.47 beta of the unhedged put/call portfolio analyzed in most of the paper. We believe that the smaller beta is the result of matching puts and calls by their deltas, which leads to a more effective implicit hedge. PanelBshowstheestimatednontradingeffectforthealternativeportfolio. Thevalueobtained, -0.57, ismoderatelysmallerthanthevaluereportedinTableII.Itremainshighlysignificant. Other patterns in Panel B mirror those observed in Table II except that they tend to be more muted for the alternative portfolio. Panel C shows how the strength of the nontrading effect varies with maturity. As with the unhedged put/call portfolio analyzed in Table III, we see here that nontrading effects decline with maturity. Again, the alternative portfolio shows smaller magnitudes, but they remain highly significant overall. Panel D shows risk and risk-adjusted performance for the alternative portfolio. In general, results are similar, though we see a slight tendency for the alternative portfolio to show greater risk over nontrading periods. Nevertheless, all risk-adjusted performance measures imply that the average returns over nontrading periods are more than enough to justify the moderate increase in risk. In particular, the Kadan and Liu (2014) statistic based on the risk measure of Foster and 3 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 77,
    "page_range": "p.77",
    "total_pages": 86,
    "chunk_index": 114,
    "word_count": 356,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.77)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "risk over nontrading periods. Nevertheless, all risk-adjusted performance measures imply that the average returns over nontrading periods are more than enough to justify the moderate increase in risk. In particular, the Kadan and Liu (2014) statistic based on the risk measure of Foster and 3 Electronic copy available at: https://ssrn.com/abstract=1364721 Hart (2009) implies a much more significant preference for nontrading returns when we use the alternative portfolio than when we use the original one. Finally, Figure A1 shows annual estimates of the nontrading effect, computed both using our previous approach and using the alternative matched put/call approach. Annual estimates are very similar, especially after 2000, with the matched portfolio displaying somewhat less volatility. As with the original portfolio of puts and calls, it is negative in all 19 years of our sample and statistically significant in 11 of them. 4 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 78,
    "page_range": "p.78-79",
    "total_pages": 86,
    "chunk_index": 115,
    "word_count": 145,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.78-79)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "put/call approach. Annual estimates are very similar, especially after 2000, with the matched portfolio displaying somewhat less volatility. As with the original portfolio of puts and calls, it is negative in all 19 years of our sample and statistically significant in 11 of them. 4 Electronic copy available at: https://ssrn.com/abstract=1364721 Table A-I Robustness of average returns for trading and nontrading periods and for each day of the week This table reports average excess returns of portfolios of unhedged and delta-hedged equity options. The first three columns of each panel show close-to- close returns in trading and nontrading periods as well as the difference between them. The remaining columns show average returns by day of the week. The unhedged put and call portfolio is constructed as the 50/50 average of put and call portfolios that are each weighted according to lagged dollar open interest. Hedged puts and hedged calls are portfolios of delta-hedged options, weighted according to lagged dollar open interest. The stock hedge portfolios for puts and calls are the portfolios of stocks that are used to delta-hedge the put and call options, respectively. Panel A reports sample means, as in Table II. Panel B reports medians. Panels C and D report robust estimates using the Huber and bisquare weighting functions, respectively. Values in parentheses are block bootstrap t-statistics computed from 1000 samples with a block size of one year. Data are daily from January 4, 1996, through August 28, 2014. Panel A: Sample means with block bootstrap t-statistics Trading Nontrading Difference Monday Tuesday Wednesday Thursday Friday Unhedged puts and calls -0.0008 -0.0076 -0.0068 -0.0079 -0.0026 -0.0008 0.0017 -0.0021 (-1.73) (-7.98) (-7.31) (-7.72) (-4.21) (-1.19) (1.96) (-2.94) Hedged puts 0.0003 -0.0082 -0.0086 -0.0085 -0.0016 0.0019 0.0025 -0.0023 (0.60) (-10.45) (-8.75) (-9.62) (-2.57) (2.48) (3.28) (-2.93) Hedged calls 0.0003 -0.0048 -0.0051 -0.0049 -0.0022 0.0012 0.0031 -0.0017 (0.61) (-5.13) (-5.20) (-4.57) (-2.37) (1.22) (3.85) (-2.40) Stock hedge for puts 0.0037 0.0058 0.0020 0.0045 0.0073 0.0084 0.0017 -0.0012 (2.71) (1.39) (0.51) (1.09) (1.96) (2.33) (0.58) (-0.47) Stock hedge for calls -0.0015 -0.0036 -0.0020 -0.0021 -0.0059 -0.0037 0.0005 0.0015 (-1.07) (-0.83) (-0.50) (-0.50) (-1.44) (-1.01) (0.19) (0.53) Unhedged puts -0.0034 -0.0140 -0.0106 -0.0130 -0.0089 -0.0066 0.0007 -0.0011 (-2.24) (-3.04) (-2.39) (-2.75) (-2.35) (-1.62) (0.21) (-0.38) Unhedged calls 0.0018 -0.0013 -0.0031 -0.0028 0.0037 0.0049 0.0026 -0.0032 (1.59) (-0.33) (-0.85) (-0.80) (1.12) (1.63) (1.15) (-1.27) 5 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 79,
    "page_range": "p.79",
    "total_pages": 86,
    "chunk_index": 116,
    "word_count": 395,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.79)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "(-1.07) (-0.83) (-0.50) (-0.50) (-1.44) (-1.01) (0.19) (0.53) Unhedged puts -0.0034 -0.0140 -0.0106 -0.0130 -0.0089 -0.0066 0.0007 -0.0011 (-2.24) (-3.04) (-2.39) (-2.75) (-2.35) (-1.62) (0.21) (-0.38) Unhedged calls 0.0018 -0.0013 -0.0031 -0.0028 0.0037 0.0049 0.0026 -0.0032 (1.59) (-0.33) (-0.85) (-0.80) (1.12) (1.63) (1.15) (-1.27) 5 Electronic copy available at: https://ssrn.com/abstract=1364721 Table A-I ̶ Continued Panel B: Return medians with block bootstrap t-statistics Trading Nontrading Difference Monday Tuesday Wednesday Thursday Friday Unhedged puts and calls -0.0041 -0.0115 -0.0074 -0.0117 -0.0059 -0.0037 -0.0025 -0.0049 (-7.84) (-11.92) (-8.14) (-11.65) (-5.17) (-5.44) (-4.09) (-9.91) Hedged puts -0.0024 -0.0105 -0.0081 -0.0106 -0.0036 -0.0003 -0.0009 -0.0048 (-3.88) (-11.69) (-7.62) (-11.67) (-4.57) (-0.41) (-1.25) (-7.65) Hedged calls -0.0018 -0.0060 -0.0042 -0.0061 -0.0021 -0.0014 -0.0001 -0.0033 (-4.44) (-9.70) (-6.24) (-8.97) (-2.97) (-2.60) (-0.14) (-7.24) Stock hedge for puts 0.0062 0.0093 0.0031 0.0073 0.0081 0.0143 0.0064 0.0011 (4.70) (1.93) (0.65) (1.57) (1.81) (3.33) (2.74) (0.59) Stock hedge for calls -0.0062 -0.0090 -0.0028 -0.0079 -0.0064 -0.0117 -0.0048 -0.0045 (-5.84) (-2.26) (-0.73) (-2.16) (-1.80) (-3.65) (-1.53) (-2.87) Unhedged puts -0.0139 -0.0230 -0.0090 -0.0205 -0.0188 -0.0171 -0.0123 -0.0107 (-8.82) (-4.76) (-2.13) (-4.25) (-4.91) (-3.71) (-4.45) (-5.71) Unhedged calls 0.0006 0.0023 0.0017 0.0010 0.0001 0.0082 0.0000 -0.0033 (0.46) (0.57) (0.39) (0.25) (0.04) (2.39) (0.01) (-1.45) 6 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 80,
    "page_range": "p.80-81",
    "total_pages": 86,
    "chunk_index": 117,
    "word_count": 208,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.80-81)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "(-5.84) (-2.26) (-0.73) (-2.16) (-1.80) (-3.65) (-1.53) (-2.87) Unhedged puts -0.0139 -0.0230 -0.0090 -0.0205 -0.0188 -0.0171 -0.0123 -0.0107 (-8.82) (-4.76) (-2.13) (-4.25) (-4.91) (-3.71) (-4.45) (-5.71) Unhedged calls 0.0006 0.0023 0.0017 0.0010 0.0001 0.0082 0.0000 -0.0033 (0.46) (0.57) (0.39) (0.25) (0.04) (2.39) (0.01) (-1.45) 6 Electronic copy available at: https://ssrn.com/abstract=1364721 Table A-I ̶ Continued Panel C: Robust means under Huber weights with block bootstrap t-statistics Trading Nontrading Difference Monday Tuesday Wednesday Thursday Friday Unhedged puts and calls -0.0029 -0.0097 -0.0069 -0.0102 -0.0047 -0.0023 -0.0009 -0.0040 (-5.97) (-9.44) (-6.84) (-9.47) (-7.04) (-3.79) (-1.37) (-5.99) Hedged puts -0.0014 -0.0097 -0.0083 -0.0100 -0.0032 0.0004 0.0003 -0.0041 (-2.41) (-14.33) (-8.66) (-13.82) (-4.84) (0.58) (0.46) (-6.17) Hedged calls -0.0012 -0.0062 -0.0050 -0.0063 -0.0020 -0.0006 0.0005 -0.0032 (-2.70) (-8.99) (-6.15) (-7.97) (-2.78) (-1.06) (1.17) (-6.70) Stock hedge for puts 0.0041 0.0068 0.0027 0.0062 0.0063 0.0091 0.0034 -0.0013 (2.71) (1.55) (0.63) (1.39) (1.67) (2.40) (1.19) (-0.60) Stock hedge for calls -0.0027 -0.0064 -0.0037 -0.0057 -0.0038 -0.0068 -0.0015 -0.0001 (-1.65) (-1.49) (-0.96) (-1.45) (-1.00) (-1.77) (-0.54) (-0.06) Unhedged puts -0.0081 -0.0193 -0.0113 -0.0188 -0.0120 -0.0113 -0.0060 -0.0054 (-4.31) (-3.92) (-2.56) (-3.77) (-2.86) (-2.97) (-1.91) (-2.27) Unhedged calls -0.0001 -0.0016 -0.0015 -0.0024 0.0002 0.0043 0.0005 -0.0046 (-0.06) (-0.41) (-0.43) (-0.67) (0.04) (1.35) (0.20) (-1.88) 7 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 81,
    "page_range": "p.81-82",
    "total_pages": 86,
    "chunk_index": 118,
    "word_count": 211,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.81-82)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "(-1.65) (-1.49) (-0.96) (-1.45) (-1.00) (-1.77) (-0.54) (-0.06) Unhedged puts -0.0081 -0.0193 -0.0113 -0.0188 -0.0120 -0.0113 -0.0060 -0.0054 (-4.31) (-3.92) (-2.56) (-3.77) (-2.86) (-2.97) (-1.91) (-2.27) Unhedged calls -0.0001 -0.0016 -0.0015 -0.0024 0.0002 0.0043 0.0005 -0.0046 (-0.06) (-0.41) (-0.43) (-0.67) (0.04) (1.35) (0.20) (-1.88) 7 Electronic copy available at: https://ssrn.com/abstract=1364721 Table A-I ̶ Continued Panel D: Robust means under bisquare weights with block bootstrap t-statistics Trading Nontrading Difference Monday Tuesday Wednesday Thursday Friday Unhedged puts and calls -0.0036 -0.0104 -0.0070 -0.0110 -0.0055 -0.0029 -0.0018 -0.0047 (-7.09) (-9.19) (-6.67) (-9.33) (-6.89) (-4.61) (-2.67) (-6.43) Hedged puts -0.0019 -0.0101 -0.0082 -0.0104 -0.0037 0.0001 -0.0003 -0.0047 (-3.26) (-13.84) (-8.67) (-14.10) (-5.32) (0.13) (-0.52) (-6.74) Hedged calls -0.0016 -0.0065 -0.0049 -0.0066 -0.0021 -0.0010 -0.0002 -0.0039 (-3.72) (-8.90) (-6.44) (-8.70) (-2.85) (-1.86) (-0.38) (-8.07) Stock hedge for puts 0.0042 0.0075 0.0033 0.0071 0.0062 0.0087 0.0043 -0.0012 (2.75) (1.66) (0.79) (1.53) (1.73) (2.32) (1.54) (-0.56) Stock hedge for calls -0.0026 -0.0066 -0.0041 -0.0062 -0.0031 -0.0070 -0.0019 0.0001 (-1.39) (-1.68) (-1.06) (-1.54) (-0.82) (-1.82) (-0.66) (0.04) Unhedged puts -0.0095 -0.0209 -0.0116 -0.0205 -0.0129 -0.0123 -0.0081 -0.0068 (-4.85) (-4.34) (-2.51) (-3.96) (-3.16) (-3.02) (-2.70) (-2.79) Unhedged calls -0.0009 -0.0020 -0.0010 -0.0025 -0.0009 0.0034 -0.0004 -0.0053 (-0.57) (-0.51) (-0.31) (-0.67) (-0.25) (1.02) (-0.16) (-2.14) 8 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 82,
    "page_range": "p.82-83",
    "total_pages": 86,
    "chunk_index": 119,
    "word_count": 211,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.82-83)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "(-1.39) (-1.68) (-1.06) (-1.54) (-0.82) (-1.82) (-0.66) (0.04) Unhedged puts -0.0095 -0.0209 -0.0116 -0.0205 -0.0129 -0.0123 -0.0081 -0.0068 (-4.85) (-4.34) (-2.51) (-3.96) (-3.16) (-3.02) (-2.70) (-2.79) Unhedged calls -0.0009 -0.0020 -0.0010 -0.0025 -0.0009 0.0034 -0.0004 -0.0053 (-0.57) (-0.51) (-0.31) (-0.67) (-0.25) (1.02) (-0.16) (-2.14) 8 Electronic copy available at: https://ssrn.com/abstract=1364721 Table A-II Differences between returns following non-trading days and trading days for portfolios sorted by delta and maturity, S&P 500 Index options This table reports the average excess returns on nontrading days minus the average excess returns on trading days for single- and double-sorted portfolios of S&P 500 Index options formed on the basis of delta and maturity. Corresponding Newey-West t-statistics are also shown. Portfolios of both unhedged and delta-hedged equity options are considered, though the former are only single-sorted by maturity. Newey- West standard errors are computed using only 5 lags. All maturities 11-53 days 54-118 days 119-252 days Unhedged puts and calls All deltas -0.0073 -0.0094 -0.0042 -0.0031 (-4.18) (-4.05) (-3.16) (-3.18) Hedged puts All deltas -0.0107 -0.0144 -0.0068 -0.0044 (-5.04) (-4.97) (-4.65) (-4.37) -.90 > Delta ≥ -.99 -0.0067 -0.0002 -0.0016 -0.0007 (-2.64) (-0.12) (-1.06) (-1.03) -.75 > Delta ≥ -.90 -0.0072 -0.0042 -0.0027 -0.0096 (-3.06) (-2.04) (-1.09) (-1.22) -.50 > Delta ≥ -.75 -0.0092 -0.0084 -0.0048 0.0001 (-4.35) (-4.15) (-3.55) (0.07) -.25 > Delta ≥ -.50 -0.0082 -0.0117 -0.0060 -0.0040 (-4.22) (-4.23) (-4.54) (-4.25) -.10 > Delta ≥ -.25 -0.0155 -0.0209 -0.0088 -0.0058 (-5.00) (-4.90) (-4.00) (-3.61) -.01 > Delta ≥ -.10 -0.0366 -0.0443 -0.0167 -0.0093 (-6.08) (-6.92) (-4.59) (-2.35) Hedged calls All deltas -0.0028 -0.0018 -0.0014 -0.0012 (-0.96) (-0.56) (-0.65) (-0.65) .01 < Delta ≤ .10 -0.0292 -0.0218 -0.0169 0.0072 (-2.13) (-1.66) (-1.28) (0.51) .10 < Delta ≤ .25 -0.0099 -0.0078 -0.0050 -0.0043 (-1.50) (-1.17) (-1.08) (-0.94) .25 < Delta ≤ .50 -0.0019 -0.0004 -0.0017 -0.0013 (-0.61) (-0.12) (-0.74) (-0.69) .50 < Delta ≤ .75 -0.0008 0.0007 0.0011 0.0010 (-0.37) (0.35) (0.78) (0.84) .75 < Delta ≤ .90 -0.0028 -0.0007 -0.0013 -0.0051 (-1.74) (-0.53) (-0.61) (-1.56) .90 < Delta ≤ .99 0.0007 0.0030 0.0333 NA (0.36) (1.83) (1.40) 9 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 83,
    "page_range": "p.83",
    "total_pages": 86,
    "chunk_index": 120,
    "word_count": 349,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.83)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "-0.0017 -0.0013 (-0.61) (-0.12) (-0.74) (-0.69) .50 < Delta ≤ .75 -0.0008 0.0007 0.0011 0.0010 (-0.37) (0.35) (0.78) (0.84) .75 < Delta ≤ .90 -0.0028 -0.0007 -0.0013 -0.0051 (-1.74) (-0.53) (-0.61) (-1.56) .90 < Delta ≤ .99 0.0007 0.0030 0.0333 NA (0.36) (1.83) (1.40) 9 Electronic copy available at: https://ssrn.com/abstract=1364721 Table A-III Nontrading effects for put/call portfolio based on sorting by maturity, delta, and open interest This table reports results for an alternative to the unhedged put/call portfolio considered in the paper. To construct this portfolio, we perform a triple sort of put and calls by maturity, delta, and open interest. Each of the maturity/moneyness categories from Table III is divided into six subgroups according to the level of open interest. For each category, we form value-weighted portfolios. We then compute the 50/50 average return for each corresponding pair of call and put portfolios, which are then value weighted across all of the maturity/moneyness/open interest bins to obtain a single put/call returns series, which is analyzed in this table. Panel A is similar to the bottom of Table I. Panel B is similar to Table II. Panel C is similar to Table III. Panel D is similar to Table VI. Panel A: Return moments Mean SD Skewness Kurtosis Beta -0.0005 0.0209 1.4048 10.5354 -0.1711 Panel B: Average returns for trading and nontrading periods and for each day of the week Trading Nontrading Difference Monday Tuesday Wednesday Thursday Friday 0.0007 -0.0049 -0.0057 -0.0052 -0.0012 0.0013 0.0030 -0.0006 (1.85) (-6.31) (-7.16) (-5.70) (-1.76) (2.04) (3.63) (-0.78) Panel C: Nontrading effect for portfolios sorted by maturity All maturities 11-53 days 54-118 days 119-252 days -0.0053 -0.0087 -0.0053 -0.0018 (-7.16) (-8.51) (-7.58) (-2.23) 10 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 84,
    "page_range": "p.84",
    "total_pages": 86,
    "chunk_index": 121,
    "word_count": 285,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.84)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "Wednesday Thursday Friday 0.0007 -0.0049 -0.0057 -0.0052 -0.0012 0.0013 0.0030 -0.0006 (1.85) (-6.31) (-7.16) (-5.70) (-1.76) (2.04) (3.63) (-0.78) Panel C: Nontrading effect for portfolios sorted by maturity All maturities 11-53 days 54-118 days 119-252 days -0.0053 -0.0087 -0.0053 -0.0018 (-7.16) (-8.51) (-7.58) (-2.23) 10 Electronic copy available at: https://ssrn.com/abstract=1364721 Table A-III ̶ Continued Panel D: Risk and risk-adjusted performance Trading Nontrading Difference Average excess return 0.0007 -0.0049 -0.0057 (1.85) (-6.31) (-7.16) Standard deviation 0.0198 0.0239 0.0041 (33.88) (15.02) (3.00) Skewness -1.0689 -2.3078 -1.2390 (-6.86) (-4.70) (-2.74) Kurtosis 6.7911 17.7587 10.9677 (6.36) (5.12) (3.46) Sharpe ratio -0.0375 0.2053 0.2429 (-1.90) (4.95) (5.97) Alpha -0.0008 0.0049 0.0057 (-1.97) (6.46) (7.43) Beta 0.1272 0.3008 0.1736 (1.85) (2.20) (1.61) Information ratio -0.0403 0.2091 0.2494 (-2.03) (5.22) (6.31) CE (gamma=1) -0.0009 0.0048 0.0057 (-2.40) (6.00) (7.11) CE (gamma=3) -0.0013 0.0042 0.0055 (-3.42) (4.83) (6.39) CE (gamma=10) -0.0028 0.0013 0.0041 (-6.57) (0.90) (3.06) P(AS) -0.0390 0.1233 0.1622 (-2.10) (4.52) (5.32) P(FH) -0.0394 0.0512 0.0906 (-2.12) (33.52) (4.90) 11 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 85,
    "page_range": "p.85-86",
    "total_pages": 86,
    "chunk_index": 122,
    "word_count": 168,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.85-86)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "-0.0403 0.2091 0.2494 (-2.03) (5.22) (6.31) CE (gamma=1) -0.0009 0.0048 0.0057 (-2.40) (6.00) (7.11) CE (gamma=3) -0.0013 0.0042 0.0055 (-3.42) (4.83) (6.39) CE (gamma=10) -0.0028 0.0013 0.0041 (-6.57) (0.90) (3.06) P(AS) -0.0390 0.1233 0.1622 (-2.10) (4.52) (5.32) P(FH) -0.0394 0.0512 0.0906 (-2.12) (33.52) (4.90) 11 Electronic copy available at: https://ssrn.com/abstract=1364721 0.010 0.005 alternative portfolio, matched by maturity, moneyness, and open interest 0.000 -0.005 -0.010 -0.015 unmatched calls and puts -0.020 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 9 9 9 9 0 0 0 0 0 0 0 0 0 0 1 1 1 1 1 9 9 9 9 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 Figure A-1. Average unhedged put and call portfolio returns in each calendar year. This table compares the average return on the unhedged put and call portfolio to the average return of an alternative put and call portfolio in each year of our sample. The alternative portfolio is based on a triple sort of put and calls by maturity, delta, and open interest. Each of the maturity/moneyness categories from Table III is divided into six subgroups according to the level of open interest. For each category, we form value-weighted portfolios. We then compute the 50/50 average return for each corresponding pair of call and put portfolios, which are then value weighted across all of the maturity/moneyness/open interest bins. 12 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 86,
    "page_range": "p.86",
    "total_pages": 86,
    "chunk_index": 123,
    "word_count": 269,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.86)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  },
  {
    "text": "six subgroups according to the level of open interest. For each category, we form value-weighted portfolios. We then compute the 50/50 average return for each corresponding pair of call and put portfolios, which are then value weighted across all of the maturity/moneyness/open interest bins. 12 Electronic copy available at: https://ssrn.com/abstract=1364721",
    "title": "Option Mispricing Around Nontrading Periods",
    "source_type": "pdf",
    "document_id": "b02f83c81b0c",
    "source_file": "Option Mispricing Around Nontrading Periods.pdf",
    "section": "References",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 86,
    "chunk_index": 124,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20170616150435-07'00'",
    "duration": null
  }
]