[
  {
    "text": "Option Trading and Individual Investor Performance Rob Bauera,b, Mathijs Cosemansa∗, Piet Eichholtza,b October 24, 2008 Abstract This paper examines the impact of option trading on individual investor performance. The results show that most investors incur substantial losses on their option investments, which aremuchlargerthanthelossesfromequitytrading. Weattributethedetrimentalimpactof optiontradingoninvestorperformancetopoormarkettimingthatresultsfromoverreaction to past stock market returns. High trading costs further contribute to the poor returns on option investments. Gambling and entertainment appear to be the most important motivations for trading options while hedging motives only play a minor role. We also provide strong evidence of performance persistence among option traders. Keywords: option trading, individual investor performance, investor sentiment, performance persistence, Internet brokerage JEL classification: G11, G12, G14, G24 Affiliations: aMaastricht University, bNetspar Anearlierdraftofthispaperwastitled“ThePerformanceandPersistenceofIndividualInvestors: Rational Agents or Tulip Maniacs?” ∗Contactdetails: MathijsCosemans,MaastrichtUniversity,P.O.Box616,6200MDMaastricht,Netherlands, E-mail: M.Cosemans@finance.unimaas.nl. We thank the Internet brokerage firm for providing most of the data forthisstudyandNYSEEuronextAmsterdamforprovidingdataonAEXindexoptions. Wearealsogratefulto an anonymous referee, Anders Anderson, Sirio Aramonte (EFA discussant), Andriy Bodnaruk, David Dubofsky (FMA discussant), Rik Frehen, Markus Glaser, Daniel Hoechle, Philipp Schmitz, Paul Sengmueller, Andrei Simonov,MartinWeberandseminarparticipantsattheStockholmSchoolofEconomics,theUniversityofSankt Gallen, Maastricht University, the University of Mannheim, the Netspar Pension Day at Tilburg University, the RotmanICPMworkshopinMaastricht,the2008FMAmeetingsinDallas,the2007EuropeanFinanceAssociation meetings in Ljubljana, the 2007 Erasmus University Finance Day in Rotterdam, the 2007 EFMA meetings in Vienna, and the 2007 FMA Europe doctoral seminar in Barcelona for helpful comments and suggestions. EEElelleeccctttrrrooonnniciicc cccooopppyyy aaavvvaaailiiallaabbblellee aaattt::: hhhttttttppps::://////ssssssrrrnnn...cccooommm///aaabbbssstttrrraaacccttt===999666555888111000",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 42,
    "chunk_index": 0,
    "word_count": 219,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "University, the University of Mannheim, the Netspar Pension Day at Tilburg University, the RotmanICPMworkshopinMaastricht,the2008FMAmeetingsinDallas,the2007EuropeanFinanceAssociation meetings in Ljubljana, the 2007 Erasmus University Finance Day in Rotterdam, the 2007 EFMA meetings in Vienna, and the 2007 FMA Europe doctoral seminar in Barcelona for helpful comments and suggestions. EEElelleeccctttrrrooonnniciicc cccooopppyyy aaavvvaaailiiallaabbblellee aaattt::: hhhttttttppps::://////ssssssrrrnnn...cccooommm///aaabbbssstttrrraaacccttt===999666555888111000 1 Introduction Agrowingliteraturepresentsevidenceofinvestorirrationalityinoptionmarkets. Poteshman (2001) shows that option market investors exhibit the same pattern of short-term underreaction and long-term overreaction to information that has been found in stock markets. In addition, Poteshman and Serbin (2003) find that customers of discount brokers regularly engage in irra- tionalearlyexerciseofstockoptionsandMahaniandPoteshman(2005)documentthatdiscount clients act irrationally by entering option positions that load up on growth stocks a few days before earnings announcements, even though at earnings announcements value stocks usually outperform substantially. Moreover, Han (2008) finds that investor sentiment about the stock market affects option prices. Another strand of literature stresses the importance of irrational determinants of individual investors’ trading activity in stock markets, like gambling (Kumar (2008), entertainment (Dorn and Sengmueller (2007)), and sensation-seeking (Grinblatt and Keloharju (2008)). However, options seem to be more attractive for these purposes than stocks due to the leverage they provide and the positive skewness of their payoffs. Indeed, Lakonishok, Lee, Pearson, and Poteshman (2007) show that a large fraction of individuals’ option activity is motivated by speculation on the direction of future stock price movements. We extend this work by studying the impact of option trading on individual investor per- formance. Doing so gives us the opportunity to shed light on the question whether individual investors understand the risk and return characteristics of these more complex securities, and whether they are able to apply these instruments successfully. Previous work (e.g., Barber and Odean (2000)) has shown that excessive trading by individual investors leads to substantial losses on their common stock investments. We therefore examine both the absolute returns of option traders and their performance relative to those who only trade stocks. In addition, we identify the determinants of option trading volume at the investor level to examine whether op- tiontradingisrelatedtoinvestorcharacteristicsthathavebeenlinkedtogamblingandsensation seeking in stock markets by Kumar (2008) and Grinblatt and Keloharju (2008). Furthermore, we investigate whether there is a group of option traders who are able to consistently earn abnormal returns. This is motivated by the findings of Coval, Hirshleifer, and Shumway (2005), who present evidence of performance persistence among a small group of stock investors. We then analyze the characteristics and trading strategies of these skilled option investors. 1 EEElelleeccctttrrrooonnniciicc cccooopppyyy aaavvvaaailiiallaabbblellee aaattt::: hhhttttttppps::://////ssssssrrrnnn...cccooommm///aaabbbssstttrrraaacccttt===999666555888111000",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 42,
    "chunk_index": 1,
    "word_count": 415,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "able to consistently earn abnormal returns. This is motivated by the findings of Coval, Hirshleifer, and Shumway (2005), who present evidence of performance persistence among a small group of stock investors. We then analyze the characteristics and trading strategies of these skilled option investors. 1 EEElelleeccctttrrrooonnniciicc cccooopppyyy aaavvvaaailiiallaabbblellee aaattt::: hhhttttttppps::://////ssssssrrrnnn...cccooommm///aaabbbssstttrrraaacccttt===999666555888111000",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 42,
    "chunk_index": 2,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "We perform the empirical analysis using a unique database that comprises more than 68,000 accounts and more than eight million trades in stocks and options at a large online broker in the Netherlands. In terms of size, the sample is comparable to the data set often used in studies for the United States (see, e.g., Barber and Odean (2000) and Kumar (2008)). We examine investor behavior and performance from January 2000 to March 2006, which covers the top of the stock market boom in 2000, the subsequent bust in stock prices in 2001 and 2002, and the recovery from 2003 to 2006. Thus, we are able to examine whether major market movements affect trading behavior and investor performance. We use several methods to deal with the specific risk and return characteristics of individual investor portfolios. First, to adjust returns for risk and style tilts, we use a multifactor model in the spirit of Agarwal and Naik (2004) to capture the nonlinear payoffs of options. Furthermore, weuseaKalmanfilterapproachtoallowfortimevariationinriskloadingsandstylepreferences. Finally, we introduce an approach that allows us to control for risk and style exposures even when the number of time series observations for some investors is very small. Wefindthatoptiontradersincurmuchlargerlossesontheirinvestmentsthanequitytraders. Thegrossreturndifferencebetweenthesetwogroupsofinvestorsequalsmorethan1%amonth, after taking risk and style differences into account. Controlling for known determinants of in- vestorreturnslikegender,age,turnover,accountvalue,income,andexperiencedoesnotexplain the return differential between option investors and equity investors. Instead, we attribute the poor performance of option traders to bad market timing that results from overreaction to past stockmarketmovements. Weconstructacall/putratiobasedontheoptiontradesoftheclients of the broker and find this ratio to be highly correlated with two other sentiment indicators, the consumer confidence index and the VIX index. In addition, estimation results for a vector autoregressive model show that the call/put ratio is driven by past market returns. We further document that the demographic (age and gender), socioeconomic (income) and portfolio characteristics (account value and turnover) of option traders and equity traders are very similar. In particular, the empirical results show that men are more likely than women to engage in both option trading and equity trading and also exhibit a higher trading intensity. Furthermore, we extend the result of Anderson (2006) that poorer investors trade most to the option market. However, an important difference between option traders and equity traders is 2 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 42,
    "chunk_index": 3,
    "word_count": 376,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "to engage in both option trading and equity trading and also exhibit a higher trading intensity. Furthermore, we extend the result of Anderson (2006) that poorer investors trade most to the option market. However, an important difference between option traders and equity traders is 2 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 42,
    "chunk_index": 4,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "theimpactofpastportfolioreturns. Specifically, whilepastreturnsdonotaffectanindividual’s trading activity in stock markets, they have a significantly negative influence on option trading volume. This is related to the finding of Coval and Shumway (2005) that futures traders are highly loss-averse and take more risk following losses than following gains. We link the option positions that investors take to their common stock holdings and show that most investors do not use options for hedging underlying stock positions, which confirms theresultsofLakonishok,Lee,Pearson,andPoteshman(2007)fortheU.S.market. Instead,our finding that single men with low income and little investment experience trade most suggests that gambling and sensation-seeking are important determinants of option trading, consistent with the results of Kumar (2008) and Grinblatt and Keloharju (2008) for equity investors. This isconfirmedbytheresponsesofagroupofbrokerageclientstoseveralstatementsoninvestment attitude, which reveal that the majority of investors enjoy trading and only invest the money they do not directly need. The responses also show that only a small subset of investors uses the option Greeks when trading options. Hence, a lack of knowledge about the risk and return characteristicsandtheuseofoptionsmightbeanotherexplanationforthedetrimentalimpactof option trading on investor performance. Seru, Shumway, and Stoffman (2007) provide support for this hypothesis by showing that inexperienced investors learn slowly. Consistentwiththisinterpretation, weidentifyasmallgroupofsophisticatedoptiontraders who succeed in consistently outperforming other investors. Specifically, option traders who are in the top decile portfolio based on past one-year performance continue to outperform investors in the bottom decile over the next year in terms of both gross and net alphas. Performance persistence is somewhat weaker on shorter horizons but still significant for six-month periods. Persistence in trading costs explains only part of total performance persistence, as we also find persistence in gross performance. Analyzing the composition of the decile portfolios shows that investors in the bottom deciles tend to hold small accounts with high turnover. Furthermore, theseaccountsarepredominantlyheldbymenwithlowincomeandlittleinvestmentexperience. The paper proceeds as follows. In section 2 we give a short overview of individual investors and financial markets in the Netherlands and introduce the data set of investor accounts and tradesthatisusedintheempiricalanalysis. Section3outlinesthemethodsusedforperformance calculation and attribution and section 4 presents the empirical results. Section 5 concludes. 3 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 42,
    "chunk_index": 5,
    "word_count": 340,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "proceeds as follows. In section 2 we give a short overview of individual investors and financial markets in the Netherlands and introduce the data set of investor accounts and tradesthatisusedintheempiricalanalysis. Section3outlinesthemethodsusedforperformance calculation and attribution and section 4 presents the empirical results. Section 5 concludes. 3 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 42,
    "chunk_index": 6,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "2 Data 2.1 Individual Investors and Financial Markets in the Netherlands We use a data set of individual investor accounts at a large online discount broker in the Netherlands. Attheendof2006,224companieshadlistedtheirsharesatEuronextAmsterdam, of which 128 were domestic firms and 96 were foreign.1 The total market capitalization of these companies was 591 billion euros. Total equity turnover in 2006 was close to 687 billion euros of which 585 billion euros was turnover of stocks included in the AEX index. The Dutch AEX stock market index is a value-weighted index of the 25 most actively traded firms with a combined market value of 50 billion euros. On the Euronext Liffe Amsterdam exchange options on approximately 50 different stocks are traded. In 2006 a total of 89 million stock option contracts and 25 million index option contracts was traded. An annual survey performed by the marketing research agency Millward-Brown in 2006 among approximately 1,000 Dutch investors characterizes the market of individual investors in the Netherlands. In total 1.5 million out of 7 million Dutch households invest their money in financial markets. The average Dutch retail investor trades securities at 1.4 different financial institutions (banks and online brokers). Thus, it is unlikely that the investors in our sample trade at many other institutions than the online broker. Almost half of Dutch retail investors trade through websites of banks and Internet brokers. These online investors trade almost three times as much as offline investors, in line with results documented by Barber and Odean (2002). The value-weighted asset mix of the average Dutch investor consists of 44% mutual funds, 34% stocks, 15% bonds, 5% derivatives and 2% other products. Investors indicate that they predominantly invest in mutual funds via a traditional bank. In contrast, online brokers are mostly used for trading stocks and derivatives. For the average (median) investor the total value of the investment portfolio is e60,000 (e35,000). 2.2 Data Set The raw data set contains the daily trades and end-of-the-month portfolio positions of all individual investor accounts that existed during the period from January 2000 to March 2006. Due to trading restrictions, we exclude accounts owned by minors (age < 18 years). We further 1These statistics are retrieved from the Euronext Global factbook, available at http://www.euronext.com. 4 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 42,
    "chunk_index": 7,
    "word_count": 376,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "of all individual investor accounts that existed during the period from January 2000 to March 2006. Due to trading restrictions, we exclude accounts owned by minors (age < 18 years). We further 1These statistics are retrieved from the Euronext Global factbook, available at http://www.euronext.com. 4 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 42,
    "chunk_index": 8,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "exclude accounts with a beginning-of-the-month value of less than e250 to reduce the impact of outliers. Imposing these restrictions leaves 68,146 accounts and more than two million monthly portfolio overviews. On average, investors are present in the sample for 36 months. Table 1 presents summary statistics for the data set. The sample is split into 26,266 option traders and 41,880 equity traders. We define an option trader as an investor who trades options at least once during the sample period. The proportion of men among option investors and equity investors is similar (more than 75%). Thus, if we take gender as a proxy for overconfi- dence, as suggested by Barber and Odean (2001), option traders and equity traders exhibit the same level of overconfidence. The average age of option traders and equity investors is also very similar (45 years). For option investors the mean (median) number of trades during the sample period is 80 (16) and for those who only invest in stocks the average (median) number of trades is 45 (11). The ten most traded stocks account for 34% of all stock transactions and almost half of the value of all stock trades. The four most frequently traded stocks all belong to the IT and Telecommunications sector, which reflects the heavy trading of these stocks during the Tech bubble. A striking feature of our sample is that almost half of all trades are in options.2 More than 33 million option contracts are traded, which, based on historical statistics retrieved from NYSE Euronext Liffe, is 7.2% of all option contracts traded at the Amsterdam options exchange during the sample period. The 10 most traded underlyings account for 77.2% of all option trades and 72.0% of the value of all option trades. Options on the Dutch AEX index account for 47.8% of all option transactions and 34.3% of the value of all option trades. The most frequently traded stock options are those on the largest firms with the most liquid stocks. Table 1 also reports statistics for monthly turnover per account, which we define as the av- erage of the value of all security purchases and sales divided by beginning-of-the-month account value. Average turnover for option traders is 8.9% but median turnover is zero. For equity traders the average (median) turnover is 23.7% (zero). These results show that although the majority of investors (65%) does not trade on a monthly basis, a subset of investors trades very often. The fact that for option investors the average number of trades is higher than for equity investors but the average turnover is lower, indicates that the value of each option transaction is smaller than the value of a stock transaction. Consequently, the average costs per transaction 2Tomakeacleancomparisonbetweentheimpactofoptiontradingandequitytradingoninvestorperformance we disregard transactions in bonds and futures contracts, which constitute only a small fraction of all trades. 5 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 42,
    "chunk_index": 9,
    "word_count": 477,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "turnover is lower, indicates that the value of each option transaction is smaller than the value of a stock transaction. Consequently, the average costs per transaction 2Tomakeacleancomparisonbetweentheimpactofoptiontradingandequitytradingoninvestorperformance we disregard transactions in bonds and futures contracts, which constitute only a small fraction of all trades. 5 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 42,
    "chunk_index": 10,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "are higher for option traders than for equity traders (e32 and e22, respectively). The average (median) portfolio size of option traders and equity traders is again close to each other, with a mean value of e35,000 and a median of e10,000. Combining the average account value with a total portfolio value of e60,000 for the average Dutch investor, as reported by Millward-Brown (2006), shows that the average client invests more than half of the total investment portfolio at the online broker. We also assign income to investors, based on their zip-code and income data retrieved from the Dutch Central Bureau of Statistics (CBS). The averagegrossincomeofbothgroupsoftradersisslightlyhigherthane2,500amonth. Following Seru, Shumway, and Stoffman (2007), we measure experience by the number of months that an investor has been trading. The results in Table 1 show that on average, option traders are a bit more experienced than equity traders (35 and 33 months of experience, respectively). In general, however, the descriptive statistics show a striking similarity between the demographic, socioeconomic, and portfolio characteristics of option traders and equity traders. [Table 1 about here.] 3 Methods 3.1 Measuring Investor Performance We define investor performance as the monthly change in the market value of all stocks and options in an investor’s account. End-of-the-month account value is net of transaction costs the investor incurred during the month. Since we measure performance on a monthly basis, we have to make an assumption concerning the timing of deposits and withdrawals of cash and securities. To be conservative, we assume that deposits are made at the beginning of the month and that withdrawals take place at the end of the month. We also performed the analysis under the assumption that deposits and withdrawals are made halfway the month and find that our results are robust to this assumption. Thus, we calculate net performance as (V −V −NDW ) Rnet = it it−1 it , (1) it (V +D ) it−1 it where V is the account value at the end of month t, NDW is the net of deposits and with- it it drawals during month t, and D are the deposits made during month t. it 6 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 42,
    "chunk_index": 11,
    "word_count": 362,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": ", (1) it (V +D ) it−1 it where V is the account value at the end of month t, NDW is the net of deposits and with- it it drawals during month t, and D are the deposits made during month t. it 6 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 42,
    "chunk_index": 12,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "We obtain gross returns by adding back transaction costs incurred during month t, TC , to it end-of-the-month account value, (V −V −NDW +TC ) Rgross = it it−1 it it . (2) it (V +D ) it−1 it We only consider direct transaction costs (commissions) and do not add back any indirect transaction costs (market impact and bid-ask spreads). The trades of most individual investors are relatively small, so their market impact is likely to be limited. In addition, Keim and Madhavan (1998) point out that quoted bid-ask spreads may be imprecise estimates of the true spread, because trades are often executed inside the quoted spread. Therefore, Barber and Odean (2000) estimate the bid-ask spread using transaction prices and closing prices. However, this approach is inappropriate for our purposes as the resulting estimate of the spread includes the return on the trading day, which can be substantial in the case of options. 3.2 Performance Attribution We attribute the returns on investor portfolios to different risk and style factors to obtain the abnormal performance. The Carhart (1997) four-factor model is used to adjust investor returns for exposures to the market, size, book-to-market, and momentum factors. We construct these factorsfortheDutchmarket,sincetheinvestorsinthesamplemainlyinvestinDutchsecurities.3 To characterize the market risk of the equity component of the portfolio returns, we include the return on the MSCI Netherlands equity index. We construct the factor-mimicking portfolios SMB, HML, and MOM according to the procedure outlined by Kenneth French.4 To characterize the nonlinear exposure from options, we build on the theoretical framework developed by Glosten and Jagannathan (1994), who propose adding option-based factors to performance attribution models. Agarwal and Naik (2004) implement this approach to measure theriskexposureofhedgefundsandfindthatmanyfundsusestrategiesthatresultinoption-like payoffs. Following these studies, we include the excess returns on liquid at-the-money (ATM) European call and put options on the Dutch AEX stock market index to capture the nonlinear systematic risk exposure of investors’ portfolios. In particular, at the end of each month, ATM 3In terms of volume (value) 95% (85%) of all trades are transactions in Dutch securities. Consequently, we findthatDutchversionsofthefactor-mimickingportfoliosleadtoabettermodelfitthandointernationalfactors. 4See http://mba.tuck.dartmouth.edu/pages/faculty/ken.french/data_library.html 7 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 42,
    "chunk_index": 13,
    "word_count": 347,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "Dutch AEX stock market index to capture the nonlinear systematic risk exposure of investors’ portfolios. In particular, at the end of each month, ATM 3In terms of volume (value) 95% (85%) of all trades are transactions in Dutch securities. Consequently, we findthatDutchversionsofthefactor-mimickingportfoliosleadtoabettermodelfitthandointernationalfactors. 4See http://mba.tuck.dartmouth.edu/pages/faculty/ken.french/data_library.html 7 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 42,
    "chunk_index": 14,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "call and put index options that expire two months later are bought. These index options are sold one month later and new index options are purchased. As a proxy for ATM options we select options whose strike prices are closest to the current index value. This rolling strategy of buying and selling index calls and puts produces a time series of returns on ATM calls and puts that we add to the performance attribution model. Wefurtherincludethevalue-weightedaveragereturnonDutchstocksfromtheMSCIITand Telecommunications sector to capture possible tech-related style tilts, since many economists, including Shiller (2005), argue that the technology bubble was fed by irrational euphoria among individual investors. Because the option-based factors and the IT factor are highly correlated with the market premium, we orthogonalize them with respect to the market factor. The general time series model we estimate to obtain risk and style adjusted returns is K (cid:88) R = α + β F +(cid:15) , (3) it i ik kt it k=1 where R is the excess return on the portfolio of investor i, β is the loading of portfolio i it ik on factor k, and F is the month t excess return on the k’th factor-mimicking portfolio. The kt intercept α measures abnormal performance relative to the risk and style factors. The factor i loadings indicate whether a portfolio is tilted towards a particular investment style. Other studies on individual investor performance assume that factor loadings remain con- stant over time, i.e., they use unconditional or static models for performance attribution. How- ever, a large body of empirical evidence shows that the systematic risk of stocks varies substan- tially over time as a function of the business cycle (see, for example, Ferson and Harvey (1999)). Moreover, in a dynamic world it is unlikely that investors keep their exposure to risk and style factors constant over time. Empirical support for this conjecture is provided by Kumar (2006), who finds that individual investors exhibit time-varying style preferences, driven by past style returns and earnings differentials. Hence, Ferson and Schadt (1996) argue that fluctuations in factor exposures should be taken into account when measuring portfolio performance. We treat thetime-varyingalphasandbetasaslatentstatevariablesandinferthemdirectlyfromportfolio returns using the Kalman filter. We assume a random walk process for the latent alphas and 8 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 42,
    "chunk_index": 15,
    "word_count": 377,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "style returns and earnings differentials. Hence, Ferson and Schadt (1996) argue that fluctuations in factor exposures should be taken into account when measuring portfolio performance. We treat thetime-varyingalphasandbetasaslatentstatevariablesandinferthemdirectlyfromportfolio returns using the Kalman filter. We assume a random walk process for the latent alphas and 8 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 42,
    "chunk_index": 16,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "betas. Specifically, we consider the following state-space representation: K (cid:88) R =α + β F +(cid:15) , (cid:15) ∼ N(0,σ2), (4) it it ikt kt it it i(cid:15) k=1 α =α +ν , ν ∼ N(0,σ2 ), (5) it it−1 it it iν β =β +η , η ∼ N(0,Q), (6) it it−1 it it where (cid:15) , ν , and η are normally distributed mean zero shocks orthogonal to each other it it it and with variance σ2, σ2 , and diagonal covariance matrix Q, respectively. We test the null i(cid:15) iν hypothesis of constant betas, which corresponds to the restriction that the diagonal elements of Qarezero, usingalikelihoodratiotest. Equation(4)istheobservationequationandEquations (5) and (6) are the state equations. The Kalman filter is a recursive algorithm for sequentially updating the one-step ahead estimate of the state mean and variance. We use it to calculate maximum likelihood estimates of the model parameters σ2, σ2 , and Q along with minimum i(cid:15) iν mean-square error estimates of the state variables α and β . We set the initial one-step-ahead it it predicted values for the states equal to the OLS estimates from the static model. We treat the initial one-step-ahead predicted values of σ2 and the covariance matrix Q as diffuse, setting iν them equal to arbitrarily large numbers. We use a smoothing algorithm to obtain Kalman smoothed estimates, conditioned on information from the full sample period (Hamilton (1994)). 4 Results 4.1 Option Trading and Investor Performance In this section we compare the raw returns and alphas of option traders and equity investors. Barber and Odean (2000) show that the common stock performance of individual investors is poor due to excessive trading and poor stock selection skills. This raises the question how these investors perform when trading options, which have a more complex payoff structure. In Table 2, Panel A shows that the average option investor loses 1.81% per month in gross terms during the sample period, which is economically large and statistically significant at a 1% level. In contrast, equity investors only lose 0.58%, which is not significant at conventional levels. The second line in Table 2 shows that accounting for risk exposures and style tilts 9 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 42,
    "chunk_index": 17,
    "word_count": 369,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "during the sample period, which is economically large and statistically significant at a 1% level. In contrast, equity investors only lose 0.58%, which is not significant at conventional levels. The second line in Table 2 shows that accounting for risk exposures and style tilts 9 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 42,
    "chunk_index": 18,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "explains only part of the poor performance of option traders. Specifically, while the gross alpha of equity traders is close to zero, the risk- and style adjusted return of option traders is -1.01%. In the third row of panel A, we adjust returns for time-varying risk and style exposures using the dynamic factor model in Equations (4)-(6). Although the average dynamic alpha of option traders is 10 basis points higher than their static alpha, they still underperform equity investors by almost a percent per month. Thus, allowing for time variation in risk and investment styles does not eliminate the underperformance of option traders. The right hand side of panel A indicates that the performance gap between option traders andcommonstockinvestorswidenswhentransactioncostsaretakenintoaccount. Inparticular, the net alphas of equity investors are 2.75% higher than those of option traders. Thus, option investors not only lose due to poor investment decisions but also suffer from higher trading costs. Part of this underperformance can be explained by the brokerage firm’s commission fee structure. Trading costs for option contracts consist of a specific amount per contract, whereas trading costs for stocks are based on a fixed amount and a variable part that depends on the value of the transaction. Because option investors tend to trade many small contracts, trading options is more expensive than trading stocks in relative terms. To shed more light on the poor performance of option traders we split the sample in two subperiods.5 Thefirstperiod,fromJanuary2000toMarch2003,includesthehugestockmarket decline after the burst of the tech bubble. In the second subperiod, from April 2003 to March 2006, the market gradually recovers from the crash. Panel B shows that in the first subperiod option investors earn positive gross alphas and actually outperform equity traders. However, panel C reveals that in the second subperiod option traders underperform other investors by almost two percent in terms of gross alpha and almost four percent in terms of net alpha. These results suggest that option traders seem to miss the recovery of the market. Panel D reports the beta estimates in the static performance evaluation model for both groups of investors. These betas are based on gross returns but loadings based on net returns are similar. The results indicate that the loadings of the portfolios held by option investors on the market and SMB factors are significantly lower than those of the equity-only traders. As expected, their exposure to the call option factor is higher. The positive loadings on the IT factor imply that, on average, investors’ portfolios are tilted towards technology stocks. The 5Wedonotestimatedynamicmodelsforsubperiodsbecauseofthesmallnumberoftimeseriesobservations. 10 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 42,
    "chunk_index": 19,
    "word_count": 427,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "market and SMB factors are significantly lower than those of the equity-only traders. As expected, their exposure to the call option factor is higher. The positive loadings on the IT factor imply that, on average, investors’ portfolios are tilted towards technology stocks. The 5Wedonotestimatedynamicmodelsforsubperiodsbecauseofthesmallnumberoftimeseriesobservations. 10 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 42,
    "chunk_index": 20,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "subsampleanalysisshowsthatinvestorslowertheirexposuretothemarket, momentumandthe IT factors but increase their exposure to the size and value factors in the second subperiod, in linewithKumar’s(2006)findingthatindividualinvestorsexhibittime-varyingstylepreferences. [Table 2 about here.] Figure 1, which traces the evolution of time-varying alphas and betas for option traders, confirms our finding that these investors primarily underperform in the second subperiod. The plot further shows that although factor betas fluctuate heavily, investors often adjust their exposures too late.6 For instance, in the first subperiod option traders increase their exposure to the call option factor when the market falls, but decrease their call option exposure at the beginning of the second subperiod when the recovery sets in. Interesting, however, is that option traders already lower their exposure to the IT factor in 2000 whereas equity traders keep their exposure constant throughout the first subperiod. A possible explanation for the slower response of equity investors to the burst of the IT bubble is that these traders are more prone to the disposition effect than option traders. Brunnermeier and Nagel (2004) show that hedge funds, which are considered to be managed by sophisticated investors, were also riding the bubble but reduced their exposure to the IT sector before stock prices collapsed. [Figure 1 about here.] Because the poor performance of option traders compared to equity investors is not ex- plained by risk and style tilts, we consider several other potential explanations. First, we account for known determinants of investor performance by relating returns to a number of investor characteristics. We examine the cross-sectional relation between investor performance and characteristics using the cross-sectional approach of Fama and MacBeth (1973). Each month we run a cross-sectional regression of portfolio returns on investor characteristics, L (cid:88) R = γ + γ Z +ξ , (7) it 0t lt ilt it l=1 where Z is the value of characteristic l for investor i in month t. We then calculate the Fama- ilt MacBeth estimator for the characteristics, which is the time series average of the monthly 6Thelikelihoodratiofortestingwhetherfactorloadingsareconstantinthedynamicmodelis22.11,rejecting the null hypothesis that betas are constant at a 1% level. 11 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 42,
    "chunk_index": 21,
    "word_count": 346,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "is the value of characteristic l for investor i in month t. We then calculate the Fama- ilt MacBeth estimator for the characteristics, which is the time series average of the monthly 6Thelikelihoodratiofortestingwhetherfactorloadingsareconstantinthedynamicmodelis22.11,rejecting the null hypothesis that betas are constant at a 1% level. 11 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 42,
    "chunk_index": 22,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "cross-sectional parameter estimates. We calculate the standard error of the Fama-MacBeth estimator from the time series of these monthly estimates. We perform this analysis for the full sample period as well as the two subperiods defined before to assess the stability of the relations between performance and characteristics in different market conditions. Weincludethefollowingcharacteristicsasindependentvariables: optionsandstocks&options, which are two dummy variables equal to one if investor i trades only options or both stocks and options, respectively, in montht; monthly portfolioturnover; inactive, a dummy variable equal tooneifmonthlyportfolioturnoveriszero; andwomanandjoint,whicharetwogenderdummy variables equal to one if the account is held by a woman or jointly by a man and woman. We also include the valueof the portfolio at the end of the previous month. Because the descriptive statistics in Table 1 show that the distributions of turnover and account value are skewed, we trim these characteristics at the 99th percentile and use their logarithmic transformations. We furtherincludetheageandthegrossincomeofinvestors. Finally, weaddexperience, measured by the number of months an investor has been trading, to the regressions. Table 3 reports results from the Fama-MacBeth regressions. Results in the left hand side of the table correspond to regressions with raw returns as dependent variable. The first column shows that even after controlling for investor and portfolio characteristics, option traders con- tinue to earn lower gross returns than those investors who only trade stocks. This is consistent with the observation in Table 1 that the demographic, socioeconomic, and portfolio character- istics of option traders and equity investors are very similar. The estimation results for the two subperiods reported in columns two and three confirm the result from Table 2 that the underperformance of option traders is concentrated in the second subperiod. The estimates in the next three columns show that also in the presence of control variables the return difference between option and stock investors increases when transactions costs are taken into account. In addition, the coefficient estimates on the control variables have the expected signs. Specifically, we find that trading lowers net performance, in line with the evidence of Barber and Odean (2000), and that portfolios held by women outperform those of men, confirming the results of Barber and Odean (2001). We also find a strong, positive relation between portfolio value and investor performance and between income and performance, which indicates that investors with larger portfolios and higher income outperform smaller investors. 12 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 42,
    "chunk_index": 23,
    "word_count": 397,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "women outperform those of men, confirming the results of Barber and Odean (2001). We also find a strong, positive relation between portfolio value and investor performance and between income and performance, which indicates that investors with larger portfolios and higher income outperform smaller investors. 12 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 42,
    "chunk_index": 24,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "The cross-sectional analysis above does not account for risk and style differences across investor portfolios. The standard approach to identifying the determinants of cross-sectional variation in risk- and style-adjusted returns consists of two steps. First, for every portfolio time series regressions of returns on risk and style factors are run to obtain alphas. Second, a cross- sectional regression of these alphas on investor characteristics is estimated. The main drawback of this approach is the errors-in-variables problem that arises because the factor loadings in the first-stage time series regression are estimated with error. Therefore, we introduce a new method that makes it possible to control for risk and style exposures even when the number of return observations for some investors is small. This approach is based on a purged estimator used in the asset pricing literature by Brennan, Chordia, and Subrahmanyam (1998). Each month, we run the cross-sectional regression (7) of returns on characteristics. We then regress the vector of monthly cross-sectional coefficients for each characteristic, γ , on a constant and lt the risk and style factors F , kt K (cid:88) γ = δ + δ F +ω . (8) lt l0 lk kt lt k=1 Intheappendixwedemonstratethattheinterceptinthisregression,δ ,isanunbiasedestimate l0 of the cross-sectional relation between characteristic l and alpha. The right hand side of Table 3 shows that the conclusion that option trading has a detri- mental impact on investor performance also holds when alpha is used as a dependent variable. The bottom line is that controlling for differences in risk and style exposures and differences in the characteristics of investors and their portfolios does not explain the underperformance of option traders compared to equity investors. [Table 3 about here.] 4.2 Investor Sentiment and Market Timing The finding that the underperformance of option investors is concentrated in the second sub- period suggests that it is related to poor market timing. Market timing skills are especially important in the options market because options are effective instruments for betting on mar- ket moves due to the leverage they provide and the positive skewness of their payoffs. Since we 13 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 42,
    "chunk_index": 25,
    "word_count": 352,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "that it is related to poor market timing. Market timing skills are especially important in the options market because options are effective instruments for betting on mar- ket moves due to the leverage they provide and the positive skewness of their payoffs. Since we 13 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 42,
    "chunk_index": 26,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "find that option investors perform poorly when markets move upward, we conjecture that after the stock market decline in 2001 and 2002, investors became bearish about market prospects and expected a further fall. Since the brokerage firm restricts the ability of its clients to sell stocks short to the 50 largest and most liquid Dutch stocks and only allows intraday short selling, most investors use options to speculate on a market decrease. Therefore, we expect that at the end of 2002 investors took bearish positions in options. Initial evidence supporting this hypothesis is provided in Figure 2, which plots the return on the MSCI Netherlands equity index, the gross return difference between equity investors and option traders, and the ratio of short-term (three months to expiration or less) option positions taken in anticipation of a market increase and positions taken in anticipation of a market decrease. We calculate this call/put ratio as the value of call options bought by the investors divided by the value of their put option purchases.7 An increase (decrease) in the call/put ratio indicates that option investors become more optimistic (pessimistic) about stock market prospects. Figure 2 indicates that the ratio is below one for most months in 2003 and 2004, which is exactly the period in which stock markets started to recover. This supports our hypothesis that, after the stock market crash in 2001 and 2002, option traders speculated on a further decline of the market. As a result, they missed part of the recovery of the market and consequently, common stock investors outperformed option traders during this period. [Figure 2 about here.] The importance of sentiment in option markets has recently been shown by Han (2008), who documents that investor sentiment about the stock market affects option prices. Figure 3 relates the call/put ratio to the level of the MSCI Netherlands index and to two other sentiment indicators, which are the consumer confidence index obtained from the Dutch Central Bureau of Statistics and the AEX volatility index (VIX) provided by Euronext. The VIX measures the market expectations of short term volatility implied by AEX index option prices. Since volatility often signals financial turmoil, the VIX is commonly interpreted as a measure of fear in the market.8 We plot the inverse of the VIX so that high values correspond to optimism 7Wealsoconsideredanextensionofthisratio,definedasthesumofthevalueofcalloptionsboughtandput options sold divided by the sum of the value of put options bought and call options sold. Using this ratio leads to similar results. 8TheconstructionoftheAEXvolatilityindexfollowsthecurrentmethodologyoftheCBOEforconstructing the traditional VIX, which is based on the S&P500 index option prices listed on CBOE. 14 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 42,
    "chunk_index": 27,
    "word_count": 433,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "correspond to optimism 7Wealsoconsideredanextensionofthisratio,definedasthesumofthevalueofcalloptionsboughtandput options sold divided by the sum of the value of put options bought and call options sold. Using this ratio leads to similar results. 8TheconstructionoftheAEXvolatilityindexfollowsthecurrentmethodologyoftheCBOEforconstructing the traditional VIX, which is based on the S&P500 index option prices listed on CBOE. 14 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 42,
    "chunk_index": 28,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "amonginvestors. Figure3showsastrongrelationbetweentheMSCIindexontheonehandand the three sentiment measures on the other hand. Both the index and the sentiment indicators reach their lowest value in the beginning of 2003, which coincides with the start of the second subperiod. The plots also reveal that after the downfall of the market it takes considerable time before confidence of consumers and investors has been restored to normal levels. [Figure 3 about here.] Table 4 provides a more formal analysis of the relation between sentiment, market timing, and investor performance. The pairwise correlations between the three different sentiment measures reported in panel A confirm their strong relationships depicted in Figure 3. In panel B we present results for time-series regressions of the gross return difference between option traders and equity investors on the market return, the call/put ratio, and interaction terms between these two variables. The first column shows that the market return alone explains more than 37% of the performance difference between these two groups of investors. The negative coefficient implies that option traders lose relative to stock investors when markets increase, which lends further support to the hypothesis that bad market timing is responsible for the underperformance of option traders in the second subperiod, when stock markets rose. The second column indicates that adding the call/put ratio only leads to a small increase in the adjusted R2. In contrast, column 3 shows that adding an interaction term between the market return and the call/put ratio leads to a sharp increase in explanatory power. In fact, this two-factor model explains more than 60% of the underperformance of option traders. The positive coefficient on this interaction term means that for a given market return, an increase in the call/put ratio is related to an increase in the relative performance of option traders. This explains the poor performance of option investors in the second subperiod, when the call/put ratio of their trades was low. Incolumnsfourandfiveweincludecall/putratiosconstructedusingindexoptionsandstock options, respectively, to examine whether the underperformance of option traders is driven by market sentiment (index options) or stock-specific sentiment (stock options). When including these variables separately, they are both significant at a 1% level. In column six we include both ratios simultaneously in the regression and find that they are still significant. This sug- gest that market sentiment and stock-specific sentiment are both important in explaining the 15 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 42,
    "chunk_index": 29,
    "word_count": 391,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "these variables separately, they are both significant at a 1% level. In column six we include both ratios simultaneously in the regression and find that they are still significant. This sug- gest that market sentiment and stock-specific sentiment are both important in explaining the 15 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 42,
    "chunk_index": 30,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "underperformance of option traders. The conclusion that option traders overreact to past stock market movements is in line with results of Lakonishok, Lee, Pearson, and Poteshman (2007). These authors find that discount clients decreased their open interest in purchased puts at the height of the Internet bubble but sharply cut their bets that prices would increase after the burst of the bubble. In contrast, clients of full-service brokers and firm proprietary traders did not use the option market to speculate on rising prices during the boom. [Table 4 about here.] To further investigate the relation between sentiment and market returns, we estimate vec- tor autoregressive (VAR) models with the call/put ratio and the market return as dependent variables. The VAR model makes it possible to examine the dynamic interrelationships be- tween sentiment and market returns. The methodology is similar to that used by Brown and Cliff (2004) and Schmitz, Glaser, and Weber (2007), who find strong evidence that sentiment is driven by past stock market returns but little evidence that sentiment predicts returns. The general VAR model is given by P (cid:88) Y = φ + φ Y +η , (9) t 0 j t−j t j=1 where Y is a vector that contains the call/put ratio and the market return. We use the Schwarz t criterion and the Akaike information criterion to determine the appropriate number of lags P. These criteria prefer a specification with two lags of the call/put ratio and the market return. Table 5 presents the estimation results from the VAR model for the full sample period and the two subperiods. The first column shows that the first-order lags of the call/put ratio and the market return have a significantly positive impact on the current level of the call/put ratio. This is consistent with the hypothesis that option investors extrapolate past market returns. In contrast, Schmitz, Glaser, andWeber(2007)deriveasentimentmeasurefromwarrantsandfind that past returns have a negative impact on sentiment, while sentiment has a positive impact on future returns. However, these effects are short-lived (2 days), so sentiment measures do not seem to be useful to predict returns for longer horizons. Table 5 also reports F-statistics and p-valuesforGrangercausalityteststhatthecoefficientsonthelagsoftheindependentvariables 16 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 42,
    "chunk_index": 31,
    "word_count": 365,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "have a negative impact on sentiment, while sentiment has a positive impact on future returns. However, these effects are short-lived (2 days), so sentiment measures do not seem to be useful to predict returns for longer horizons. Table 5 also reports F-statistics and p-valuesforGrangercausalityteststhatthecoefficientsonthelagsoftheindependentvariables 16 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 42,
    "chunk_index": 32,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "other than the lags of the dependent variable are jointly equal to zero. The results show that market returns Granger-cause the call/put ratio at the 1% level. In contrast, column two indicates that lags of the call/put ratio do not predict the return on the market. Estimation results for the two subperiods are similar and confirm the conclusion that sentiment among option investors, as measured by the call/put ratio, is driven by past market returns while the call/put ratio itself does not predict future market returns. [Table 5 about here.] 4.3 Hedging and Gambling Motivations for Option Trading The large losses on option investments bring up the question why individual investors trade options. In this section we consider two alternative motivations for option trading. First, it is possible that investors use options for hedging the downward risk of their stock portfolio. Anotherpossibilityisthatinvestorsuseoptionsforgambling. Kumar(2008)linksthepreference ofindividualinvestorsforlotterystockstotheirsocioeconomiccharacteristics. Hedefineslottery stocks as stocks with a low price, high idiosyncratic skewness and high idiosyncratic volatility and shows that state lotteries and lottery stocks attract a similar socioeconomic clientele, which consists of poor, young, single men. However, options seem to be even more attractive for gambling purposes than stocks because of the leverage they provide and their skewed payoffs. We examine this hypothesis by linking both option trading and equity trading to a number of investor and portfolio characteristics. Specifically, we regress different measures of trading on a gender dummy variable, lagged portfolio value, age, income, experience, and past portfolio returns. We also include the number of trades in the other asset class as a regressor to control for an investor’s general propensity to trade. Furthermore, this allows us to investigate whether option investors also trade more stocks than equity-only investors. ThefirsttwocolumnsinTable6reportestimatesforapooledprobitmodelthatmeasuresthe influence of the investor and portfolio characteristics on the decision to trade options (column one) and stocks (column two) in a given month. Standard errors are clustered by investor and by time period, as suggested by Petersen (2007), to account for both serial correlation and cross-sectional correlation. The results indicate that past portfolio returns have a significantly negative impact on the decision to trade options. In contrast, past returns have a positive but 17 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 42,
    "chunk_index": 33,
    "word_count": 364,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "and by time period, as suggested by Petersen (2007), to account for both serial correlation and cross-sectional correlation. The results indicate that past portfolio returns have a significantly negative impact on the decision to trade options. In contrast, past returns have a positive but 17 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 42,
    "chunk_index": 34,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "insignificant effect on the decision to trade stocks. The finding that lower past returns increase trading activity among option investors but decrease the intensity of trading among equity investors is consistent with a disposition effect being present among equity traders but absent among option traders. Another potential explanation for this finding is that option traders are loss-averse and take more risk following losses and less risk following gains. This is consistent with evidence documented by Coval and Shumway (2005), who show that professional future traders are highly loss averse. Table 6 also shows that females have a lower propensity to trade both options and stocks, which generalizes the conclusion of Barber and Odean (2001) that men trade more than women to the option market. Portfolio value has a positive impact on the decision to trade, since large portfolios require more trades. We further find that older investors are more likely to trade stocks and options. A possible explanation for this result is that for older investors trading is a leisure activity. Experience and income lower the probability of trading stocks and options, consistent with the view that less experienced and poorer investors are more inclined to trade. Theprobitregressionsconsiderthedecisiontotradebutnottheintensityoftrading. There- fore, in columns three and four we report Fama-MacBeth regression estimates in which the dependent variable is the logarithm of the number of option trades (column three) and equity trades (column four). Since the dependent variables exhibit serial correlation, we correct the Fama-MacBeth standard errors for serial correlation using the Newey-West procedure, as sug- gested by Cochrane (2005). In addition, we apply the Heckman (1976) two-stage procedure to account for self-selection in the trading decision. In the first stage, we use the estimates from the probit regressions to calculate the inverse Mills ratio. We then include the inverse Mills ratioasanadditionalregressorintheFama-MacBethregressionstoobtainconsistentestimates. The Fama-MacBeth estimates are qualitatively similar to the results from the probit model. In particular, higher past portfolio returns decrease option trading activity but increase the intensity of equity trading. Single men, investors with large accounts, older investors, and those with low income and little experience tend to trade most. Furthermore, the results confirm the hypothesis that investors who trade more options (stocks) also trade more stocks (options). Although we correct the Fama-MacBeth standard errors for serial correlation, as a robustness check we also report estimation results for pooled panel regressions in the last two columns with 18 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 42,
    "chunk_index": 35,
    "word_count": 402,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "confirm the hypothesis that investors who trade more options (stocks) also trade more stocks (options). Although we correct the Fama-MacBeth standard errors for serial correlation, as a robustness check we also report estimation results for pooled panel regressions in the last two columns with 18 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 42,
    "chunk_index": 36,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "standard errors clustered by investor and by time period. The results from the panel model are very similar to the Fama-MacBeth estimates and confirm the conclusion that investor and portfolio characteristics have the same influence on option trading as on equity trading, except for the impact of past portfolio returns. The finding that single men with low income and little experience trade most suggests that gambling and entertainment motives play an important role in explaining excessive trading by individual investors in both option and stock markets. [Table 6 about here.] To dig further into the motivations for trading options, in Table 7 we classify all opening option trades into purchased call, written call, purchased put, and written put positions. Fur- thermore, a split is made between AEX index options and stock options. Panel A reports the percentage of option volume in a given category relative to the total of calls and puts traded. When looking at trading volume in all options, purchased call options dominate, followed by written calls, written puts and purchased put positions. The result that call positions are more prevalent than put positions is consistent with results documented by Lakonishok, Lee, Pear- son, and Poteshman (2007). However, differentiating between index options and stock options shows that purchased put positions dominate for index options but are least prevalent for stock options. Similarly, Schmitz, Glaser, and Weber (2007) find that for index warrants, trading volume of calls equals volume of puts but that for stock warrants, volume of calls is much larger than volume of puts. The finding that purchased puts are the least frequently traded category of stock options suggests that most investors do not use options for hedging their underlying stock portfolio. Panel B shows the percentage of the value of option trades in a given category relative to the total value of calls and puts traded. These results are qualitatively similar to those reported in panel A. In particular, most investments in index options are purchased put positions while for stock options the highest amount of money is invested in long call positions. In Panel C we display the moneyness of the options in each category, defined as the strike price divided by the price of the underlying asset. The results indicate that investors have a preferenceforout-of-the-moneyoptions. Thisholdsforbothcallsandputsandforindexoptions and stock options. The tendency to take out-of-the-money option positions is consistent with a gambling motive for option trading, since these options are cheap and offer a small probability of a large gain, similar to a lottery ticket. 19 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 42,
    "chunk_index": 37,
    "word_count": 426,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "that investors have a preferenceforout-of-the-moneyoptions. Thisholdsforbothcallsandputsandforindexoptions and stock options. The tendency to take out-of-the-money option positions is consistent with a gambling motive for option trading, since these options are cheap and offer a small probability of a large gain, similar to a lottery ticket. 19 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 42,
    "chunk_index": 38,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "Panel D reports the percentage of stock options for which the investor holds the underlying stock. These results provide direct evidence that most investors do not use options for hedging. In fact, more than 70% of all purchased puts are naked positions. The option category with the highest percentage of options for which the investor has a long position in the underlying stock is that of written calls, which suggests that some investors use a strategy of covered call writing. Although written calls can be used for hedging, the protection they provide against a price decline of the underlying asset is limited to the option premium. Given the restrictions imposed by the broker on short-selling stocks, it is unlikely that investors use purchased call and written put positions for hedging short-stock positions. Panel D indeed shows that most positionstakeninthesecategoriesarealsonakedpositions. Ourconclusionthatmostindividual investorsprimarilyuseoptionsforspeculationreinforcesresultsdocumentedbyLakonishok,Lee, Pearson,andPoteshman(2007)fortheU.S.marketandthefindingofSchmitzandWeber(2007) that hedging is not an important motive for trading in the market of bank-issued warrants. [Table 7 about here.] We use survey data to complement the information derived from the trades and portfolio positions of the investors. In September 2005, a questionnaire was sent to all clients of the brokerage firm. In total 4,516 clients responded, which we split into 2,323 option traders and 2,193 equity-only traders.9 Panel A in Table 8 reports the responses to statements related to investor experience and to the importance of the portfolio held at the online broker. An importantdifferencebetweenoptiontradersandequityinvestorsisthatonlyasmallproportion of option traders consider themselves novice investors while more than half of all equity traders think they are novice investors. However, the average option investor indicates that she has been trading for just four years, which is only slightly longer than the investment experience of equity traders. This suggests that option traders are overconfident about their investment experience and skills. Panel A further shows that both option and equity traders indicate that they invest more than half of their portfolio at the broker. This implies that the losses investors incur on accounts held at the broker can have a serious impact on their total financial wealth. Panel B shows the responses to statements that measure the investment attitude of the clients. More than half of all option traders indicate that investing is just a hobby for them. 9Thedemographicandportfoliocharacteristicsoftherespondentsaresimilartothoseofthenon-respondents. 20 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 42,
    "chunk_index": 39,
    "word_count": 381,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "the broker can have a serious impact on their total financial wealth. Panel B shows the responses to statements that measure the investment attitude of the clients. More than half of all option traders indicate that investing is just a hobby for them. 9Thedemographicandportfoliocharacteristicsoftherespondentsaresimilartothoseofthenon-respondents. 20 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 42,
    "chunk_index": 40,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "Consistent with this result, over 80% of the option investors and 65% of the equity traders state that they only invest the money they have left. Moreover, whereas 17.2% of the option traders agree to the statement that short-term speculation is their main investment objective only 9.4% oftheequityinvestorsagree. Theoverallpicturethatemergesfromtheresultsreportedinpanel Bisthatforbothgroupsofinvestorsentertainmentandsensation-seekingareimportantreasons for investing. However, option traders seem to be affected most by these factors. Panel C presents the responses to three statements on option trading. As expected, only a small proportion of option investors and a majority of equity traders consider option trading too risky. A striking result is that only 10% of those who do invest in options indicate that they use the option Greeks when trading options. This finding suggests that a lack of knowledge about the risk and return characteristics and the use of options might also contribute to the poor performance on option investments. Finally, panel C reveals that only 20% of the option traders indicate that they use options primarily for hedging their risks, which confirms the conclusion from Table 7 that little option volume can be attributed to hedging. [Table 8 about here.] 4.4 Option Trading Skills Although the previous sections have shown that on average option traders perform poorly, it is possible that some sophisticated investors do possess trading skills and are able to exploit inefficiencies in the option market. Coval, Hirshleifer, and Shumway (2005) present strong evidenceofperformancepersistenceamongasmallgroupofcommonstockinvestors. Theynote that although it is unlikely that individual investors are better informed than professional fund managers, they are better able to exploit superior information for two reasons. First, individual investors usually trade smaller positions, so the price impact of their trades is limited. Second, individual investors face fewer asset allocation constraints, since they are not required to hold a diversified portfolio or track a specified benchmark. In this section we perform persistence tests to investigate whether their findings can be extended to option traders. Subsequently, we examinethecharacteristicsandtradingbehaviorofsuccessfulandunsuccessfuloptioninvestors. Wefirstsortoptiontradersintodecileportfoliosbasedontheirperformanceduringaranking period. We then calculate returns for each of these deciles over an evaluation period. Repeating 21 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 42,
    "chunk_index": 41,
    "word_count": 343,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "diversified portfolio or track a specified benchmark. In this section we perform persistence tests to investigate whether their findings can be extended to option traders. Subsequently, we examinethecharacteristicsandtradingbehaviorofsuccessfulandunsuccessfuloptioninvestors. Wefirstsortoptiontradersintodecileportfoliosbasedontheirperformanceduringaranking period. We then calculate returns for each of these deciles over an evaluation period. Repeating 21 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 42,
    "chunk_index": 42,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "the ranking procedure using nonoverlapping intervals produces a time series of post-ranking returns for each decile. We include investors who drop out of the sample during the evaluation period in the portfolios until they disappear, after which we readjust the portfolio weights. We test whether past winners continue to outperform past losers by performing a t-test on the return difference between decile 1 (past winners) and decile 10 (past losers). We also calculate Spearmanrankcorrelationcoefficientsbetweentheformationperiodrankingandtheevaluation period ranking. The null hypothesis of the nonparametric Spearman test is that there is no relation between formation and evaluation period ranking, i.e., no performance persistence. To examine whether consistency in returns, if any, is due to persistence in transaction costs, weperformtheanalysisusingbothgrossandnetreturns. Ifweonlyfindevidenceofperformance persistence when we sort on net returns we conclude that it is related to costs. We consider three-, six-, and 12-month ranking and evaluation periods. This choice is based on mutual fund studies showing that performance persistence is usually short term (e.g., Busse and Irvine (2006)). Using longer periods also means that we can include fewer investors in the analysis, because we require an investor to be present in the sample during the complete ranking period and at least one month in the evaluation period. On the other hand, results for periods shorter than three months are likely to be dominated by noise and luck. Table9presentspost-formationreturnsandalphasforportfoliosofoptioninvestorssortedon pastone-yearreturn. Thecolumnslabeled“gross”(“net”)refertodecilesformedandevaluated on the basis of gross (net) performance. The results indicate that on average, option traders in the top decile continue to outperform those in the bottom decile in the year subsequent to the formation year by more than 3.5% per month in terms of gross return and almost 5% in terms of net return. The consistency in gross returns indicates that persistence in costs explains only part of total performance persistence. A substantial part of the performance differential is driven by the extremely poor performance of the option investors in decile 10. Gross and net returns for these investors are 2% and 2.5% lower, respectively, than for those in decile 9. The Spearman rank correlation is significant at the 1% level, which indicates a strong relation between formation and evaluation period ranking. The difference in performance between past winners and losers also shows up when we consider risk- and style-adjusted returns. Investors in decile 1 earn gross and net alphas that 22 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 42,
    "chunk_index": 43,
    "word_count": 392,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "at the 1% level, which indicates a strong relation between formation and evaluation period ranking. The difference in performance between past winners and losers also shows up when we consider risk- and style-adjusted returns. Investors in decile 1 earn gross and net alphas that 22 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 42,
    "chunk_index": 44,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "are almost 4% and 5% higher, respectively, than those earned by investors in decile 10. These differences are significant at a 1% level. Spearman rank correlation coefficients exceed 0.9 and are also significant at the 1% level, providing strong evidence of performance persistence among optiontraders. Althoughgrossandnetalphasforoptioninvestorsinthetopdecilesarepositive but insignificant, alphas are significantly negative for those in the bottom two deciles. Table 9 alsoreportstheexposuresofthereturnsonthedecileportfoliostothefactorsintheperformance attribution model. Loser deciles tend to have significantly higher loadings on the SMB and IT factors than winner deciles, indicating strong tilts in their portfolios towards small tech stocks. Results for the three- and six-month ranking and evaluation periods (not reported to save space) show that performance persistence is still significant on six-month horizons but absent for shorter periods. Spearman correlation coefficients are significant at the 5% level for the six-month periods but not significant for the three-month periods. [Table 9 about here.] Since the performance difference between winners and losers cannot be explained by risk and style tilts, we investigate whether it can be linked to heterogeneity in the characteristics of investors and their portfolios. Table 10 presents the characteristics of the investors in the decile portfolios formed on past one-year net returns. We find that the median account value decreases uniformly with ranking, i.e., the bottom decile consists of investors who hold the smallest accounts. Furthermore, those in the bottom deciles have much higher turnover than the successful option traders. Table 10 also shows that a higher proportion of accounts in the bottom deciles is held by men with low income and little investment experience. [Table 10 about here.] 5 Conclusion Thispapershowsthatoptiontradinghasadetrimentalimpactontheperformanceofindividual investors. The losses investors incur on their option investments are much larger than those from equity trading. Risk and style tilts and differences in demographic and socioeconomic characteristicsdonotexplainthepoorperformanceofoptiontradersrelativetoequityinvestors. Instead, we attribute the poor performance of option traders to bad market timing due to 23 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 42,
    "chunk_index": 45,
    "word_count": 315,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "Thispapershowsthatoptiontradinghasadetrimentalimpactontheperformanceofindividual investors. The losses investors incur on their option investments are much larger than those from equity trading. Risk and style tilts and differences in demographic and socioeconomic characteristicsdonotexplainthepoorperformanceofoptiontradersrelativetoequityinvestors. Instead, we attribute the poor performance of option traders to bad market timing due to 23 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 42,
    "chunk_index": 46,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "overreaction to past stock market movements. In particular, after the collapse of the Internet bubble, option traders speculated on a further market decrease when markets actually started to recover. High trading costs also contribute to the losses suffered by option investors. We also show that various demographic, socioeconomic, and portfolio characteristics that have been linked to gambling by Kumar (2008) have a similar influence on the trading inten- sity of option investors and equity investors. Specifically, we find that single men with low income and little investment experience are most likely to engage in both option trading and equity trading. However, an important difference between option traders and equity investors is that the trading activity of the former increases after past losses while past performance has a positive, but insignificant effect on the trading volume of equity investors. By linking option trades to the common stock holdings of individual investors we rule out hedging as an impor- tant motivation for trading options. Instead, investors tend to take naked, out-of-the-money option positions, suggesting a gambling motive for trading options. Options are particularly attractive for gambling because of the leverage they provide and their skewed payoffs, thereby resembling lottery tickets. Responses of investors to statements on investment attitude confirm that entertainment and sensation-seeking are important reasons for trading options. Despite the poor performance of the average option trader, we do identify a small group of investors who consistently manage to outperform the others. Option traders who are in the top decile portfolio based on past one-year performance continue to outperform investors in the bottom decile over the next year. We further show that persistence in trading costs explains only part of total performance persistence. The bottom deciles tend to consist of male investors withlittleexperienceandlowincomewhoholdsmallaccountswithhighturnover. Theseresults suggest that most option traders lose money due to excessive trading and a lack of knowledge. We conclude that trading hurts investor performance and that trading options hurts most. 24 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 42,
    "chunk_index": 47,
    "word_count": 328,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "of total performance persistence. The bottom deciles tend to consist of male investors withlittleexperienceandlowincomewhoholdsmallaccountswithhighturnover. Theseresults suggest that most option traders lose money due to excessive trading and a lack of knowledge. We conclude that trading hurts investor performance and that trading options hurts most. 24 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 42,
    "chunk_index": 48,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "A Cross-Sectional Risk and Style Adjustment In this appendix we show how to obtain an unbiased estimate of the relation between alphas andcharacteristicswithoutestimatingfirst-stagetimeseriesregressionsforeveryinvestor. Each month, we estimate a cross-sectional regression of returns on investor characteristics. We then regress the vector of monthly cross-sectional coefficients γ for each of the l investor character- lt istics on a constant and the time series of risk and style factor realizations F , kt K (cid:88) γ = δ + δ F +ω . (10) lt l0 lk kt lt k=1 To see that the intercept δ in this time series regression is an unbiased estimate of the cross- l0 sectional relation between alpha and investor characteristic l, consider the following. Suppose that portfolio returns are generated by the factor model K (cid:88) R = α + β F +(cid:15) . (11) it i ik kt it k=1 We are interested in the cross-sectional relation between α and Z , the value of characteristic i ilt l for investor i at time t. Denote the true coefficient vector of this relation between alphas and the characteristics by δ. The cross-sectional regression of portfolio returns in month t on investor characteristics produces the following coefficient vector γ = (Z(cid:48)Z )−1Z(cid:48)R = δ+F [(Z(cid:48)Z )−1Z(cid:48)β]. (12) t t t t t t t t t Therefore, as noted by Brennan, Chordia, and Subrahmanyam (1998), the intercept δ from the 0 time series regression of the monthly cross-sectional parameter estimates γ on the vector of lt factor realizations F is an unbiased estimate of δ if the factor premia are serially uncorrelated. t Intuitively, the time series regression (10) purges the cross-sectional coefficients of their factor dependent component. The standard error of δ is the standard error of the purged estimator. 0 The coefficients on the factor premia F are unbiased estimates of (Z(cid:48)Z )−1Z(cid:48)β and measure t t t t the relation between factor loadings and investor characteristics. 25 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 42,
    "chunk_index": 49,
    "word_count": 328,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "factor dependent component. The standard error of δ is the standard error of the purged estimator. 0 The coefficients on the factor premia F are unbiased estimates of (Z(cid:48)Z )−1Z(cid:48)β and measure t t t t the relation between factor loadings and investor characteristics. 25 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 42,
    "chunk_index": 50,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "Agarwal, V., and N. Naik, 2004, Risks and portfolio decisions involving hedge funds, Review of Financial Studies 17, 63–98. Anderson,A.,2006,Isonlinetradinggamblingwithpeanuts?,Workingpaper,SwedishInstitute for Financial Research. Barber, B., and T. Odean, 2000, Trading is hazardous to your wealth: The common stock investment performance of individual investors, Journal of Finance 55, 773–806. Barber, B., and T. Odean, 2001, Boys will be boys: Gender, overconfidence, and common stock investment, Quarterly Journal of Economics 116, 261–292. Barber, B., and T. Odean, 2002, Online investors: Do the slow die first?, Review of Financial Studies 15, 455–487. Brennan, M., T. Chordia, and A. Subrahmanyam, 1998, Alternative factor specifications, se- curity characteristics, and the cross-section of expected stock returns, Journal of Financial Economics 49, 345–373. Brown, G., and M. Cliff, 2004, Investor sentiment and the near-term stock market, Journal of Empirical Finance 11, 1–27. Brunnermeier, M., and S. Nagel, 2004, Hedge funds and the technology bubble, Journal of Finance 59, 2013–2038. Busse, J., and P. Irvine, 2006, Bayesian alphas and mutual fund persistence, Journal of Finance 61, 2251–2288. Carhart, M., 1997, On persistence in mutual fund performance, The Journal of Finance 52, 57–82. Cochrane, J., 2005, Asset Pricing (Princeton University Press: Princeton) 2nd edn. Coval, J., D. Hirshleifer, and T. Shumway, 2005, Can individual investors beat the market?, Working paper, Harvard University. 26 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "References",
    "page_number": 27,
    "page_range": "p.27-28",
    "total_pages": 42,
    "chunk_index": 51,
    "word_count": 219,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.27-28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "Carhart, M., 1997, On persistence in mutual fund performance, The Journal of Finance 52, 57–82. Cochrane, J., 2005, Asset Pricing (Princeton University Press: Princeton) 2nd edn. Coval, J., D. Hirshleifer, and T. Shumway, 2005, Can individual investors beat the market?, Working paper, Harvard University. 26 Electronic copy available at: https://ssrn.com/abstract=965810 Coval, J., and T. Shumway, 2005, Do behavioral biases affect asset prices?, Journal of Finance 60, 1–34. Dorn, D., and P. Sengmueller, 2007, Trading as entertainment, Working paper, Drexel Univer- sity and Tilburg University. Fama, E., and J. MacBeth, 1973, Risk, return and equilibrium: Empirical tests, Journal of Political Economy 71, 607–636. Ferson, W., and C. Harvey, 1999, Conditioning variables and the cross section of stock returns, Journal of Finance 54, 1325–1360. Ferson, W., and R. Schadt, 1996, Measuring fund strategy and performance in changing eco- nomic conditions, Journal of Finance 51, 425–462. Glosten,L.,andR.Jagannathan,1994,Acontingentclaimapproachtoperformanceevaluation, Journal of Empirical Finance 1, 133–160. Grinblatt, M., and M. Keloharju, 2008, Sensation seeking, overconfidence, and trading activity, Journal of Finance, Forthcoming. Hamilton, J D., 1994, Time Series Analysis (Princeton University Press: Princeton). Han, B., 2008, Investor sentiment and option prices, Review of Financial Studies 21, 387–414. Heckman, J., 1976, The common structure of statistical models of truncation, sample selection and limited dependent variables and a simple estimator for such models, Annals of Economic and Social Measurement 5, 475–492. Keim, D., and A. Madhavan, 1998, The cost of instituational equity trades, Financial Analysts Journal 54, 50–69. Kumar, A., 2006, Dynamic style preferences of individual investors and stock returns, Journal of Financial and Quantitative Analysis, Forthcoming. Kumar, A., 2008, Who gambles in the stock market?, Journal of Finance, Forthcoming. Lakonishok, J., I. Lee, N. Pearson, and A. Poteshman, 2007, Option market activity, Review of Financial Studies 20, 813–857. 27 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "References",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 42,
    "chunk_index": 52,
    "word_count": 297,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "individual investors and stock returns, Journal of Financial and Quantitative Analysis, Forthcoming. Kumar, A., 2008, Who gambles in the stock market?, Journal of Finance, Forthcoming. Lakonishok, J., I. Lee, N. Pearson, and A. Poteshman, 2007, Option market activity, Review of Financial Studies 20, 813–857. 27 Electronic copy available at: https://ssrn.com/abstract=965810 Mahani, R., and A. Poteshman, 2005, Overreaction to stock market news and misevaluation of stock prices by unsophisticated investors: Evidence from the option market, Working paper, University of Illinois at Urbana-Champaign. Millward-Brown, 2006, The retail investor 2006: Developments in the market of retail investors in the Netherlands, Amsterdam. Petersen, M., 2007, Estimating standard errors in finance panel data sets: Comparing ap- proaches, Review of Financial Studies, Forthcoming. Poteshman, A., 2001, Underreaction, overreaction, and increasing misreaction to information in the options market, Journal of Finance 56, 851–876. Poteshman, A., and V. Serbin, 2003, Clearly irrational financial market behavior: Evidence from the early exercise of exchange traded stock options, Journal of Finance 58, 37–70. Schmitz, P., M. Glaser, and M. Weber, 2007, Individual investor sentiment and stock returns - what do we learn from warrant traders?, Working paper, University of Mannheim. Schmitz, P., and M. Weber, 2007, Buying and selling behavior of individual investors in option- like securities, Working paper, University of Mannheim. Seru, A., T. Shumway, and N. Stoffman, 2007, Learning by trading, Working paper, University of Chicago and University of Michigan. Shiller, R., 2005, Irrational Exuberance (Princeton University Press). 28 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "References",
    "page_number": 29,
    "page_range": "p.29-30",
    "total_pages": 42,
    "chunk_index": 53,
    "word_count": 245,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.29-30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "Buying and selling behavior of individual investors in option- like securities, Working paper, University of Mannheim. Seru, A., T. Shumway, and N. Stoffman, 2007, Learning by trading, Working paper, University of Chicago and University of Michigan. Shiller, R., 2005, Irrational Exuberance (Princeton University Press). 28 Electronic copy available at: https://ssrn.com/abstract=965810 Table 1: Descriptive Statistics on Investor Accounts and Trades This table presents descriptive statistics for a sample of 68,146 investor accounts at a Dutch online broker. We split the sample into 26,266 option traders and 41,880 equity traders. The sample period is from January 2000 to March 2006. The variables are defined as follows: Gender and Age are the gender and age of the primary accountholder. Trades is the total number of trades per account during the sample period. Turnover is the average of the value of all purchases and sales in a given month divided by the beginning-of-the-month account value. Portfolio value is the average market value of all assets in the investor’s portfolio. Income is the average monthly income assigned to investors based on their zip-code. Experience is the number of months an investor has been trading. The table shows for each variable the mean, median, and standard deviation, as well as 5th, 25th, 75th, and 95th percentile values. Mean Std. dev. 5th 25th Median 75th 95th Gender (male=1) Option traders 0.78 Equity traders 0.76 Age (years) Option traders 45.28 12.98 26 36 44 55 67 Equity traders 44.72 13.29 25 36 44 54 66 Trades (#) Option traders 80.32 304.23 1 4 16 59 331 Equity traders 45.26 135.43 1 4 11 35 185 Turnover (%) Option traders 8.85 100.83 0 0 0 0 25.60 Equity traders 23.68 184.96 0 0 0 2.38 83.33 Portfolio value (e) Option traders 34,682 111,344 500 2,700 9,419 29,432 133,655 Equity traders 35,053 179,762 662 3,343 10,004 28,351 129,812 Income (e) Option traders 2,548 935 1,500 1,900 2,300 2,900 4,300 Equity traders 2,563 937 1,500 2,000 2,400 2,900 4,400 Experience (months) Option traders 34.64 28.02 3.00 12.00 27.28 50.80 75.00 Equity traders 32.94 25.34 2.00 12.00 27.52 48.80 74.00 29 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "References",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 42,
    "chunk_index": 54,
    "word_count": 354,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "3,343 10,004 28,351 129,812 Income (e) Option traders 2,548 935 1,500 1,900 2,300 2,900 4,300 Equity traders 2,563 937 1,500 2,000 2,400 2,900 4,400 Experience (months) Option traders 34.64 28.02 3.00 12.00 27.28 50.80 75.00 Equity traders 32.94 25.34 2.00 12.00 27.52 48.80 74.00 29 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "References",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 42,
    "chunk_index": 55,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "Table 2: Investment Performance of Option Traders and Equity Traders This table reports the raw returns and alphas of option traders and equity investors. Panel A presents the performance for the full sample period, January 2000 to March 2006, panel B for the first subperiod from January 2000 to March 2003, and panel C for the second subperiod from April 2003 to March 2006. The left handsideofeachpanelshowsthegrossperformanceandtherighthandsidedisplaysthenetperformanceofeach groupofinvestors. StaticalphasarethoseproducedbythestaticmodelinEquation(3)anddynamicalphasare the average alphas produced by the dynamic model in Equations (4)-(6). Panel D reports the estimated factor loadings in the static model for the full period and the two subperiods for both groups of investors. t-statistics based on Newey-West heteroskedasticity and autocorrelation robust standard errors are in parentheses. Gross Net Options Stocks Difference Options Stocks Difference Panel A: Performance Full Period: 2000/01 - 2006/03 Raw Return -1.81 -0.58 -1.23 -4.46 -1.57 -2.89 (-2.31) (-0.49) (-1.60) (-6.83) (-1.35) (-3.24) Static Alpha -1.01 0.03 -1.04 -3.72 -0.97 -2.75 (-1.72) (0.05) (-2.00) (-6.30) (-2.08) (-4.65) Dynamic Alpha -0.93 0.03 -0.96 -3.59 -0.97 -2.62 (-1.75) (0.34) (-2.08) (-6.24) (-2.17) (-4.81) Panel B: Performance Subperiod 1: 2000/01 - 2003/03 Raw Return -3.03 -3.70 0.67 -5.51 -4.78 -0.73 (-3.02) (-2.52) (0.68) (-5.60) (-3.32) (-0.78) Static Alpha 1.32 1.00 0.32 -1.28 -0.15 -1.13 (1.17) (1.23) (0.39) (-1.19) (-0.10) (-1.43) Panel C: Performance Subperiod 2: 2003/04 - 2006/03 Raw Return -0.48 2.80 -3.28 -3.33 1.90 -5.23 (-0.58) (2.02) (-2.65) (-4.48) (1.41) (-4.45) Static Alpha -1.82 -0.01 -1.81 -4.74 -0.87 -3.87 (-2.92) (-0.01) (-2.15) (-7.87) (-1.29) (-4.90) Panel D: Factor Loadings Full Period Subperiod 1 Subperiod 2 Options Stocks Options Stocks Options Stocks R 0.94 1.48 1.20 1.46 0.71 1.14 M (5.55) (19.39) (4.69) (10.48) (2.52) (3.70) SMB 0.30 0.99 0.22 0.87 0.60 1.05 (1.21) (7.89) (0.74) (6.87) (2.01) (3.18) HML -0.13 0.23 -0.10 0.26 0.10 0.42 (-0.63) (2.31) (-0.39) (2.99) (0.41) (1.62) MOM 0.16 0.01 0.21 0.15 0.16 -0.36 (1.26) (0.08) (1.12) (2.17) (1.16) (-2.65) ATMC 0.37 0.06 0.66 -0.12 0.39 0.22 (3.24) (0.80) (2.18) (-0.59) (2.58) (1.79) ATMP 0.04 -0.02 0.08 0.05 -0.15 -0.21 (0.24) (-0.26) (0.44) (0.53) (-1.08) (-1.15) IT 0.31 0.41 0.25 0.48 0.17 0.24 (2.89) (6.35) (1.44) (5.46) (0.99) (1.28) Adj. R2 (%) 61.8 89.1 61.3 94.2 62.8 85.3 30 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "References",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 42,
    "chunk_index": 56,
    "word_count": 370,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "-0.12 0.39 0.22 (3.24) (0.80) (2.18) (-0.59) (2.58) (1.79) ATMP 0.04 -0.02 0.08 0.05 -0.15 -0.21 (0.24) (-0.26) (0.44) (0.53) (-1.08) (-1.15) IT 0.31 0.41 0.25 0.48 0.17 0.24 (2.89) (6.35) (1.44) (5.46) (0.99) (1.28) Adj. R2 (%) 61.8 89.1 61.3 94.2 62.8 85.3 30 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "References",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 42,
    "chunk_index": 57,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "scitsiretcarahC dna ecnamrofreP rotsevnI :3 elbaT srefer edis dnah thgir eht dna selbairav tnedneped sa snruter war sesu elbat eht fo edis dnah-tfel ehT .setamitse tneicffieoc )3791( hteBcaM-amaF stroper elbat sihT dna ,6002 hcraM ot 0002 yraunaJ ,doirep lluf eht rof snoisserger hteBcaM-amaF eht etamitse eW .noitamitse eht ni desu era snruter ten dna ssorg htoB .sahpla ot elbairav ymmud a si snoitpO .scitsiretcarahc rotsevni era selbairav tnednepedni ehT .6002 hcraM ot 3002 lirpA dna 3002 hcraM ot 0002 yraunaJ ,sdoirepbus owt rof ni snoitpo dna skcots htob sedart rotsevni eht fi eno ot lauqe elbairav ymmud a si snoitpo&skcotS .htnom nevig a ni snoitpo dedart ylno rotsevni na fi eno ot lauqe .eulav tnuocca htnom-eht-fo-gninnigeb yb dedivid htnom nevig a ni rotsevni na fo selas dna sesahcrup lla fo eulav eht fo egareva eht si revonruT .htnom ralucitrap a si tnuocca eht fi eno ot lauqe selbairav ymmud era tnioj dna namow elgniS .htnom nevig a ni edart ton seod rotsevni na fi eno ot lauqe elbairav ymmud a si evitcanI .htnom eno yb deggal si dna oiloftrop s’rotsevni eht ni stessa lla fo eulav tekram eht si eulav oiloftroP .ylevitcepser ,namow dna nam a yb yltnioj ro namow a yb dleh eht shtnom fo rebmun eht si ecneirepxE .edoc-piz rieht no desab srotsevni ot dengissa emocni ylhtnom eht si emocnI .redlohtnuocca yramirp eht fo ega eht si egA .sesehtnerap ni era scitsitats-t .smhtiragol larutan sa desserpxe era eulav oiloftrop dna revonruT .gnidart neeb sah rotsevni ahplA nruteR waR teN ssorG teN ssorG 2 buS 1 buS lluF 2 buS 1 buS lluF 2 buS 1 buS lluF 2 buS 1 buS lluF 23.4- 45.1- 12.3- 69.1- 93.0 11.1- 55.5- 93.1- 83.3- 32.3- 04.0 43.1- snoitpO )86.6-( )85.1-( )90.6-( )77.2-( )14.0( )80.2-( )01.7-( )82.1-( )37.4-( )59.3-( )73.0( )88.1-( 24.1- 93.1- 35.1- 46.0- 96.0- 97.0- 05.1- 77.1- 46.1- 07.0- 01.1- 19.0- snoitpo&skcotS )29.4-( )54.3-( )19.6-( )52.2-( )96.1-( )16.3-( )79.4-( )10.5-( )40.7-( )74.2-( )90.3-( )69.3-( 24.0- 45.0 40.0 92.0 83.1 97.0 72.0- 80.0 80.0- 74.0 48.0 76.0 revonruT )69.2-( )61.1( )82.0( )01.2( )50.5( )27.5( )02.2-( )63.0( )36.0-( )75.3( )43.3( )45.4( 46.1 20.0- 25.0 72.0- 70.2- 64.1- 25.0 50.1 97.0 24.1- 29.0- 61.1- evitcanI )06.3( )30.0-( )06.1( )75.0-( )24.3-( )62.4-( )59.0( )78.1( )30.2( )74.2-( )75.1-( )38.2-( 61.0 43.0 13.0 91.0 63.0 33.0 60.0 66.0 73.0 70.0 76.0 83.0 namow elgniS )82.1( )60.2( )23.3( )25.1( )21.2( )25.3( )54.0( )69.3( )53.3( )06.0( )69.3( )74.3( 71.0 40.0 81.0 41.0 20.0- 31.0 02.0 52.0 32.0 61.0 91.0 81.0 tnioJ )67.2( )24.0( )57.3( )98.3( )12.0-( )92.2( )93.4( )38.2( )44.4( )35.3( )21.2( )44.3( 14.0 13.0 05.0 32.0 20.0 22.0 44.0 66.0 55.0 71.0 83.0 82.0 eulav oiloftroP )79.3( )84.1( )70.5( )54.2( )70.0( )10.2( )53.5( )84.3( )12.5( )69.1( )30.2( )25.2( 70.0- 60.0- 70.0- 50.0- 50.0- 50.0- 50.0- 10.0 20.0- 30.0- 10.0 10.0- 01/egA )91.2-( )41.1-( )87.2-( )40.2-( )93.1-( )23.2-( )87.1-( )32.0( )95.0-( )30.1-( )22.0( )82.0-( 73.0 98.0 64.0 53.0 48.0 34.0 12.0 77.0 05.0 91.0 37.0 74.0 emocnI )05.3( )76.5( )78.4( )52.5( )90.4( )45.3( )30.2( )18.5( )55.5( )08.1( )24.5( )61.5( 30.0 61.0 50.0 20.0 83.0 11.0 20.0 11.0 70.0 20.0 21.0 70.0 ecneirepxE )02.0( )11.1( )48.0( )97.0( )32.1( )40.1( )34.0( )29.0( )90.1( )24.0( )59.0( )90.1( 31 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "References",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 42,
    "chunk_index": 58,
    "word_count": 532,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "12.0 77.0 05.0 91.0 37.0 74.0 emocnI )05.3( )76.5( )78.4( )52.5( )90.4( )45.3( )30.2( )18.5( )55.5( )08.1( )24.5( )61.5( 30.0 61.0 50.0 20.0 83.0 11.0 20.0 11.0 70.0 20.0 21.0 70.0 ecneirepxE )02.0( )11.1( )48.0( )97.0( )32.1( )40.1( )34.0( )29.0( )90.1( )24.0( )59.0( )90.1( 31 Electronic copy available at: https://ssrn.com/abstract=965810 Table 4: Sentiment and Market Timing PanelAofthistablepresentsdescriptivestatisticsforthreesentimentindicators. Wedefinethecall/putratioas thevalueofallcalloptionsboughtbytheinvestorsdividedbythevalueoftheirputoptionpurchases. TheAEX VIX index captures the implied volatility embedded in prices of options on the Dutch AEX stock market index. The CC index is the consumer confidence index constructed by the Dutch Central Bureau of Statistics (CBS). Panel B presents results for time-series regressions of the gross return difference between option traders and equitytradersonthemarketreturn,thecall/putratio,andvariousinteractiontermsbetweenthemarketreturn andthecall/putratio,constructedusingindexoptions,stockoptions,orboth. t-statisticsbasedonNewey-West heteroskedasticity and autocorrelation robust standard errors are in parentheses. Panel A: Descriptive Statistics on Sentiment Indicators Mean Std. dev. Autocorr. Pairwise Correlations Call/Put Ratio 1.12 0.49 0.79 1 AEX VIX Index 24.63 10.77 0.86 -0.60 1 CC Index -13.45 19.74 0.97 0.43 -0.52 1 Panel B: Option Trader Performance and Market Timing Gross Return Difference Option Traders and Equity Traders Intercept -1.91 -4.48 -1.99 -1.82 -1.97 -1.90 (-3.08) (-2.95) (-4.16) (-3.67) (-4.00) (-4.01) Market -0.77 -0.78 -2.14 -3.29 -2.35 -3.15 (-6.57) (-6.74) (-10.00) (-8.20) (-9.10) (-8.18) Call/Put 2.31 (1.85) Market*Call/Put 1.46 (7.06) Market*Call/Put Index 3.14 1.79 (6.45) (2.70) Market*Call/Put Stocks 0.66 0.40 (6.55) (2.87) Adj. R2 (%) 37.1 38.3 61.8 59.0 59.5 62.8 32 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "References",
    "page_number": 33,
    "page_range": "p.33-34",
    "total_pages": 42,
    "chunk_index": 59,
    "word_count": 233,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.33-34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "(-4.16) (-3.67) (-4.00) (-4.01) Market -0.77 -0.78 -2.14 -3.29 -2.35 -3.15 (-6.57) (-6.74) (-10.00) (-8.20) (-9.10) (-8.18) Call/Put 2.31 (1.85) Market*Call/Put 1.46 (7.06) Market*Call/Put Index 3.14 1.79 (6.45) (2.70) Market*Call/Put Stocks 0.66 0.40 (6.55) (2.87) Adj. R2 (%) 37.1 38.3 61.8 59.0 59.5 62.8 32 Electronic copy available at: https://ssrn.com/abstract=965810 Table 5: VAR Model of Sentiment and Market Returns This table presents estimation results for vector autoregressive models with two lags. The dependent variables are the call/put ratio and the market return. We estimate the VAR models for the full period, January 2000 to March 2006, and for two subperiods, January 2000 to March 2003 and April 2003 to March 2006. t-statistics basedonNewey-Westheteroskedasticityandautocorrelationrobuststandarderrorsareinparentheses. Granger Causality F is the F-statistic of a test that the coefficients on the lags of the independent variables other than the lags of the dependent variable are jointly equal to zero. 2000/01 - 2006/03 2000/01 - 2003/03 2003/04 - 2006/03 Call/Put Market Call/Put Market Call/Put Market Intercept 0.26 0.89 0.29 -3.58 0.18 2.02 (3.71) (0.55) (2.28) (-1.29) (1.41) (0.80) Call/Put 0.63 1.10 0.67 2.98 0.45 -0.26 t−1 (6.13) (0.47) (4.60) (0.95) (2.64) (-0.08) Call/Put 0.11 -2.03 0.05 -1.92 0.35 0.68 t−2 (1.15) (-0.91) (0.40) (-0.64) (2.10) (0.21) Market 0.02 0.06 0.02 -0.06 0.02 -0.21 t−1 (3.09) (0.53) (1.96) (-0.36) (2.48) (-1.25) Market -0.01 0.10 -0.01 -0.02 0.00 -0.14 t−2 (-0.84) (0.81) (-0.62) (-0.09) (0.35) (-0.80) Granger Causality F 5.08 0.53 2.28 0.48 3.09 0.03 P-value (0.01) (0.59) (0.12) (0.62) (0.06) (0.97) Adj. R2 (%) 70.3 -2.4 70.5 -9.1 54.7 -5.2 33 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "References",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 42,
    "chunk_index": 60,
    "word_count": 260,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "(0.53) (1.96) (-0.36) (2.48) (-1.25) Market -0.01 0.10 -0.01 -0.02 0.00 -0.14 t−2 (-0.84) (0.81) (-0.62) (-0.09) (0.35) (-0.80) Granger Causality F 5.08 0.53 2.28 0.48 3.09 0.03 P-value (0.01) (0.59) (0.12) (0.62) (0.06) (0.97) Adj. R2 (%) 70.3 -2.4 70.5 -9.1 54.7 -5.2 33 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "References",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 42,
    "chunk_index": 61,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "Table 6: Trading Behavior and Investor Characteristics Thistablerelatesthetradingbehaviorofindividualinvestorstoinvestorcharacteristics. Resultsinthecolumns labeled“Probit”areestimatesforapooledprobitregressionwithstandarderrorsclusteredbyinvestorandmonth to account for potential serial correlation and cross-correlation in parentheses. Results in the columns labeled “Fama-MacBeth” refer to Fama and MacBeth (1973) coefficient estimates with Newey-West heteroskedasticity andautocorrelationrobuststandarderrorsinparentheses. Resultsinthecolumnslabeled“Panel”arepooledOLS panel regression estimates with standard errors clustered by investor and month in parentheses. The dependent variable in the probit model is a dummy variable equal to one if an investor trades options (column 1) or stocks (column2)inagivenmonth. ThedependentvariableintheFama-MacBethandpanelregressionsisthelogarithm ofthenumberofoptiontradespermonthperaccount(columns3and5)orthelogarithmofthenumberofequity trades (columns 4 and 6). The inverse Mills ratio is based on the estimates of the pooled probit regressions and is included to account for self-selection in trading decisions. The R2 reported for the probit regressions is the pseudo R2. Probit Fama-MacBeth Panel Options Stocks Options Stocks Options Stocks Intercept -1.51 -1.09 -2.40 0.20 -3.12 0.02 (-10.63) (-5.19) (-6.14) (0.91) (-4.56) (0.06) Net Return -0.33 0.06 -0.81 0.02 -0.76 0.04 t−1 (-4.80) (1.14) (-10.06) (0.52) (-7.15) (0.68) Single Woman -0.20 -0.23 -0.33 -0.21 -0.40 -0.25 (-9.15) (-7.56) (-8.79) (-11.26) (-6.34) (-8.02) Joint -0.13 -0.07 -0.22 -0.06 -0.26 -0.07 (-10.00) (-3.61) (-11.11) (-8.34) (-6.99) (-5.39) Portfolio Value 0.16 0.23 0.35 0.25 0.38 0.27 (38.35) (20.58) (14.56) (14.64) (8.86) (10.86) Age/10 0.04 0.00 0.09 0.02 0.10 0.02 (7.57) (0.22) (12.02) (6.84) (8.48) (4.98) Income -0.12 -0.17 -0.29 -0.25 -0.30 -0.26 (-6.49) (-7.09) (-16.23) (-27.27) (-7.86) (-11.42) Experience/12 -0.08 -0.01 -0.25 -0.17 -0.17 -0.12 (-14.17) (-5.72) (-7.12) (-4.17) (-7.42) (-9.44) Inverse Mills Ratio 2.13 0.79 2.46 0.97 (10.99) (8.87) (7.12) (6.63) Equity Trades 0.22 0.48 0.53 (30.35) (16.12) (9.13) Option Trades 0.23 0.18 0.20 (9.03) (11.72) (15.13) R2 (%) 6.6 9.2 6.3 6.9 4.3 5.6 34 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "References",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 42,
    "chunk_index": 62,
    "word_count": 276,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "-0.17 -0.17 -0.12 (-14.17) (-5.72) (-7.12) (-4.17) (-7.42) (-9.44) Inverse Mills Ratio 2.13 0.79 2.46 0.97 (10.99) (8.87) (7.12) (6.63) Equity Trades 0.22 0.48 0.53 (30.35) (16.12) (9.13) Option Trades 0.23 0.18 0.20 (9.03) (11.72) (15.13) R2 (%) 6.6 9.2 6.3 6.9 4.3 5.6 34 Electronic copy available at: https://ssrn.com/abstract=965810 Table 7: Descriptive Statistics on Option Positions Inthistableweclassifyall2,497,378openingoptiontradesintopurchasedcall,writtencall,purchasedput,and written put positions. Furthermore, a split is made between index options (1,148,148 trades) and stock options (1,349,230 trades). Panel A reports the percentage of option volume in a given category relative to the total of callsandputstraded. PanelBshowsthepercentageofthevalueofoptiontradesinagivencategoryrelativeto the total value of calls and puts traded. In Panel C we display the moneyness of the options in each category, defined as the strike price divided by the price of the underlying asset. Panel D reports the percentage of stock options for which the investor holds the underlying stock. Call Put Purchased Written Total Purchased Written Total Panel A: Option Volume (%) All 40.4 21.3 61.7 17.9 20.3 38.3 Index 30.3 17.4 47.6 33.1 19.2 52.4 Stock 45.2 23.2 68.4 10.8 20.8 31.6 Panel B: Option Value (%) All 34.4 16.9 51.3 28.1 20.6 48.7 Index 26.3 16.2 42.5 37.9 19.5 57.5 Stock 49.6 18.3 67.8 9.5 22.7 32.2 Panel C: Option Moneyness (K/S) All 1.02 1.03 1.02 0.97 0.94 0.96 Index 1.03 1.03 1.03 0.98 0.95 0.97 Stock 1.01 1.03 1.02 0.96 0.94 0.95 Panel D: Underlying Stock Holdings (%) Yes 14.5 34.3 21.1 27.3 27.1 27.2 No 85.5 65.7 78.9 72.7 72.9 72.8 35 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "References",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 42,
    "chunk_index": 63,
    "word_count": 257,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "Option Moneyness (K/S) All 1.02 1.03 1.02 0.97 0.94 0.96 Index 1.03 1.03 1.03 0.98 0.95 0.97 Stock 1.01 1.03 1.02 0.96 0.94 0.95 Panel D: Underlying Stock Holdings (%) Yes 14.5 34.3 21.1 27.3 27.1 27.2 No 85.5 65.7 78.9 72.7 72.9 72.8 35 Electronic copy available at: https://ssrn.com/abstract=965810 Table 8: Responses to Statements on Investment Attitude and Option Trading Thistableshowstheresponsesof4,516clientsofthebrokeragefirmtostatementsoninvestorexperience(panel A), investment attitude (panel B), and option trading (panel C). We split the respondents into 2,323 option traders and 2,193 equity traders. The questionnaire was sent to clients in September 2005. Statement Option Traders Equity Traders Panel A: Investor Experience (% Agree or Amount x) “I consider myself a novice investor.” 18.2 50.7 “I already invest for x years.” 4.0 3.5 “I invest x% of my portfolio at another bank or broker.” 48.8 46.0 Panel B: Investment Attitude (% Agree) “Investing is just a hobby for me.” 55.7 43.6 “I only invest the money I have left.” 80.9 65.3 “My main investment objective is short-term speculation.” 17.2 9.4 Panel C: Option Trading (% Agree) “Option trading is too risky.” 11.6 67.8 “When trading options I use the option Greeks.” 11.2 - “I primarily use options to hedge my risks.” 19.6 - 36 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "References",
    "page_number": 37,
    "page_range": "p.37-38",
    "total_pages": 42,
    "chunk_index": 64,
    "word_count": 209,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.37-38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "80.9 65.3 “My main investment objective is short-term speculation.” 17.2 9.4 Panel C: Option Trading (% Agree) “Option trading is too risky.” 11.6 67.8 “When trading options I use the option Greeks.” 11.2 - “I primarily use options to hedge my risks.” 19.6 - 36 Electronic copy available at: https://ssrn.com/abstract=965810 sredarT noitpO fo ecnetsisreP ecnamrofreP :9 elbaT dlehsioiloftrophcaE .raeyehtrevodenraesnruternodesabsoiloftropeliceddethgiew-lauqeotnisrotsevninoitpotrosew4002ot0002morfraeyyrevefodneehttA noitamrof-tsopehtnioiloftropelicedhcaerofsgnidaolrotcafdnasahpla,snruterwarylhtnomegarevaehtswohselbatsihT .decnalaberyltneuqesbusdnaraeyenorof gniknar eht ni sremrofrep %01 tsrow eht sedulcni 01 eliced dna doirep gniknar eht gnirud nruter tsehgih eht htiw srotsevni fo %01 eht sniatnoc 1 eliceD .doirep dna yticitsadeksoreteh tseW-yeweN no desab scitsitats-t .snruter )ten( ssorg no desab detaulave dna demrof seliced ot refer )”ten“( ”ssorg“ delebal snmuloC .doirep doirepnoitamrofneewtebnoitalerehtserusaemtahttneicffieocnoitalerrocknarnamraepSehtsi .rroCknaR .sesehtnerapnierasrorredradnatstsubornoitalerrocotua .level %1 eht ta ecnacfiingis sti setoned *** .gniknar doirep noitaulave dna gniknar sgnidaoL rotcaF teN ssorG 2R .jdA TI PMTA CMTA MOM LMH BMS R ahplA nruteR ahplA nruteR eliceD M 8.48 60.0- 58.1- 11.0- 10.0 31.0 61.0 30.1 30.0 50.0- 22.0 70.0 renniW )13.1-( )52.2-( )51.0-( )22.0( )72.1( )70.1( )53.11( )31.0( )70.0-( )37.0( )80.0( 5.19 50.0 55.0 31.1- 01.0- 02.0 71.0 18.0 32.0 90.0- 94.0 93.0 2 )10.1( )79.0( )06.2-( )87.2-( )95.4( )35.2( )25.31( )81.1( )21.0-( )43.2( )15.0( 4.49 60.0 34.0- 40.0- 20.0- 50.0- 31.0 97.0 80.0 20.0 61.0 70.0- 3 )52.2( )44.1-( )71.0-( )99.0-( )51.1-( )92.4( )44.32( )73.0( )30.0( )09.0( )01.0-( 2.59 12.0 23.0 08.0 50.0 41.0 83.0 79.0 30.0 21.0- 44.0 82.0 4 )64.5( )50.0( )86.2( )94.1( )93.3( )18.9( )23.52( )41.0( )61.0-( )28.1( )53.0( 0.49 91.0 28.0 92.1- 30.0 01.0 74.0 91.1 03.0- 44.0- 90.0 80.0- 5 )57.3( )31.0( )22.3-( )25.0( )81.1( )02.4( )65.71( )79.0-( )54.0-( )13.0( )90.0-( 6.78 23.0 12.1- 75.0 11.0 10.0- 75.0 61.1 32.0- 84.0- 20.0 13.0- 6 )81.5( )28.1-( )98.0( )35.1( )41.0-( )27.3( )23.81( )97.0-( )05.0-( )80.0( )23.0-( 2.78 93.0 17.1 67.0- 52.0 51.0 09.0 52.1 77.0- 78.0- 31.0- 24.0- 7 )16.6( )32.2( )04.1-( )99.3( )05.1( )59.8( )22.91( )44.1-( )48.0-( )53.0-( )44.0-( 8.09 95.0 50.0 73.0 72.0 80.0 71.1 15.1 86.0- 50.1- 71.0- 93.0- 8 )88.7( )50.0( )95.0( )99.3( )07.0( )53.21( )38.81( )41.1-( )19.0-( )43.0-( )23.0-( 4.97 46.0 91.0 91.0- 42.0 71.0 19.0 43.1 32.2- 03.2- 73.1- 46.1- 9 )26.5( )31.0( )52.0-( )95.2( )60.1( )27.5( )92.21( )63.3-( )77.1-( )16.2-( )33.1-( 7.25 27.0 91.3- 84.0 41.0 50.0 39.0 10.1 28.4- 19.4- 74.3- 95.3- resoL )59.2( )54.1-( )53.0( )41.1( )12.0( )51.3( )01.5( )28.7-( )89.3-( )31.5-( )28.2-( 3.11 87.0- 43.1 95.0- 31.0- 80.0 77.0- 20.0 58.4 68.4 96.3 66.3 resoL-renniW )37.2-( )15.0( )13.0-( )28.0-( )72.0( )89.1-( )60.0( )03.6( )97.5( )84.4( )34.4( ∗∗∗49.0 ∗∗∗69.0 ∗∗∗39.0 ∗∗∗39.0 .rroC knaR 37 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "References",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 42,
    "chunk_index": 65,
    "word_count": 421,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "74.3- 95.3- resoL )59.2( )54.1-( )53.0( )41.1( )12.0( )51.3( )01.5( )28.7-( )89.3-( )31.5-( )28.2-( 3.11 87.0- 43.1 95.0- 31.0- 80.0 77.0- 20.0 58.4 68.4 96.3 66.3 resoL-renniW )37.2-( )15.0( )13.0-( )28.0-( )72.0( )89.1-( )60.0( )03.6( )97.5( )84.4( )34.4( ∗∗∗49.0 ∗∗∗69.0 ∗∗∗39.0 ∗∗∗39.0 .rroC knaR 37 Electronic copy available at: https://ssrn.com/abstract=965810 Table 10: Characteristics of Successful and Unsuccessful Option Traders This table reports time series averages of monthly cross-sectional averages of investor characteristics for decile portfolios of option investors formed on the basis of past one-year net return. As an exception, the numbers we report for account value and income are time series averages of monthly cross-sectional median values. Decile 1 containsthe10%ofinvestorswiththehighestreturnduringtherankingperiodanddecile10includestheworst 10%performersintherankingperiod. Valueisthemarketvalueofallassetsintheinvestor’saccount. Turnover is the average value of purchases and sales in a given month divided by beginning-of-the-month account value. Men is the percentage of accounts in a given decile portfolio held by a man and Age is the age of the primary accountholder. Income is the monthly gross income assigned to investors based on their zip-code. Experience is the number of months the investor has been trading. Decile Value Turnover Men Age Income Experience (e) (%) (%) (years) (e) (months) Winner 26,341 15.9 70.6 44.1 2,706 41.2 2 25,604 5.9 64.5 46.9 2,611 41.8 3 27,023 3.7 71.2 47.0 2,714 42.0 4 18,853 5.3 67.1 49.5 2,473 41.8 5 12,401 8.1 73.7 44.9 2,552 41.7 6 14,001 8.7 76.3 54.1 2,498 41.9 7 4,261 9.6 84.1 42.1 2,316 41.0 8 5,382 8.4 83.0 46.8 2,323 40.7 9 3,235 16.0 84.6 45.3 2,404 39.5 Loser 1,813 76.7 85.1 48.1 2,279 34.8 Winner-Loser 23,106 -60.8 -14.5 4.0 427 6.4 38 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "References",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 42,
    "chunk_index": 66,
    "word_count": 275,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "2,552 41.7 6 14,001 8.7 76.3 54.1 2,498 41.9 7 4,261 9.6 84.1 42.1 2,316 41.0 8 5,382 8.4 83.0 46.8 2,323 40.7 9 3,235 16.0 84.6 45.3 2,404 39.5 Loser 1,813 76.7 85.1 48.1 2,279 34.8 Winner-Loser 23,106 -60.8 -14.5 4.0 427 6.4 38 Electronic copy available at: https://ssrn.com/abstract=965810 Figure 1: Kalman Smoothed Alpha and Betas for Option Traders ThisfigureplotstheevolutionoftheKalmansmoothedalphaandbetasforoptiontradersovertheperiodJanuary 2000 through March 2006. The estimates are produced by the dynamic factor model in Equations (4)-(6) and are based on gross returns. Alpha Market Beta 2 3.0 2.5 1 2.0 0 1.5 -1 1.0 -2 0.5 -3 0.0 2000 2001 2002 2003 2004 2005 2006 2000 2001 2002 2003 2004 2005 2006 SMB Beta HML Beta .8 .3 .7 .2 .6 .1 .5 .4 .0 .3 -.1 .2 .1 -.2 2000 2001 2002 2003 2004 2005 2006 2000 2001 2002 2003 2004 2005 2006 MOM Beta ATMC Beta .16 .45 .12 .40 .08 .35 .04 .30 .00 .25 -.04 -.08 .20 -.12 .15 2000 2001 2002 2003 2004 2005 2006 2000 2001 2002 2003 2004 2005 2006 ATMP Beta IT Beta .15 .6 .10 .5 .05 .4 .00 -.05 .3 -.10 .2 -.15 -.20 .1 2000 2001 2002 2003 2004 2005 2006 39 2000 2001 2002 2003 2004 2005 2006 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "References",
    "page_number": 40,
    "page_range": "p.40-41",
    "total_pages": 42,
    "chunk_index": 67,
    "word_count": 216,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.40-41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "2002 2003 2004 2005 2006 2000 2001 2002 2003 2004 2005 2006 ATMP Beta IT Beta .15 .6 .10 .5 .05 .4 .00 -.05 .3 -.10 .2 -.15 -.20 .1 2000 2001 2002 2003 2004 2005 2006 39 2000 2001 2002 2003 2004 2005 2006 Electronic copy available at: https://ssrn.com/abstract=965810 Figure 2: Call/Put Ratio and Return Difference Equity Traders and Option Traders ThisfigureplotstheevolutionthroughtimeofthemonthlyCall/Putratio,thereturnontheMSCINetherlands equity index and the gross return difference between equity and option traders. We calculate the call/put ratio as the value of short-term (three months to expiration or less) call options bought by the investors divided by the value of their put option purchases. The sample period is January 2000 to March 2006. 3.5 2.5 2.0 1.5 1.0 30 0.5 20 10 0 -10 -20 2000 2001 2002 2003 2004 2005 2006 Call/Put Ratio Gross Return Difference Equity Traders and Option Traders (%) MSCI Netherlands Return (%) 40 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "References",
    "page_number": 41,
    "page_range": "p.41-42",
    "total_pages": 42,
    "chunk_index": 68,
    "word_count": 155,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.41-42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  },
  {
    "text": "purchases. The sample period is January 2000 to March 2006. 3.5 2.5 2.0 1.5 1.0 30 0.5 20 10 0 -10 -20 2000 2001 2002 2003 2004 2005 2006 Call/Put Ratio Gross Return Difference Equity Traders and Option Traders (%) MSCI Netherlands Return (%) 40 Electronic copy available at: https://ssrn.com/abstract=965810 Figure 3: MSCI Netherlands Index and Sentiment Measures This figure shows the evolution through time of the MSCI Netherlands Equity Index, scaled to 1 in January 2000,andofthreesentimentmeasures. WedefinetheCall/Putratioasthevalueofshort-term(threemonthsto expiration or less) call options bought by the investors divided by the value of their put option purchases. The AEX VIX index captures the implied volatility embedded in prices of options on the Dutch AEX stock market index. ThehorizontallineinthisplotcorrespondstotheinverseofaVIXlevelof30,whichmarketparticipants ofteninterpretasafearthreshold. TheConsumerConfidenceIndexisconstructedbytheDutchCentralBureau of Statistics. The sample period is January 2000 to March 2006. MSCI Netherlands Index Call/Put Ratio 1.4 3.0 1.2 2.5 1.0 2.0 0.8 1.5 0.6 1.0 0.4 0.5 2000 2001 2002 2003 2004 2005 2000 2001 2002 2003 2004 2005 2006 Inverse AEX VIX Index Consumer Confidence Index .10 30 20 .08 10 .06 0 -10 .04 -20 .02 -30 .00 -40 2000 2001 2002 2003 2004 2005 2006 2000 2001 2002 2003 2004 2005 2006 41 Electronic copy available at: https://ssrn.com/abstract=965810",
    "title": "Option Trading and Individual Investor Performance",
    "source_type": "pdf",
    "document_id": "dee33d9daff5",
    "source_file": "Option Trading and Individual Investor Performance.pdf",
    "section": "References",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 42,
    "chunk_index": 69,
    "word_count": 201,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20081024083653-04'00'",
    "duration": null
  }
]