[
  {
    "text": "A Safer & Easier Way For You to Trade Options HUGHE S OPTIONE E RING TM Beginners Guide to Stunning Profits By Chuck Hughes 8-Time Winner of Prestigious World Live Trading Championship",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Introducing",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 72,
    "chunk_index": 0,
    "word_count": 32,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introducing (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "Copyright 2016 by Legacy Publishing LLC. All Rights Reserved. Reproduction or translation of any part of this work beyond that permitted by Section 107 or 108 of the 1976 United States Copyright Act without the permission of the copyright owner is unlawful. Information within this publication contains \"forward looking statements\" within the meaning of Section 27A of the Securities Act of 1933 and Section 21B of the Securities Exchange Act of 1934. Any statements that express or involve discussions with respect to predictions, goals, expectations, beliefs, plans, projections, objectives, assumptions or future events or performance are not statements of historical fact and may be \"forward looking statements.\" Forward looking statements are based on expectations, estimates and projections at the time the statements are made that involve a number of risks and uncertainties which could cause actual results or events to differ materially from those presently anticipated. Investing involves the risk of loss as well as the possibility of profit. All investments involve risk, and all investment decisions of an individual remain the responsibility of that individual. Option and stock investing involves risk and is not suitable for all investors. Past performance does not guarantee future results. No statement in this book should be construed as a recommendation to buy or sell a security. The author and publisher of this book cannot guarantee that the strategies outlined in this book will be profitable and will not be held liable for any possible trading losses related to these strategies. All information provided within this publication pertaining to investing, options, stocks and securities is educational information and not investment advice. Legacy Publishing is not an investment advisor and recommends all readers and subscribers to seek advice from a registered professional securities representative before deciding to invest in stocks and options featured within this publication. None of the material within this publication shall be construed as any kind of investment advice. Readers of this publication are cautioned not to place undue reliance on forward-looking statements, which are based on certain assumptions and expectations involving various risks and uncertainties that could cause results to differ materially from those set forth in the forward looking statements. Please be advised that nothing within this publication shall constitute a solicitation or an invitation to buy or sell any security mentioned herein. The author of this publication is neither a registered investment advisor nor affiliated with any broker or dealer. Although every precaution has been taken in the preparation of this publication, the publisher and author assume no liability for errors and omissions. This publication is published without warranty of any kind, either expressed or implied. Furthermore, neither the author nor the publisher shall be liable for any damages, either directly or indirectly arising from the use or misuse of the book. Users of this publication agree to indemnify, release and hold harmless Legacy Publishing, its members, employees, agents, representatives, affiliates, subsidiaries, successors and assigns (collectively, \"The Companies\") from and against any and all claims, liabilities, losses, causes of actions, costs, lost profits, lost opportunities, indirect, special, incident, consequential, punitive, or any other damages whatsoever and expenses (including, without limitation, court costs and attorneys' fees) (\"Losses\") asserted against, resulting from, imposed upon or incurred by any of The Companies as a result of, or arising out of this agreement and/or your use of this publication. This publication is designed to provide accurate and authoritative information in regard to the subject matter covered. It is sold with the understanding that the author and publisher are not engaged in rendering legal, accounting, or other professional services. If legal advice or other expert assistance is required, the services of a competent professional person should be sought. Use of the material within this publication constitutes your acceptance of these terms. HYPOTHETICAL PERFORMANCE RESULTS HAVE MANY INHERENT LIMITATIONS, SOME OF WHICH ARE DESCRIBED BELOW. NO REPRESENTATION IS BEING MADE THAT ANY ACCOUNT WILL OR IS LIKELY TO ACHIEVE PROFITS OR LOSSES SIMILAR TO THOSE SHOWN. IN FACT, THERE ARE FREQUENTLY SHARP DIFFERENCES BETWEEN HYPOTHETICAL PERFORMANCE RESULTS AND THE ACTUAL RESULTS SUBSEQUENTLY ACHIEVED BY ANY PARTICULAR TRADING PROGRAM. ONE OF THE LIMITATIONS OF HYPOTHETICAL PERFORMANCE RESULTS IS THAT THEY ARE GENERALLY PREPARED WITH THE BENEFIT OF HINDSIGHT. IN ADDITION, HYPOTHETICAL TRADING DOES NOT INVOLVE FINANCIAL RISK, AND NO HYPOTHETICAL TRADING RECORD CAN COMPLETELY ACCOUNT FOR THE IMPACT OF FINANCIAL RISK IN ACTUAL TRADING. FOR EXAMPLE, THE ABILITY TO WITHSTAND LOSSES OR TO ADHERE TO A PARTICULAR TRADING PROGRAM IN SPITE OF TRADING LOSSES ARE MATERIAL POINTS WHICH CAN ALSO ADVERSELY AFFECT ACTUAL TRADING RESULTS. THERE ARE NUMEROUS OTHER FACTORS RELATED TO THE MARKETS IN GENERAL OR TO THE IMPLEMENTATION OF ANY SPECIFIC TRADING PROGRAM WHICH CANNOT BE FULLY ACCOUNTED FOR IN THE PREPARATION OF HYPOTHETICAL PERFORMANCE RESULTS AND ALL OF WHICH CAN ADVERSELY AFFECT ACTUAL TRADING RESULTS. 2",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Introducing",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 72,
    "chunk_index": 1,
    "word_count": 803,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introducing (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "ALSO ADVERSELY AFFECT ACTUAL TRADING RESULTS. THERE ARE NUMEROUS OTHER FACTORS RELATED TO THE MARKETS IN GENERAL OR TO THE IMPLEMENTATION OF ANY SPECIFIC TRADING PROGRAM WHICH CANNOT BE FULLY ACCOUNTED FOR IN THE PREPARATION OF HYPOTHETICAL PERFORMANCE RESULTS AND ALL OF WHICH CAN ADVERSELY AFFECT ACTUAL TRADING RESULTS. 2 Presents . . . Option Trading Made Easy Welcome to the exciting world of Option Trading! The Hughes Optioneering™ Team has over 60 years of combined trading experience and has taught thousands of people from all walks of life and backgrounds with no investing experience to trade options successfully. The Team has found that just about anybody can learn to trade options as long as they understand the basics of options trading. And if you don’t understand options, then no problem . . . We have the resources to teach you what you need to know. Real People . . . Real Trades . . . Real Profits The Hughes Optioneering™ Team “practices what they preach”. The Team is in the trenches every trading day successfully profiting from every type of market condition from severe bear markets to highly volatile, non-trending type markets. The Hughes Optioneering™ Strategies have a long history of profitability generating more than $7.2 million in actual documented profits over the past 8 years during which we experienced the worst bear market since the Great Depression. Copies of our brokerage account statements showing this $7.2 million in profits is presented in our Guaranteed Real Optioneering Winners! training manual. And we currently have $1.7 million in actual profits with an average return of 223.5%. Copies of our brokerage account Profit/Loss Reports that show the $1,756,533.72 in open trade profits are included at the end of this Guide. 3",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Introducing",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 72,
    "chunk_index": 2,
    "word_count": 290,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introducing (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "profits is presented in our Guaranteed Real Optioneering Winners! training manual. And we currently have $1.7 million in actual profits with an average return of 223.5%. Copies of our brokerage account Profit/Loss Reports that show the $1,756,533.72 in open trade profits are included at the end of this Guide. 3",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Introducing",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 72,
    "chunk_index": 3,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introducing (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "Team members Ryan and Chuck Hughes were awarded a total of 13 World Trading Championship trophies including eight first-place, four second-place and one third-place finish. The World Trading Championship is a highly competitive, real money trading contest in which competitors from around the globe display their trading skills trading real money. All profit results are audited by CPAs before being posted on the sponsor’s website. Despite the difficult market conditions last year, Chuck had a 309% real time return trading the Optioneering™ strategies with a first-place finish in the trading contest. And the year before, Chuck had a 339% return with a second-place finish. Chuck has more first place finishes in the trading contest than any other trader in the history of the competition. We are not showing you these profit results to “brag”. The reason we’re showing you real results is to build your confidence in the Optioneering™ strategies. Because they really do work... and there is no reason they can’t work for you as well. We are showing you actual profit results so you can feel comfortable and confident that you are learning from someone who knows what they’re talking about! To be a successful options investor you don’t need to know complicated mathematical formulas or Greek letters. You only need to know the basic mechanics of buying and selling options which will be fully explained in this Guide. $460,164 Profit Starting With a $4,600 Account Option trading allows investors to turn a small amount of money into a large amount of money. Team member Chuck Hughes started investing in options 31 years ago. Chuck had a big mortgage payment and a young family. He started investing in options with only a $4,600 trading account as that is all he could scrape together at the time. But within the first two years Chuck made $460,164 in profits which is more than he made at his airline job over the previous six years. Chuck says “Knowing that I could support my family from my option trading business was very comforting and liberating for me as I finally achieved financial independence. I no longer depended on my job to support my family.” At the end of this Guide we included copies of Chuck’s tax returns showing the $460,164 of profits during his first two years of option investing. Getting Started With $270 In this Guide we show actual examples of option portfolios that only require a total investment of $270. Getting a high return with a small investment is the secret to becoming what we call a ‘Shoestring Millionaire’. The key to achieving a high return is to use leverage. 4",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Introducing",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 72,
    "chunk_index": 4,
    "word_count": 441,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introducing (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "$270 In this Guide we show actual examples of option portfolios that only require a total investment of $270. Getting a high return with a small investment is the secret to becoming what we call a ‘Shoestring Millionaire’. The key to achieving a high return is to use leverage. 4",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Introducing",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 72,
    "chunk_index": 5,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introducing (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "Stocks have historically provided an 11.6% average compounded rate of return over the long term. While this rate of return far exceeds the historical returns for home prices and fixed income investments, it would take many years to turn a small investment into a large investment with an 11.6% annual return. For example, it would take more than six years to double your investment with an 11.6% compounded rate of return. Using Leverage In our experience the best way to achieve a high rate of investment return is to invest in options. Options give you the ‘leverage’ you need to generate a high rate of return with a small investment which can enable us to become ‘Shoestring Millionaires’. In this Guide we will explore purchasing call and put options which provide leverage that can enable you to realize a high rate of return over a short period of time. When you purchase a call or put option, the most you can lose is the cost of the option regardless of the price movement of the underlying stock. Even if the price of a stock drops to zero the most you can lose is the cost you paid for the option. But because you can lose the funds you invest in options, we recommend only investing that portion of your investing funds that you can afford to lose in options. Purchasing options incurs limited risk as you can’t lose more money than you invest. This is different from Forex trading or trading futures contracts which can result in losing more money than you invest. I have seen a lot of advertisements lately touting the ‘100 to 1’ or even ‘200 to 1’ leverage available from Forex trading. While this kind of leverage can produce high returns it can be dangerous to your financial health. If you invest $10,000 in a ‘200 to 1’ leveraged contract a 10% adverse move can wipe out your $10,000 investment and trigger a $190,000 margin call that will force you to pay the brokerage firm an additional $190,000 to meet the margin call. The Amaranth hedge fund ‘blew up’ as a result of margin calls the fund received on its energy futures contracts. These types of margin calls have occurred in the past and with the use of this type of leverage will probably occur again in the future. More often than not the use of this type of leverage eventually ends badly for investors. Options Can Provide a High Rate of Return With a Small Investment Which Would Allows Us to Become Shoestring Millionaires 5",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Introducing",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 72,
    "chunk_index": 6,
    "word_count": 430,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introducing (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "use of this type of leverage will probably occur again in the future. More often than not the use of this type of leverage eventually ends badly for investors. Options Can Provide a High Rate of Return With a Small Investment Which Would Allows Us to Become Shoestring Millionaires 5",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Introducing",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 72,
    "chunk_index": 7,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introducing (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "As noted previously, the greater return potential associated with options is due to the leverage that options provide. Let’s take a look at some actual option examples so that you can understand the important concept of leverage and how leverage can provide a high rate of return. The option quote table below contains actual call option prices (courtesy of Yahoo Finance) for Hewlett Packard (HPQ). Buying call options is a bullish strategy as the value of a call option will increase as the price of the underlying stock increases. Hewlett Packard stock is currently trading at 32.78. Let’s focus on the March 35-Strike call option (circled). Hewlett-Packard Co. (HPQ) At 3:49PM ET: 32.78 0.18 (0.55%) CALL OPTIONS Expire at close Friday, Mar 17 Open Strike Symbol Last Chg Bid Ask Int 25.00 HPQCE.X 7.90 0.00 7.60 7.80 303 27.50 HPQCY.X 5.40 1.00 5.10 5.30 479 30.00 HPQCF.X 2.80 0.15 2.65 2.75 4,797 32.50 HPQCZ.X 0.70 0.15 0.65 0.70 38,350 35.00 HPQCG.X 0.05 0.05 0.05 0.10 30,226 10% Stock Price Increase = 950% Option Return Buying the 35-Strike call option gives us the right to buy 100 shares of HPQ at 35.00. If we were to purchase the 35-Strike call option we would expect to pay the ‘ask’ price of .10 cents or $10 per option (.10 x 100 shares = $10). Let’s assume HPQ stock increases 10% in price from the current price of 32.78 to 36.05. With a stock price of 36.05 the 35-Strike call option would be worth 1.05 points or $105 (stock price of 36.05 minus 35-Strike price = 1.05 option value). When you purchase options you can sell them any time prior to option expiration. So the option we purchased for .10 points could be sold for 1.05 points. Selling the 35-Strike call at 1.05 would produce a 950% return (1.05 sale price minus .10 cost = .95 profit divided by .10 cost = 950% return). 6",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Introducing",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 72,
    "chunk_index": 8,
    "word_count": 321,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introducing (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "sell them any time prior to option expiration. So the option we purchased for .10 points could be sold for 1.05 points. Selling the 35-Strike call at 1.05 would produce a 950% return (1.05 sale price minus .10 cost = .95 profit divided by .10 cost = 950% return). 6 9.5 to 1 Leverage = Profit Opportunity Options Are Highly Leveraged and Can Provide a High Rate of Return Stock Investor ● Buys HPQ Stock at 32.78 ● Stock Increases 10% to 36.05 Results: ● Big Investment $3,278 ● Small Profit 10% Option Investor ● Buys 35-Strike Call Option for $10 ● Stock Increases 10% to 36.05 Call Option is Worth $105 (Stock Price of 36.05 minus 35.0 Strike = 1.05 Option Value) $105 Option Value Minus $10 Cost = $95 Profit $95 Profit Divided by $10 Cost = 950% Return Results: ● Small Investment $10 ● Big Profit 950% A 10% Price Increase in Stock = 950% Call Option Return Which Allows Us to Achieve a High Rate of Return 7",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Introducing",
    "page_number": 7,
    "page_range": "p.7-8",
    "total_pages": 72,
    "chunk_index": 9,
    "word_count": 172,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introducing (p.7-8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "Value) $105 Option Value Minus $10 Cost = $95 Profit $95 Profit Divided by $10 Cost = 950% Return Results: ● Small Investment $10 ● Big Profit 950% A 10% Price Increase in Stock = 950% Call Option Return Which Allows Us to Achieve a High Rate of Return 7 The Power of Leverage The table below compares the profit potential of purchasing Hewlett Packard stock at today’s price of 32.78 versus the HPQ March 35-strike call option at .10 points. If HPQ stock increases to 38.00 stock investors realize a 15.9% return but option investors realize a 2,900% return. If HPQ stock increases to 40 stock investors realize a 22% return but option investors realize a 4,900% return. “Progress always involves risks. You can’t steal second base and keep your foot on first.” - Frederick B. Wilcox 15.9% Stock Return = 2,900% Option Return = 29 to 1 Leverage 22% Stock Return = 4,900% Option Return = 49 to 1 Leverage Hewlett Packard 35.00 36.00 37.00 38.00 39.00 40.00 Stock Price Stock Profit 2.22 3.22 4.22 5.22 6.22 7.22 Stock % Return 6.8% 9.8% 12.9% 15.9% 19.0% 22.0% Value of 35-Strike 0.00 1.00 2.00 3.00 4.00 5.00 Call Option Option Profit 0.00 0.90 1.90 2.90 3.90 4.90 Option % Return 0.00 900% 1900% 2900% 3900% 4900% 8",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Introducing",
    "page_number": 8,
    "page_range": "p.8-9",
    "total_pages": 72,
    "chunk_index": 10,
    "word_count": 218,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introducing (p.8-9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "39.00 40.00 Stock Price Stock Profit 2.22 3.22 4.22 5.22 6.22 7.22 Stock % Return 6.8% 9.8% 12.9% 15.9% 19.0% 22.0% Value of 35-Strike 0.00 1.00 2.00 3.00 4.00 5.00 Call Option Option Profit 0.00 0.90 1.90 2.90 3.90 4.90 Option % Return 0.00 900% 1900% 2900% 3900% 4900% 8 Options Work Just as Well in a Down Market Options work just as well in a down market. The option quote table below contains actual put option prices (courtesy of Yahoo Finance) for Hewlett Packard (HPQ). Buying put options is a bearish strategy as the value of a put option increases as the price of the underlying stock decreases. Hewlett Packard stock is currently trading at 32.78. Let’s assume that HPQ stock declines in price 10% from 32.78 to 29.50. Let’s focus on the March 30-Strike put option (circled). 10% Stock Price Decrease = 900% Option Return Buying the 30-Strike put option gives us the right to sell 100 shares of HPQ at 30.00. If we were to purchase the 30-Strike put option we would expect to pay the ‘ask’ price of .05 cents or $5 per option (.05 x 100 shares = $5). Let’s assume HPQ stock decreases 10% in price from the current price of 32.78 to 29.50. With a stock price of 29.50 the 30-Strike put option would be worth .50 points or $50 (strike price of 30.00 minus 29.50 stock price = .50 option value). When you purchase options you can sell them anytime prior to option expiration. So the option we purchased for .05 points could be sold for .50 points. Selling the 30-Strike put at .50 would produce a 900% return (.50 sale price minus .05 cost = .45 profit divided by .05 cost = 900% return). Hewlett-Packard Co. (HPQ) At 3:49PM ET: 32.78 0.18 (0.55%) PUT OPTIONS Expire at close Fri, Mar 17, 2006 Strike Symbol Last Chg Bid Ask Open Int 27.50 HPQOY.X 0.05 0.00 N/A 0.05 13,200 30.00 HPQOF.X 0.05 0.00 N/A 0.05 21,661 32.50 HPQOZ.X 0.40 0.05 0.45 0.55 24,820 35.00 HPQOG.X 2.30 0.10 2.40 2.45 5,504 37.50 HPQOU.X 4.70 0.00 4.80 5.00 291 A 10% Increase in Stock Price = 950% Call Opt Return A 10% Decline in Stock Price = 900% Put Option Return Making Options the Most Profitable and Most Versatile Financial Investments Available Today 9",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Introducing",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 72,
    "chunk_index": 11,
    "word_count": 389,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introducing (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "24,820 35.00 HPQOG.X 2.30 0.10 2.40 2.45 5,504 37.50 HPQOU.X 4.70 0.00 4.80 5.00 291 A 10% Increase in Stock Price = 950% Call Opt Return A 10% Decline in Stock Price = 900% Put Option Return Making Options the Most Profitable and Most Versatile Financial Investments Available Today 9",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Introducing",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 72,
    "chunk_index": 12,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introducing (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "Options are ‘derivatives’ that derive their value from the price of the underlying stock. The intrinsic value of a call option will increase one point for each point its underlying stock increases above the strike price. Intrinsic Value of Call Option Increases One Point for Each Point Its Stock Increases above the Strike Price A lot has been published about option strategies that invest in options based on whether an option is undervalued or overvalued according to the Black-Scholes Pricing Model. These option strategies are very complex and require high-level mathematical calculations to compute an option’s Alpha, Beta, Delta, Gamma, Theta etc. We never understood the logic of investing in an option because it was slightly under valued at the time of purchase. Undervalued options can become more undervalued. The price movement of the underlying stock determines an option’s value and the resulting profit/loss. When you purchase a call option your profits are determined by the price movement of the underlying stock. Let’s refer again to the example for the Hewlett Packard 35-Strike call purchased at .10 points so that you fully understand this important concept. The table below clearly demonstrates that the price of HPQ stock determines the profit/loss of the 35-Strike call option. If we can select a stock moving up in price, purchasing a call option on that stock can produce enormous profits due to the leverage options provide. Option intrinsic value increases ‘dollar for dollar’ once the stock price moves above the strike price of the option purchased HPQ Stock Price 35.00 36.00 37.00 38.00 39.00 40.00 Value of 35-Strike 0.00 1.00 2.00 3.00 4.00 5.00 Call Option Option Profit/Loss 0.00 0.90 1.90 2.90 3.90 4.90 Option % Return 0.00 900% 1,900% 2,900% 3,900% 4,900% If we can select a stock moving up in price, purchasing a call option on that stock can produce enormous profits and will allow us to harness the leverage provided from option investing. 10",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Option Profits Are Derived From Stock Price Movement",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 72,
    "chunk_index": 13,
    "word_count": 323,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Profits Are Derived From Stock Price Movement (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "Profit/Loss 0.00 0.90 1.90 2.90 3.90 4.90 Option % Return 0.00 900% 1,900% 2,900% 3,900% 4,900% If we can select a stock moving up in price, purchasing a call option on that stock can produce enormous profits and will allow us to harness the leverage provided from option investing. 10",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Option Profits Are Derived From Stock Price Movement",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 72,
    "chunk_index": 14,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Profits Are Derived From Stock Price Movement (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "Purchasing call options can provide the leverage that allows you to achieve a high return with a small investment. The table below contains actual call option prices for Merck (MRK). Merck stock is currently trading at 41.03. Let’s focus on the MRK 40- Strike call option (circled below). Purchasing this option would cost 1.10 points or $110 (plus commission) at the current trading price. MRK 41.03 -0.06 Last Open Calls Sale Bid Ask Int 06 Sep 30.00 (MRK IF) 11.10 10.90 11.10 231 06 Sep 32.50 (MRK IZ) 8.60 8.40 8.60 150 06 Sep 35.00 (MRK IG) 6.10 5.90 6.10 263 06 Sep 37.50 (MRK IU) 3.60 3.40 3.60 474 06 Sep 40.00 (MRK IH) 1.10 1.00 1.10 12,744 An ordinary investor would: A “Shoestring Millionaire” would: ■ Buy Merck at 41.03 ■ Buy MRK 40-Strike call at 1.10 ■ Let’s Assume Stock Increases ■ Let’s Assume Stock Increases 10% to 45.13 10% to 45.13 Net Result: Net Result: ■ Large Investment: $4,103 ■ Small Investment: $110 ■ Small Profit: 10% ■ Large Profit: 366% * * Stock price of 45.13 Minus 40-Strike Price = Option Value of 5.13 5.13 Option Value Minus 1.10 Cost = 4.03 Option Profit 4.03 Profit Divided by 1.10 Cost = 366% Option Return Let’s assume we purchase 10 of the Merck 40-Strike call options previously mentioned. Our total investment would be $1,100 plus commission (10 X $110 option price = $1,100). And let’s again assume that the price of Merck stock increases 10% from 41.03 to 45.13. The value of the 40-Strike call option would be 5.13 (stock price of 45.13 minus strike price of 40 = 5.13 option value). After subtracting the 1.10 cost of the option from the current 5.13 value results in a 4.03 profit or $403 per option. Our total profit for purchasing 10 options would be $4,030. When purchasing options our risk is limited to the purchase price of the option. In this example our total risk for purchasing ten options would be $1,100. 11",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Compounding Your Returns",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 72,
    "chunk_index": 15,
    "word_count": 336,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Compounding Your Returns (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "current 5.13 value results in a 4.03 profit or $403 per option. Our total profit for purchasing 10 options would be $4,030. When purchasing options our risk is limited to the purchase price of the option. In this example our total risk for purchasing ten options would be $1,100. 11",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Compounding Your Returns",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 72,
    "chunk_index": 16,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Compounding Your Returns (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "In order for a stock investor to realize a $4,030 profit from a 10% move in Merck stock they would have to purchase 982 shares which would require a $40,291 investment. Which brings up the question . . . Would you rather risk $40,291 to make a $4,030 profit (buying stock) or risk $1,100 to make the same $4,030 profit (buying options)? Options trading allows you to make big gains that do not require big risks. The Power of Compounding Let’s take this example one step further. Let’s assume that you were able to make several of these trades consecutively. I know that losing trades are inevitable with any strategy and that every trade cannot be a big winner but for the sake of demonstration just bear with me for a moment. If you invested $1,100 and made a 366% return it would only take four such trades for your $1,100 investment to grow to $518,724 and after five trades your $1,100 investment grows to $2,417,253. Again, these results are strictly hypothetical but clearly demonstrate the power of compounding. Trade Starting Percent Profit Ending Number Value Return Value 1 $1,100 366% $4,026 $5,126 2 $5,126 366% $18,761 $23,887 3 $23,887 366% $87,427 $111,314 4 $111,314 366% $407,410 $518,724 5 $518,724 366% $1,898,530 $2,417,254 6 $2,417,254 366% $8,847,149 $11,264,403 7 $11,264,403 366% $41,227,716 $52,492,119 Options can provide spectacular returns without big risks . . . why doesn't everyone invest in them? I think that in general options trading has been shrouded in mystery for the average investor. Most investors don’t invest in options because they don’t understand options. They have heard too many myths and misconceptions concerning options trading. When something is not understood, it is often feared. I believe this is the case with option trading. The biggest misconception related to option trading is that it is ‘too risky’. But that is simply not true. In the previous example for Merck options we learned that a stock investor has to risk $40,291 to receive the same profit potential as the options investor who only risks $1,100. Trading stocks can be more risky than trading options because more of your money is at risk. Option trading is also more versatile as you can profit in up or down markets. 12",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Big Gains Do Not Require Big Risks",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 72,
    "chunk_index": 17,
    "word_count": 379,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Big Gains Do Not Require Big Risks (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "to risk $40,291 to receive the same profit potential as the options investor who only risks $1,100. Trading stocks can be more risky than trading options because more of your money is at risk. Option trading is also more versatile as you can profit in up or down markets. 12",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Big Gains Do Not Require Big Risks",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 72,
    "chunk_index": 18,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Big Gains Do Not Require Big Risks (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "Options are also known as derivatives because the option contract derives its price and value from the underlying asset on which it is based. The value of an option fluctuates as the price of the underlying asset rises or falls in price. An option is the right, but not the obligation, to buy or sell a stock or index for a specified price on or before a specific date. A call option is the right to buy a stock/index, while a put option is the right to sell a stock/index. The investor who purchases an option, whether it is a put or call, is the option “buyer”. Conversely, the investor who sells the put or call “to open” is the option “seller” or “writer”. Options are contracts in which the terms of the contract are standardized and give the buyer the right, but not the obligation, to buy or sell a particular stock/index at a fixed price (the strike price) for a specific period of time (until expiration). All option contracts traded on U.S. securities exchanges are issued, guaranteed and cleared by the Options Clearing Corporation (OCC). OCC is a registered clearing corporation with the SEC and has received ‘AAA’ credit rating from Standard & Poor’s Corporation. The ‘AAA’ credit rating corresponds to OCC’s ability to fulfill its obligations as counter-party for options trades. The options markets provide a mechanism where many different types of investors can achieve their specific investment goals. An options investor may be looking for long term or short term profits, or they may be looking to hedge an existing stock or index position. Whatever your objectives may be, you need a thorough understanding of the markets you will be trading. Options Share the Following General Characteristics:  Options give you the right but not the obligation to buy or sell an underlying security or index  If you buy an option, you are not obligated to buy the underlying security. You simply have the right to exercise the option.  Options are in force for a specified period of time after which they expire and you lose the right to buy or sell the underlying security  When options are purchased the buyer incurs a debit  Options are available in various strike prices representing the price of the underlying security  The cost of an option is referred to as the option premium  There are two kinds of options: calls and puts. Calls give you the right to buy the underlying security and puts give you the right to sell the underlying security  Most options are never exercised and are closed out before option expiration 13",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Option Basics",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 72,
    "chunk_index": 19,
    "word_count": 444,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Basics (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "to as the option premium  There are two kinds of options: calls and puts. Calls give you the right to buy the underlying security and puts give you the right to sell the underlying security  Most options are never exercised and are closed out before option expiration 13",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Option Basics",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 72,
    "chunk_index": 20,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Basics (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "Any investor can buy options if they have the required account established with their broker. Buying options limits the investor’s risk to the amount of capital invested in the option purchase. Therefore the only requirement is that the investor has enough funds in their account to purchase the options. Since the purchase of an option contract results in a long position, a cash debit is subtracted from the buyer’s account. Underlying Security The underlying security in options trading is defined as the financial instrument on which an option contract is based or derived. It is a stock or Exchange Traded Fund (ETF) that you have the right to purchase or sell. The symbol used for the underlying security in options trading is usually the symbol used by the exchange on which the underlying security is traded. For example, GE is used for General Electric and SPY is used for the S&P 500 Index ETF. Strike Price The strike price is the actual price at which the option holder may buy or sell the underlying security as defined in the option contract. For example, a GE Mar 20-Strike call gives the buyer of the option the right to buy 100 shares of General Electric at $20 per share between now and the monthly option expiration which is usually the third Friday of the month. Expiration Date The expiration date is the actual date that an option contract becomes void. Monthly options normally expire on the third Friday of each month. Be aware that at expiration options that are not closed prior to expiration and are in-the-money will be exercised automatically. Option Type There are two types of options - call options and put options. A call option profits when the price of the underlying security moves higher. A put option profits when the price of the underlying security moves lower. 14",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Buying Options",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 72,
    "chunk_index": 21,
    "word_count": 310,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Buying Options (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "to expiration and are in-the-money will be exercised automatically. Option Type There are two types of options - call options and put options. A call option profits when the price of the underlying security moves higher. A put option profits when the price of the underlying security moves lower. 14",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Buying Options",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 72,
    "chunk_index": 22,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Buying Options (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "How to Read Option Symbols An option symbol is comprised of several components that define the underlying stock or ETF and information about the specific option contract. An option symbol consists of the stock or ETF trading symbol, year of expiration, month of expiration, expiration date, option type (call or put) and strike-price. There are many financial websites available today that will give you option quotes. I like to use Yahoo Finance or the Chicago Board Options Exchange website at www.cboe.com to obtain option quotes. The symbol for the General Electric Jan 2018 25-Strike call option is GE180119C00025000. Let’s look at the components of this option symbol. GE, 18, 01, 19, C, 00025000 GE is the trading symbol for General Electric 18 is the expiration year 2018 01 is the expiration month of January 19 is the expiration date which is Friday January 19th in this example C designates a call option (put options are designated with a “P”) 00025000 designates a 25-Strike price Stock Option Point Values Normally, 1 stock option contract covers 100 hundred shares of the underlying stock. Therefore an option with a 3.5 point premium would cost $350 (100 shares x $3.5). Exercise Exercise is the term used when the buyer of an option uses their right to purchase or sell the underlying security at the terms of the option contract. Your broker handles the entire option exercise transaction, and the resulting stock position is transferred into your account. Advantages of Options Versus Stocks/Mutual Funds When you purchase options you commit a limited amount of capital and thus have less total dollars at risk in the market compared to stocks and mutual funds. The surplus dollars can be placed in safe investments like a money market fund. Instead of buying stocks consider “leasing” them with options especially when your market expectations are likely to change more frequently with today’s volatile markets. If you set aside a small portion of your portfolio for options to benefit from the frequent market swings it can create big profit opportunities for traders positioned to capitalize on market swings. Options offer profit potential not only when the market rallies, but also when it declines. With stocks and most mutual funds you can only benefit from bullish markets. If you are bearish on the stock market cash is usually your only alternative. With options you can profit from both bullish and bearish markets. 15",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Buying Options",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 72,
    "chunk_index": 23,
    "word_count": 402,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Buying Options (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "not only when the market rallies, but also when it declines. With stocks and most mutual funds you can only benefit from bullish markets. If you are bearish on the stock market cash is usually your only alternative. With options you can profit from both bullish and bearish markets. 15",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Buying Options",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 72,
    "chunk_index": 24,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Buying Options (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "A Lower Risk Alternative to ‘Going Short’ Put options are normally a better choice than selling short a stock or ETF. Option purchases normally do not require a margin account, whereas short selling a stock does require a margin account. In addition, a short stock position has virtually unlimited loss potential if a stock continues to rally in price. Conversely, the maximum loss for a put option purchase is limited to the purchase price of the option. Options offer greater leverage than stocks or mutual funds. A 10% move in a stock can easily translate into a 50 to 100% move in the related option. Purchasing options offers profit leverage if you are correct in your market view but also offers limited risk if your market view is incorrect. Risk Management The first step toward intelligent risk management is to trade options only with that portion of your capital that can be comfortably devoted to speculation. This will permit you to trade rationally and to sleep soundly which is not possible if your ‘Safe Money’ is at risk. Never trade options with money needed to pay living expenses. Restrict your options trading to funds that can be lost without undue financial hardship. Once you determine the amount of your available trading capital, try to allocate no more than 10% to any one trade. This should help mitigate losses when losing trades occur. This rule holds regardless of how successful you have been in the past and regardless of how attractive the next trade appears. There will always be losing trades. By compounding your capital after a few profitable trades, you are exposing yourself to potentially painful losses once that losing trade comes along. Risk and Diversification Option positions should be diversified. A major advantage of option purchases is ‘truncated risk’, whereby your loss is limited to your initial investment yet your profit is virtually unlimited. Diversification will allow you to use truncated risk to its maximum advantage. While some of your positions will inevitably be unprofitable, each profitable trade can offset several unprofitable trades. Option positions should be established among 5 or more underlying stocks and indexes in unrelated industries. This gives you diversification, which can help mitigate sector weakness. In order to trade options, your broker must first approve your account for option trading. There are various levels of option trading and each level has financial requirements that differ from broker to broker: Level 1 Covered call writing Level 2 Call and put purchases and covered put writing Level 3 Spreads Level 4 Uncovered call and put writing (requires margin) Level 5 Index option writing (requires margin) Be sure to ask your broker about their requirements for the level of options you plan to trade. 16",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Buying Options",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 72,
    "chunk_index": 25,
    "word_count": 457,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Buying Options (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "call writing Level 2 Call and put purchases and covered put writing Level 3 Spreads Level 4 Uncovered call and put writing (requires margin) Level 5 Index option writing (requires margin) Be sure to ask your broker about their requirements for the level of options you plan to trade. 16",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Buying Options",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 72,
    "chunk_index": 26,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Buying Options (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "Listed below are definitions for a variety of popular orders that may be helpful.  Market Order A market order is simply an order without restrictions or limits that guarantees execution but not price. Because it lacks restrictions, it takes precedence over all other types of orders. A market order to buy is executed at the best offering price available, which is normally the “ask” price. A market order to sell is executed at the best bid price available which is normally the “bid” price.  Limit Order A limit order is an order in which an investor has placed a restriction or limit on the acceptable purchase or selling price. There are two types of limit orders: a buy limit order and sell limit order. A buy limit order sets the maximum amount an investor is willing to pay to purchase a security or option contract. A sell limit order sets the minimum price that an investor is willing to accept to sell their security or option contract.  Day Orders Day orders are only valid for one trading day. If you place the order during market hours, then it will expire at the end of the trading day if it is not executed. If you place a day order after the market close then it will be valid for the next trading day.  Good Until Canceled Orders (GTC) Normally each brokerage firm will establish time periods for which GTC orders are valid. Once a GTC order is placed, it will remain open until the option expires, the order itself expires, the order is filled, or the order is cancelled. Option Pricing The most important factor that determines the price of an option is the price of the underlying stock or ETF relative to the strike price. This determines whether an option is in-the-money or out-of-the-money and quantifies an option’s intrinsic and time value. In-the-money options have more intrinsic value and are more expensive than out-of-the-money options. The deeper an option is in-the-money the more intrinsic value it will have and the more expensive it will be. In-the-money options are more expensive than at-the-money and out-of-the-money options. Time Until Expiration An option premium is comprised of time value and intrinsic value. An option is considered a wasting asset as the time value portion of the option decreases as the option approaches expiration. At option expiration the time value of an option decays to zero. 17",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Order Types",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 72,
    "chunk_index": 27,
    "word_count": 407,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Order Types (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "out-of-the-money options. Time Until Expiration An option premium is comprised of time value and intrinsic value. An option is considered a wasting asset as the time value portion of the option decreases as the option approaches expiration. At option expiration the time value of an option decays to zero. 17",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Order Types",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 72,
    "chunk_index": 28,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Order Types (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "If the underlying security price falls far below or far above the strike price of the option, the underlying security becomes more dominant in determining the price of the option. On the day the option expires its only value is its intrinsic value. Intrinsic value is determined by the price of the underlying security in relation to the option strike price. If an option has no intrinsic value at expiration, it expires worthless. The passage of time works against the options buyer, as the price of out-of-the-money options decreases at an accelerating rate as the expiration date approaches. This is called “time decay”. The longer an option has before expiration, the more expensive it will be. More time until expiration means more time value and a higher premium. Call Put In the money strike price<stock price strike price>stock price At the money strike price=stock price strike price=stock price Out of the money strike price>stock price strike price<stock price Goal of Option Trading The goal of option trading is to ‘Buy Low and Sell High’. Buying a call option is a bullish strategy as the value of a call option will increase as the price of the underlying stock increases. Conversely, if the price of the underlying stock decreases then the value of a call option also decreases. Buying calls is a strategy that can be used as an alternative to the outright purchase of the underlying security, giving the purchaser the added benefits of limited risk and increased leverage. Buying a put option is a bearish strategy as the value of a put option will increase as the price of the underlying stock decreases. Conversely, if the price of the underlying stock increases then the value of a put option will decrease. The risk for call or put option purchases is limited to the premium paid for the option. The profit potential is not limited. 18",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Order Types",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 72,
    "chunk_index": 29,
    "word_count": 316,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Order Types (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "as the price of the underlying stock decreases. Conversely, if the price of the underlying stock increases then the value of a put option will decrease. The risk for call or put option purchases is limited to the premium paid for the option. The profit potential is not limited. 18",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Order Types",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 72,
    "chunk_index": 30,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Order Types (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "The price you pay for an option is called the premium. When you buy an option, cash is deducted from your brokerage account to pay for the option premium. One option contract normally controls one hundred shares of the underlying stock. Purchasing an option with a 4.00 point premium would result in $400 being deducted from your brokerage account to pay for the premium (4.00 x 100 shares = $400). If you later sold this option for 6.00 points you would realize a $200 profit. Buy at 4.00 and sell at 6.00 = 2.00 Profit Conversely, if you later sell this option for 3.00 points you would realize a $100 loss. Buy at 4.00 and sell at 3.00 = 1.00 Loss Buyers of call options profit if the underlying stock increases in price Buyers of put options profit if the underlying stock decreases in price Note: When you buy an option, you can sell the option any time prior to option expiration. Let’s review the types of option orders that you would give to your broker (or online) to make sure you understand this important concept. Order Result Buy Call to Open Establishes Call Position Buy Put to Open Establishes Put Position Sell Call to Close Closes Out Call Position Sell Put to Close Closes Out Put Position Put Purchases A put option purchase also known as being long a put is a bearish position. It gives the purchaser the right but not the obligation to sell the underlying security at a fixed price on or before the expiration. The risk for the purchaser is limited to the premium paid for the put option. The profit potential is not limited. 19",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Order Types",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 72,
    "chunk_index": 31,
    "word_count": 281,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Order Types (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "is a bearish position. It gives the purchaser the right but not the obligation to sell the underlying security at a fixed price on or before the expiration. The risk for the purchaser is limited to the premium paid for the put option. The profit potential is not limited. 19",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Order Types",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 72,
    "chunk_index": 32,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Order Types (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "The put purchase strategy benefits from a decrease in the price of the underlying security. Buying puts is a strategy that can be used as an alternative to short selling a stock, giving the purchaser the added benefits of limited risk and increased leverage. Put Buying Advantages  A put purchase is a limited risk alternative to shorting a stock which is a high-risk strategy  Put purchases provide leverage without having to use margin  Put purchases are limited risk but the profit potential is not limited  Put purchasers do not have to pay dividends on the underlying stock, which is required of short sellers Trading Options Online Trading options online has made options trading quick and easy with low costs. The Optioneering™ Team trades at three of the major online brokerage houses and pay commissions ranging from $5 to $8 to trade options. These three brokerage houses have provided us with excellent telephone support over the years if we have a question about our option trade or if we want to give a broker an option order over the phone. Option specialists are available to help with option orders. Options can be traded in most standard brokerage accounts and is similar to trading stocks like Apple or Microsoft. When you trade stocks, you only make money when the stock price goes up. One of the great advantages of option trading is that you can profit if the price of the underlying stock goes up, down, or even sideways. Another advantage of option trading is that you can start small. We will see shortly that trading a portfolio of options using the strategy presented in this Guide only costs $270. Also, options can be traded in most retirement accounts just as the Optioneering™ Team does in their retirement accounts. Option Orders Let’s now take a look at entering option orders. You can enter option orders over the phone with your stock broker or they can be entered online. Today is February 8th. General Electric stock symbol GE is trading at 28.17. Let’s assume you want to purchase a GE March 26-Strike call option which expires in about 6 weeks. You can call your broker and give him an order to “Buy to open 1 GE March 26- Strike call option at the market.” “At the market” means that the option will be purchased at the price the option is trading at the time the order is placed. A market order will normally be filled in just a few seconds. 20",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Order Types",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 72,
    "chunk_index": 33,
    "word_count": 422,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Order Types (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "“Buy to open 1 GE March 26- Strike call option at the market.” “At the market” means that the option will be purchased at the price the option is trading at the time the order is placed. A market order will normally be filled in just a few seconds. 20",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Order Types",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 72,
    "chunk_index": 34,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Order Types (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "Let’s now take a look at entering option orders. You can enter option orders over the phone with your stock broker or they can be entered online. Today is February 8th. General Electric stock symbol GE is trading at 28.17. If you purchased 100 shares of GE stock the cost would be $2,817 plus commission. A lower cost alternative would be to purchase a GE call option which controls 100 shares of GE stock. Let’s assume you want to purchase a GE March 26-Strike call option which expires in about 6 weeks. You can call your broker and give him an order to ‘Buy to open 1 GE March 26-Strike call option at the market.’ ‘At the market’ means that the option will be purchased at the price the option is trading at the time the order is placed. A market order will normally be filled in just a few seconds. When you buy an option, you normally would pay the ‘ask’ price with a market order. If you have an online brokerage account you can enter your buy order online. Each online brokerage company has a slightly different format for entering orders online. The online order on the following page would be an example of an online order we would enter in our E*Trade online brokerage account to ‘buy to open 1 GE March 26- Strike call option at the market’. This option currently has an ask price of 2.47 points or $247 plus commission. Symbol - GE Order Type – Buy to open Contracts – 1 Type – Call Expiration – March 18th Strike - 26 Price Type – Market Term – Good For The Day 21",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Option Orders",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 72,
    "chunk_index": 35,
    "word_count": 279,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Orders (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "at the market’. This option currently has an ask price of 2.47 points or $247 plus commission. Symbol - GE Order Type – Buy to open Contracts – 1 Type – Call Expiration – March 18th Strike - 26 Price Type – Market Term – Good For The Day 21 Online Option Order to ‘Buy to open 1 GE March 26-Strike call option at the market’ 22 Let’s now look at an example of an order to sell or close out an option. Let’s assume that we purchased the GE March 26-Strike call option at .50 points and we now want to sell the option. The online order below would be an example of an online order we would enter in our E*Trade brokerage account to ‘sell to close 1 GE March 26-Strike call option at the market’. This option is currently trading at a bid price 2.26 points or $226 plus commission. Symbol - GE Order Type – Sell to close Contracts – 1 Type – Call Expiration – March 18th Strike - 26 Price Type – Market Term – Good For The Day Online Option Order to ‘Sell to close 1 GE March 26-Strike call option at the market’ 23",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Option Orders",
    "page_number": 22,
    "page_range": "p.22-24",
    "total_pages": 72,
    "chunk_index": 36,
    "word_count": 202,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Orders (p.22-24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "commission. Symbol - GE Order Type – Sell to close Contracts – 1 Type – Call Expiration – March 18th Strike - 26 Price Type – Market Term – Good For The Day Online Option Order to ‘Sell to close 1 GE March 26-Strike call option at the market’ 23 The goal of option investing is to buy low and sell high to make a profit! The goal of option investing is to buy a call option or a put option and sell the option at a higher price which allows you to make a profit. If we purchased the GE March 26- Strike call option at .50 points the cost would be $50 plus commission (.50 points x 100 shares = $50. If we sold the option at 2.26 points or $226 we would realize a $176 profit on the trade or a 352% return before commission.10 shares of Microsoft at 29.85 and later sell the shares at 37.00. We would realize a $55.52 profit after accounting for the $7.99 brokerage commission to purchase the shares and the $7.99 commission to sell the shares. Buy 1 GE March 26-Strike Call at .50 = $50 cost Sell 1 GE March 26-Strike Call at 2.26 = $226 in proceeds Proceeds From Sale $226 Minus Cost $ 50 Profit = $176 (before commission) Profit $176/ Cost $50 = 352% Return (before commission) 24",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Option Orders",
    "page_number": 24,
    "page_range": "p.24-25",
    "total_pages": 72,
    "chunk_index": 37,
    "word_count": 231,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Orders (p.24-25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "to sell the shares. Buy 1 GE March 26-Strike Call at .50 = $50 cost Sell 1 GE March 26-Strike Call at 2.26 = $226 in proceeds Proceeds From Sale $226 Minus Cost $ 50 Profit = $176 (before commission) Profit $176/ Cost $50 = 352% Return (before commission) 24 $137,041.40 Option Profit When you purchase options, your contracts are held in your brokerage account. The copy of our brokerage account Portfolio Report below lists our option trades for Amazon, Facebook, Google, Home Depot, Starbucks and Visa and the open trade profits for each option. We have $137,934.87 in profits and no losing trades. We will look next at our indicator that helps us find the best profit opportunities. $137,041.40 Profit 25",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Option Orders",
    "page_number": 25,
    "page_range": "p.25-26",
    "total_pages": 72,
    "chunk_index": 38,
    "word_count": 122,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Orders (p.25-26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "Report below lists our option trades for Amazon, Facebook, Google, Home Depot, Starbucks and Visa and the open trade profits for each option. We have $137,934.87 in profits and no losing trades. We will look next at our indicator that helps us find the best profit opportunities. $137,041.40 Profit 25 Finding the Best Option Profit Opportunities We use a simple trend following system we call Prime Trade Select to select option trades with the best profit potential. We have been using this trend following system successfully to select option trades for more than 30 years. When Prime Trade Select is on a ‘Buy’ signal we want to purchase call options that profit when the underlying stock moves up in price. And when Prime Trade Select is on a ‘Sell’ signal we want to purchase put options that profit when the underlying stock moves down in price. Options are ‘derivatives’ that derive their value from the price movement of the underlying stock or ETF. If we can select stocks or ETFs that are moving up in price, we can harness the tremendous profit potential available from purchasing call options. And if we can select stocks or ETFs that are moving down in price we can harness the tremendous profit potential available from purchasing put options. Let’s now focus on the Prime Trade Select trade selection process to identify stocks that are moving up in price so we can initiate bullish option positions and to identify stocks that are moving down in price so we can initiate bearish option positions. 26",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Option Orders",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 72,
    "chunk_index": 39,
    "word_count": 259,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Orders (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "available from purchasing put options. Let’s now focus on the Prime Trade Select trade selection process to identify stocks that are moving up in price so we can initiate bullish option positions and to identify stocks that are moving down in price so we can initiate bearish option positions. 26",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Option Orders",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 72,
    "chunk_index": 40,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Orders (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "Road Map to Trading Success “What goes up must come down spinning wheel got to go around.” - Blood, Sweat and Tears What really makes stock prices go up or down? Is it really as simple as what goes up must come down and vice versa? How do I select stocks with the best profit potential? Stock prices are constantly fluctuating and many times there seems to be no ‘rhyme or reason’ to this constant price fluctuation. The air waves and the Internet are flooded with analysts and experts who try to predict the future price moves for stocks. Often they have no real answers to our same questions and are just as baffled by why a stock is going up or going down. Where does that leave us? Let’s face it; to the average investor the stock market can seem complicated and confusing. Stocks can go up or down for no apparent reason. Apple reports great earnings but the stock plummets. The price of oil drops and the inflation report is tame but the major stock market indexes dive. Pfizer reports terrible earnings but the stock rallies. With the spinning wheel, going round and round, the ups and downs of the markets can leave anyone’s head going round and round. When it comes right down to it, the reason why stock prices are going up or down seems to be anybody’s guess. You might as well try to read tea leafs. Highly paid analysts would have us believe that a company’s earnings outlook drive stock prices. Yet how many times have you seen the stock of companies with good earnings plummet while those with terrible earnings soar? Just like bad things happen to good people, big stock declines can happen to good companies. It is a fact of life with no true explanation. But none of that matters for one simple reason. At the end of the day, if there are more buy orders for a stock than sell orders then the price of the stock will go up. And if there are more sell orders for a stock than buy orders, then the price of the stock will go down. It’s just that simple. Everything else is just noise. Everything else does not matter. To make real money in the stock or option markets you don’t need to know why a stock price rises or falls, you just need to know two things: when to buy and when to sell. If you can quantitatively measure the buying and selling pressure of a stock then you will know in advance whether the price of a stock is likely to go up or down. And you will then know if you should take a bullish or bearish option position. In other words, if you get a reading on the buying pressure and selling pressure for a stock you can successfully assess whether a stock is likely to go up or go down in price. There are numerous ways to measure the buying and selling pressure of a stock. We want to teach you several methods. That way you can use all the methods or just work with the methods you are most comfortable. Remember comfort and ease are what we are aim for! 27",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Option Orders",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 72,
    "chunk_index": 41,
    "word_count": 544,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Orders (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "There are numerous ways to measure the buying and selling pressure of a stock. We want to teach you several methods. That way you can use all the methods or just work with the methods you are most comfortable. Remember comfort and ease are what we are aim for! 27",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Option Orders",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 72,
    "chunk_index": 42,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Orders (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "Successful option trading can be reduced to two simple rules: 1) Buy call options on a stock if the buying pressure exceeds the selling pressure 2) Buy put options on a stock if the selling pressure exceeds the buying pressure The best way to measure buying and selling pressure is to track the daily price movement of a stock. If the daily price of a stock is increasing then the buying pressure is exceeding selling pressure and the stock is a ‘buy’. If the daily price of a stock is decreasing then the selling pressure is exceeding buying pressure and the stock is on a ‘sell’ signal. One of the most important rules we learned as a novice investors was that you want to purchase a stock or call option only if the buying pressure exceeds selling pressure as indicated by the price of the stock trending up. Trying to profit by investing in a stock with a price that is trending down is very difficult as it requires that you correctly predict when the price of the stock will ‘bottom out’ and resume a price up trend so that your stock or call option purchase can be profitable. Buying a stock because it is cheap and then trying to predict when a stock’s price will bottom out can be nearly impossible to forecast correctly on a regular basis. This ‘crystal ball’ type of approach can leave the investor in a vulnerable position. A safer approach would be to wait until a stock’s price is in an uptrend before investing. A stock’s price movement reflects all of the known information about a company so let the price movement of the stock tell you when you should buy and sell! One of the most effective ways to measure buying and selling pressure is to look at the daily price movement of a stock. There are numerous methods for tracking the daily price movement. We want to teach you one of our favorite and most effective ways. It is using a price chart. Price charts are a great way to get a visual look at the daily price changes and the price trend of a stock. It is the price trend that will determine if the stock is on a ‘buy’ or ‘sell’ signal and whether a bullish or bearish option trade should be taken. 28",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Option Orders",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 72,
    "chunk_index": 43,
    "word_count": 394,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Orders (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "a great way to get a visual look at the daily price changes and the price trend of a stock. It is the price trend that will determine if the stock is on a ‘buy’ or ‘sell’ signal and whether a bullish or bearish option trade should be taken. 28",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Option Orders",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 72,
    "chunk_index": 44,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Orders (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "For example, if the daily price trend of a stock is increasing then the buying pressure is exceeding selling pressure and a call option position should be initiated. If the daily price trend of a stock is decreasing then the selling pressure is exceeding buying pressure and a put option position should be initiated. Let’s take a closer look at price charts and how this tool will lead us to the path of success. Daily Price Trend of a Stock Is Increasing = Call Option Position Daily Price Trend of a Stock Is Deceasing = Put Option Position Using Price Charts Price charts are a great tool that helps us determine a stock’s price trend. The daily price chart below displays the daily price movement for Apple stock over a one month period. The horizontal axis at the bottom of the chart references the time period of the chart which is one month in this example from March 8th through April 8th. The vertical axis on the right side of the chart represents the price of Apple stock and in this example ranges from 218 to 242. The vertical bars display the daily price movement of the stock. Each vertical bar has a horizontal line which represents the stock’s closing price for the day. On March 22nd the daily bar shows that Apple stock traded in a range from about 220 to 226 (circled). The closing price on March 22nd which is represented by the horizontal bar was about 225. Daily Price Movement 29",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Option Orders",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 72,
    "chunk_index": 45,
    "word_count": 254,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Orders (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "line which represents the stock’s closing price for the day. On March 22nd the daily bar shows that Apple stock traded in a range from about 220 to 226 (circled). The closing price on March 22nd which is represented by the horizontal bar was about 225. Daily Price Movement 29 Determining the Price Trend As noted previously we only want to buy a stock or call option if the buying pressure is exceeding the selling pressure as indicated by the price of the stock trending up. The best time to buy a call option is after the stock is already in a price up trend. We want to avoid stocks that are in a price down trend. Daily price charts like the one just presented for Apple allow us to instantly see the price trend of a stock. We like to take this visual look at a stock’s price movement one step further and actually measure the price movement. The easiest and simplest way to measure price movement is to use what are called ‘moving average lines’. Next, we are going to take a look at when to buy and when to sell. This concept always reminds me of an old Kenny Rogers song: You got to know when to hold 'em, know when to fold 'em - Know when to walk away, know when to run. Yes, with stocks you need to know when a stock is on a ‘buy’ signal or ‘sell’ signal. You are about to learn indicators that can quantitatively measure if a stock is moving up in price or moving down in price. These indicators let us know in advance the most likely future price movement of a stock. We will then know if we want to buy call options or put options. 30",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Option Orders",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 72,
    "chunk_index": 46,
    "word_count": 299,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Orders (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "learn indicators that can quantitatively measure if a stock is moving up in price or moving down in price. These indicators let us know in advance the most likely future price movement of a stock. We will then know if we want to buy call options or put options. 30 Determining the Most Likely Future Price Movement Moving Average lines are a great trading tool that allows us to know in advance the most likely future price movement for a stock. We know the term Moving Average line may seem complicated but a Moving Average line is simply the average closing price of a stock over a specified time period. For example, the 50-Day Moving Average line represents the average closing price of a stock over the past 50 days. Many times the real price trend of a stock can be obscured by the daily price fluctuations. The daily price chart below for Apple stock covers the 3 month period of November, December and January. As we learned in the previous price chart example for Apple, the vertical bars display the daily price movement of the stock. This price chart shows a rally for Apple stock until mid-November and then a price decline into mid-December. This price decline is followed by another rally into the beginning of January followed by another price decline in January. Despite the daily price fluctuations the stock price was little changed over the 3 month period. Three Month Price Action Shows No Clear Trend Daily Price Movement 31",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Option Orders",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 72,
    "chunk_index": 47,
    "word_count": 253,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Orders (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "into mid-December. This price decline is followed by another rally into the beginning of January followed by another price decline in January. Despite the daily price fluctuations the stock price was little changed over the 3 month period. Three Month Price Action Shows No Clear Trend Daily Price Movement 31",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Option Orders",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 72,
    "chunk_index": 48,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Orders (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "Let’s take another look at a price chart for Apple stock that covers a longer time period but includes the November, December and January period just mentioned. This price chart also includes the 100-Day Exponential Moving Average (EMA) line for Apple stock. We prefer to use Exponential Moving Averages over Simple Moving Averages as we have found Exponential Moving Averages to be more accurate in determining the price trend. Exponential Moving Averages give more weighting to recent price movements than Simple Moving Averages which give every day an equal weighting. 100-Day EMA Line is Sloping Up Clearly Indicating a Price Up Trend Daily Price Movement 100-Day EMA Line Trending Up The 100-Day Exponential Moving Average (EMA) line is sloping up clearly indicating Apple stock is in a price up trend. Moving average lines give us an instant visual reference of the current price trend of a stock. 1) If the moving average line is sloping up, the stock is in a price up trend and buying pressure is exceeding selling pressure. Call options should be purchased. 2) If the moving average line is sloping down, the stock is in a price down trend and selling pressure is exceeding buying pressure. Put options should be purchased. It is that simple! Moving averages tell us if a stock is on a ‘buy’ signal or ‘sell’ signal instead of trying to predict the future price movement of a stock. You can easily and quickly obtain moving average lines from numerous websites which will be covered shortly. 32",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Option Orders",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 72,
    "chunk_index": 49,
    "word_count": 254,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Orders (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "purchased. It is that simple! Moving averages tell us if a stock is on a ‘buy’ signal or ‘sell’ signal instead of trying to predict the future price movement of a stock. You can easily and quickly obtain moving average lines from numerous websites which will be covered shortly. 32",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Option Orders",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 72,
    "chunk_index": 50,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Orders (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "Buy and Sell Signals One of the easiest ways to clarify whether a stock is a ‘buy’ or a ‘sell’ is to look at the shorter term 50-Day Exponential Moving Average (EMA) line in relation to the longer term 100-Day Exponential Moving Average (EMA) line. If the shorter term 50-Day EMA line is above the longer term 100-Day EMA line it indicates the price momentum for the stock is to the upside which confirms the price up trend. We should initiate a call option trade for the stock. If the shorter term 50-Day EMA line is below the longer term 100-Day EMA line it indicates the price momentum for the stock is to the downside which confirms the price down trend. We should initiate a put option trade for the stock. 50-Day EMA Line Above 100-Day EMA = Price Up Trend = Buy 50-Day EMA Line Below 100-Day EMA = Price Down Trend = Sell Buying and Selling Pressure When the shorter term 50-Day EMA line is above the longer term 100-Day EMA line it is an indication that the buying pressure for a stock is exceeding the selling pressure. And the most likely future price movement of the stock is up. The stock is on a ‘buy’ signal. When the shorter term 50-Day EMA line is below the longer term 100-Day EMA line it is an indication that the selling pressure for a stock is exceeding the buying pressure. And the most likely future price movement of the stock is down. The stock is on a ‘sell’ signal . 50-Day EMA Line Above 100-Day EMA = Buying Pressure Exceeding Selling Pressure 50-Day EMA Line Below 100-Day EMA = Selling Pressure Exceeding Buying Pressure 33",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Option Orders",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 72,
    "chunk_index": 51,
    "word_count": 285,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Orders (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "is exceeding the buying pressure. And the most likely future price movement of the stock is down. The stock is on a ‘sell’ signal . 50-Day EMA Line Above 100-Day EMA = Buying Pressure Exceeding Selling Pressure 50-Day EMA Line Below 100-Day EMA = Selling Pressure Exceeding Buying Pressure 33",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Option Orders",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 72,
    "chunk_index": 52,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Orders (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "‘Buy’ Signal Example Let’s look at an example of a ‘buy’ signal. The Apple stock daily price chart below displays the 50-Day EMA line and the 100-Day EMA line. The moving average lines indicate that Apple stock entered a price ‘up’ trend in April (circled) as the 50-Day EMA crossed above the 100-Day EMA line. When the 50-Day EMA crossed above the 100-Day EMA it was a good indication that buying pressure was exceeding selling pressure and you want to take bullish option trades for Apple. As long as the 50-Day EMA line remains above the 100-Day EMA line Apple stock remains a ‘buy’ and bullish option trades should be maintained. In this example the Apple 50-Day EMA line crossed above the 100-Day EMA line in April. We purchased Apple stock and call options after the April buy signal. Apple remains in a price ‘up’ trend if the 50-Day EMA line remains above the 100-Day EMA line indicating that buying pressure continues to exceed selling pressure. Monitoring the 50-Day and 100-Day EMA lines is an easy and effective way to determine the current price trend which tells us if we should be taking bullish or bearish option trades for Apple stock. If the 50-Day EMA crosses below the 100-Day EMA it would indicate a reversal to a price ‘down’ trend as the selling pressure is now exceeding the buying pressure. You should take bearish option trades for the stock when this occurs. We will look at an example of a sell signal next. 50-Day EMA line Above 100-Day EMA line = Buy 50-Day EMA Line 100-Day EMA Line Buy 50-Day EMA Crosses Above 100-Day EMA = Buy 34",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Option Orders",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 72,
    "chunk_index": 53,
    "word_count": 278,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Orders (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "buying pressure. You should take bearish option trades for the stock when this occurs. We will look at an example of a sell signal next. 50-Day EMA line Above 100-Day EMA line = Buy 50-Day EMA Line 100-Day EMA Line Buy 50-Day EMA Crosses Above 100-Day EMA = Buy 34",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Option Orders",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 72,
    "chunk_index": 54,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Orders (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "Let’s look at an example of a ‘sell’ signal. The daily price chart below shows the daily price movement and the 50-Day and 100-Day EMA lines for Merck stock. This chart reveals that in February the Merck 50-Day EMA line crossed below the 100-Day EMA line (circled) resulting in an EMA System ‘sell’ signal for Merck stock. When the 50-Day EMA crossed below the 100-Day EMA it was a good indication that selling pressure was exceeding buying pressure and you want to establish bearish option positions for Merck stock. You want to hold on to the bearish option positions for Merck while the price trend is ‘down’ and at this point the length and severity of the price decline is still unknown. As long as the 50-Day EMA line remains below the 100-Day EMA line Merck stock remains a ‘sell’. Merck does not qualify as a buy until the 50-Day EMA line crosses above the 100-Day EMA line. Monitoring the 50-Day and 100-Day EMA lines is an easy and effective way to determine the current price trend which tells us if we should be establishing bullish or bearish option positions for Merck stock. 50-Day EMA Below 100-Day EMA = Sell 50-Day EMA Crosses Below 100-Day EMA Indicating a Price Down Trend Sell 100-Day EMA 50-Day EMA The 50/100-Day EMA trend following system is your road map to investing success. Trend following is a powerful, systematic approach that allows us to profit from the powerful profit opportunities available from trading weekly options. 35",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Sell Signal Example",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 72,
    "chunk_index": 55,
    "word_count": 252,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Sell Signal Example (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "Crosses Below 100-Day EMA Indicating a Price Down Trend Sell 100-Day EMA 50-Day EMA The 50/100-Day EMA trend following system is your road map to investing success. Trend following is a powerful, systematic approach that allows us to profit from the powerful profit opportunities available from trading weekly options. 35",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Sell Signal Example",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 72,
    "chunk_index": 56,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Sell Signal Example (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "Historical Results of EMA System The 50/100-Day EMA System is a rule based system with clearly defined ‘buy’ and ‘sell’ rules. This enabled us to do historical testing with the help of the Omega Research Trade Station program using the 50/100-Day EMA Cross Over System just presented. Historical profit results are based on buying a stock when its 50-Day EMA line crosses above the 100-Day EMA and selling a stock when its 50-Day EMA line crosses below the 100-Day EMA. The profit/loss for each trade is calculated and a cumulative total is maintained for each testing period. The EMA System is universal in nature and has been profitable for short term investing across a wide range of markets including: stocks, options, indexes, closed-end funds, zero coupon bonds, mutual funds, index funds and sector funds. The fact that the system is profitable in virtually every type of market confirms its credibility as a viable, robust approach to trading the financial markets. Included on the following page are profit results for a well-diversified sampling of both growth and value stocks that represent a broad cross section of 26 different industry groups. This sampling includes small, mid and large cap stocks. Historical profit results were generated over a recent twenty four year period. Profitable with Low Risk Keep in mind that four bear markets occurred during this period. Results are based on trading one hundred shares of stock for each ‘buy’ signal and do not include commissions. Let’s review the tests conducted using the first stock tested Aetna Health Care (AET). The first time Aetna’s 50-Day EMA crossed above the 100-Day EMA during the test period one hundred shares of Aetna were purchased at 10.18. The profit/loss for each AET trade was calculated by the Trade Station software and the profits totaled $5,376 over the test period based on trading 100 shares for each buy signal. This $5,376 profit represents a 528% return on the initial investment of $1,018. The software divides the total profits by the total losses to calculate the Reward to Risk Ratio. Aetna had a Reward to Risk Ratio of 3.9 as there were 3.9 dollars of profit for each 1 dollar of loss. There were 10 losing trades over the 24-year period and the average losing trade incurred a -$120 loss. 36",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Sell Signal Example",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 72,
    "chunk_index": 57,
    "word_count": 384,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Sell Signal Example (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "total losses to calculate the Reward to Risk Ratio. Aetna had a Reward to Risk Ratio of 3.9 as there were 3.9 dollars of profit for each 1 dollar of loss. There were 10 losing trades over the 24-year period and the average losing trade incurred a -$120 loss. 36",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Sell Signal Example",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 72,
    "chunk_index": 58,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Sell Signal Example (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "24-Years of Historical Results Stock Profit on Profit Initial Cost % Return on Avg 100 Shares Factor 100 Shares Initial Cost Loss Aetna $5,376 3.9 $1018 528% -120 Adobe Systems $5,679 4.4 $5 126200% -173 Altria $4,602 3.2 $220 2092% -180 Analog Devices $3,559 2.0 $92 3868% -251 Applied Materials $2,419 3.0 $3 96760% -70 Auto Data Process $2,878 3.5 $182 1581% -98 Bunge $3,282 100.0 $1,585 207% 0 Centex $3,810 4.3 $216 1764% -143 Cisco Systems $5,474 10.1 $8 68425% -100 Corning $6,153 12.4 $178 3457% -54 CVS Drug $4,237 2.7 $505 839% -250 Eaton Vance $1,682 6.7 $10 16820% -27 eBay $2,453 3.7 $120 2044% -156 EMC Corp $7,257 80.0 $5 145140% -18 Franklin Resources $5,264 3.2 $5 112000% -18 General Electric $3,675 5.2 $130 2827% -97 Golden West Fin’l $3,700 4.4 $40 9250% -78 Home Depot $4,092 4.0 $4 102300% -174 Illinois Tool Works $5,924 4.8 $176 3366% -225 Intel $2,845 3.5 $39 7295% -71 Johnson & Johnson $4,877 4.5 $227 2148% -181 KB Homes $6,654 3.4 $840 792% -202 Legg Mason $4,212 7.1 $187 2252% -78 Microsoft $2,651 2.8 $10 26510% -108 M&T Bank $6,445 5.5 $37 17419% -95 NVR Inc $50,070 5.0 $1,080 4636% -1050 PMC Sierra $15,603 41.5 $225 6935% -48 Procter & Gamble $3,096 3.1 $223 1388% -108 Sun Microsystems $3,342 7.5 $25 13368% -26 Texas Instruments $4,227 3.7 $184 2297% -111 Taro Pharma $4,551 4.7 $87 5231% -113 Unitedhealth $7,627 9.5 $32 23834% -91 Water Corp $4,898 4.5 $375 1306% -471 Yahoo! $7,964 63.0 $132 6033% -129 Totals / Averages $210,578 12.7 $8,204 2,567% -150 37",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Sell Signal Example",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 72,
    "chunk_index": 59,
    "word_count": 264,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Sell Signal Example (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "-108 Sun Microsystems $3,342 7.5 $25 13368% -26 Texas Instruments $4,227 3.7 $184 2297% -111 Taro Pharma $4,551 4.7 $87 5231% -113 Unitedhealth $7,627 9.5 $32 23834% -91 Water Corp $4,898 4.5 $375 1306% -471 Yahoo! $7,964 63.0 $132 6033% -129 Totals / Averages $210,578 12.7 $8,204 2,567% -150 37",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Sell Signal Example",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 72,
    "chunk_index": 60,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Sell Signal Example (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "Average Yearly Return of 107% The total initial investment required to buy 100 shares of each of the 34 stocks over the test period was $8,204. This $8,204 initial investment produced a total of $210,578 in profits over the test period which equates to a 2,567% return. The average yearly return was 107% which would enable us to double our initial investment every year on average. This average 107% annual return was achieved without the use of leverage or margin. Trading options instead of stock would have resulted in a much higher rate of return over the test period as options provide leverage. The historical results demonstrate that the EMA System has the ability to produce ample profits with very low risk. Of the trades that were losing trades, the average loss over the twenty four year period was $150 and when compared to the total profits of $210,578 demonstrates the ability of the system to keep losses to a minimum. The average Reward to Risk ratio was a very healthy 12.7 with over 12 dollars of profit for each 1 dollar of loss again demonstrating a very healthy risk-adjusted return. The preceding investing results demonstrate the importance of ‘investing with the trend’ if you are a short term investor. The 50/100-Day EMA System allows us to know in advance the most likely future price movement of a stock and reduces the entry and exit timing risk associated with short term investing. It is a versatile, effective method for profiting in any type of market and can quickly identify stocks on a ‘buy’ or ‘sell’ signal. This allows us to profit from trading options by purchasing call options for a stock on a 50/100-Day EMA System ‘buy’ signal and purchasing put options for a stock on a 50/100-Day EMA System ‘sell’ signal. Equally important is the ability of the system to avoid large losses which can quickly ruin an investment plan. The system keeps losses to a minimum and almost always exits a trade before a big loss occurs. Following a discipline that keeps losses to a minimum is one of the most important characteristics of a successful short term investing program. Keep in mind that the worst bear market since 1932 occurred during this test period. 38",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Sell Signal Example",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 72,
    "chunk_index": 61,
    "word_count": 378,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Sell Signal Example (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "and almost always exits a trade before a big loss occurs. Following a discipline that keeps losses to a minimum is one of the most important characteristics of a successful short term investing program. Keep in mind that the worst bear market since 1932 occurred during this test period. 38",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Sell Signal Example",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 72,
    "chunk_index": 62,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Sell Signal Example (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "The 50-Day and 100 Day-EMA Lines Are the ‘Key’ to Developing a Profitable Strategy The stock market is in a constant state of flux. The constant up and down price movement of a stock makes it difficult at times to see the real price trend of a stock. That is why it is important for an investor to become comfortable with the 50/100-Day EMA lines. The position of the 50-Day EMA in relation to the 100-Day EMA gives us a quick and accurate indication of a stock’s current price trend. If the stock is in a price up trend call option trades should be initiated. And if the stock is in a price down trend put option trades should be initiated. In order to be a successful option investor we do not have to know what an analyst’s rating is for a stock or the current earnings projection. All of that information is already reflected in a stock’s price movement which can be quantitatively measured by the 50/100-Day EMA lines. This simple but effective trend following system is mechanical in nature and instantly tells you if you should be taking a bullish or bearish option position. We prefer mechanical systems as they take the emotion out of trading. There is no judgment or interpretation involved. You don’t have to rely on trying to predict future price movement. Follow the Price Trend Instead of Trying to Predict It “Prediction is very difficult, especially if it’s about the future.” - Nils Bohr The 50/100-Day EMA System allows us to ‘invest with the trend’ instead of trying to predict the price direction of a stock. The historical studies presented demonstrate that price trends tend to continue in the same direction and can continue on longer than one may initially expect. Our investing experience confirms that the 50/100-Day EMA System allows us to know in advance the most likely future price movement of a stock and whether we should be initiating bullish or bearish option trades. 39",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Sell Signal Example",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 72,
    "chunk_index": 63,
    "word_count": 333,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Sell Signal Example (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "in the same direction and can continue on longer than one may initially expect. Our investing experience confirms that the 50/100-Day EMA System allows us to know in advance the most likely future price movement of a stock and whether we should be initiating bullish or bearish option trades. 39",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Sell Signal Example",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 72,
    "chunk_index": 64,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Sell Signal Example (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "Surviving the Financial Armageddon By John Weston There are times in your life that you will never forget. Dates that you know exactly where you were and what you were doing. In our family we have this thing about remembering where you were on significant events in history. My Grandfather would always say that he was out looking for his kids the day Pearl Harbor was attacked. My Dad was collecting glass bottles for money on the beach the day that the stock market crashed in 1929. My Mom was home watching TV the day President Kennedy was assassinated. I was at the office during the terrorist attack on September 11th. I remember sitting there watching the TV with utter disbelief and terror. Unfortunately, I now have another unpleasant day to remember. I am thankful that no one has injured or killed. But the loss of people’s dreams and financial security became palpable. That day would be September 15, 2008. This day will go down in history as the beginning of the worst financial crisis in the United States since the Great Depression. Due to the Lehman Brothers and Fannie Mae bankruptcy, the Merrill Lynch buyout and the AIG insurance company insolvency, today could be considered one of the worst global financial storms in history. Some call it a ‘Financial Armageddon’. Over thirty trillion dollars of highly leveraged mortgage securities that went bad have caused a financial meltdown that has frozen global credit. The day of September 15, 2008 started out no different than most. I was cruising into my desk that morning nursing my second cup of coffee, entertaining thoughts of when the market volatility is going to give us a decisive trend. Well, be careful what you wish for . . . the market was about to show us and the rest of the world a very decisive trend. The market began a precipitous sell off. Of course, Chuck Hughes was already on top of it . . . in the early AM hours he knew the Asian markets were selling off. He had a feeling already that things were going south and the ride was going to be a rough one. Fortunately, Chuck’s trend following system had already positioned us on the right side of the trend in the global currency, commodity and equity markets. In Chuck Hughes’ August blog he recommended that readers take short positions in the global markets just as he had done over the summer. The trend following system issued ‘go short’ signals for most foreign currencies, commodities and equity markets in the June – July time frame. By the end of the day the Dow Jones Industrial Average had lost over 500 points in ONE DAY! But Chuck’s ETF option trading accounts had a positive return for the day. The copy of his brokerage account Profit/Loss Report that follows shows $14,987.22 in closed trade profits on September 15th and his open trades had a 14.5% return for the day. His other three global ETF trading accounts had similar returns. Chuck Hughes locked in solid profits today. 40",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Sell Signal Example",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 72,
    "chunk_index": 65,
    "word_count": 515,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Sell Signal Example (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "the day. The copy of his brokerage account Profit/Loss Report that follows shows $14,987.22 in closed trade profits on September 15th and his open trades had a 14.5% return for the day. His other three global ETF trading accounts had similar returns. Chuck Hughes locked in solid profits today. 40 14.5% Return in One Day While Dow Dropped 504 Points Sept 15th Closed Trades Open Trade Profit 41 Downloading On the 50/100-Day EMA Lines The 50/100-Day EMA Lines can be easily downloaded from www.StockCharts.com. On the home page type in the stock symbol and click “Go”. In this example we typed in the symbol for Apple stock AAPL. Once you click “Go” the default chart for Apple will appear. Below the default chart for Apple select “Daily” under Periods and “1 Year” under Range. Under Overlays select “Exp Mov. Avg” and Under Parameters select “50”. Then select “Exp Mov. Avg” on the second row and Under Parameters select “100”. Click “Update” and the Apple price chart with the 50/100-Day EMA Lines will be displayed (see price chart on the following page). 42 Apple One Year Price Chart with 50/100-Day EMA Lines 43",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Sell Signal Example",
    "page_number": 41,
    "page_range": "p.41-44",
    "total_pages": 72,
    "chunk_index": 66,
    "word_count": 192,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Sell Signal Example (p.41-44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "Parameters select “50”. Then select “Exp Mov. Avg” on the second row and Under Parameters select “100”. Click “Update” and the Apple price chart with the 50/100-Day EMA Lines will be displayed (see price chart on the following page). 42 Apple One Year Price Chart with 50/100-Day EMA Lines 43 Confirming the Price Trend On any given day there can be hundreds of stocks and ETFs on a ‘buy’ or ‘sell’ signal using the 50/100-Day EMA System. The challenge lies in narrowing down the list of ‘buys’ to the stocks/ETFs with the best profit potential so that we may establish call option trades. And narrowing down the list of ‘sells’ to the stocks/ETFs with the best profit potential so that we may establish put option trades. The 50/100-Day EMA System is a simple, systematic, approach for determining a stock’s price trend. This systematic approach has produced consistent profits during all types of market conditions. The second Step in the Prime Trade Select process is confirming the price trend. In our experience, one of the simplest but most effective methods for confirming the price trend is volume flow. Prices do not move without buyers and sellers. Volume flow precedes price and is the key to measuring the validity and sustainability of a price trend. Our favorite volume indicator is the On Balance Volume line. On Balance Volume measures volume flow. When a stock closes up for the day, volume is added to the line and when a stock closes down volume is subtracted from the line. A cumulative total of the volume additions and subtractions form the On Balance Volume line. On Balance Volume Indicator ● When Close is Up Volume is Added ● When Close is Down Volume is Subtracted ● A Cumulative Total of Additions and Subtractions Form the OBV Line 44",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Sell Signal Example",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 72,
    "chunk_index": 67,
    "word_count": 303,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Sell Signal Example (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "the line. A cumulative total of the volume additions and subtractions form the On Balance Volume line. On Balance Volume Indicator ● When Close is Up Volume is Added ● When Close is Down Volume is Subtracted ● A Cumulative Total of Additions and Subtractions Form the OBV Line 44 Let’s now look at an example of how we use the On Balance Volume indicator to confirm the price trend. The price chart below displays the daily price movement for Riverbed stock. Below the price chart is an example of the On Balance Volume line for Riverbed stock. The numerical value of the On Balance Volume line is not important. We simply want to see an up sloping line to confirm a price up trend. We can see from chart below that the On Balance Volume line is sloping up. An up sloping line indicates that the volume is heavier on up days and buying pressure is exceeding selling pressure. Buying pressure must continue to exceed selling pressure in order to sustain a price up trend. So On Balance Volume is a simple indicator to use that confirms the price up trend and the sustainability of the price up trend. Normally we only want to establish call option positions on stocks/ETFs with an up sloping On Balance Volume line. Limiting call option trades to stocks/ETFs with an up sloping On Balance Volume line helps us further narrow down our list of potential stocks/ETFs to trade. On Balance Volume Line 45",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Sell Signal Example",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 72,
    "chunk_index": 68,
    "word_count": 250,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Sell Signal Example (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "Normally we only want to establish call option positions on stocks/ETFs with an up sloping On Balance Volume line. Limiting call option trades to stocks/ETFs with an up sloping On Balance Volume line helps us further narrow down our list of potential stocks/ETFs to trade. On Balance Volume Line 45 Let’s now look at an example of how we use the On Balance Volume indicator to confirm a price down trend. The price chart below displays the daily price movement for the Brazil ETF. Below the price chart is an example of the On Balance Volume line for the Brazil ETF. As previously mentioned, the numerical value of the On Balance Volume line is not important. We simply want to see a down sloping line to confirm a price down trend. We can see from chart below that the On Balance Volume line is sloping down. A down sloping line indicates that the volume is heavier on down days and selling pressure is exceeding buying pressure. Selling pressure must continue to exceed buying pressure in order to sustain a price down trend. The On Balance Volume is confirming the price down trend and the sustainability of the price down trend. Normally we only want to establish put option positions on stocks/ETFs with a down sloping On Balance Volume line. Limiting put option trades to stocks/ETFs with a down sloping On Balance Volume line helps us further narrow down our list of potential stocks/ETFs to trade. On Balance Volume Line 46",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Sell Signal Example",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 72,
    "chunk_index": 69,
    "word_count": 250,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Sell Signal Example (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "Normally we only want to establish put option positions on stocks/ETFs with a down sloping On Balance Volume line. Limiting put option trades to stocks/ETFs with a down sloping On Balance Volume line helps us further narrow down our list of potential stocks/ETFs to trade. On Balance Volume Line 46",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Sell Signal Example",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 72,
    "chunk_index": 70,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Sell Signal Example (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "● Volume is Heavier On Days Stock Closes Up ● Volume is Lighter On Days Stock Closes Down ● Buying Pressure is Exceeding Selling Pressure ● Helps Sustain Price Up Trend Down Sloping On Balance Volume Line ● Volume is Heavier On Days Stock Closes Down ● Volume is Lighter On Days Stock Closes Up ● Selling Pressure is Exceeding Buying Pressure ● Helps Sustain Price Down Trend On Balance Volume Is a Useful Tool to Confirm the Price Trend For Virtually Any Market 47 The price chart below displays the daily price movement for Home Depot stock. Below the price chart is the On Balance Volume line for Home Depot stock. We can see from chart that the On Balance Volume line is sloping up indicating volume is heavier on up days and buying pressure is exceeding selling pressure. The up sloping On Balance Volume line confirms the price up trend and the sustainability of the price up trend. Confirmed Up Trend ● Stock price is trending up with 50-Day EMA line above 100-Day EMA line ● Volume is increasing on days a stock closes up ● Volume is decreasing on days a stock closes down 50-Day EMA 100-Day EMA OBV Line Sloping Up 48",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Up Sloping On Balance Volume Line",
    "page_number": 47,
    "page_range": "p.47-49",
    "total_pages": 72,
    "chunk_index": 71,
    "word_count": 206,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Up Sloping On Balance Volume Line (p.47-49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "the price up trend. Confirmed Up Trend ● Stock price is trending up with 50-Day EMA line above 100-Day EMA line ● Volume is increasing on days a stock closes up ● Volume is decreasing on days a stock closes down 50-Day EMA 100-Day EMA OBV Line Sloping Up 48 And the price chart below displays the daily price movement for the Brazil ETF. Below the price chart is the On Balance Volume line for the Brazil ETF. We can see from chart that the On Balance Volume line is sloping down indicating volume is heavier on down days and selling pressure is exceeding buying pressure. The down sloping On Balance Volume line confirms the price down trend and the sustainability of the price down trend. Confirmed Down Trend ● Stock price is trending down with 50-Day EMA line below 100-Day EMA line ● Volume is increasing on days a stock closes down ● Volume is decreasing on days a stock closes up 50-Day EMA 100-Day EMA OBV Line Sloping Down 49",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Up Sloping On Balance Volume Line",
    "page_number": 49,
    "page_range": "p.49",
    "total_pages": 72,
    "chunk_index": 72,
    "word_count": 172,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Up Sloping On Balance Volume Line (p.49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "the price down trend. Confirmed Down Trend ● Stock price is trending down with 50-Day EMA line below 100-Day EMA line ● Volume is increasing on days a stock closes down ● Volume is decreasing on days a stock closes up 50-Day EMA 100-Day EMA OBV Line Sloping Down 49 On Balance Volume can be easily downloaded from www.StockCharts.com. On the home page type in the stock symbol and click “Go”. In this example we typed in the symbol for Apple stock AAPL. Once you click “Go” the default chart for Apple will appear. Below the default chart for Apple select “Daily” under Periods and “1 Year” under Range. Under Indicators select “On Balance Volume”. Click “Update” and the Apple price chart with the On Balance Line will be displayed (see price chart on the following page). 50 Apple One Year Price Chart with On Balance Volume Line Below On Balance Volume Line 51",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Downloading On Balance Volume",
    "page_number": 50,
    "page_range": "p.50-51",
    "total_pages": 72,
    "chunk_index": 73,
    "word_count": 154,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Downloading On Balance Volume (p.50-51)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "and “1 Year” under Range. Under Indicators select “On Balance Volume”. Click “Update” and the Apple price chart with the On Balance Line will be displayed (see price chart on the following page). 50 Apple One Year Price Chart with On Balance Volume Line Below On Balance Volume Line 51 $254,006.83 Profit, Average Return 114.9% Our brokerage portfolio statement below contains examples of call options we purchased using Prime Trade Select. This portfolio has an open trade profit of $254,006.83 and an average return of 114% with no losing trades. Apple Option + 70.2% Cameron Option + 117.8% Freeport Option + 116.2% Fluor Corp Option + 146.7% Google Option + 2.2% Google Option + 120.0% Celgene Option + 0.6% Nat’l Oil Option + 84.2% Apple Option + 182.5% RIMM Option + 167.9% Transocean Option + 49.5% Note: In this portfolio, we traded multiple option contracts. Trading one contract would require considerably less trading capital. 52",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Option Portfolio Snapshot",
    "page_number": 52,
    "page_range": "p.52",
    "total_pages": 72,
    "chunk_index": 74,
    "word_count": 155,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Option Portfolio Snapshot (p.52)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "+ 146.7% Google Option + 2.2% Google Option + 120.0% Celgene Option + 0.6% Nat’l Oil Option + 84.2% Apple Option + 182.5% RIMM Option + 167.9% Transocean Option + 49.5% Note: In this portfolio, we traded multiple option contracts. Trading one contract would require considerably less trading capital. 52 Our brokerage confirmation below shows we purchased 15 Apple October 130-Strike call options at 14.00 points. We used Prime Trade Select to select this option. Apple was in a confirmed price up trend. The AAPL 50-Day EMA was above the 100-Day EMA and the On Balance Volume line was sloping up confirming the price up trend. 50-Day EMA Above 100-Day EMA On Balance Volume Line Sloping Up 53 In this trade example, our brokerage confirmation below shows we purchased 10 of the FCX Jun 65-Strike call options at 7.20 points using Prime Trade Select which was on a ‘buy’ signal. FCX was in a confirmed price up trend with the 50-Day EMA was above the 100-Day EMA and the On Balance Volume line was sloping up confirming the price up trend. 50-Day EMA Above 100-Day EMA On Balance Volume Line Sloping Up 54 And in this trade example on April 23rd we purchased the Express Scripts Jun 80-Strike call option symbol XTQFP (ESRX subsequently had a stock split) at 10.18 using Prime Trade Select which was on a ‘buy’ signal. Like Apple and FCX, the Express Scripts On Balance Volume line was sloping up confirming the price up trend. 50-Day EMA Above 100-Day EMA OBV Line Sloping Up 55",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Call Option Trade Examples",
    "page_number": 53,
    "page_range": "p.53-55",
    "total_pages": 72,
    "chunk_index": 75,
    "word_count": 259,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Call Option Trade Examples (p.53-55)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "option symbol XTQFP (ESRX subsequently had a stock split) at 10.18 using Prime Trade Select which was on a ‘buy’ signal. Like Apple and FCX, the Express Scripts On Balance Volume line was sloping up confirming the price up trend. 50-Day EMA Above 100-Day EMA OBV Line Sloping Up 55 Let’s take a look next at the details of the call option trade examples just presented so that you can understand the important concept of leverage and how leverage can provide a high rate of return. Remember that even though these call option trades use leverage, they are all limited risk trades and you can’t lose more than your initial investment regardless of adverse market moves. Our brokerage account Profit/Loss Report below shows that on October 5th we closed out the 15 Apple Oct 130-Strike call options at 30.30 points resulting in a $24,392.27 net profit after commissions and a 116% return for the option trade. On August 31st when we purchased the AAPL options, Apple stock was trading at 139.20. When we sold the options on October 5th AAPL stock was trading at 158.40. Purchasing Apple stock at 139.20 on August 31st and selling on October 5th at 158.40 would result in a 13.8% return. Over the same period of time our option trade produced a 116% return which is 8.4 times greater than the stock trade demonstrating the leverage available from trading options. Option Return 8.4 Times Greater Than Stock Return Purchase Sale Point Percent Price Price Profit Return Stock 139.20 158.40 19.20 13.8% Option 14.00 30.30 16.30 116.4% 56",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Call Option Trade Examples",
    "page_number": 56,
    "page_range": "p.56",
    "total_pages": 72,
    "chunk_index": 76,
    "word_count": 262,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Call Option Trade Examples (p.56)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "our option trade produced a 116% return which is 8.4 times greater than the stock trade demonstrating the leverage available from trading options. Option Return 8.4 Times Greater Than Stock Return Purchase Sale Point Percent Price Price Profit Return Stock 139.20 158.40 19.20 13.8% Option 14.00 30.30 16.30 116.4% 56 13.8% Stock Return = 116% Option Return Option Return 840% Greater Than Stock Return 120.0% 100.0% Option Return 80.0% 60.0% 40.0% Stock Return 20.0% 0.0% Aug 31st Oct 5th 8.4 to 1 Leverage = Profit Opportunity Options Are Highly Leveraged and Can Provide a High Rate of Return Stock Investor ● Buys Apple Stock at 139.20 ● Stock Increases 13.8% to 158.40 Results: ● Big Investment $13,920 ● Small Profit 13.8% Option Investor ● Buys 130-Strike Call Option for $1,400 ● Stock Increases 13.8% to 158.40 ● Call Option Increases in Value to 30.30 Results: ● Small Investment $1,400 ● Big Profit 116% Which Allows a High Rate of Return 57",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Call Option Trade Examples",
    "page_number": 57,
    "page_range": "p.57-58",
    "total_pages": 72,
    "chunk_index": 77,
    "word_count": 161,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Call Option Trade Examples (p.57-58)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "158.40 Results: ● Big Investment $13,920 ● Small Profit 13.8% Option Investor ● Buys 130-Strike Call Option for $1,400 ● Stock Increases 13.8% to 158.40 ● Call Option Increases in Value to 30.30 Results: ● Small Investment $1,400 ● Big Profit 116% Which Allows a High Rate of Return 57 FCX and ESRX Trade Examples Our brokerage account confirmations below display the FCX and ESRX call option purchase examples previously presented. We purchased 10 of the FCX Jun 65-Strike call options at 7.20 points and 10 of the ESRX Jun 80-Strike call options 10.18 points. Our brokerage account Profit/Loss Report below shows that we sold the FCX calls at 16.35 points and the ESRX calls at 22.40 points. This resulted in a $9,099.72 profit and a 126% return for FCX and a $12,199.65 profit and a 119% return for ESRX. Over the same time period purchasing FCX would have produced a 14.8% return compared to the 126% return for the option. The option purchase provided 8.5 to 1 leverage compared to the stock purchase. FCX Option Return 8.5 Times Greater Than Stock Return Purchase Sale Point Percent Price Price Profit Return Stock 71.15 81.75 10.60 14.8% Option 7.20 16.35 9.15 126% 58",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Call Option Trade Examples",
    "page_number": 58,
    "page_range": "p.58-59",
    "total_pages": 72,
    "chunk_index": 78,
    "word_count": 202,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Call Option Trade Examples (p.58-59)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "return compared to the 126% return for the option. The option purchase provided 8.5 to 1 leverage compared to the stock purchase. FCX Option Return 8.5 Times Greater Than Stock Return Purchase Sale Point Percent Price Price Profit Return Stock 71.15 81.75 10.60 14.8% Option 7.20 16.35 9.15 126% 58 And purchasing ESRX stock would have produced a 15.4% return over the same time period compared to the 119% return for the ESRX option. The option purchase provided 7.7 to 1 leverage compared to the stock purchase. ESRX Option Return 7.7 Times Greater Than Stock Return Purchase Sale Point Percent Price Price Profit Return Stock 88.30 101.90 13.60 15.4% Option 10.18 22.40 12.22 119% The Power of Leverage On average these three option trade examples provided 8.2 times more profit compared to the purchase of their underlying stocks over the same time period. The 8.2 to 1 leverage provided by options can dramatically increase profit results. 59",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Call Option Trade Examples",
    "page_number": 59,
    "page_range": "p.59",
    "total_pages": 72,
    "chunk_index": 79,
    "word_count": 157,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Call Option Trade Examples (p.59)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "13.60 15.4% Option 10.18 22.40 12.22 119% The Power of Leverage On average these three option trade examples provided 8.2 times more profit compared to the purchase of their underlying stocks over the same time period. The 8.2 to 1 leverage provided by options can dramatically increase profit results. 59 Let’s now take a look at using Prime Trade Select to select weekly option purchases. We have been trading weekly options since 2010 and have had great success using Prime Trade Select to trade weekly options. There are 52 opportunities per year to profit from weekly options compared to 12 opportunities per year for monthly options. Weekly options start trading on Thursday and expire the following Friday and have a life of 6 trading days. Weekly Option Trade Examples The daily price graph below shows Microsoft in a price up trend with the 50-Day EMA above the 100-Day EMA. The price up trend is confirmed with an up sloping On Balance Volume line. Confirmed Price Up Trend for Microsoft: 1) 50-Day EMA above 100-Day EMA = Buy 2) On Balance Volume line is sloping up 50-Day EMA Above 100-Day EMA On Balance Volume Line Sloping Up 60",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Trading Weekly Options",
    "page_number": 60,
    "page_range": "p.60-61",
    "total_pages": 72,
    "chunk_index": 80,
    "word_count": 197,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Trading Weekly Options (p.60-61)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "100-Day EMA. The price up trend is confirmed with an up sloping On Balance Volume line. Confirmed Price Up Trend for Microsoft: 1) 50-Day EMA above 100-Day EMA = Buy 2) On Balance Volume line is sloping up 50-Day EMA Above 100-Day EMA On Balance Volume Line Sloping Up 60 With Microsoft in a confirmed price up trend, we purchased weekly call options for Microsoft which profit when Microsoft stock moves up in price. Our brokerage account Realized Gain/Loss Report below shows we purchased 5 of the MSFT Feb 18 30-Strike weekly calls at .52 points on February 14th and sold these calls four days later on February 17th at 1.18 points which resulted in a 126.6% return in four days. Bought 5 MSFT Feb 18 30-Strike calls at .52 on Feb 14 Sold 5 calls at 1.18 on Feb 17 for 126.6% gain Over the same four day period we owned the MSFT 30-Strike weekly call options, the price of Microsoft stock increased 3.2%. In this example the MSFT weekly option out performed Microsoft stock 39 to 1 (126.6%/3.2% = 39.5) demonstrating the tremendous leverage available with weekly options. Option Trade Provided 39 to 1 Leverage ● MSFT Option Trade Produced 126.6% Return ● Over the Same 4-Day Time Period MSFT Stock Increased 3.2% ● Option Trade Provided 39 to 1 Leverage Compared to Stock Trade 61 Option Trade Provided 39 to 1 Leverage Microsoft Option Return vs Stock Return 140% 120% 100% Option Return 80% 60% 40% Stock Return 20% 0% Feb 14 Feb 17 62",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Trading Weekly Options",
    "page_number": 61,
    "page_range": "p.61-62",
    "total_pages": 72,
    "chunk_index": 81,
    "word_count": 258,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Trading Weekly Options (p.61-62)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "4-Day Time Period MSFT Stock Increased 3.2% ● Option Trade Provided 39 to 1 Leverage Compared to Stock Trade 61 Option Trade Provided 39 to 1 Leverage Microsoft Option Return vs Stock Return 140% 120% 100% Option Return 80% 60% 40% Stock Return 20% 0% Feb 14 Feb 17 62 Let’s look at another example of a weekly option purchase trade. The daily price graph below shows Home Depot in a price up trend with the 50-Day EMA above the 100-Day EMA. The price up trend is confirmed with an up sloping On Balance Volume line. Confirmed Price Up Trend for Home Depot: ● 50-Day EMA above 100-Day EMA = Buy ● On Balance Volume line is sloping up 50-Day EMA Above 100-Day EMA On Balance Volume Line Sloping Up 63",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Trading Weekly Options",
    "page_number": 63,
    "page_range": "p.63-64",
    "total_pages": 72,
    "chunk_index": 82,
    "word_count": 131,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Trading Weekly Options (p.63-64)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "EMA. The price up trend is confirmed with an up sloping On Balance Volume line. Confirmed Price Up Trend for Home Depot: ● 50-Day EMA above 100-Day EMA = Buy ● On Balance Volume line is sloping up 50-Day EMA Above 100-Day EMA On Balance Volume Line Sloping Up 63 With Home Depot in a confirmed price up trend, we purchased weekly call options for Home Depot. Our brokerage account Realized Gain/Loss Report below shows we purchased 5 of the HD Feb 18 46-Strike weekly calls at .31 points on February 14th and sold these calls four days later on February 17th at .50 points which resulted in a 61.2% return in four days. Bought 5 HD Feb 18 46-Strike calls at .31 on Feb 14 Sold 5 calls at .50 on Feb 17 for 61.2% gain Trade a Portfolio of 5 Weekly Options with $270 Investment When we trade weekly options we like to purchase options on stocks in different industry groups to help diversify our portfolio. Our brokerage account Realized Gain/Loss Report below shows we purchased options on stocks in 5 different industry groups. The average cost of these options was .54 points or $54 per option. If you traded one contract for each of the five options, your total investment would be $270. This portfolio had an average return of 82.7% over a four day period with no losing trades. Average Weekly Return of 82.7%, Average Cost of $54 Per Option Total Cost of $270 to Purchase Portfolio of 5 Options 64",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Trading Weekly Options",
    "page_number": 64,
    "page_range": "p.64",
    "total_pages": 72,
    "chunk_index": 83,
    "word_count": 255,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Trading Weekly Options (p.64)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "each of the five options, your total investment would be $270. This portfolio had an average return of 82.7% over a four day period with no losing trades. Average Weekly Return of 82.7%, Average Cost of $54 Per Option Total Cost of $270 to Purchase Portfolio of 5 Options 64 And our brokerage account Realized Gain/Loss Report below shows another portfolio of weekly options we purchased in different industry groups. The average cost of these options was .59 points or $59 per option. If you traded one contract for each of the four options your total investment would be $236. This week the Mar 02 weekly option portfolio had an average return of 83.6% over the one week period with no losing trades. Average Weekly Return of 83.6% Average Cost of $59 Per Option Total Cost of $236 to Purchase Portfolio of 4 Options 65",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Trading Weekly Options",
    "page_number": 65,
    "page_range": "p.65-66",
    "total_pages": 72,
    "chunk_index": 84,
    "word_count": 145,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Trading Weekly Options (p.65-66)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "total investment would be $236. This week the Mar 02 weekly option portfolio had an average return of 83.6% over the one week period with no losing trades. Average Weekly Return of 83.6% Average Cost of $59 Per Option Total Cost of $236 to Purchase Portfolio of 4 Options 65 Four Advantages of Options Investing 1. Size Doesn’t Matter Options can be traded in almost any size account. This allows traders with small trading accounts to take part in this opportunity. Options can be purchased for as little as $50 dollars and a diversified options portfolio can be established with just a few hundred dollars. 2. Risk Is Limited Risk is limited to the purchase price of the call option regardless of how far the underlying stock may fall in price. With option purchases you are not required to add funds to your account with adverse market moves and there is no threat of margin calls. 3. High Leverage Options provide substantially more leverage than stocks and mutual funds. A 10% price increase in a stock can easily produce a 100% return for the related call option. 4. Profit Potential Is Not Limited Most importantly option profit potential is not limited. When you purchase a call option, the value of the option intrinsic value increases ‘dollar for dollar’ as the price of the underlying stock moves above the strike price of the call option purchased. 66 Copies of Chuck’s Tax Returns: $460,164 Option Profits Year 1 Copies of Tax Returns from Chuck’s first two years of trading showing $460,164 in option profits 67",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Trading Weekly Options",
    "page_number": 66,
    "page_range": "p.66-67",
    "total_pages": 72,
    "chunk_index": 85,
    "word_count": 263,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Trading Weekly Options (p.66-67)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "value increases ‘dollar for dollar’ as the price of the underlying stock moves above the strike price of the call option purchased. 66 Copies of Chuck’s Tax Returns: $460,164 Option Profits Year 1 Copies of Tax Returns from Chuck’s first two years of trading showing $460,164 in option profits 67 Copies of Chuck’s Tax Returns: $460,164 Option Profits Year 2 Copies of Tax Returns from Chuck’s first two years of trading showing $460,164 in option profits 68",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Trading Weekly Options",
    "page_number": 68,
    "page_range": "p.68",
    "total_pages": 72,
    "chunk_index": 86,
    "word_count": 77,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Trading Weekly Options (p.68)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "Returns: $460,164 Option Profits Year 1 Copies of Tax Returns from Chuck’s first two years of trading showing $460,164 in option profits 67 Copies of Chuck’s Tax Returns: $460,164 Option Profits Year 2 Copies of Tax Returns from Chuck’s first two years of trading showing $460,164 in option profits 68 Produces $1.7 Million in Actual Profits With An Average Return of 223.5% Copies of our brokerage account Profit/Loss Reports for our two option trading accounts that follow show that we have $1,756,533.72 in open trade profits. There are 18 winning trades and no losing trades resulting in 100% accuracy. The average return per trade is 223.5%. Trading Account #1 $1,356,052.06 Profit 69 Trading Account #2 $400,481.66 Profit 70",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Prime Trade Select",
    "page_number": 69,
    "page_range": "p.69-71",
    "total_pages": 72,
    "chunk_index": 87,
    "word_count": 118,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Prime Trade Select (p.69-71)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "Reports for our two option trading accounts that follow show that we have $1,756,533.72 in open trade profits. There are 18 winning trades and no losing trades resulting in 100% accuracy. The average return per trade is 223.5%. Trading Account #1 $1,356,052.06 Profit 69 Trading Account #2 $400,481.66 Profit 70 Optioneering™ Advisory Service The Hughes Optioneering™ Team makes trade recommendations for the Optioneering™ Trading Strategies through the Weekly Option Advisory Service. Advisory members receive access to an exclusive 'Members Only' proprietary web page enabling members to benefit from the continued success of the Hughes Optioneering™ Trading Strategies. Email alerts are sent to members with specific instructions whenever there is a new trade recommendation or if an existing trade is closed out. Portfolios of the trade recommendations are maintained and prices are updated real time so members can track the profit performance of every trade recommendation. A closed trade record of all closed trades is also maintained so that a full accounting of all trade recommendations is always available. Membership Benefits: ● Personal consultations with the Hughes Optioneering™ Team by phone or email ● Full support from the Hughes Optioneering™ Team to help you implement the trade recommendations ● Receive clear and concise ‘buy’, ‘sell’ or ‘hold’ signals that eliminate guesswork ● Frees up your time spent on research ● Receive access to actual open trade and closed trade profit results that give you an instant ‘picture’ of how a strategy is performing 71",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Prime Trade Select",
    "page_number": 71,
    "page_range": "p.71-72",
    "total_pages": 72,
    "chunk_index": 88,
    "word_count": 243,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Prime Trade Select (p.71-72)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  },
  {
    "text": "implement the trade recommendations ● Receive clear and concise ‘buy’, ‘sell’ or ‘hold’ signals that eliminate guesswork ● Frees up your time spent on research ● Receive access to actual open trade and closed trade profit results that give you an instant ‘picture’ of how a strategy is performing 71 If you would like to learn more about becoming a member of the Hughes Optioneering™ Advisory Service then log on to www.WeeklyOptionAlert.com or call our sales partner Brad toll free at (866)-661-5664 or (310)-647-5664. Click the ‘Trade Results’ link for updated profit performance for the Hughes Optioneering™ Trading Strategies. Log On to www.WeeklyOptionAlert.com or Call Brad toll free (866)-661-5664 or (310)-647-5664 Click Trade Results for Updated Profit Performance 72",
    "title": "Option Engineering - Hughs BGSP Report",
    "source_type": "pdf",
    "document_id": "4b5ce6b81933",
    "source_file": "Option Engineering - Hughs BGSP_Report.pdf",
    "section": "Prime Trade Select",
    "page_number": 72,
    "page_range": "p.72",
    "total_pages": 72,
    "chunk_index": 89,
    "word_count": 119,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Prime Trade Select (p.72)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20160404162559-04'00'",
    "duration": null
  }
]