[
  {
    "text": "Option Return Predictability* Xintong (Eunice) Zhan School of Management, Fudan University Bing Han Rotman School of Management, University of Toronto Jie Cao CUHK Business School, The Chinese University of Hong Kong Qing Tong Shanghai LiLi technology Co., Ltd. Abstract We uncover new return predictability in the cross-section of delta-hedged equity options. Expected returns to writing delta-hedged calls are negatively correlated with stock price, profit margin and firm profitability, but positively correlated with cash holding, cash flow variance, new shares issuance, total external financing, distress risk, and dispersion of analyst forecasts. Our option portfolio strategies have annual Sharpe ratio above two and remain profitable after transaction costs. Their profits can be explained by two option factors while equity risk factors have no explanatory power. We find support for several economic channels at work, yet the option return predictability remains puzzling. (JEL G02, G12, G13) * We thank Stijn Van Nieuwerburgh (the editor), two anonymous referees, Gurdip Bakshi, Turan Bali, Hendrik Bessembinder,PeterCarr, HuiChen,PeterChristoffersen, TarunChorida,ZhiDa,ChristopherDoffing,Christian Dorion, Stephen Figlewski, Ross Goran, Amit Goyal, Ruslan Goyenko, Allaudeen Hameed, Dmitriy Muravyev, Chayawat Ornthanalai, Neil Pearson, Lin Peng, Jeffrey Pontiff, Geert Rouwenhorst, David Solomon, Sheridan Titman, Robert Webb, Jason Wei, Yan Xu, and Hua Zhang and seminar participants at Baruch College, Chinese University of Hong Kong, Cubist Systematic Strategies, Fudan University, McMaster University, Menta Capital, Morgan Stanley, Rutgers University, Shanghai University of Economics and Finance, Singapore Management University, Southwestern University of Finance and Economics, Tsinghua University, Two Sigma Investments, and Yinghua Fund Management for helpful discussions and useful suggestions. We have benefited from the comments of participants at the 3rd Deutsche Bank Annual Global Quantitative Strategy Conference, the 4th OptionMetrics Research Conference, the 10th Annual Conference on Advances in the Analysis of Hedge Fund Strategies, the 4th ChicagoQuantitativeAllianceAsiaConference,the6thRiskManagementConferenceatMont Tremblant, the 1st Annual China Derivatives Markets Conference, the 1st PKU-NUS International Conference on Quantitative Finance and Economics, the 4th Annual Conference of Asian Bureau of Finance and Economic Research, Macquarie Global Quantitative Research Conference, China International Conference in Finance, European Finance Association Annual Meeting, the 5th CDI Conference on Derivatives, Northern Finance Association Conference, the 27th Annual Conference on Financial Economics & Accounting, and the 6th ITAM Finance Conference. The work was supported by Research Grant Council of the Hong Kong Special Administrative Region, China [Project No. CUHK 458212, 14501115, 1400919, 14501720], the Canadian Derivatives Institute (CDI), and a CUHK Business School Direct Grant. We are grateful for research assistance from Sai Ke and Weiming (Elaine) Zhang. All errors are our own. Han holds the TMX Chair in Capital Markets at the University of Toronto. Send correspondence to Bing Han, bing.han@rotman.utoronto.ca. 0 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 78,
    "chunk_index": 0,
    "word_count": 439,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "and a CUHK Business School Direct Grant. We are grateful for research assistance from Sai Ke and Weiming (Elaine) Zhang. All errors are our own. Han holds the TMX Chair in Capital Markets at the University of Toronto. Send correspondence to Bing Han, bing.han@rotman.utoronto.ca. 0 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 78,
    "chunk_index": 1,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "A voluminous literature has documented return predictability in the cross-section of stocks. Harvey, Liu, and Zhu (2016) have categorized 316 explanatory factors from the existing studies. Despite the tremendous growth of equity options in recent decades,1 little is known about the determinants of the cross-section of equity option expected returns. This paper documents a rich set of puzzling option return predictability. Our results challenge existing asset pricing models and shed new light on pricing efficiency as well as risk-return trade-off in financial markets. We examine whether stock characteristics that are well known to predict stock returns can also predict the cross-section of delta-hedged equity option returns. Delta-hedging is frequently used by option traders and market makers to reduce the total risk of an option position. By construction, delta-hedged options are insensitive to the movements in underlying stock prices. By focusing on delta-hedged options, we investigate option return predictability beyond those simply inherited from the underlying stock return predictability. Unlike raw option returns which have skewed and fat-tailed distributions, delta-hedged option returns are better described by normal distributions and thus are more amenable to statistical analysis.2 Further, delta-hedged options are more informative than raw option returns regarding potential option mispricing (Broadie, Chernov, and Johannes 2009). The basic unit of analysis in our study is delta-neutral call writing which sells one contract of equity call hedged by a long position of delta shares of the underlying stock.3 At the end of each month, we rank all optionable stocks into deciles by a given stock characteristics and form portfolios of delta-neutral call writing on stocks in each decile. We close out the delta-hedged option positions after one month, and compute the holding returns. For portfolio returns, we use value weight by the stock market capitalization, equal weight, or value weight by option open interests at the beginning of the month. For various stock characteristics, we find monotonic patterns in the average returns of option portfolios, and the return differences between the top and 1 Data from the Options Clearing Corporation (https://www.theocc.com/webapps/historical-volume-query) indicates that equity (not including index) options have about 362 billion shares traded during 2016 across all U.S. option exchanges, which is 25% of trading volume of all CRSP stocks (including non-optionable stocks). The dollar volume of equity options on Chicago Board Options Exchange in 2016 is US$666 billon (http://www.cboe.com/data/historical-options-data/annual-market-statistics). 2 For example, under the Black-Scholes model, delta-hedged option returns have a symmetric distribution with zero mean (Bertsimas, Kogan, and Lo 2001). 3 We use the Black-Scholes option delta and pick short term (with time-to-maturity about 50 calendar days) options that are closest to being at-the-money. Our results are robust with regards to option maturity and moneyness. All our results obtain when we analyze put options. 1 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 78,
    "chunk_index": 2,
    "word_count": 460,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "3 We use the Black-Scholes option delta and pick short term (with time-to-maturity about 50 calendar days) options that are closest to being at-the-money. Our results are robust with regards to option maturity and moneyness. All our results obtain when we analyze put options. 1 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 78,
    "chunk_index": 3,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "the bottom decile portfolios are statistically significant. Specifically, writing delta-hedged calls on stocks with high cash flow variance, high cash holding, high new shares issuance, large total external financing, high distress risk, large dispersion of analyst forecasts, as well as on stocks with low price, low firm profit margin, and low profitability on average earn significantly higher returns than writing delta-hedged calls on stocks with the opposite characteristics. On average, the stock-value-weighted 10-minus-1 spread portfolio of delta-hedged options sorted by one of the underlying stock characteristics above has an average return of 1.56% per month. The average monthly Sharpe ratio is 0.7, and the annualized Sharpe ratio is 2.4. The profitability of our option portfolio strategies is robust across subperiods, over different market conditions (e.g., both high and low sentiment periods, both up and down market) or macroeconomic environments (e.g., both recession and expansion periods). After accounting for realistic option-transaction costs and margin requirements for writing options, our portfolio strategies still yield both statistically and economically significant mean returns. The delta-hedged option return predictability we document is independent of the stock market anomalies. Our option portfolio strategies do not load on common equity risk factors. After controlling for the exposures to a comprehensive set of nineteen equity risk factors, the risk- adjusted returns of our option portfolio strategies remain statistically significant, and the magnitudes are about the same as the raw returns. Therefore, common equity risk factors have no explanatory power for the profitability of our option portfolio strategies. The return predictability of delta-hedged options supports the idea that options are non- redundant.4 Under the Black-Scholes model where options are redundant, the delta-hedged option returns are unpredictable. Existing option pricing models where options are not redundant feature stochastic volatility or jump risk. Bakshi and Kapadia (2003) show that the expected delta-hedged option returns under a stochastic volatility model are determined only by the variance risk premium. We confirm that writing delta-hedged calls on stocks with larger variance risk premium delivers higher returns on average. But our option return predictability results remain significant after we control for the stock variance risk premium in Fama-MacBeth regressions. Moreover, our option portfolio strategies continue to have positive alphas after controlling for several systematic volatility risk factors. We have also implemented our portfolio strategies with delta-vega-neutral 4 Previous studies (e.g., Figlewski 1989; Green and Figlewski 1999; Buraschi and Jackwerth 2001; Coval and Shumway 2001; Jones 2006) provide empirical support that options are not redundant from the perspectives of hedging and pricing options. In contrast, our results are based on systematic patterns in the delta-hedged option returns. 2 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 78,
    "chunk_index": 4,
    "word_count": 437,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Green and Figlewski 1999; Buraschi and Jackwerth 2001; Coval and Shumway 2001; Jones 2006) provide empirical support that options are not redundant from the perspectives of hedging and pricing options. In contrast, our results are based on systematic patterns in the delta-hedged option returns. 2 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 78,
    "chunk_index": 5,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "options (i.e., we hedge option’s exposure to fluctuations in both underlying stock price and its volatility) and obtain significantly positive returns. Thus, our results are not simply driven by volatility risk. Similarly, we find that jump risk plays an important role but cannot fully explain our findings, even when combined with volatility risk. We examine several alternative channels including option mispricing that might drive delta- hedged option return predictability.5 We find that higher returns accrue to selling delta-hedged calls on stocks with high volatility uncertainty and high information asymmetry. But the effects of volatility uncertainty and information asymmetry are largely independent of our results. We also find that selling delta-hedged calls on stocks with lottery characteristics delivers a higher return on average, and investor gambling preference plays an important role to partly explain our results. However, based on a test proposed by Engelberg, McLean, and Pontiff (2018), we find no evidence that biased investor expectations cause the option return predictability we document. Together, the leading candidate economic mechanisms (e.g., variance risk, jump risk, investor gambling preference) contribute to explain about two-third of our option return predictability results. However, after accounting for these explanations, there are still significant relations between various stock characteristics and expected returns of delta-hedged options. We leave it to future studies to reconcile our findings in a coherent economic model. It is a daunting task but, in this pursuit, novel insights can be learned about asset pricing, investor behavior, and market efficiency. We uncover commonality in the returns of seemingly unrelated option portfolio strategies. This suggests a low-dimensional structure in the cross-section of delta-hedged option returns. We construct two option-based factors that can well explain the returns of all our option portfolio strategies. One factor is obtained by sorting equity options based on stock idiosyncratic volatility and the other factor is obtained by sorting equity options based on stock illiquidity. When we regress the returns of our option portfolio strategies on these two factors only, the alphas are no longer significant statistically or economically.6 These two option factors could capture the compensation required by constrained financial intermediaries to meet end users’ demand pressure 5 Constantinides, Jackwerth, and Perrakis (2009) use the stochastic dominance argument to draw conclusions on mispricing of out- of-money S&P 500 call options. Boyer and Vorkink (2014) and Byun and Kim (2016) provide evidence of overpricing of equity call options due to investors' preference for skewness or gambling in options. 6 Our result is distinct from Christoffersen, Fournier, and Jacobs (2018) who document common factors in the cross-section of equity option prices or in the level of implied equity volatility (not in delta-hedged option returns like our study). 3 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 78,
    "chunk_index": 6,
    "word_count": 450,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "for skewness or gambling in options. 6 Our result is distinct from Christoffersen, Fournier, and Jacobs (2018) who document common factors in the cross-section of equity option prices or in the level of implied equity volatility (not in delta-hedged option returns like our study). 3 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 78,
    "chunk_index": 7,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "for options that are costly and risky to hedge or trade, in the spirit of demand-based option pricing framework (e.g., Garleanu, Pedersen, and Poteshman 2009). Our paper contributes to the nascent and rapidly growing literature on option return predictability. Goyal and Saretto (2009) find that straddles or delta-hedged calls on stocks with high implied-volatility relative to the historical volatility earn low returns. Cao and Han (2013) document that delta-hedged equity option returns decrease monotonically with the idiosyncratic volatility of the underlying stock. Bali and Murray (2013) find a negative relation between risk- neutral stock skewness and the returns of skewness assets constructed from options and the underlying stock. An, Ang, Bali, and Cakici (2014) find that stocks with high past returns tend to have call and put options that exhibit increases in implied volatility over the next month. Our option return predictability results are robust to controlling for these effects and distinct from known patterns in the literature.7 The rest of the paper proceeds as follows. Section 1 describes the data and key variables. Section 2 presents new profitable option portfolio strategies sorted on a variety of underlying stock and firm characteristics. Section 3 tests several leading candidate explanations for the significant cross-sectional relationships between delta-hedged option returns and underlying stock characteristics. Section 4 examines the factor structure among our option portfolio strategies. Section 5 concludes the paper with suggestions for future research. 1. Data and Variables This section introduces the data and key variables used in the empirical analyses. More details about the definitions and measurements of the variables can be found in the online Appendix. 1.1 Data and sample coverage We collect data from both stock and equity option markets. The data process for the option market follows that of Cao and Han (2013). We obtain data on U.S. individual stock options from OptionMetrics from January 1996 to April 2016. The data set includes the daily closing bid and ask quotes, trading volume, and open interest of each option. Implied volatility, option’s delta, 7 Our paper is related to but distinct from several recent studies on the relation between expected option returns and option characteristics. Boyer and Vorkink (2014) report a negative relationship between returns on individual equity options and option skewness. Muravyev (2016) documents that option market order-flow imbalance significantly predicts daily option returns. Christoffersen et al. (2018) find more illiquid options tend to have higher daily delta-hedged option returns. 4 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 78,
    "chunk_index": 8,
    "word_count": 409,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Vorkink (2014) report a negative relationship between returns on individual equity options and option skewness. Muravyev (2016) documents that option market order-flow imbalance significantly predicts daily option returns. Christoffersen et al. (2018) find more illiquid options tend to have higher daily delta-hedged option returns. 4 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 78,
    "chunk_index": 9,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "vega, and other Greeks are computed by OptionMetrics based on standard market conventions. We obtain stock returns, prices, and trading volume from the Center for Research on Security Prices (CRSP). The Fama-French common risk factors and the risk-free rate are taken from Kenneth French’s website. The annual accounting data are obtained from Compustat. The quarterly institutional holding data are from Thomson Reuters (13F) database. The analyst coverage and forecast data are from I/B/E/S. The intra-day stock quotes and trades data are from Trade and Quote (TAQ) database. The option intra-day trades data are from the Options Price Reporting Authority (OPRA) database and start from 2003. Our analysis focuses on the options of common stocks (CRSP share codes 10 and 11). To avoid extremely illiquid stocks, we exclude stocks with a closing price at the end of the previous month below five dollars. At the end of each month and for each optionable stock, we extract from the Ivy DB database of OptionMetrics a pair of options (one call and one put) that are closest to being at-the-money and have the shortest maturity among those with more than one month to expiration. Several filters are applied to the extracted option data. First, U.S. individual stock options are of the American type. We exclude an option if the underlying stock paid a dividend during the remaining life of the option.8 Second, in order to avoid biases related to the microstructure, we only retain options in which the trading volume and bid quote are positive, the bid price is strictly smaller than the ask price, and the mid-point of the bid and ask quote is at least $1/8. Third, we exclude all option observations that violate obvious no-arbitrage conditions.9 Fourth, we exclude options with moneyness lower than 0.8 or higher than 1.2. Fifth, most of the options selected each month have the same maturity. We drop options whose maturity is different from the majority of options. Lastly, we only retain stocks with both call and put options available after filtering.10 Our final sample contains 186,220 option-month observations for both call and put options on individual stocks. Table 1 shows that the average moneyness of the chosen options is 1, with a small standard deviation of 0.04. The time to maturity is between 47 and 52 calendar days, with 8 The equity call options we analyze are therefore effectively European-type options. Our results remain robust when we include options on stocks that make dividend payments before option maturity in our analyses. 9 For example, one no-arbitrage conditions for a call option price C is S ≥ C ≥ max(0, S-Ke-rt), where S, K, T, and r are the underlying stock price, the option strike price, the option time to maturity, and the risk-free rate, respectively. 10 These filters are standard in the literature (see, e.g., Goyal and Saretto 2009; Cao and Han 2013). However, removing any of these data filters does not materially affect our results. 5 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 78,
    "chunk_index": 10,
    "word_count": 498,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "option strike price, the option time to maturity, and the risk-free rate, respectively. 10 These filters are standard in the literature (see, e.g., Goyal and Saretto 2009; Cao and Han 2013). However, removing any of these data filters does not materially affect our results. 5 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 78,
    "chunk_index": 11,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "an average of 50 days. These short-term options are most actively traded, have a relatively smaller bid-ask spread, and provide more reliable pricing information. We utilize this set of option data to study how expected option returns vary across the cross-section of underlying stocks. Appendix Table A1 reports the sample coverage of 5,748 underlying stocks. Over the entire 244-months sample period, the average number of optionable stocks in our sample per month is 763. On average, these stocks comprise 36% of the total market capitalization and 11% of the total number of stocks in the CRSP universe. Relative to the full CRSP sample, the average size percentile, book-to-market ratio percentile, and volatility percentile of the optionable stocks in our sample are 80%, 33%, and 51%, respectively. Moreover, the average institutional ownership is 69% and the average number of analyst coverage is 11.5. The industry distribution of underlying stocks is similar to that in the full CSRP sample (see Panel C of Table A1). Therefore, our results are not driven by small, illiquid, highly volatile stocks, stocks with low attention or a few industries. 1.2 Delta-hedged option return The basic unit of analysis in our study is delta-neutral call writing.11 We are motivated by the popular covered call writing (also known as a “buy-write” strategy) in which investors hold the underlying stock and sell a call option against it (see, e.g., Lakonishok, Lee, Pearson, and Poteshman 2007). The covered call writing involves the same number of shares of stock and option. Therefore, writing a covered call would have a positive exposure to the underlying stock. To isolate the effect of the underlying stock price movement, we sell one contract of call option hedged by a long position in delta shares of the underlying stock, where delta is the hedge ratio under Black- Scholes model. Building up such a position requires a positive amount of capital. To reduce option transaction costs and also to follow previous studies such as Goyal and Saretto (2009) and Bali and Murray (2013), we hold the position for one month without rebalancing the delta-hedges. We only report results based on buy-and-hold delta-hedged option returns, as our results are robust when we daily rebalance the delta hedges (see Section 2.3.2). Specifically, the return to selling a delta-neutral call over is [𝑡𝑡,𝑡𝑡+1] 11 We focus on call options since at-the-money calls have much higher trading volume and higher frequency of trading than at-the- money puts (Christoffersen et al. 2018). We have verified that all of our results hold for put options (see Section 3.3.3). 6 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 78,
    "chunk_index": 12,
    "word_count": 431,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "is [𝑡𝑡,𝑡𝑡+1] 11 We focus on call options since at-the-money calls have much higher trading volume and higher frequency of trading than at-the- money puts (Christoffersen et al. 2018). We have verified that all of our results hold for put options (see Section 3.3.3). 6 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 78,
    "chunk_index": 13,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "𝐻𝐻𝑡𝑡+1 (∆𝑡𝑡 ∙𝑆𝑆𝑡𝑡+1 −𝐶𝐶𝑡𝑡+1) 𝐻𝐻𝐻𝐻𝐻𝐻 = −1 = −1, (1) 𝐻𝐻𝑡𝑡 (∆𝑡𝑡 ∙𝑆𝑆𝑡𝑡 −𝐶𝐶𝑡𝑡) where the initial investment cost is , with C and S denoting the call option price and the underlying stock pric 𝐻𝐻 e𝑡𝑡 a = nd ( ∆𝑡𝑡 ∙ b 𝑆𝑆 e𝑡𝑡in − g 𝐶𝐶 th𝑡𝑡e ) > Bla 0 ck-Scholes call option delta at time . The payoff at the end of holding period is ∆𝑡𝑡 . 𝑡𝑡 Table 1 Panel A shows that the avera 𝐻𝐻 g𝑡𝑡e+ 1m = on ( t ∆ h𝑡𝑡ly ∙ 𝑆𝑆 b𝑡𝑡u+y1-a − nd 𝐶𝐶 -𝑡𝑡h+o1l ) d return to delta-neutral call writing is 3.5%. By extending the holding period until option maturity (about 50 calendar days), the average return to delta-neutral call writing increases to 5.87%. Figure 1 shows that the distribution of raw monthly option returns is poorly behaved with a heavy left tail near -100% (i.e., when options are close to expire out-of-money). In contrast, the monthly return to delta-neutral call writing is well approximated by a normal distribution. This renders it feasible to apply standard statistical inferences such as t-statistics in our analyses. [Insert Figure 1 and Table 1 about here] 1.3. Stock characteristics We identify a host of underlying stock characteristics that can predict the returns to delta-neutral call writing. These variables are motivated by ten well-known stock return anomalies. 1. CFV: Cash flow variance, as in Haugen and Baker (1996), computed as the variance of the monthly ratio of cash flow to market value of equity over the last 60 months. Cash flow is net income plus depreciation and amortization, all scaled by market value of equity. 2. CH: The cash-to-assets ratio, as in Palazzo (2012), is defined as the value of corporate cash holdings over the value of the firm’s total assets. 3. DISP: Analyst earnings forecast dispersion, as in Diether, Malloy, and Scherbina (2002), computed as the standard deviation of annual earnings-per-share forecasts scaled by the absolute value of the average outstanding forecasts. 4. ISSUE_1Y: 1-year new issues, as in Pontiff and Woodgate (2008), measured as the change in shares outstanding from 11 months ago. 7 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 78,
    "chunk_index": 14,
    "word_count": 360,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "and Scherbina (2002), computed as the standard deviation of annual earnings-per-share forecasts scaled by the absolute value of the average outstanding forecasts. 4. ISSUE_1Y: 1-year new issues, as in Pontiff and Woodgate (2008), measured as the change in shares outstanding from 11 months ago. 7 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 78,
    "chunk_index": 15,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "5. ISSUE_5Y: 5-year new issues, as in Daniel and Titman (2006), measured as five-year real change in number of shares outstanding. 6. PM: Profit margin, as in Soliman (2008), calculated as earnings before interest and tax scaled by revenues. 7. Ln(PRICE): The log of stock price at the end of last month, as in Blume and Husic (1972). 8. PROFIT: Profitability, as in Fama and French (2006), calculated as earnings divided by book equity, in which earnings is defined as income before extraordinary items. 9. TEF: Total external financing, as in Bradshaw, Richardson, and Sloan (2006), calculated as net share issuance plus net debt issuance minus cash dividends, scaled by total assets. 10. ZS: Z-Score, as in Dichev (1998). (1.2×(Working Capital / Assets) + 1.4×(Retained Earnings / Assets) + 3.3×(EBIT / Assets) + 0.6×(Market Value of Equity / Book Value of Total Liabilities) + (Revenues / Assets)). Higher values of ZS indicate lower probability of bankruptcy. To avoid the impact of outliers on regression analyses, we winsorize all the independent variables each month at the 0.5% and 99.5% levels. Panel B of Table 1 provides the summary statistics of the ten stock characteristics above. Due to the disparate data availability across these variables, the number of observations varies from 145,381 to 186,220. We use the maximum number of cross-sectional observations for each stock characteristic when examining its relationship with the expected delta-hedged option returns. We also use other variables as controls in our analyses, including VOL_deviation (volatility mispricing measure as in Goyal and Saretto (2009), calculated as the log difference between the realized volatility and Black-Scholes implied volatility for at-the-money options at the end of the last month), idiosyncratic volatility (IVOL, as in Ang, Hodrick, Xing, and Zhang (2006) and Cao and Han (2013), computed as the standard deviation of the regression residual of individual stock returns on the Fama and French (1993) three factors using daily data in the previous month), the Amihud (2002) stock illiquidity measure (calculated as the average of the daily ratio of the absolute stock return to dollar volume over the previous month), and other firm characteristics such as Ln(ME) and Ln(BM) in Fama and French (1992), momentum (RET ), and short-term reversal (-12,-2) 8 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 78,
    "chunk_index": 16,
    "word_count": 375,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "stock illiquidity measure (calculated as the average of the daily ratio of the absolute stock return to dollar volume over the previous month), and other firm characteristics such as Ln(ME) and Ln(BM) in Fama and French (1992), momentum (RET ), and short-term reversal (-12,-2) 8 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 78,
    "chunk_index": 17,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "(RET ). Table 2 reports the time-series average of the cross-sectional correlations between these (-1,0) stock characteristics. The correlations among these variables are generally low. [Insert Table 2 about here] 2. Empirical Results In this section, we document robust evidence on significant cross-sectional relation between future delta-hedged option return and a set of underlying stock characteristics. Our findings are distinct from known determinants of delta-hedged option returns. We implement various option portfolio strategies and examine their profitability after taking into considerations option transaction costs and margin requirements. 2.1 Returns to delta-neutral call writing: Portfolio sorts We first study the relation between return to delta-neutral call writing (i.e., sell a call and long delta shares of the underlying stock) and stock characteristics using the portfolio-sorting approach.12 At the end of each month and for each stock characteristics, we sort all optionable stocks into 10 deciles and then compare the portfolios of delta-neutral call writing on the stocks belonging to the top decile versus the bottom decile. To ensure the robustness of portfolio analyses, we use three weighting schemes in computing the average return of a portfolio of delta-neutral call writing: weight by market capitalization of the underlying stock (Stock-VW), equal weight (EW), and weight by the market value of option open interest at the beginning of the holding period (Option-VW). For each stock characteristic sort, we have an associated option portfolio trading strategy, which consists of writing delta-neutral calls on stocks that belong to the top decile and buying delta-neutral calls on stocks that belong to the bottom decile. We sort on the negative value of several characteristics (e.g., profit margin, stock price level, profitability, and Z-score) in order to generate increasing average returns from decile 1 to decile 10 portfolios. Table 3 reports the average return to delta-neutral call writing for the 10 decile portfolios sorted by each stock characteristic, the difference in the average returns between the top and the bottom decile portfolios 12 We use the Black-Scholes delta in reported tables. We obtain similar results if we compute the option delta using the historical GARCH volatility estimate. 9 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 78,
    "chunk_index": 18,
    "word_count": 355,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "sorted by each stock characteristic, the difference in the average returns between the top and the bottom decile portfolios 12 We use the Black-Scholes delta in reported tables. We obtain similar results if we compute the option delta using the historical GARCH volatility estimate. 9 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 78,
    "chunk_index": 19,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "(i.e., the profits of our option portfolio strategy). [Insert Table 3 about here] Table 3 reveals economically and statistically significant relations between each of the ten sorting stock characteristics and return to delta-neutral call writing over the next month. For the Stock-VW scheme, the (10-1) spread portfolio of delta-neutral call writing formed by sorting on the variance of cash flow (CFV) has a monthly return of 0.87% with a t-statistics of 5.92. For the EW (Option-VW) case the spread return is 1.63% (1.51%), with t-statistics around 12 (6). Cash holding (CH), analyst earnings forecast dispersion (DISP), net share issuance (ISSUE_1Y, ISSUE_5Y), and total external financing (TEF) all strongly and positively predict the next month returns of delta-neutral call writing. For example, our option portfolio strategy based on DISP has a monthly return of 2.03% (t-stat=19.81) when equal-weighted, 1.51% (t-stat=10.94) and 2.38% (t-stat=10.25) when value-weighted by stock and option respectively. The other four characteristics (PM, Ln(PRICE), PROFIT, and ZS) are significantly negatively related to next month returns of delta-neutral call writing. To ensure that the option portfolio strategies have positive average returns, we sort on the negative values of these variables in Table 3. The corresponding option portfolio strategies are even more profitable. For example, the (10-1) spread portfolio formed by sorting on –PROFIT has a monthly return of 2.48% with t-statistic of 21.67 when equal-weighted, and 1.73% (2.63%) in the Stock-VW (Option VW) case. For robustness, we redo the portfolio analyses using quintile sorts and report in the last column of Table 3 the (5-1) return spreads. The results are qualitatively the same as the (10-1) return spreads although the magnitudes tend to be smaller. For both decile and quintile sorts, the spread portfolios generally have larger returns when equal-weighted or option-value-weighted than stock- value-weighted. To be conservative, we mainly focus on stock-VW results for the rest of our paper. In summary, using portfolio sorts, we show that ten stock characteristics can predict the returns to delta-neutral call writing. These results are new to the literature. We also perform portfolio sorts according to several stock characteristics that are known to be related to the cross-section of delta- hedged option returns, such as VOL_deviation, stock idiosyncratic volatility (IVOL), and the Amihud (2002) stock illiquidity measure. We verify that writing delta-hedged call options delivers 10 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 78,
    "chunk_index": 20,
    "word_count": 388,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "perform portfolio sorts according to several stock characteristics that are known to be related to the cross-section of delta- hedged option returns, such as VOL_deviation, stock idiosyncratic volatility (IVOL), and the Amihud (2002) stock illiquidity measure. We verify that writing delta-hedged call options delivers 10 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 78,
    "chunk_index": 21,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "significantly higher returns on more illiquid stocks, stocks with higher idiosyncratic volatility or larger spread between historical stock volatility and option implied volatility. These results are consistent with the literature. In Section 2.3.1, we use bivariate portfolio sorts to show that the option return predictability results documented in Table 3 are new to the literature. 2.2 Time-series of return spreads and sub-period evidence Panel A of Table 4 reports the properties of time-series distributions of the Stock-VW monthly returns of our option portfolio strategies. They all have positive mean, median, and excess kurtosis. Nine of the ten option strategies have slightly negatively skewed returns while the other option strategy (based on price of the underlying stock) has slightly positive skewed returns. The mean (median) monthly Sharpe ratio of the ten option strategies is 0.7 (0.67). The corresponding annualized Sharpe ratio is around 2.4, several times larger than the Sharpe ratios of typical stock market anomalies as well as the popular strategy of selling volatility using equity index options.13 In Table 4 Panel B, we further conduct a variety of sub-period analyses to gain a better understanding regarding the profitability of our option-trading strategies. We first partition the full sample into two periods (1996–2005 versus 2006–2016). The profits of our strategies remain significant and just as strong in the more recent subsample. Furthermore, as shown in Columns (3)–(6), they are robust during both January and non-January months, following both periods of high and low market sentiment.14 Columns (7)–(10) indicate that our option portfolio strategies tend to be more profitable when stock market performance is good or when the economy is in expansion, but their average returns generally remain significantly positive during periods of negative stock market returns as well as NBER recession periods.15 Finally, Columns (11) and (12) show that our option strategies generate economically and statistically significant profits during both periods of high and low funding liquidity, as measured by broker-dealer’s leverage according 13 Ang (2014) reports that the monthly returns on the volatility strategy given by the MLHFEV1 index produced by Merrill Lynch has an annualized Sharpe ratio of 0.65. 14 Baker and Wurgler (2006) construct an index of market-wide investor sentiment. The index contains five underlying measures of investor sentiment: the average closed-end fund discount, the number of IPOs, the first-day returns of IPOs, the equity share of total new issues, and the dividend premium (see http://people.stern.nyu.edu/jwurgler/). 15 Among the few exceptions, the mean profits of option portfolio strategies based on cash-to-asset ratio (CH) and change in shares over the previous year (ISSUE_1Y) become insignificant during periods of negative stock market returns as well as during NBER recession periods. 11 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 78,
    "chunk_index": 22,
    "word_count": 447,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "(see http://people.stern.nyu.edu/jwurgler/). 15 Among the few exceptions, the mean profits of option portfolio strategies based on cash-to-asset ratio (CH) and change in shares over the previous year (ISSUE_1Y) become insignificant during periods of negative stock market returns as well as during NBER recession periods. 11 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 78,
    "chunk_index": 23,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "to Adrian, Etula, and Muir (2014).16 We examine in Section 4.1 whether the intermediary capital shocks (e.g., Adrian et al. 2014; He, Kelly, and Manela 2017) can explain the profits of our option strategies. [Insert Table 4 about here] Figure 2 plots the time-series of monthly returns of the Stock-VW (10-1) spread portfolio of delta-neutral call writing sorted on each of the ten stock characteristics of the underlying stock in Table 3. One striking pattern is that for the majority of the option strategies, the positive return cases vastly outnumber the negative return cases, justifying their high average returns and high Sharpe ratios. Moreover, the profitability is stable over time and is even stronger during or after the 2008–2009 financial crisis. In contrast, according to Chordia, Subrahmanyam, and Tong (2014) and McLean and Pontiff (2016), many stock market anomalies have weakened or become insignificant in recent years, with many equity strategies doing poorly or even crashed during the 2008–2009 financial crisis. [Insert Figure 2 about here] The consistent profitability of our option strategies could hint that they are compensations for exposures to some priced risk factors (Section 4 examines this possibility for a comprehensive set of stock market factors). Alternatively, the profitability of our option portfolio strategies could manifest market mispricing that have previously been neglected. Option traders traditionally focus on the relative valuation of an option and the underlying stock, or across options (with different moneyness or maturity) on the same underlying stock. Our option portfolio strategies have a completely different focus and are based on the cross-section of options (of same moneyness and maturity) on different underlying stocks. Therefore, we suspect few market participants were aware of and had traded on the option predictability patterns uncovered in this paper. 2.3 Robustness checks 16 Following Adrian, Etula, and Muir (2014), the broker-dealer quarterly leverage is defined as total financial asset / (total financial asset - total financial liability) based on the Level Table “Security Brokers and Dealers” of the Federal Reserve (Item FL664090005.Q for asset and Item FL664190005.Q for liability) obtained from https://www.federalreserve.gov/RELEASES/z1/ 12 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 78,
    "chunk_index": 24,
    "word_count": 350,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "(2014), the broker-dealer quarterly leverage is defined as total financial asset / (total financial asset - total financial liability) based on the Level Table “Security Brokers and Dealers” of the Federal Reserve (Item FL664090005.Q for asset and Item FL664190005.Q for liability) obtained from https://www.federalreserve.gov/RELEASES/z1/ 12 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 78,
    "chunk_index": 25,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "In this subsection, we first control for known determinants of option returns in the literature, and then conduct a battery of robustness checks for our results with regards to variations in the construction of delta-neutral option positions and the type of options used in the analyses (e.g. put options instead of call options, other option moneyness and maturity). 2.3.1 Bivariate portfolio sorts controlling for known determinants of option returns. We use bivariate portfolio sorts to examine whether our results remain significant after controlling for variables that are known to be related to the cross-section of expected delta-hedged option returns. The control variables include (1) VOL_deviation (the log difference between the realized stock volatility and Black-Scholes implied volatility for at-the-money options) following Goyal and Saretto (2009); (2) stock idiosyncratic volatility (IVOL) to control for the effect identified by Cao and Han (2013); (3) stock illiquidity and option bid-ask spread motivated by Christoffersen et al. (2018); (3) other firm characteristics including size (Ln(ME)), book-to-market ratio (Ln(BM)), momentum (RET )), and short-term reversal (RET )) that have been used by Cao and Han (-12,-2) (-1,0) (2013), and (4) option Greeks such as delta, vega, theta, gamma, and the square of gamma. Our approach of bivariate portfolio sorts follows previous studies such as Ang et al. (2006) and Bali, Cakici, and Whitelaw (2011). Each month, we first sort our sample into five quintiles by one of the control variables such as IVOL. Within each control quintile, we form five quintile portfolios of delta-neutral call writing by sorting on one of the equity characteristics in Table 3. We then aggregate the 5x5 double-sorted option portfolios across the five control quintiles to produce five option portfolios with similar level in the control variable for the underlying stock, but with dispersion in the new equity characteristics we use to predict delta-hedged option returns. Table 5 reports a matrix of average stock-value-weighted (5-1) option spread portfolio return over our sample period. The entry in the ith row and jth column corresponds to the option portfolio strategy sorted on the equity characteristics labeled by row i, after controlling for the variable labeled in column j via bivariate portfolio sorts as described above. [Insert Table 5 about here] Results in Table 5 show that after adjusting for the effect of each control variable using bivariate portfolio sorts, all ten option strategies continue to have positive mean returns that are 13 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 78,
    "chunk_index": 26,
    "word_count": 405,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "j via bivariate portfolio sorts as described above. [Insert Table 5 about here] Results in Table 5 show that after adjusting for the effect of each control variable using bivariate portfolio sorts, all ten option strategies continue to have positive mean returns that are 13 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 78,
    "chunk_index": 27,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "both statistically and economically significant. In unreported table, we have also confirmed this finding using Fama-MacBeth regressions with returns to selling delta-neutral call options on individual stocks as dependent variable. The advantage of regressions is that we can control for multiple variables simultaneously. We find that all ten stock characteristics used in performing univariate portfolio sorts in Table 3 are significantly related to the cross-section of next month’s delta-hedged option returns, even in the presence of all control variables used in the bivariate portfolio sorts in Table 5. Thus, the option return predictability patterns we document are distinct from the existing results in the literature. 2.3.2. Variations in delta-neutral call writing. We verify the robustness of our findings to two variations in delta-neutral call writing. Thus far we have only considered monthly buy-and-hold returns of delta-neutral call writing. Strictly speaking, the position is delta-neutral only at the beginning of the month if we do not rebalance the delta hedges as time goes by, because option’s delta will change as the stock price changes over time. As a first robustness check, we adjust the option delta hedges each day and compound the daily returns of delta-neutral call writing over all trading days of a given month to obtain a monthly return. The results based on daily-rebalanced delta-neutral call writing in Appendix Table A2 are qualitatively the same as those reported in Table 3 for all ten option strategies. The option portfolio profits become smaller after daily rebalancing delta-hedges, but they are still both statistically and economically significant. This suggests that our option-return predictability results are not driven by the underlying stock return predictability. In unreported test, we confirm that the significant relationships between return to delta-neutral call writing and various underlying stock characteristics are robust after controlling for contemporaneous stock return, which further removes the concern that our results are caused by delta-hedging error and stock return predictability. Second, Table A3 in the Appendix reports results based on returns of delta-neutral call writing held until maturity (about 50 calendar days). The patterns are identical to Table 3 in which the holding period is one month. Returns of delta-neutral call writing held until maturity increase with cash flow variance, cash holding, analyst forecast dispersion, 1-year and 5-year shares issuance, as well as total external financing, but decrease with the underlying stock’s price, profit margin, profitability, and Z-score. All of these predictive relations are statistically significant, just as in 14 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 78,
    "chunk_index": 28,
    "word_count": 412,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "increase with cash flow variance, cash holding, analyst forecast dispersion, 1-year and 5-year shares issuance, as well as total external financing, but decrease with the underlying stock’s price, profit margin, profitability, and Z-score. All of these predictive relations are statistically significant, just as in 14 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 78,
    "chunk_index": 29,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Table 3. The only difference is that with a longer holding period, the return spreads between the extreme decile or quintile portfolios sorted by the underlying equity characteristics are bigger in magnitudes than the corresponding results in Table 3. Holding options until maturity also lowers transaction costs as there is no need to sell options to close the option position. 2.3.3 Strategies involving delta-neutral put writing. In this subsection, we examine the profitability of put options portfolio strategies sorted by various stock characteristics. The basic unit of analysis here is selling a delta-neutral equity put. Specifically, for each stock, we sell one contract of put option against a short position of delta shares of the underlying stock, using the Black-Scholes put option delta. We then repeat Table 3 for portfolios of delta-neutral put writing sorted on the same set of ten stock characteristics. Comparing Appendix Table A4 with Table 3, our option portfolio strategies based on equity puts produce consistent returns (same signs, similar magnitudes) as those implemented with equity calls. This suggests that the predictability in delta- hedged option returns we document is not simply driven by the underlying stock return predictability; otherwise, the patterns for calls and puts would have the opposite signs. 2.3.4. Across different moneyness and maturity group. Our results so far are based on at-the- money short-maturity call options, because these options are most actively traded. In this subsection, we explore whether the same return predictability patterns also hold for other options. For each stock at the end of each month, we assign its call options into 3x3 moneyness and maturity groups. Three moneyness groups are based on the option delta (Δ): out-of-money (0.2<Δ<0.4), at- the-money (0.4≤Δ≤0.6), and in-the-money (0.6<Δ<0.8). Three maturity groups are based on days to maturity: short-term (30 to 60 days), medium-term (90 to 180 days), and long-term (180 to 360 days), respectively. For each moneyness-maturity option group, we calculate the average return to delta-neutral call writing for all call options on a given stock within that group. Then, we compute the stock-value-weighted average return to delta-neutral call writing across all stocks that belong to top (bottom) decile sorted by each stock characteristics. As shown in Appendix Table A5, the average 10-minus-1 return spread of delta-neutral call writing is generally significant with consistent sign across different moneyness-maturity groups, though the magnitude tends to be stronger for short-term options. 15 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 78,
    "chunk_index": 30,
    "word_count": 402,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "to top (bottom) decile sorted by each stock characteristics. As shown in Appendix Table A5, the average 10-minus-1 return spread of delta-neutral call writing is generally significant with consistent sign across different moneyness-maturity groups, though the magnitude tends to be stronger for short-term options. 15 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 78,
    "chunk_index": 31,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "For all of the previous results, we assume that options can be bought or sold at the midpoint of the bid and ask price quotes. Table 6 examines whether our option portfolio strategies remain profitable after accounting for option transaction costs and margin requirement. We measure option transaction costs by the effective bid-ask spreads when selling and buying the call options. Due to the data limitation, we do not observe the effective option bid-ask spread for our full sample. However, for a subsample and starting from May 2003, we obtain the actual effective option bid-ask spreads using the option intra-day trades data from the Options Price Reporting Authority (OPRA). In our full sample, we first recompute option returns corresponding to an assumed effective option spread that is equal to 25%, 50%, 75%, and 100% of the quoted spread.17 The column “No Cost” in Table 6 corresponds to zero effective spread—i.e., option returns are computed with the transactions done at the midpoint of the bid and ask quotes—as in all previous tables. Table 6 shows that for all the portfolios of delta-neutral call writing sorted on one of the ten stock characteristics, the stock-value-weighed (10-1) return spread decreases monotonically with the transaction costs. For example, the average return of our option strategy based on analyst dispersion (DISP) is 1.51% per month when the effective spread is taken to be zero. With an effective option spread that is 25% (50%) of the quoted spread, the average return is reduced to 1.23% (0.95%) per month. When the effective option spread increases to 75% (100%) of the quoted spread, the average monthly return of our option strategy sorted on DISP further drops to 0.67% (0.40%). With one exception (portfolios sorted on cash holding CH), the option strategies still have significantly positive mean returns at 75% effective option spread. However, four option strategies (those based on CH, ISSUE_1Y, TEF and PM) are no longer profitable at 100% effective option spread. In the OPRA subsample, the actual effective option spread is on average 55% of the quoted spread. For this subsample, the right half of Table 6 shows that after taking the actual bid-ask spreads into account, nine out of our ten option strategies still deliver positive average returns that are statistically significant from zero. After adjusting for actual effective option spread, the return 17 Previous studies such as De Fontnouvelle, Fisher, and Harris (2003) and Mayhew (2002) show that for equity options, the ratio of effective spread to the quoted spread is less than 0.5. Using more recent data, Goyenko, Ornthanalai, and Tang (2015) report that in aggregate, the effective-to-quoted spread ratio is 0.8 for options with various moneyness and maturity between 30 and 182 calendar days. We only focus on at-the-money short-term options which are among the most liquid options. 16 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "2.4 Accounting for option trading costs",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 78,
    "chunk_index": 32,
    "word_count": 472,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.4 Accounting for option trading costs (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "recent data, Goyenko, Ornthanalai, and Tang (2015) report that in aggregate, the effective-to-quoted spread ratio is 0.8 for options with various moneyness and maturity between 30 and 182 calendar days. We only focus on at-the-money short-term options which are among the most liquid options. 16 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "2.4 Accounting for option trading costs",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 78,
    "chunk_index": 33,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.4 Accounting for option trading costs (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "spreads of stock-value-weighted (10-1) portfolios sorted on the ten stock characteristics reduce by 32% on average. This is likely an overestimate of the impact of transaction costs, since according to Muravyev and Pearson (2020), investors who employ execution timing pay less than 40% of the conventional effective spreads. [Insert Table 6 about here] Another cost of option trading is the margin requirement, especially in the case of writing options. To be conservative, we assume the long positions in the underlying stocks cannot be used to fulfill the margin requirement for the short call position. We follow the CBOE initial margin requirement for a naked short option position, which is “100% of option proceeds plus 20% of underlying security value less out-of-the-money amount, if any, to a minimum for calls of option proceeds plus 10% of the underlying security value, and a minimum for puts of option proceeds plus 10% of the puts exercise price.”18 Following Weinbaum, Fodor, Muravyev, and Cremers (2020), we measure the margin cost as the cost of borrowing additional capital to meet the margin requirement over the holding period which is one month in our study. The margin adjusted return over to writing a delta-neutral call is defined as [𝑡𝑡,𝑡𝑡+1] (∆𝑡𝑡 ∙𝑆𝑆𝑡𝑡+1 −𝐶𝐶𝑡𝑡+1)−(𝑟𝑟/12)∙𝑀𝑀 𝐻𝐻𝐻𝐻𝐻𝐻 = −1, (2) (∆𝑡𝑡 ∙𝑆𝑆𝑡𝑡 −𝐶𝐶𝑡𝑡) where is the option-maturity matched annual LIBOR rate, and M is the CBOE required margin amount. 𝑟𝑟 The impact of margin requirement on the profits of our option strategies is smaller than that of the option transaction cost. Table 6 shows that for the full sample and with the effective option spread assumed to be 50% of the quoted spread, further adjusting for option margin requirement reduces the stock-value-weighed (10-1) return spread by about 14% on average. For the OPRA subsample using the actual effective option spread, further adjusting for option margin requirement only reduces the profit of option strategy by 5% on average. More importantly, the profits for nine 18 See http://www.cboe.com/LearnCenter/pdf/margin2-00.pdf. This margin requirement has been used in related studies such as Bali and Murray (2013), Hitzemann, Hofmann, Urig-Homburg, and Wagner (2018). 17 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "2.4 Accounting for option trading costs",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 78,
    "chunk_index": 34,
    "word_count": 353,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.4 Accounting for option trading costs (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "option margin requirement only reduces the profit of option strategy by 5% on average. More importantly, the profits for nine 18 See http://www.cboe.com/LearnCenter/pdf/margin2-00.pdf. This margin requirement has been used in related studies such as Bali and Murray (2013), Hitzemann, Hofmann, Urig-Homburg, and Wagner (2018). 17 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "2.4 Accounting for option trading costs",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 78,
    "chunk_index": 35,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.4 Accounting for option trading costs (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "out of ten option strategies remain significant both economically and statistically after incorporating both option transactions costs and margin cost. We have also implemented an alternative margin requirement according to Murray (2013) and obtain the same conclusion.19 In summary, our findings on option return predictability generally survive transactions costs and margin requirement, despite their large impact on the profits of our option strategies. 3. Potential Explanations So far, we have documented a variety of highly profitable option portfolio strategies motivated by novel patterns of option return predictability by underlying stock characteristics. In this section, we use both Fama-MacBeth (1973) regressions and bivariate portfolio sorts to assess several potential underlying economic channels for our results. We find that some of these economic mechanisms play important roles and together, they can explain up to 65% of our findings based on the reduction in Fama-MacBeth regression coefficients. However, we still find significant option return predictability after controlling for the various explanations below. 3.1 Variance risk premium This subsection examines whether our results can be explained by the stock variance risk premium. Delta-hedged options are sensitive to underlying asset volatility. Investors generally dislike the randomness of future variance and, in equilibrium, demand a premium for accepting variance risk. Previous studies (e.g., Bakshi and Kapadia 2003; Bakshi, Kapadia, and Madan 2003) have used delta-hedged options to examine variance risk premium. Individual stock variance risk premium is theoretically related to the expected delta-hedged option returns under a stochastic volatility model (e.g., Bakshi and Kapadia 2003) and has been empirically estimated (e.g., Carr and Wu 2009; Han and Zhou 2015). Stock variance risk premium depends importantly on various stock characteristics (Han and Zhou 2015). Therefore, stock variance risk premium could account for the option return predictability by stock characteristics we have documented if the stock characteristics are correlated with stock variance risk premium. We examine the effect of monthly individual stock variance risk premium (VRP) by using 19 For a portfolio of options and stocks, Murray (2013) develops a methodology for calculating the amount of cash reserve required to satisfy potential future margin calls. This alternative margin requirement leads to slightly larger margin-adjusted returns of our option strategies. Our delta-hedged option positions have limited downside compared to selling naked call options. We find that the margin requirement under the methodology of Murray (2013) tends to be marginally smaller than the assumption we use (based on CBOE margin requirement and not allowing the long stock positions in delta-neutral call writing to lower required margin). 18 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "2.4 Accounting for option trading costs",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 78,
    "chunk_index": 36,
    "word_count": 422,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.4 Accounting for option trading costs (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "call options. We find that the margin requirement under the methodology of Murray (2013) tends to be marginally smaller than the assumption we use (based on CBOE margin requirement and not allowing the long stock positions in delta-neutral call writing to lower required margin). 18 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "2.4 Accounting for option trading costs",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 78,
    "chunk_index": 37,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.4 Accounting for option trading costs (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Fama-MacBeth (1973) regressions. VRP is measured as the difference between the expected stock return variance under the risk-neutral measure and under the empirical probability. Following Jiang and Tian (2005), and Bollerslev, Tauchen, and Zhou (2009), the risk-neutral expected stock variance is extracted from a cross-section of equity options on the last trading day of a month and the empirical counterpart is proxied by realized return variance computed from intra-daily stock returns over all trading days of a month (see Cao and Han (2013) Appendix A for details). The results are reported in the left three columns of Table 7 Panel A. In the first column, we regress next month return to delta-neutral call writing on one of the stock characteristics within the subsample with available VRP measure. In the next two columns, we further add VRP as another regressor in each regression. By comparing the coefficient of each stock characteristics with and without VRP as control using the same data sample, we can assess the explanatory power of variance risk premium for the option return predictability we document. Individual stock variance risk premium has a significantly positive coefficient in all regressions, suggesting higher returns to selling delta-hedged calls on stocks with large VRP. After controlling for VRP, the coefficients for all ten stock characteristics remain significant at the 1% level with the same signs as those in the corresponding ‘No Controls’ column. The magnitudes of the coefficients shrink on average by about 26%. Therefore, the significant relationships between delta-hedged option returns and the ten stock characteristics do not merely reflect the effect of stock variance risk premium on expected delta-hedged option returns. [Insert Table 7 about here] 3.2 Uncertainty about stock volatility In this subsection, we test a potential explanation of our results based on investors’ uncertainties about future stock volatilities, the most important input in option valuation. Such uncertainties create a “model risk.” Green and Figlewski (1999) show that the pricing and hedging errors due to inaccurate volatility forecasts create sizable risk exposure for option writers. Risk-averse option sellers respond by using a higher option implied volatility. Thus, when there is increased uncertainty about the underlying stock volatility, option sellers charge a higher option premium, resulting in a higher expected return to selling delta-neutral options. This could explain our 19 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "2.4 Accounting for option trading costs",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 78,
    "chunk_index": 38,
    "word_count": 386,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.4 Accounting for option trading costs (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "writers. Risk-averse option sellers respond by using a higher option implied volatility. Thus, when there is increased uncertainty about the underlying stock volatility, option sellers charge a higher option premium, resulting in a higher expected return to selling delta-neutral options. This could explain our 19 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "2.4 Accounting for option trading costs",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 78,
    "chunk_index": 39,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.4 Accounting for option trading costs (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "findings if the stock characteristics underlying our option portfolio strategy are correlated in the cross-section with uncertainty about stock volatility. To test this potential explanation, we control for the volatility of implied volatility (VOL-of- VOL), a measure of uncertainty in stock volatility from Baltussen, Van Bekkum, and Van Der Grient (2018). It is the standard deviation of the stock's ATM implied volatilities (the average of the ATM call and ATM put implied volatilities) over all trading days in the previous month divided by the mean of these same implied volatilities.20 The results are illustrated in the middle three columns of Table 7 Panel A. The coefficient of VOL-of-VOL is significantly positive. It is consistent with Green and Figlewski (1999) and the idea that option writers charge a higher option premium when facing greater uncertainty in the underlying stock volatility. More importantly, after we control for uncertainty in stock volatility, the coefficients for the ten stock characteristics are virtually the same as the coefficients reported in the corresponding ‘No Controls’ column for the same sample, and are statistically significant at the 1% level. Therefore, the predictive power of stock characteristics for delta-hedged option returns is independent of and unexplained by the effect of stock volatility uncertainty. To further understand the role of volatility risk for our findings, we examine option return predictability results using delta-vega-neutral call writing, which by construction is not sensitive to change in stock volatility. Specifically, we sell one at-the-money equity call, hedged by a long position in appropriate units of an out-of-money call with same maturity (in order to be vega- neutral) as well as a long position in appropriate units of the underlying stock (to be delta-neutral). Appendix Table A6 provides the detail for the construction of delta-vega-neutral call writing and its return. The ten stock characteristics are significantly related to the cross-section of returns to delta-vega-neutral call writing with the same sign as those for the returns to delta-neutral call writing. When we form portfolios of delta-vega-neutral call writing sorted by each of the ten stock characteristics, the 10-minus-1 spread portfolios continue to have significantly positive mean returns, just as the portfolio strategies in Table 3 based on delta-neutral call writing. Moreover, there are no material changes in the magnitudes of the average returns of the option portfolio strategies. From these results and those in Section 3.1, we conclude that the return predictability for delta-hedged options is largely unexplained by their exposures to volatility risk. 20 To calculate VOL-of-VOL for a stock in a given month, we follow Baltussen et al. (2018) and require at least 12 daily ATM implied volatilities during the previous month. Our results are robust when we use alternative volatility uncertainty measures in Cao, Vasquez, Xiao, and Zhan (2020). 20 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "2.4 Accounting for option trading costs",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 78,
    "chunk_index": 40,
    "word_count": 464,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.4 Accounting for option trading costs (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "for a stock in a given month, we follow Baltussen et al. (2018) and require at least 12 daily ATM implied volatilities during the previous month. Our results are robust when we use alternative volatility uncertainty measures in Cao, Vasquez, Xiao, and Zhan (2020). 20 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "2.4 Accounting for option trading costs",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 78,
    "chunk_index": 41,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.4 Accounting for option trading costs (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "A delta-hedged option is immune from small changes in the price of the underlying stock. However, it is exposed to the underlying stock jump risk since a large price movement would render delta- hedging ineffective. As argued by Green and Figlewski (1999), option dealers charge a premium for the jump risk when they write options. Broadie, Chernov, and Johannes (2009) show that incorporating a jump risk premium can help explain empirical patterns in index option returns. In this subsection, we examine whether our results could be explained by the correlations between jump risk and the stock characteristics that predict the cross-section of delta-hedged option return. Following Bakshi and Kapadia (2003) as well as Bakshi et al. (2003), we proxy the underlying stock return jump risk by an ex-ante measure of the stock return risk-neutral skewness and kurtosis inferred from equity options (see e.g., Cao and Han (2013) for details). The right four columns of Table 7 Panel A show that the risk-neutral skewness and kurtosis are positively and significantly related to returns to selling delta-neutral calls. This is consistent with the prediction of Green and Figlewski (1999), as well as the findings in Bali and Murray (2013). More importantly, the presence of stock return jump risk proxies does not change the sign and statistical significance of the coefficients for the ten stock characteristics. After controlling for jump risk proxies, the ten stock characteristics still have significant predictive power for the cross-section of delta-hedged option returns. Compared to corresponding coefficients reported in the ‘No Controls’ column, the estimated coefficients for the stock characteristics become 36% lower on average after controlling for the jump risk proxies. Therefore, jump risk plays an important role, but it cannot fully explain our findings.21 3.4 Information asymmetry This subsection explores the potential role of information asymmetry in explaining our results. Previous studies provide evidence of informed trading in the option market (e.g., Pan and Poteshman 2006). The left three columns of Table 7 Panel B report the results of Fama-Macbeth regressions that control for the probability of information-based trading using the PIN measure of Easley, Hvidkjaer, and O'hara (2002). The coefficient of PIN is significantly positive, suggesting 21 Given the complexity in measuring jump risk, it is possible that our option return predictability could become weaker than indicated by Table 7 Panel A after controlling for additional proxies of jump risk beyond risk-neutral skewness and kurtosis. 21 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "3.3 Jump risk",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 78,
    "chunk_index": 42,
    "word_count": 406,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3 Jump risk (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "PIN is significantly positive, suggesting 21 Given the complexity in measuring jump risk, it is possible that our option return predictability could become weaker than indicated by Table 7 Panel A after controlling for additional proxies of jump risk beyond risk-neutral skewness and kurtosis. 21 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "3.3 Jump risk",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 78,
    "chunk_index": 43,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3 Jump risk (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "that option market makers charge a higher premium when there is higher probability of informed trading. However, after controlling for the cross-sectional difference of firm-level information asymmetry with PIN, the coefficients of the ten stock characteristics remain significant, and their magnitudes are reduced on average only by 3%. Therefore, our option return predictability results are largely independent of and unexplained by the effect information asymmetry and informed trading in options. 3.5 Option demand pressure and gambling preference The impact of demand-pressure on the option price has been documented (e.g., Bollen and Whaley (2004), Garleanu et al. (2009), Muravyev 2016). Option market makers charge a higher premium for options facing higher end users demand pressure, leading to a higher return to delta-neural call writing in these cases. To the extent that option demand pressure could depend on underlying stock characteristics, we examine whether various stock characteristics can still significantly predict delta-hedged option returns after controlling for option demand pressure. We measure option demand pressure by the total market value of all options (open interest times option price) on a given stock, scaled by the market value of underlying stock. The middle three columns of Panel B Table 7 report the Fama-Macbeth regression results with and without controlling for option demand pressure. Consistent with demand-based option pricing framework, the coefficient of demand pressure is significantly positive. In the presence of option demand proxy, the coefficients for the ten stock characteristics are reduced by about 17% in magnitude, but they remain significant both economically and statistically.22 One source of demand pressure for call options is investor gambling preference, especially in the cases of stocks with lottery characteristics. In the right three columns of Panel B Table 7, we control for a measure of lottery characteristics of stocks, MAX(5), which is the average of the five highest daily stock returns within the last month (see Bali et al. 2011). The coefficient of MAX(5) is significantly positive in all regressions, indicating a higher return to selling delta-hedged calls on stocks with lottery characteristics. This is consistent with the finding in Byun and Kim (2016) based on raw option returns. More importantly, after controlling for MAX(5), the ten stock 22 We also verify that after controlling for the option order imbalance, an alternative proxy for demand pressure (see Muravyev 2016), the ten stock characteristics continue to be significantly related to future delta-hedged option returns. Muravyev (2016) documents that option market order-flow imbalance significantly predicts daily option returns. We estimate the option order imbalance using intra-day trades from Options Price Reporting Authority, and then scale it by the total number of option trades or by the total dollar option trading volume. This alternative proxy is available for only part of our sample period. 22 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "3.3 Jump risk",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 78,
    "chunk_index": 44,
    "word_count": 462,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3 Jump risk (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "estimate the option order imbalance using intra-day trades from Options Price Reporting Authority, and then scale it by the total number of option trades or by the total dollar option trading volume. This alternative proxy is available for only part of our sample period. 22 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "3.3 Jump risk",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 78,
    "chunk_index": 45,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3 Jump risk (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "characteristics are still significantly related to delta-hedged option returns with the same sign as those in the ‘No Controls’ column, except the magnitudes of the coefficients are reduced by about 34% on average. Therefore, just as variance risk premium and jump risk, gambling preference plays an important role and partly explains our results. 3.6 Controlling for multiple explanations simultaneously and additional results based on bivariate portfolio sorts Results in Sections 3.1-3.5 indicate that it is more profitable to sell delta-hedged calls on stocks with high variance risk premium, high uncertainty in stock volatility, large jump risk, and high information asymmetry, as well as stocks with lottery characteristics, and when option demand pressure is large. These findings are interesting on their own and mostly new to the literature. The effects of volatility uncertainty and information asymmetry are largely independent of our results. The other effects contribute to partly explain the option return predictability we have documented, but their explanatory power is modest when each effect is considered individually (the coefficients of stock characteristics are reduced by about 25% to 35%). Panel C of Table 7 presents the results of regressions that simultaneously take into consideration multiple effects above. The left two columns report the Fama-MacBeth regression results for the subsample for which VRP, VOL-of-VOL, MAX(5), and option demand pressure are available (about 90% of the full sample). After controlling for these variables, the coefficients of the ten stock characteristics are reduced by about 60% in magnitude on average, but they all remain statistically significant. In the middle two columns, we add PIN measure as a another control (this cuts the sample to about 63% of the full sample) and the magnitudes of the coefficients shrink by about 60% compared to the cases without controlling for VRP, VOL-of-VOL, MAX(5), option demand pressure and PIN. In the right two columns, we further control for option-implied skewness and kurtosis and re-run the Fama-MacBeth regressions on a subsample that is about 40% of the full sample (limited by the availability of all explanatory variables). After controlling for all these explanatory variables simultaneously, the coefficients for the ten stock characteristics remain statistically significant, but their magnitude become 64% lower on average. For robustness, we have also examined the explanatory power of various economic channels in Sections 3.1-3.5 using stock-value-weighted double-sorted option portfolios. Each month, we first sort our sample into five quintiles by one of the explanatory variables such as VRP. Within 23 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "3.3 Jump risk",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 78,
    "chunk_index": 46,
    "word_count": 412,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3 Jump risk (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "lower on average. For robustness, we have also examined the explanatory power of various economic channels in Sections 3.1-3.5 using stock-value-weighted double-sorted option portfolios. Each month, we first sort our sample into five quintiles by one of the explanatory variables such as VRP. Within 23 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "3.3 Jump risk",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 78,
    "chunk_index": 47,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3 Jump risk (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "each quintile, we further sort delta-neutral call options into five portfolios according to one of the stock characteristics. We then aggregate the 25 option portfolios across the five explanatory quintiles to produce five portfolios of delta-neutral equity call writing with similar value of explanatory variable, but with dispersion in the equity characteristics that predict delta-hedged option returns. Table 7 Panel D reports the difference in average monthly returns of stock-value- weighted portfolios of delta-neutral call writing between quintile 5 and 1, for each pair of equity characteristics and explanatory variable. They represent the profits of our option strategies after controlling for various explanatory variables using bivariate portfolio sorts. In all cases, our option strategies continue to have both economically and statistically significant returns. 3.7 Biased expectations and earnings announcements Thus far, we have explored several alternative economic channels underlying option return predictability that are based on risk (e.g., variance risk, jump risk), volatility uncertainty, information asymmetry, option demand pressures, and investor lottery preference. In this subsection, we examine an explanation based on biased expectations. Specifically, we study the role of earnings announcements for the option return predictability. Engelberg, McLean, and Pontiff (2018) find that stock return anomalies are six times higher on earnings announcement days. They interpret this result as evidence that anomaly returns are due to stock mispricing that are at least partially corrected upon the arrival of news such as the earning announcements. Similar argument suggests that our option return predictability results should be stronger around earning announcements if they mainly reflect the correction of option mispricing caused by biased investor expectations. We test this biased expectation hypothesis using portfolio sorts. We first implement each option portfolio strategy separately on two subsamples and then compare its average return across the two subsamples. In each month, one subsample contains options on stocks with earnings announcements during that month, while all other equity options belong to the second subsample. Table 8 reports the stock-value-weighted (10-1) spread of monthly return to delta-neutral call writing for the two subsamples. All ten option portfolio strategies deliver significantly positive mean returns over both subsamples, except for ISSUE_1Y over the subsample with earnings announcements. Contrary to the biased expectation hypothesis, the profits of our option portfolio strategies tend to be higher for the subsample without earnings 24 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "3.3 Jump risk",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 78,
    "chunk_index": 48,
    "word_count": 387,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3 Jump risk (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "All ten option portfolio strategies deliver significantly positive mean returns over both subsamples, except for ISSUE_1Y over the subsample with earnings announcements. Contrary to the biased expectation hypothesis, the profits of our option portfolio strategies tend to be higher for the subsample without earnings 24 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "3.3 Jump risk",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 78,
    "chunk_index": 49,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3 Jump risk (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "announcements than for the earnings announcement subsample. This holds for eight out of the ten option portfolio strategies. The findings in Table 8 are different from the pattern documented in Engelberg, McLean, and Pontiff (2018) for stock market anomalies, suggesting once again that our results on delta-hedged option return predictability are not driven by the corresponding stock return predictability. Unlike the case of stock anomalies, we do not find support for biased expectations as an important source of option return predictability. [Insert Table 8 about here] 4. Factor Model for Option Return Predictability Section 2 documents a set of new and robust findings about option return predictability by various underlying stock characteristics. Cross-sectional tests in Section 3 show that several economic channels together can explain a substantial portion of our results, but significant option return predictability remains after accounting for these explanations. In this section, we use time-series regressions to study the ability of a comprehensive set of common risk factors to explain the profits of our option portfolio strategies. We are motivated by the fact that although there are hundreds of stock market anomalies, most of them can be explained by a small number of common risk factors (e.g., Hou, Xue, and Zhang 2015; Fama and French 2016). If a factor structure exists among delta- hedged option returns, it would reduce the dimensionality of the option anomalies and facilitate the search for a unifying framework that underlies the option return predictability. 4.1 Common factors from stock market We first examine the alphas of our option portfolio strategies under a comprehensive set of common risk factors in the stock market, including the Fama and French (2015) five factors, the momentum factor (Carhart 1997), the liquidity risk factor (Pastor and Stambaugh 2003), the systematic mispricing factors of Stambaugh and Yuan (2017) as well as the behavioral factors of Daniel, Hirshleifer, and Sun (2020). Other risk factors include the common idiosyncratic volatility factor (Herskovic et al. 2016), broker-dealer leverage shock factor (Adrian et al. 2014), intermediary capital risk factor (He et al. 2017), betting-against-beta factor (Frazzini and Petersen 25 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "3.3 Jump risk",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 78,
    "chunk_index": 50,
    "word_count": 352,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3 Jump risk (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "as the behavioral factors of Daniel, Hirshleifer, and Sun (2020). Other risk factors include the common idiosyncratic volatility factor (Herskovic et al. 2016), broker-dealer leverage shock factor (Adrian et al. 2014), intermediary capital risk factor (He et al. 2017), betting-against-beta factor (Frazzini and Petersen 25 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "3.3 Jump risk",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 78,
    "chunk_index": 51,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3 Jump risk (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "2014), and tail risk factor (Kelly and Jiang 2014).23 We also control for several volatility risk factors including the zero-beta straddle return of the S&P 500 Index option (Coval and Shumway 2001), the change in the Chicago Board Options Exchange Market Volatility Index (∆VIX, Ang et al. 2006), and the value-weighted average of zero-beta straddle returns on individual stocks belonging to the S&P 500 Index (Cao and Han 2013). We regress the time series of monthly returns of stock-value-weighted option portfolio strategies on these risk factors and examine whether the intercept terms are significantly different from zero. Table 9 shows that after controlling for the exposures to these stock market common factors and volatility factors, the risk-adjusted average returns of our option portfolio strategies remain highly significant and are similar in magnitudes as the raw returns. Our option strategies generate significant profits that are virtually unexplained by a comprehensive set of stock market factors and volatility risk factors. We obtain consistent results when using equal-weighted or option-value- weighted returns (see Appendix Table A7). Thus, the option return predictability we document can’t be explained by the common stock market factors. [Insert Table 9 about here] 4.2 Common factors from option market In this subsection, we study the ability of several factors constructed from options data to explain our results. We first consider the Level, Slope, and Value factors proposed by Karakaya (2013). These factors are designed to capture the cross-sectional variations in expected returns on option portfolios formed on moneyness, maturity, and option “value” (where value is measured as the spread between historical stock return volatility and the Black-Scholes option implied volatility). Specifically, the Level factor is the average return on selling at the money option portfolios; the Slope factor is the average return on buying long maturity option portfolios and selling short maturity ones; and the Value factor is the average return on buying high value option portfolios and selling low value ones. The alpha of each option strategy in Model (1) of Table 10 is smaller than that in Model (7) of Table 9. Thus, the three-factor model of Karakaya (2013) outperforms a comprehensive set of 19 stock market factors in explaining the profitability of our option portfolio 23 We thank the authors for making these risk factors available. 26 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "3.3 Jump risk",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 78,
    "chunk_index": 52,
    "word_count": 386,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3 Jump risk (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "smaller than that in Model (7) of Table 9. Thus, the three-factor model of Karakaya (2013) outperforms a comprehensive set of 19 stock market factors in explaining the profitability of our option portfolio 23 We thank the authors for making these risk factors available. 26 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "3.3 Jump risk",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 78,
    "chunk_index": 53,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3 Jump risk (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "strategies. Nevertheless, with the exception of option strategies based on CH and ISSUE_1Y, the alphas in Model (1) of Table 10 are still highly significant, both statistically and economically. The average alpha relative to the three-factor model of Karakaya (2013) is 1.24% per month. In comparison, the average raw return of the ten option portfolio strategies is 1.56% per month. Next, we construct two new option factors. One is an option IVOL factor and the other is an option illiquidity factor, motivated respectively by Cao and Han (2013) and Christoffersen et al. (2018). The factor realizations in each month are obtained as the high-minus-low spread returns of stock-value-weighted portfolios of writing delta-neutral calls sorted on the idiosyncratic volatility or the Amihud illiquidity measure of the underlying stock. In Table 10 Model (2), we regress the time series of monthly returns of each option portfolio strategy on the option IVOL factor alone. Five portfolio strategies no longer have significant alpha. The alpha of the other five strategies is reduced by 40%, although still statistically significant. The average absolute value of the alpha across the ten strategies under this single option factor model is 0.8%, already lower than the 1.24% average alpha under the three-factor model of Karakaya (2013). Therefore, the single option IVOL factor outperforms the three-factor model of Karakaya (2013) in explaining the profitability of our option strategies. Table 10 Model (3) indicates that the option illiquidity factor also outperforms Karakaya (2013) three-factor model. After adjusting for the option illiquidity factor, six out of ten portfolio strategies no longer have significant alphas, and the average absolute value of the alphas is 0.71%. Table 10 Model (4) shows that the option IVOL and the option illiquidity factor together can fully explain the profits for nine out of ten option strategies. The alphas are no longer significant statistically or economically, except for the option portfolio strategy based on underlying stock’s profit margin. The average alpha is 0.34% under the two-factor model. Moreover, as shown in Model (5), adding the Karakaya (2013) three-factors does not improve the explanatory power of our two-factor model. Table A8 in the Appendix reports similar results using equal-weighted and option-value-weighted option portfolio returns. [Insert Table 10 about here] We have verified that adding an option market factor and a volatility mispricing factor motivated by Goyal and Saretto (2009) to our two-factor model does not significantly improve the 27 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "3.3 Jump risk",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 78,
    "chunk_index": 54,
    "word_count": 405,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3 Jump risk (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "reports similar results using equal-weighted and option-value-weighted option portfolio returns. [Insert Table 10 about here] We have verified that adding an option market factor and a volatility mispricing factor motivated by Goyal and Saretto (2009) to our two-factor model does not significantly improve the 27 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "3.3 Jump risk",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 78,
    "chunk_index": 55,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3 Jump risk (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "explanatory power for the profits of our option portfolio strategies. The option market factor is stock-value-weighted average return of writing delta-neutral calls on individual stocks. The volatility mispricing factor is constructed from portfolios of delta-neutral call writing sorted by the difference between option implied-volatility and historical stock volatility. These two factors are close to the Level factor and the Value factor of Karakaya (2013). We have also verified that adding two option factors based on stock risk-neutral skewness and kurtosis to our two-factor model does not improve the explanatory power, either. To summarize, we have documented novel option return predictability by ten underlying stock characteristics. The corresponding option portfolio strategies are highly profitable and not explained at all by the common stock market risk factors. However, after controlling for an option IVOL factor and an option illiquidity factor, the profits of these option strategies are reduced by 80% on average and become largely insignificant. Therefore, although our option portfolio strategies are independent of the stock market anomalies, they have a low-dimensional common factor structure. This result could facilitate further explorations of the economic mechanisms underlying the option return predictability. Table 11 presents additional option return predictability results that collaborate the findings above.24 Panel A reports fourteen new stock characteristics beyond those in Table 3 that significantly predict delta-hedged option returns such as current stock price scaled by highest price over the past one year (52-week high), asset turnover, market beta, short interest ratio, earning yield, accounting valuation by analyst forecasts, cash flow scaled by market value of equity, R&D expenses scaled by market value of equity. These additional findings about option return predictability are all new to the literature. Moreover, just like the results in Tables 9 and 10, the profits of the option portfolio strategies based on these fourteen new predictors do not change materially after controlling for common stock market risk factors, but they become insignificant both statistically and economically after accounting for the option IVOL factor and option illiquidity factor. 24 The universe of stock characteristics we have examined as potential predictors of delta-hedged option returns is based on McLean and Pontiff (2016). They classify the stock characteristics that can predict the cross-section of stock returns into four types “Event”, “Market”, “Valuation” and “Fundamental” (for details, see https://sites.google.com/site/davidmcleanswebpage/research-1). Excluding the ten stock characteristics in Table 3 and several variables known to predict delta-hedged option returns in the literature (such as IVOL and past stock returns), we select twenty-five stock characteristics from all four categories of stock return predictors in McLean and Pontiff (2016) that cover the major stock market anomalies. Then we form portfolios of delta-neutral call writing sorted by each of these twenty-five stock characteristics. Half of the 14 stock characteristics reported in Table 11 Panel A that are significant predictors of delta-hedged option returns fall under the “Market” category of McLean and Pontiff (2016), while 7 out of the 11 insignificant cases in Table 11 Panel B come from the “Fundamental” category. 28 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "3.3 Jump risk",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 78,
    "chunk_index": 56,
    "word_count": 503,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3 Jump risk (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "stock characteristics reported in Table 11 Panel A that are significant predictors of delta-hedged option returns fall under the “Market” category of McLean and Pontiff (2016), while 7 out of the 11 insignificant cases in Table 11 Panel B come from the “Fundamental” category. 28 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "3.3 Jump risk",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 78,
    "chunk_index": 57,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3 Jump risk (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "[Insert Table 11 about here] Not all stock characteristics that we have used to form portfolios of delta-neutral call writing produce statistically significant (10-1) and (5-1) spread returns, especially under the stock-value- weighting scheme. Table 11 Panel B reports eleven such insignificant cases, including earnings surprises, accounting accruals, net operating assets, financial leverage, operating leverage, and corporate governance index. The results in Table 11 suggest there are a lot more to be learnt about option return predictability that deserve further investigations. Our results would be informative to future efforts to reconcile option return predictability in a coherent economic model. 5. Conclusion This paper documents novel and robust evidence on return predictability of delta-hedged options by various underlying stock characteristics. Expected returns to writing delta-hedged calls are negatively correlated with current stock price, firm profit margin and profitability, but positively correlated with firm cash holding, cash flow variance, new shares issuance, total external financing, distress risk, and dispersion of analyst forecasts. We find supportive evidence that several leading candidate economic channels (including variance risk, jump risk, and investor lottery preference) can partly explain option return predictability. Additional tests reveal many other (but not all) underlying stock characteristics can also predict the cross-section of delta-hedged option returns. There is ample room for future studies to conduct more comprehensive analyses of option return predictability and reconcile the results under a coherent economic model. We construct monthly-rebalanced tradable option portfolio strategies that yield both statistically and economically significant profits even after accounting for realistic option- transaction costs and margin requirements. The average Sharpe ratio of our option portfolio strategies is 0.7 at monthly frequency, or 2.4 when annualized, substantially higher than stock anomalies. In order to explain the high Sharpe ratio of our option portfolios, the stochastic discount factors need to be substantially more volatile than that implied by the stock market anomalies. Our findings are independent of the stock market anomalies. Common equity risk factors have no explanatory power for the profits of our option portfolio strategies. In contrast, when we regress the returns of our option portfolio strategies on two new option factors, the alphas are no longer 29 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "3.3 Jump risk",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 78,
    "chunk_index": 58,
    "word_count": 362,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3 Jump risk (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "independent of the stock market anomalies. Common equity risk factors have no explanatory power for the profits of our option portfolio strategies. In contrast, when we regress the returns of our option portfolio strategies on two new option factors, the alphas are no longer 29 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "3.3 Jump risk",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 78,
    "chunk_index": 59,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3 Jump risk (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "significant statistically or economically. We construct the two option factors from portfolios of delta-hedged options sorted by the underlying stock idiosyncratic volatility and stock illiquidity. This low-dimensional factor structure in option return predictability would facilitate further investigations of the underlying economic mechanisms. Given that the two summarizing factors are option portfolios sorted on stock idiosyncratic volatility and stock illiquidity, a promising venue for future research is to better understand how various frictions faced by option market makers such as the costs and risks in hedging options, constraints on funding liquidity or position limit, affect option prices under the demand-based option pricing framework (e.g., Garleanu et al. 2009). These frictions represent limits to arbitrage in the relative valuation of equity options and the underlying stocks. Our results could reflect cross- sectional differences in limits to arbitrage that are correlated with various stock characteristics. Since some of the option return predictability we document involves firm fundamentals, another potential fruitful path going forward is to consider structural models that first specify the process of the firm’s asset value rather than the stock price dynamics directly, and then value equity options (e.g., using the compounded options approach as in Geske 1979). Using such models, recent studies have shown that firms’ leverage or investment decisions have interesting implications for option pricing, leading to a better fit to the observed option prices (Geske, Subrahmanyam, and Zhou 2016) and the implied volatility surface (Gamba and Saretto 2020). It is worth investigating whether structural models can also explain the cross-sectional relation between expected delta-hedged option returns and various firm fundamentals.25 Finally, our results could manifest systematic mispricing and its correction over time. The profits of our option strategies could be explained by the abnormal returns earned from selling (buying) call options on overvalued (undervalued) stocks. Our strategies involve selling delta- hedged calls on low priced stocks, stocks with low profit margin and low profitability, high cash holding, large cash flow variance, large new shares issuance, high total external financing, high distress risk, and high dispersion of analyst forecasts. Stocks with the above characteristics are likely overvalued (e.g., due to investors’ gambling preference or over-optimism, short sales constraints). Call options on overvalued stocks are also overvalued, and the relative amount of 25 Vasquez and Xiao (2020) extend the model in Geske et al. (2016) by including jumps to the asset process and show it holds the promise to explain the negative relation between delta-hedge option return and firm credit ratings or default probability (which is consistent with our finding based on Z-score). The link is entirely through variance risk premium in the model of Vasquez and Xiao (2020). 30 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "3.3 Jump risk",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 78,
    "chunk_index": 60,
    "word_count": 445,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3 Jump risk (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "holds the promise to explain the negative relation between delta-hedge option return and firm credit ratings or default probability (which is consistent with our finding based on Z-score). The link is entirely through variance risk premium in the model of Vasquez and Xiao (2020). 30 Electronic copy available at: https://ssrn.com/abstract=2698267 overvaluation in options could be even higher than that of the underlying stocks (e.g., when leverage-constrained or overconfident investors prefer to speculate more with equity options instead of the underlying stocks). Moreover, there could be relative mispricing in options independent of stock mispricing. The effects of behavioral biases on option pricing (when options are not redundant) are complex and deserve careful studies in future. It is useful to apply an equilibrium model to value options and the underlying stocks simultaneously in the presence of investor behavioral biases. 31 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "3.3 Jump risk",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 78,
    "chunk_index": 61,
    "word_count": 143,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3 Jump risk (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "The effects of behavioral biases on option pricing (when options are not redundant) are complex and deserve careful studies in future. It is useful to apply an equilibrium model to value options and the underlying stocks simultaneously in the presence of investor behavioral biases. 31 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "References",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 78,
    "chunk_index": 62,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Adrian, T., E. Etula, and T. Muir. 2014. Financial intermediaries and the cross-section of asset returns. Journal of Finance 69:2557–2596. Amihud, Y. 2002. Illiquidity and stock returns: Cross-section and time-series effects, Journal of Financial Markets 5:31–56. An, B., A. Ang, T. G. Bali, and N. Cakici. 2014. The joint cross section of stocks and options. Journal of Finance 69: 2279–2337. Ang, A. 2014. Asset management: A systematic approach to factor investing. Oxford University Press. Ang, A., R. J. Hodrick, Y. Xing, and X. Zhang. 2006. The cross‐section of volatility and expected returns. Journal of Finance 61:259–299. Baker, M., and J. Wurgler. 2006. Investor sentiment and the cross‐section of stock returns. Journal of Finance 61:1645–1680. Bakshi, G., and N. Kapadia. 2003. Delta-hedged gains and the negative market volatility risk premium. Review of Financial Studies 16:527–566. Bakshi, G., N. Kapadia, and D. Madan. 2003. Stock return characteristics, skew laws, and differential pricing of individual equity options. Review of Financial Studies 16:101–143. Bali, T. G., N. Cakici, and R. F. Whitelaw. 2011. Maxing out: stocks as lotteries and the cross- section of expected returns. Journal of Financial Economics 99:427–446. Bali, T. G., and S. Murray. 2013. Does risk-neutral skewness predict the cross-section of equity option portfolio returns? Journal of Financial and Quantitative Analysis 48:1145–1171. Baltussen, G., S. Van Bekkum, and B. Van Der Grient. 2018. Unknown unknowns: Uncertainty about risk and stock returns. Journal of Financial and Quantitative Analysis 53:1615–1651. Bertsimas, D., L. Kogan, and A. W. Lo. 2001. Hedging derivative securities and incomplete markets: An epsilon-arbitrage approach. Operations Research 49:372–397. Blume, M. E., and F. Husic. 1973. Price, beta and exchange listing. Journal of Finance 28:283– 299. Bollen, N. P., and R. E. Whaley. 2004. Does net buying pressure affect the shape of implied volatility functions? Journal of Finance 59:711–753. Bollerslev, T., G. Tauchen, and H. Zhou. 2009. Expected stock return and variance risk premium. Review of Financial Studies 22:4463–4492. 32 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "References",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 78,
    "chunk_index": 63,
    "word_count": 324,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "299. Bollen, N. P., and R. E. Whaley. 2004. Does net buying pressure affect the shape of implied volatility functions? Journal of Finance 59:711–753. Bollerslev, T., G. Tauchen, and H. Zhou. 2009. Expected stock return and variance risk premium. Review of Financial Studies 22:4463–4492. 32 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "References",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 78,
    "chunk_index": 64,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Boyer, B. H., and K. Vorkink. 2014. Stock options as lotteries. Journal of Finance 69:1485–1527. Bradshaw, M. T., S. A. Richardson, and R. G. Sloan. 2006. The relation between corporate financing activities, analysts’ forecasts and stock returns. Journal of Accounting and Economics 42:53–85. Broadie, M., M. Chernov, and M. Johannes. 2009. Understanding index option returns. Review of Financial Studies 22:4493–4529. Buraschi, A., and J. Jackwerth. 2001. The price of a smile: hedging and spanning in option markets. Review of Financial Studies 14:495–527. Byun, S. J., and D. H. Kim. 2016. Gambling preference and individual equity option returns. Journal of Financial Economics 122:155–174. Cao, J., A. Vasquez, X. Xiao, and X. Zhan. 2020. Volatility uncertainty and the cross-section of option Returns. Working Paper, The Chinese University of Hong Kong. Cao, J., and B. Han. 2013. Cross-section of option returns and idiosyncratic stock volatility. Journal of Financial Economics 108:231–249. Carhart, M. M. 1997. On persistence in mutual fund performance. Journal of Finance 52:57-82. Carr, P., and L. Wu. 2009. Variance risk premia. Review of Financial Studies 22: 1311–1341. Chordia, T., A. Subrahmanyam, and Q. Tong. 2014. Have capital market anomalies attenuated in the recent era of high liquidity and trading activity? Journal of Accounting and Economics 58:41– 58. Christoffersen, P., M. Fournier, and K. Jacobs. 2018. The factor structure in equity options. Review of Financial Studies 31:595–637. Christoffersen, P., R. Goyenko, K. Jacobs, and M. Karoui. 2018. Illiquidity premia in the equity options market. Review of Financial Studies 31:811–851. Constantinides, G. M., J. C. Jackwerth, and S. Perrakis. 2009. Mispricing of S&P500 index options. Review of Financial Studies 22:1247–1277. Coval, J. D., and T. Shumway. 2001. Expected option returns. Journal of Finance 56:983–1009. Daniel, K., D. Hirshleifer, and L. Sun. 2020. Short- and long-horizon behavioral factors. Review of Financial Studies 33:1673–1736. Daniel, K., and S. Titman. 2006. Market reactions to tangible and intangible information. Journal of Finance 61:1605–1643. 33 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "References",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 78,
    "chunk_index": 65,
    "word_count": 322,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Shumway. 2001. Expected option returns. Journal of Finance 56:983–1009. Daniel, K., D. Hirshleifer, and L. Sun. 2020. Short- and long-horizon behavioral factors. Review of Financial Studies 33:1673–1736. Daniel, K., and S. Titman. 2006. Market reactions to tangible and intangible information. Journal of Finance 61:1605–1643. 33 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "References",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 78,
    "chunk_index": 66,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "De Fontnouvelle, P., R. P. Fishe, and J. H. Harris. 2003. The behavior of bid-ask spreads and volume in options markets during the competition for listings in 1999. Journal of Finance 58:2437–2463. Dichev, I. D. 1998. Is the risk of bankruptcy a systematic risk? Journal of Finance 53:1131–1147. Diether, K. B., C. J. Malloy, and A. Scherbina. 2002. Differences of opinion and the cross section of stock returns. Journal of Finance 57:2113–2141. Easley, D., S. Hvidkjaer, and M. O'hara. 2002. Is information risk a determinant of asset returns? Journal of Finance 57:2185–2221. Engelberg, J., R. D. McLean, and J. Pontiff. 2018. Anomalies and news. Journal of Finance 73:1971–2001. Fama, E. F., and K. R. French. 1992. The cross-section of expected stock returns. Journal of Finance 47:427–465. Fama, E. F., and K. R. French. 2006. Profitability, investment and average returns. Journal of Financial Economics 82:491–518. Fama, E. F., and K. R. French. 2015. A five-factor asset pricing model. Journal of Financial Economics 116:1–22. Fama, E. F., and K. R. French. 2016. Dissecting anomalies with a five-factor model. Review of Financial Studies 29:69–103. Fama, E. F., and J. D. MacBeth. 1973. Risk, return and equilibrium: Empirical tests. Journal of Political Economy 81:607–636. Figlewski, S. 1989. Options arbitrage in imperfect markets. Journal of Finance 44:1289–1311. Frazzini, A., and L. H. Pedersen. 2014. Betting against beta. Journal of Financial Economics 111:1–25. Gamba, A., and A. Saretto. 2020. Endogenous option pricing. Working Paper, University of Texas at Dallas. Garleanu, N., L. H. Pedersen, and A. M. Poteshman. 2009. Demand-based option pricing. Review of Financial Studies 22:4259–4299. Geske, R. 1979. The valuation of compound options. Journal of Financial Economics 7:63–81. Geske, R., A. Subrahmanyam, and Y. Zhou. 2016. Capital structure effects on the prices of equity call options. Journal of Financial Economics 121:231–253. 34 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "References",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 78,
    "chunk_index": 67,
    "word_count": 303,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Demand-based option pricing. Review of Financial Studies 22:4259–4299. Geske, R. 1979. The valuation of compound options. Journal of Financial Economics 7:63–81. Geske, R., A. Subrahmanyam, and Y. Zhou. 2016. Capital structure effects on the prices of equity call options. Journal of Financial Economics 121:231–253. 34 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "References",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 78,
    "chunk_index": 68,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Goyal, A., and A. Saretto. 2009. Cross-section of option returns and volatility. Journal of Financial Economics 94:310–326. Goyenko, R., C. Ornthanalai, and S. Tang. 2015. Options illiquidity: determinants and implications for stock returns. Working Paper, McGill University. Green, T. C., and S. Figlewski. 1999. Market risk and model risk for a financial institution writing options. Journal of Finance 54:1465–1499. Han, B., and Y. Zhou. 2015. Individual stock variance risk premium and cross-section of stock returns. Working Paper, University of Toronto. Harvey, C. R., Y. Liu, and H. Zhu. 2016. … and the cross-section of expected returns. Review of Financial Studies 29:5–68. Haugena, R. A., and N. L. Baker. 1996. Commonality in the determinants of expected stock returns. Journal of Financial Economics 41:401–439. He, Z., B. Kelly, and A. Manela. 2017. Intermediary asset pricing: New evidence from many asset classes. Journal of Financial Economics 126:1–35. Herskovic, B., B. Kelly, H. Lustig, and S. Van Nieuwerburgh. 2016. The common factor in idiosyncratic volatility: Quantitative asset pricing implications. Journal of Financial Economics 119:249–283. Hitzemann, S., M. Hofmann, and M. Uhrig-Homburg, and C. Wagner. 2018. Margin requirements and equity option returns. Working Paper, Rutgers University. Hou, K., C. Xue, and L. Zhang. 2015. Digesting anomalies: An investment approach. Review of Financial Studies 28:650–705. Jiang, G. J., and Y. S. Tian. 2005. The model-free implied volatility and its information content. Review of Financial Studies 18:1305–1342. Jones, C. S. 2006. A nonlinear factor analysis of S&P 500 index option returns. Journal of Finance 61:2325–2363. Karakaya, M. M. 2013. Characteristics and expected returns in individual equity options. Working Paper, PDT Partners. Kelly, B., and H. Jiang. 2014. Tail risk and asset prices. Review of Financial Studies 27:2841– 2871. 35 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "References",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 78,
    "chunk_index": 69,
    "word_count": 287,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "analysis of S&P 500 index option returns. Journal of Finance 61:2325–2363. Karakaya, M. M. 2013. Characteristics and expected returns in individual equity options. Working Paper, PDT Partners. Kelly, B., and H. Jiang. 2014. Tail risk and asset prices. Review of Financial Studies 27:2841– 2871. 35 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "References",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 78,
    "chunk_index": 70,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Lakonishok, J., I. Lee, N. D. Pearson, and A. M. Poteshman. 2007. Option market activity. Review of Financial Studies 20:813–857. Mayhew, S. 2002. Competition, market structure, and bid-ask spreads in stock option markets. Journal of Finance 57:931–958. McLean, R. D., and J. Pontiff. 2016. Does academic research destroy stock return predictability? Journal of Finance 71:5–32. Muravyev, D. 2016. Order flow and expected option returns. Journal of Finance 71:673–708. Muravyev, D., and N. D. Pearson. 2020. Option trading costs are lower than you think. Review of Financial Studies 33:4973–5014. Murray, S. 2013. A margin requirement based return calculation for portfolios of short option positions. Managerial Finance 39:550–568. Newey, W. K., and K. D. West. 1987. A simple positive semi-definite, heteroskedasticity and autocorrelation consistent covariance matrix. Econometrica 55:703–708. Palazzo, B. 2012. Cash holdings, risk, and expected returns. Journal of Financial Economics 104:162–185. Pan, J., and A. M. Poteshman. 2006. The information in option volume for future stock prices. Review of Financial Studies 19:871–908. Pastor, L., and R. F. Stambaugh. 2003. Liquidity risk and expected stock returns. Journal of Political Economy 111:642–685. Pontiff, J., and A. Woodgate. 2008. Share issuance and cross-sectional returns. Journal of Finance 63:921–945. Soliman, M. T. 2008. The use of DuPont analysis by market participants. The Accounting Review 83:823–853. Stambaugh, R. F., and Y. Yuan. 2017. Mispricing factors. Review of Financial Studies 30:1270– 1315. Vasquez, A., and X. Xiao. 2020. Default risk and option returns. Working Paper, Instituto Tecnológico Autónomo de México. Weinbaum, D., A. Fodor, D. Muravyev, and M. Cremers. 2020. How do informed option traders trade? Option trading activity, news releases, and stock return predictability. Working Paper, Syracuse University. 36 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "References",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 78,
    "chunk_index": 71,
    "word_count": 278,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "X. Xiao. 2020. Default risk and option returns. Working Paper, Instituto Tecnológico Autónomo de México. Weinbaum, D., A. Fodor, D. Muravyev, and M. Cremers. 2020. How do informed option traders trade? Option trading activity, news releases, and stock return predictability. Working Paper, Syracuse University. 36 Electronic copy available at: https://ssrn.com/abstract=2698267 Figure 1 The distribution of option returns Figure 1A plots the histogram for the pooled distribution of monthly buy-and-hold return to delta-neutral call writing. Figure 1B plots the histogram for the pooled distribution of monthly buy-and-hold raw return of call options. Delta-neutral call writing strategy is as follows: for each stock, we sell one contract of call option and delta hedge it by a long position of ∆ shares of the underlying stock, where ∆ is the Black-Scholes call option delta. The sample period is from January 1996 to April 2016 and the total number of observations is 186,220. 8 6 4 2 0 -0.273-0.237-0.201-0.165-0.129-0.093-0.057-0.021 0.015 0.051 0.087 0.123 0.159 0.195 0.231 ZR 37 tnecreP Distribution of ZR N158236 8 6 4 2 0 -0.6125 -0.4375 -0.2625 -0.0875 0.0875 0.2625 0.4375 0.6125 0.7875 0.9625 1.1375 1.3125 ZR_straddle tnecreP Figure 1A: Monthly buy-and-hold return to delta-neutral call writing Distribution of ZR_straddle N158241 Figure 1B: Monthly buy-and-hold raw returns of call options Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "References",
    "page_number": 38,
    "page_range": "p.38-39",
    "total_pages": 78,
    "chunk_index": 72,
    "word_count": 215,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.38-39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Distribution of ZR N158236 8 6 4 2 0 -0.6125 -0.4375 -0.2625 -0.0875 0.0875 0.2625 0.4375 0.6125 0.7875 0.9625 1.1375 1.3125 ZR_straddle tnecreP Figure 1A: Monthly buy-and-hold return to delta-neutral call writing Distribution of ZR_straddle N158241 Figure 1B: Monthly buy-and-hold raw returns of call options Electronic copy available at: https://ssrn.com/abstract=2698267 Figure 2 Time-series of returns of various long-short portfolios of delta-neutral call writing This figure plots the time-series of (10-1) return spread for stock-value-weighted portfolios of delta-neutral call writing sorted on the underlying stock characteristics described in Table 1. At the end of each month, we sort the delta-neutral call writing positions into deciles by a characteristic of the underlying stocks (as indicated by the title of each panel). The numbers in this figure are monthly returns expressed in percent. The sample period is from January 1996 to April 2016. + CFV + CH 1998-2000 2001-2005 2006-2010 2011-2016 1996-2000 2001-2005 2006-2010 2011-2016 12 12 10 10 8 8 6 6 4 4 2 2 0 0 -2 -2 -4 -4 -6 -6 -8 -8 -10 -10 -12 -12 -14 + DISP + ISSUE_1Y 1996-2000 2001-2005 2006-2010 2011-2016 1996-2000 2001-2005 2006-2010 2011-2016 8 6 4 6 2 4 0 2 -2 0 -4 -6 -2 -8 -4 -10 -6 -12 38 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "References",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 78,
    "chunk_index": 73,
    "word_count": 215,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "0 -2 -2 -4 -4 -6 -6 -8 -8 -10 -10 -12 -12 -14 + DISP + ISSUE_1Y 1996-2000 2001-2005 2006-2010 2011-2016 1996-2000 2001-2005 2006-2010 2011-2016 8 6 4 6 2 4 0 2 -2 0 -4 -6 -2 -8 -4 -10 -6 -12 38 Electronic copy available at: https://ssrn.com/abstract=2698267 1996-2000 2001-2005 2006-2010 2011-2016 1996-2000 2001-2005 2006-2010 2011-2016 8 8 6 6 4 4 2 2 0 0 -2 -2 -4 -6 -4 -8 -6 -10 -8 -12 – PM – Ln(PRICE) 1996-2000 2001-2005 2006-2010 2011-2016 1996-2000 2001-2005 2006-2010 2011-2016 10 14 8 12 6 10 4 8 2 6 0 4 -2 2 -4 0 -6 -2 -8 -4 -10 -6 -12 -8 – PROFIT – ZS 1996-2000 2001-2005 2006-2010 2011-2016 1996-2000 2001-2005 2006-2010 2011-2016 10 10 8 8 6 6 4 4 2 2 0 0 -2 -2 -4 -4 -6 -6 -8 -8 -10 -10 -12 -12 -14 39 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "+ ISSUE_5Y + TEF",
    "page_number": 40,
    "page_range": "p.40-41",
    "total_pages": 78,
    "chunk_index": 74,
    "word_count": 157,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "+ ISSUE_5Y + TEF (p.40-41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "-2 -8 -4 -10 -6 -12 -8 – PROFIT – ZS 1996-2000 2001-2005 2006-2010 2011-2016 1996-2000 2001-2005 2006-2010 2011-2016 10 10 8 8 6 6 4 4 2 2 0 0 -2 -2 -4 -4 -6 -6 -8 -8 -10 -10 -12 -12 -14 39 Electronic copy available at: https://ssrn.com/abstract=2698267 Table 1 Summary statistics This table reports the descriptive statistics of option returns and equity characteristics used to predict delta-hedged option returns. The sample period is from January 1996 to April 2016. Panel A reports the pooled summary of returns to delta-neutral equity call writing and the characteristics of options involved. A delta-neutral call writing position involves selling one contract of an equity call and a long position of ∆ shares of the underlying stock, where ∆ is the Black-Scholes call option delta. The position is held for one month or until option maturity. Moneyness is the ratio of stock price to option strike price. Days to maturity is the number of calendar days until the option expiration. Vega is the Black-Scholes option vega scaled by the stock price. Option bid-ask spread is the ratio of the difference between ask and bid quotes of option to the midpoint of the bid and ask quotes at the end of each month. Panel B reports the time-series average of cross-sectional statistics of equity characteristics (winsorized each month at the 0.5% level). CFV is cash flow variance as in Haugen and Baker (1996). CH is the cash-to-assets ratio as in Palazzo (2012). DISP is the analyst earnings forecast dispersion, as in Diether, Malloy, and Scherbina (2002). ISSUE_1Y represents 1-year new issues as in Pontiff and Woodgate (2008). ISSUE_5Y represents 5-year new issues as in Daniel and Titman (2006). PM is profit margin as in Soliman (2008). Ln(PRICE) is the log of the underlying stock price at the end of last month. PROFIT is the profitability as in Fama and French (2006). TEF is total external finance. ZS is Z-score as in Dichev (1998). IVOL is the annualized idiosyncratic volatility computed as in Ang, Hodrick, Xing, and Zhang (2006). VOL_deviation is the log difference between the realized volatility and the Black-Scholes implied volatility for at-the-money options at the end of last month, as in Goyal and Saretto (2009). The realized volatility is the annualized standard deviation of stock returns estimated from daily data over the previous twelve months. Ln(ME) represents the logarithm of market capitalization in billions of U.S. dollars. Ln(BM) is the logarithm of the book-to-market ratio. RET is the lagged one month stock return. RET is the cumulative stock returns from (-1,0) (-12,-2) twelve months ago till one month ago. A. Pooled summary of returns to delta-neutral call writing strategy and option characteristics (186,220 observations) Standard 10th Lower Upper 90th Variables Mean Median deviation percentile quartile quartile percentile Buy & hold until month-end (%) 3.50 5.65 -1.45 1.28 3.32 5.84 9.12 Buy & hold until maturity (%) 5.87 11.20 -4.04 1.50 5.87 10.94 17.08 Moneyness = S/K (%) 100.24 4.32 95.20 97.61 100.00 102.57 105.44 Days to maturity 50 2 47 50 50 51 52 Vega 0.14 0.01 0.13 0.14 0.14 0.15 0.15 Quoted option bid-ask spread (%) 20.34 16.88 5.66 9.11 15.29 26.01 41.51 40 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "+ ISSUE_5Y + TEF",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 78,
    "chunk_index": 75,
    "word_count": 539,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "+ ISSUE_5Y + TEF (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "5.87 10.94 17.08 Moneyness = S/K (%) 100.24 4.32 95.20 97.61 100.00 102.57 105.44 Days to maturity 50 2 47 50 50 51 52 Vega 0.14 0.01 0.13 0.14 0.14 0.15 0.15 Quoted option bid-ask spread (%) 20.34 16.88 5.66 9.11 15.29 26.01 41.51 40 Electronic copy available at: https://ssrn.com/abstract=2698267 B. Equity characteristics (time-series average of cross-sectional statistics) Standard 10th Lower Upper 90th Variable Obs Mean Median deviation percentile quartile quartile percentile CFV 165,510 0.24 1.01 0.01 0.02 0.05 0.13 0.36 CH 166,734 0.23 0.23 0.01 0.04 0.14 0.35 0.60 DISP (%) 179,502 23.73 175.85 0.85 1.59 3.41 8.96 23.77 ISSUE_1Y 180,757 0.04 0.12 -0.04 -0.01 0.01 0.05 0.16 ISSUE_5Y 145,381 0.21 0.38 -0.13 -0.02 0.12 0.34 0.66 PM 176,754 -0.60 6.21 -0.16 0.04 0.11 0.19 0.30 Ln(PRICE) 186,220 3.35 0.70 2.38 2.87 3.39 3.84 5.13 PROFIT 173,302 0.05 0.47 -0.20 0.03 0.12 0.19 0.28 TEF 146,256 0.04 0.18 -0.10 -0.04 0.00 0.06 0.25 ZS 161,489 1.46 2.18 -0.36 0.84 1.72 2.58 3.41 VOL_deviation 182,947 0.01 0.18 -0.21 -0.10 0.00 0.11 0.22 IVOL 186,209 0.39 0.22 0.17 0.24 0.34 0.48 0.67 Ln(Amihud) 186,211 -6.89 1.64 -9.04 -8.04 -6.87 -5.72 -4.76 Ln(ME) 167,564 7.63 1.47 5.86 6.57 7.47 8.58 9.66 Ln(BM) 167,264 -1.10 0.81 -2.13 -1.58 -1.03 -0.54 -0.13 RET (%) 186,042 1.76 13.17 -13.00 -5.83 1.06 8.38 16.98 (-1,0) RET (%) 183,398 26.95 65.89 -30.90 -10.49 13.57 44.91 93.82 (-12,-2) 41 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "+ ISSUE_5Y + TEF",
    "page_number": 42,
    "page_range": "p.42-43",
    "total_pages": 78,
    "chunk_index": 76,
    "word_count": 236,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "+ ISSUE_5Y + TEF (p.42-43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "-8.04 -6.87 -5.72 -4.76 Ln(ME) 167,564 7.63 1.47 5.86 6.57 7.47 8.58 9.66 Ln(BM) 167,264 -1.10 0.81 -2.13 -1.58 -1.03 -0.54 -0.13 RET (%) 186,042 1.76 13.17 -13.00 -5.83 1.06 8.38 16.98 (-1,0) RET (%) 183,398 26.95 65.89 -30.90 -10.49 13.57 44.91 93.82 (-12,-2) 41 Electronic copy available at: https://ssrn.com/abstract=2698267 Table 2 Time-series average of cross-sectional correlations The table presents the cross-sectional Pearson correlations of various option returns predictors. The variables are described in Table 1 and are winsorized each month at the 0.5% level. We compute the cross-sectional correlations each month and report the time-series average of these correlations. The sample period is from January 1996 to April 2016. ISSUE_ ISSUE_ Ln VOL_ Ln Ln CH DISP PM PROFIT TEF ZS IVOL 1Y 5Y (PRICE) deviation (Amihud) (ME) CFV -0.016 0.047 0.049 0.057 -0.029 -0.097 -0.080 0.062 -0.078 0.035 0.093 0.061 -0.067 CH 0.067 0.152 0.202 -0.298 -0.204 -0.277 0.317 -0.380 -0.021 0.310 0.225 -0.283 DISP 0.062 0.094 -0.038 -0.188 -0.120 0.076 -0.134 -0.001 0.131 0.133 -0.137 ISSUE_1Y 0.514 -0.121 -0.128 -0.203 0.262 -0.261 0.038 0.205 0.117 -0.172 ISSUE_5Y -0.195 -0.246 -0.284 0.371 -0.395 0.006 0.253 0.182 -0.217 PM 0.148 0.294 -0.297 0.377 0.046 -0.146 -0.144 0.139 Ln(PRICE) 0.265 -0.201 0.301 0.095 -0.409 -0.670 0.265 PROFIT -0.326 0.545 0.013 -0.221 -0.220 0.239 TEF -0.415 0.016 0.276 0.223 -0.239 ZS 0.046 -0.239 -0.225 0.220 VOL_deviation 0.094 -0.076 0.046 IVOL 0.380 -0.430 Ln(Amihud) -0.910 42 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "+ ISSUE_5Y + TEF",
    "page_number": 43,
    "page_range": "p.43-44",
    "total_pages": 78,
    "chunk_index": 77,
    "word_count": 239,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "+ ISSUE_5Y + TEF (p.43-44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "PM 0.148 0.294 -0.297 0.377 0.046 -0.146 -0.144 0.139 Ln(PRICE) 0.265 -0.201 0.301 0.095 -0.409 -0.670 0.265 PROFIT -0.326 0.545 0.013 -0.221 -0.220 0.239 TEF -0.415 0.016 0.276 0.223 -0.239 ZS 0.046 -0.239 -0.225 0.220 VOL_deviation 0.094 -0.076 0.046 IVOL 0.380 -0.430 Ln(Amihud) -0.910 42 Electronic copy available at: https://ssrn.com/abstract=2698267 Table 3 Average returns of portfolios of delta-neutral call writing sorted by equity characteristics This table reports the average monthly returns of delta-neutral equity call writing sorted on various characteristics of the underlying stock described in Table 1. At the end of each month, we rank all stocks with options traded into deciles by the equity characteristics. For each stock, we sell one contract of call option against a long position of ∆ shares of the underlying stock, where ∆ is the Black-Scholes call option delta. The position is held for one month without rebalancing the delta-hedges. We use three weighting schemes when computing the average return of a portfolio of delta-neutral call writing on stocks: weight by the market capitalization of the underlying stock (Stock-VW), equal weight (EW), and weight by the market value of option open interest (Option-VW) at the beginning of the period. The table reports the return for each decile option portfolio as well as the 10-1 spread return (i.e., difference between the returns of the top and bottom decile portfolios). We also form quintile portfolios when sorting by each equity characteristics. We sort on the negative value of some characteristics (e.g., profit margin, stock price level, profitability and Z-score) in order to generate increasing average returns from decile 1 to decile 10 portfolios. The (5-1) spread return is the average difference between the returns of the top and bottom quintile portfolios of delta- neutral call writing. All returns in this table are expressed in percent. The sample period is from January 1996 to April 2016. To adjust for serial correlation, robust Newey-West (1987) t-statistics are reported in brackets. (10-1) (5-1) 1 2 3 4 5 6 7 8 9 10 Spread Spread CFV Stock-VW 1.90 2.01 2.05 2.23 2.29 2.47 2.59 2.64 2.71 2.76 0.87*** 0.75*** (16.26) (17.74) (17.20) (20.78) (15.89) (16.83) (16.22) (15.27) (15.73) (13.07) (5.92) (7.04) EW 2.55 2.69 2.92 3.02 3.29 3.53 3.79 4.01 4.23 4.18 1.63*** 1.58*** (21.73) (21.28) (23.86) (24.28) (23.90) (23.06) (22.44) (23.26) (22.59) (19.96) (11.74) (14.93) Option-VW 2.15 2.23 2.50 2.51 2.80 3.11 3.55 3.54 3.68 3.65 1.51*** 1.53*** (12.54) (17.04) (18.44) (16.56) (17.40) (17.44) (14.87) (14.96) (15.52) (12.35) (6.36) (8.56) CH Stock-VW 2.28 2.00 2.06 2.11 2.07 2.31 2.39 2.48 2.63 2.75 0.48** 0.41** (17.08) (19.27) (18.46) (18.78) (17.05) (17.39) (15.98) (12.18) (15.12) (11.43) (2.02) (2.51) EW 3.03 2.91 2.96 3.13 3.26 3.54 3.62 3.79 4.05 5.14 2.11*** 1.63*** (21.10) (24.82) (21.63) (22.53) (23.35) (25.02) (23.00) (23.78) (24.53) (30.89) (15.88) (13.99) Option-VW 2.59 2.62 2.57 2.58 2.89 2.92 2.86 2.91 3.01 4.02 1.43*** 0.41** (16.35) (19.89) (16.23) (17.23) (21.16) (16.61) (15.89) (13.81) (13.01) (14.29) (4.92) (2.51) DISP Stock-VW 1.87 1.98 1.98 2.08 2.18 2.30 2.42 2.59 2.92 3.38 1.51*** 1.15*** (16.39) (18.63) (19.07) (18.06) (16.74) (17.03) (16.66) (16.04) (18.78) (18.94) (10.94) (10.24) EW 2.62 2.59 2.78 2.90 3.14 3.35 3.68 3.97 4.30 4.66 2.03*** 1.87*** (21.83) (22.94) (23.80) (22.40) (23.85) (24.58) (26.22) (25.28) (28.09) (26.87) (19.81) (21.95) Option-VW 2.04 2.18 2.29 2.41 2.48 2.79 2.99 3.25 3.82 4.42 2.38*** 1.15*** (11.20) (20.28) (20.31) (18.55) (16.01) (14.67) (16.24) (14.72) (18.99) (16.36) (10.25) (10.24) 43 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "+ ISSUE_5Y + TEF",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 78,
    "chunk_index": 78,
    "word_count": 571,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "+ ISSUE_5Y + TEF (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "3.35 3.68 3.97 4.30 4.66 2.03*** 1.87*** (21.83) (22.94) (23.80) (22.40) (23.85) (24.58) (26.22) (25.28) (28.09) (26.87) (19.81) (21.95) Option-VW 2.04 2.18 2.29 2.41 2.48 2.79 2.99 3.25 3.82 4.42 2.38*** 1.15*** (11.20) (20.28) (20.31) (18.55) (16.01) (14.67) (16.24) (14.72) (18.99) (16.36) (10.25) (10.24) 43 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "+ ISSUE_5Y + TEF",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 78,
    "chunk_index": 79,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "+ ISSUE_5Y + TEF (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Stock-VW 2.15 1.91 2.03 2.13 2.27 2.33 2.35 2.51 2.41 2.72 0.56*** 0.54*** (18.88) (20.07) (18.47) (17.63) (19.08) (15.31) (16.73) (17.36) (14.84) (17.19) (4.86) (5.64) EW 2.76 2.70 2.95 3.28 3.47 3.58 3.69 3.75 3.91 4.37 1.60*** 1.41*** (23.33) (23.32) (23.54) (24.01) (23.91) (23.83) (24.23) (24.47) (26.47) (29.30) (14.84) (16.83) Option-VW 2.49 2.03 2.52 2.68 2.93 3.09 3.08 3.08 3.26 3.62 1.13*** 0.54*** (21.43) (13.31) (17.32) (18.26) (18.05) (19.27) (16.72) (14.24) (16.34) (12.23) (3.92) (5.64) ISSUE_5Y Stock-VW 2.00 1.97 2.02 2.00 2.11 2.35 2.15 2.41 2.45 2.73 0.73*** 0.56*** (18.99) (17.58) (20.15) (13.98) (16.90) (15.91) (14.10) (18.03) (15.67) (18.75) (7.98) (6.62) EW 2.53 2.55 2.74 2.95 3.08 3.30 3.49 3.60 3.94 4.39 1.86*** 1.63*** (24.10) (25.29) (23.78) (23.04) (21.84) (22.42) (24.76) (24.76) (27.92) (29.93) (19.92) (23.11) Option-VW 2.33 2.24 2.33 2.53 2.72 2.80 2.70 3.07 3.25 4.00 1.67*** 1.32*** (19.75) (17.74) (15.92) (15.29) (17.32) (15.30) (15.33) (16.99) (15.41) (17.90) (8.19) (8.21) TEF Stock-VW 2.03 2.09 2.05 2.15 2.07 2.30 2.23 2.46 2.69 3.32 1.28*** 0.85*** (18.66) (20.04) (15.63) (19.41) (14.34) (17.27) (15.05) (14.16) (16.86) (19.03) (8.88) (7.51) EW 2.91 2.83 2.89 3.10 3.17 3.50 3.53 3.58 3.72 4.78 1.87*** 1.38*** (27.55) (23.75) (21.97) (22.85) (22.76) (24.13) (24.79) (24.43) (23.06) (27.06) (14.63) (14.17) Option-VW 2.48 2.35 2.58 2.82 2.60 3.05 2.77 3.25 3.31 4.34 1.85*** 1.40*** (19.73) (19.77) (16.86) (18.75) (14.59) (15.87) (13.84) (14.42) (15.50) (15.40) (7.76) (7.36) –PM Stock-VW 1.98 1.97 2.06 2.20 2.13 2.23 2.29 2.39 2.98 3.90 1.92*** 1.27*** (14.34) (15.37) (19.80) (18.78) (18.15) (18.91) (21.10) (17.54) (18.76) (18.21) (11.98) (10.73) EW 2.90 2.92 2.92 3.02 3.00 3.08 3.24 3.52 4.18 5.42 2.53*** 1.89*** (21.62) (20.95) (22.84) (22.89) (23.84) (22.72) (26.94) (25.53) (24.62) (31.25) (22.11) (20.17) Option-VW 2.46 2.38 2.67 2.52 2.43 2.61 2.63 2.95 3.77 5.18 2.72*** 1.99*** (14.54) (14.01) (17.90) (18.06) (18.26) (15.29) (20.55) (16.26) (17.64) (16.96) (10.60) (10.68) –Ln(PRICE) Stock-VW 1.59 1.85 2.06 2.38 2.48 2.78 3.17 3.68 4.68 6.26 4.67*** 3.53*** (13.78) (16.91) (20.37) (19.80) (19.97) (18.68) (23.99) (22.84) (24.52) (29.27) (25.17) (23.32) EW 1.79 2.14 2.33 2.65 2.79 3.18 3.70 4.23 5.08 6.80 5.01*** 3.97*** (13.88) (19.34) (20.89) (22.14) (22.88) (24.20) (24.82) (27.43) (27.45) (35.00) (33.23) (31.60) Option-VW 1.60 2.08 2.39 2.67 2.86 3.22 3.85 4.42 5.55 7.45 5.85*** 4.61*** (10.34) (16.27) (16.77) (17.67) (17.32) (18.58) (20.95) (18.85) (26.73) (25.37) (20.18) (21.14) 44 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "ISSUE_1Y",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 78,
    "chunk_index": 80,
    "word_count": 385,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "ISSUE_1Y (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "3.18 3.70 4.23 5.08 6.80 5.01*** 3.97*** (13.88) (19.34) (20.89) (22.14) (22.88) (24.20) (24.82) (27.43) (27.45) (35.00) (33.23) (31.60) Option-VW 1.60 2.08 2.39 2.67 2.86 3.22 3.85 4.42 5.55 7.45 5.85*** 4.61*** (10.34) (16.27) (16.77) (17.67) (17.32) (18.58) (20.95) (18.85) (26.73) (25.37) (20.18) (21.14) 44 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "ISSUE_1Y",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 78,
    "chunk_index": 81,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "ISSUE_1Y (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Stock-VW 1.96 2.02 1.99 2.10 2.06 2.23 2.40 2.55 2.94 3.70 1.73*** 1.23*** (15.86) (18.85) (17.81) (18.30) (19.58) (17.67) (13.73) (18.56) (17.48) (18.87) (10.96) (10.48) EW 2.90 2.82 2.78 2.96 2.94 3.16 3.33 3.66 4.17 5.38 2.48*** 1.91*** (23.37) (22.02) (22.21) (22.47) (23.42) (22.57) (22.88) (27.39) (25.29) (31.00) (21.67) (19.97) Option-VW 2.29 2.39 2.31 2.59 2.54 2.60 2.98 3.09 3.68 4.92 2.63*** 2.01*** (16.02) (19.01) (16.66) (17.51) (16.67) (18.41) (12.44) (16.34) (16.65) (16.65) (10.37) (10.44) –ZS Stock-VW 2.20 2.02 1.91 2.08 2.11 2.27 2.33 2.28 2.68 4.05 1.85*** 0.92*** (17.71) (13.39) (15.39) (17.82) (18.43) (19.13) (19.09) (19.75) (17.76) (20.18) (10.73) (7.96) EW 3.07 3.02 3.01 3.05 3.17 3.34 3.35 3.39 4.01 5.67 2.60*** 1.79*** (22.93) (22.57) (24.04) (23.67) (23.48) (23.58) (23.42) (24.62) (25.80) (32.10) (20.11) (17.81) Option-VW 2.42 2.36 2.17 2.47 2.78 2.73 2.89 2.82 3.54 5.54 3.12*** 2.03*** (15.73) (13.80) (15.14) (17.19) (19.23) (16.19) (14.84) (15.77) (13.73) (22.01) (11.82) (10.16) –VOL_deviation Stock-VW 1.23 1.63 1.80 1.95 2.20 2.28 2.45 2.65 2.96 4.10 2.86*** 1.91*** (7.38) (11.81) (12.19) (15.90) (18.95) (19.85) (22.40) (20.94) (20.69) (23.38) (12.42) (11.02) EW 1.77 2.35 2.68 2.94 3.20 3.40 3.65 4.02 4.49 6.25 4.48*** 3.31*** (9.74) (15.86) (17.07) (20.57) (22.86) (23.78) (26.02) (26.29) (26.84) (33.91) (16.72) (14.85) Option-VW 1.50 2.02 2.03 2.32 2.62 2.89 2.89 3.36 3.75 5.80 4.30*** 3.01*** (5.55) (11.12) (9.98) (15.17) (17.58) (18.07) (18.45) (17.74) (19.56) (22.17) (11.76) (10.97) IVOL Stock-VW 1.66 1.90 2.01 2.32 2.52 2.68 3.00 3.30 3.57 4.63 2.97*** 2.25*** (16.34) (18.65) (17.02) (17.72) (18.44) (16.53) (18.45) (18.76) (17.32) (20.97) (17.64) (15.13) EW 1.90 2.24 2.58 2.92 3.18 3.47 3.75 4.21 4.64 5.78 3.88*** 3.14*** (20.71) (22.14) (23.98) (22.97) (23.25) (24.93) (24.14) (25.53) (26.07) (30.22) (28.24) (26.45) Option-VW 1.72 1.83 2.02 2.40 2.80 2.87 3.45 3.88 4.46 5.39 3.67*** 2.25*** (18.27) (13.03) (13.67) (18.24) (18.52) (16.04) (17.25) (18.45) (17.72) (18.06) (14.05) (15.13) Ln(Amihud) Stock-VW 1.87 2.21 2.43 2.69 2.96 3.16 3.46 3.88 4.37 5.24 3.38*** 2.75*** (16.28) (19.32) (20.23) (21.96) (23.87) (24.60) (24.29) (27.16) (29.28) (30.33) (29.11) (27.95) EW 1.97 2.32 2.53 2.84 3.12 3.40 3.72 4.23 4.79 5.76 3.79*** 3.13*** (15.89) (18.38) (19.98) (22.06) (24.60) (24.65) (24.94) (28.22) (29.56) (32.97) (30.85) (30.05) Option-VW 2.00 2.74 2.90 3.12 3.70 4.15 4.38 5.12 5.70 6.73 4.73*** 3.96*** (14.08) (16.92) (17.25) (17.31) (20.24) (20.85) (20.31) (23.94) (20.46) (25.98) (19.21) (19.46) 45 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 78,
    "chunk_index": 82,
    "word_count": 385,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "3.40 3.72 4.23 4.79 5.76 3.79*** 3.13*** (15.89) (18.38) (19.98) (22.06) (24.60) (24.65) (24.94) (28.22) (29.56) (32.97) (30.85) (30.05) Option-VW 2.00 2.74 2.90 3.12 3.70 4.15 4.38 5.12 5.70 6.73 4.73*** 3.96*** (14.08) (16.92) (17.25) (17.31) (20.24) (20.85) (20.31) (23.94) (20.46) (25.98) (19.21) (19.46) 45 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 78,
    "chunk_index": 83,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Table 4 Returns of option portfolio strategies Panel A of this table reports some summary statistics for the returns of ten option portfolio strategies. For each equity characteristics in the row label, we first form 10 decile portfolios of delta-neutral equity call writing by sorting on the characteristic of the underlying stock and then take the difference in the stock-value-weighted returns between the top and the bottom decile portfolios. Panel B reports the average return of our option strategies for different subsamples. The sentiment index is constructed by Baker and Wurgler (2006). The business cycle dates are from The National Bureau of Economic Research (NBER). The broker-dealer’s quarterly leverage is measured as in Adrian, Etula, and Muir (2014) using data from the Federal Reserve. The sample period is from January 1996 to April 2016. A. Time-series distribution of stock-value-weighted returns of option portfolio strategies Sorted on 10-1 Spread Portfolios of Delta-Neutral Call-Writing Sorted on Various Equity Characteristics Excess Sharpe Mean Min 10-Pctl Q1 Med Q3 90-Pctl Max Std Skewness Kurtosis Ratio CFV 0.87*** -9.62 -0.65 0.01 0.84 1.67 3.22 9.91 2.00 -0.68 6.97 0.43 CH 0.48** -13.02 -3.08 -0.72 0.90 2.22 3.41 10.32 3.06 -1.24 4.00 0.16 DISP 1.51*** -5.96 -0.68 0.62 1.57 2.50 3.77 9.05 1.97 -0.33 2.09 0.77 ISSUE_1Y 0.56*** -10.69 -0.95 -0.16 0.66 1.54 2.19 5.59 1.73 -2.01 10.14 0.33 ISSUE_5Y 0.73*** -5.72 -1.04 0.06 0.84 1.55 2.26 5.92 1.47 -0.42 2.82 0.49 TEF 1.28*** -11.32 -1.01 0.41 1.33 2.28 3.79 7.32 2.24 -1.17 6.82 0.57 –PM 1.92*** -10.47 -0.53 0.85 2.09 3.32 4.61 7.64 2.39 -1.23 4.29 0.80 –Ln(PRICE) 4.67*** -6.32 2.09 3.11 4.38 6.06 8.31 12.18 2.45 0.09 1.68 1.90 –PROFIT 1.73*** -10.19 -0.33 0.79 1.84 2.89 3.91 8.90 2.25 -0.97 4.95 0.77 –ZS 1.85*** -11.70 -0.38 0.59 1.91 3.19 4.68 8.90 2.39 -1.13 5.65 0.78 46 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 78,
    "chunk_index": 84,
    "word_count": 307,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "7.64 2.39 -1.23 4.29 0.80 –Ln(PRICE) 4.67*** -6.32 2.09 3.11 4.38 6.06 8.31 12.18 2.45 0.09 1.68 1.90 –PROFIT 1.73*** -10.19 -0.33 0.79 1.84 2.89 3.91 8.90 2.25 -0.97 4.95 0.77 –ZS 1.85*** -11.70 -0.38 0.59 1.91 3.19 4.68 8.90 2.39 -1.13 5.65 0.78 46 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 48,
    "page_range": "p.48",
    "total_pages": 78,
    "chunk_index": 85,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "B. Sub-sample analyses Stock-Value-Weighted Average Returns of Option Portfolio Strategies (1) (2) (3) (4) (5) (6) (7) (8) (9) (10) (11) (12) Broker- Broker- 1996– 2006– Sentiment Sentiment Positive Negative NBER NBER January Feb-Dec dealer dealer 2005 2016 Low High Mkt Ret Mkt Ret Expansion Recession Leverage Leverage Low High # of Months 120 124 21 223 122 122 151 93 218 26 120 123 CFV 0.82*** 0.91*** 0.93*** 0.86*** 0.79*** 0.40** 1.14*** 0.79*** 0.80*** 1.42** 1.16*** 0.54** (3.77) (4.56) (3.17) (5.25) (3.43) (2.05) (6.25) (3.43) (5.60) (2.63) (6.89) (2.14) CH 0.54 0.42 -1.22 0.64*** 0.53 0.44 0.32 0.53 0.50** 0.33 0.22 0.71** (1.44) (1.43) (-1.00) (2.66) (1.39) (1.36) (0.96) (1.39) (2.05) (0.36) (0.63) (2.41) DISP 1.36*** 1.67*** 1.48*** 1.52*** 1.38*** 1.16*** 1.89*** 1.38*** 1.50*** 1.65*** 1.76*** 1.28*** (6.14) (10.10) (4.26) (10.60) (6.11) (6.19) (12.48) (6.11) (10.87) (2.86) (10.60) (5.98) ISSUE_1Y 0.26 0.85*** 0.18 0.60*** 0.18 0.36** 0.77*** 0.18 0.57*** 0.50 0.74*** 0.39*** (1.37) (7.58) (0.58) (4.82) (0.88) (2.60) (5.04) (0.88) (4.84) (1.24) (3.95) (2.97) ISSUE_5Y 0.65*** 0.80*** 0.38 0.76*** 0.60*** 0.52*** 0.91*** 0.60*** 0.77*** 0.42* 0.87*** 0.59*** (4.21) (8.26) (1.27) (7.46) (3.74) (4.19) (8.63) (3.74) (7.98) (1.74) (7.15) (4.34) TEF 1.38*** 1.19*** 1.38** 1.28*** 1.31*** 1.14*** 1.56*** 1.31*** 1.30*** 1.11** 1.33*** 1.24*** (5.44) (8.27) (2.74) (7.55) (4.68) (4.67) (8.87) (4.68) (9.02) (2.28) (8.25) (5.27) –PM 1.80*** 2.04*** 2.00*** 1.92*** 1.77*** 1.72*** 2.23*** 1.77*** 1.98*** 1.43*** 1.97*** 1.87*** (6.25) (13.92) (3.53) (10.93) (5.83) (6.66) (11.38) (5.83) (11.60) (4.59) (9.29) (7.78) –Ln(PRICE) 5.16*** 4.20*** 5.39*** 4.60*** 5.15*** 4.64*** 5.09*** 5.15*** 4.59*** 5.32*** 4.72*** 4.65*** (17.83) (21.19) (5.27) (26.01) (18.67) (16.87) (21.52) (18.67) (24.83) (8.21) (19.55) (16.56) –PROFIT 1.63*** 1.83*** 1.38*** 1.77*** 1.64*** 1.39*** 2.03*** 1.64*** 1.72*** 1.89*** 1.88*** 1.59*** (5.61) (13.81) (4.26) (10.46) (5.59) (5.68) (11.11) (5.59) (9.88) (5.71) (9.57) (6.13) –ZS 1.94*** 1.77*** 1.61*** 1.88*** 2.11*** 1.57*** 2.04*** 2.11*** 1.94*** 1.14*** 1.68*** 2.01*** (6.19) (11.52) (4.94) (9.72) (6.84) (5.69) (9.76) (6.84) (10.16) (3.15) (6.70) (8.53) 47 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 48,
    "page_range": "p.48",
    "total_pages": 78,
    "chunk_index": 86,
    "word_count": 321,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "1.39*** 2.03*** 1.64*** 1.72*** 1.89*** 1.88*** 1.59*** (5.61) (13.81) (4.26) (10.46) (5.59) (5.68) (11.11) (5.59) (9.88) (5.71) (9.57) (6.13) –ZS 1.94*** 1.77*** 1.61*** 1.88*** 2.11*** 1.57*** 2.04*** 2.11*** 1.94*** 1.14*** 1.68*** 2.01*** (6.19) (11.52) (4.94) (9.72) (6.84) (5.69) (9.76) (6.84) (10.16) (3.15) (6.70) (8.53) 47 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 49,
    "page_range": "p.49",
    "total_pages": 78,
    "chunk_index": 87,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Table 5 Returns of option portfolio strategies adjusting for control variables This table reports the stock-value-weighted average returns of our option portfolio strategies after accounting for various control variables using the dependent double-sorts approach. Each row of the table corresponds to one option portfolio strategy, obtained by sorting delta-neutral writing equity calls by one characteristics of the underlying stock. Each column corresponds to one control variable. In each month, for each equity characteristics used in our option strategies and for each control variable, we first sort our option sample into five quintiles by the value of the control variable. Within each quintile, we further sort options into five portfolios by the equity characteristics. We then aggregate the 25 option portfolios across the five control quintiles to produce five portfolios of delta-neutral call writing with similar level in the control variable, but with dispersion in the equity characteristics. We report the difference in average monthly returns (in percent) between the top and the bottom quintile portfolios. The control variables include VOL_deviation (the log difference between historical realized stock volatility and the Black-Scholes at-the-money option implied volatility), idiosyncratic volatility (IVOL, the annualized stock return idiosyncratic volatility of last month defined in Ang, Hodrick, Xing and Zhang 2006), Stock Ln(Amihud) (the Amihud (2002) illiquidity measure’s logarithm), option bid-ask spread (the ratio of the difference between the ask and bid quotes of the option to the midpoint of the bid and ask quotes at the end of last month), Ln(ME) and Ln(BM) as defined in Fama and French (1992). RET is the lagged one month stock return. RET (-1,0) (- is the cumulative stock returns from twelve months ago till one month ago. Vega, theta, delta, and gamma are the option Greeks according to the 12,-2) Black-Scholes model. The sample period is from January 1996 to April 2016. To adjust for serial correlation, robust Newey-West (1987) t-statistics are reported in brackets. 48 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 49,
    "page_range": "p.49",
    "total_pages": 78,
    "chunk_index": 88,
    "word_count": 323,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "months ago till one month ago. Vega, theta, delta, and gamma are the option Greeks according to the 12,-2) Black-Scholes model. The sample period is from January 1996 to April 2016. To adjust for serial correlation, robust Newey-West (1987) t-statistics are reported in brackets. 48 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 78,
    "chunk_index": 89,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Stock-Value-Weighted Returns of Option Portfolio Strategies Adjusting for Control Variables Sorted on Control for Option VOL_ Ln Ln Ln RET RET IVOL bid-ask Vega Theta Gamma Gamma2 deviation (Amihud) (ME) (BM) spread (-12, -2) (-1,0) CFV 1.07*** 0.49*** 0.81*** 0.86*** 0.75*** 0.85*** 0.72*** 0.67*** 0.90*** 0.89*** 0.87*** 0.87*** (9.88) (4.74) (9.57) (7.81) (7.62) (7.62) (7.48) (5.77) (8.78) (9.93) (9.36) (9.36) CH 1.00*** 0.27** 1.00*** 1.09*** 0.75*** 1.02*** 0.70*** 0.76*** 0.85*** 1.29*** 1.29*** 1.29*** (8.62) (2.18) (9.94) (7.75) (5.87) (8.39) (6.33) (6.02) (6.51) (11.07) (11.06) (11.06) DISP 1.32*** 0.59*** 0.97*** 1.19*** 0.92*** 1.20*** 0.95*** 1.02*** 1.24*** 1.22*** 1.22*** 1.22*** (12.36) (6.16) (12.56) (12.56) (9.20) (11.28) (10.06) (10.60) (11.41) (14.20) (14.39) (14.39) ISSUE_1Y 0.79*** 0.18 0.79*** 0.57*** 0.50*** 0.57*** 0.58*** 0.54*** 0.66*** 0.81*** 0.79*** 0.79*** (11.03) (1.64) (10.71) (5.50) (6.03) (6.79) (6.94) (5.63) (7.36) (10.89) (10.64) (10.64) ISSUE_5Y 0.85*** 0.42*** 0.91*** 0.72*** 0.74*** 0.69*** 0.66*** 0.63*** 0.68*** 0.75*** 0.74*** 0.74*** (12.20) (5.40) (14.05) (10.24) (10.26) (9.03) (8.84) (8.53) (8.56) (9.66) (8.87) (8.87) TEF 1.01*** 0.24*** 0.70*** 0.82*** 0.54*** 0.69*** 0.76*** 0.73*** 0.88*** 1.01*** 1.09*** 1.09*** (9.12) (2.93) (8.79) (6.27) (5.88) (5.95) (7.98) (6.75) (8.12) (9.97) (10.69) (10.69) –PM 1.45*** 0.63*** 1.01*** 1.31*** 0.74*** 1.20*** 1.10*** 1.09*** 1.33*** 1.43*** 1.42*** 1.42*** (14.84) (6.07) (12.68) (11.29) (7.41) (10.42) (12.53) (9.80) (12.23) (16.55) (17.44) (17.44) –Ln(PRICE) 3.25*** 2.68*** 2.41*** 3.36*** 2.48*** 3.38*** 3.08*** 3.15*** 3.66*** 3.98*** 3.85*** 3.85*** (26.68) (20.28) (26.40) (20.14) (19.87) (26.03) (24.99) (24.48) (26.59) (27.27) (25.76) (25.76) –PROFIT 1.42*** 0.71*** 1.01*** 1.23*** 0.88*** 1.26*** 1.13*** 1.12*** 1.33*** 1.33*** 1.29*** 1.29*** (15.88) (7.45) (12.91) (10.79) (9.11) (12.93) (12.69) (11.27) (13.09) (17.05) (15.48) (15.48) –ZS 1.10*** 0.77*** 1.07*** 0.88*** 0.97*** 0.85*** 0.90*** 0.94*** 0.95*** 1.02*** 1.02*** 1.02*** (11.37) (8.36) (12.36) (8.46) (10.39) (9.01) (10.46) (9.76) (8.79) (11.63) (11.42) (11.42) 49 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 78,
    "chunk_index": 90,
    "word_count": 291,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "1.26*** 1.13*** 1.12*** 1.33*** 1.33*** 1.29*** 1.29*** (15.88) (7.45) (12.91) (10.79) (9.11) (12.93) (12.69) (11.27) (13.09) (17.05) (15.48) (15.48) –ZS 1.10*** 0.77*** 1.07*** 0.88*** 0.97*** 0.85*** 0.90*** 0.94*** 0.95*** 1.02*** 1.02*** 1.02*** (11.37) (8.36) (12.36) (8.46) (10.39) (9.01) (10.46) (9.76) (8.79) (11.63) (11.42) (11.42) 49 Electronic copy available at: https://ssrn.com/abstract=2698267 Table 6 Impact of option transaction costs on the profitability of option portfolio strategies This table examines the impact of stock options’ transaction costs (bid-ask spreads and margin requirements) on the profitability of our option portfolio strategies (stock-value-weighted). For the column “No Cost”, we assume the options are transacted at the midpoint of the bid and ask quotes (i.e., effective spread is zero). The other columns correspond to different assumptions on the ratio of effective bid-ask spread (ESPR) to the quoted bid-ask spread (QSPR). The margin requirement adjusted return is calculated using initial CBOE-based option margin requirements and option-maturity matched LIBOR rate for the interest expense. Following Weinbaum, Fodor, Muravyev, and Cremers (2020), the margin costs equal the cost of borrowing the additional capital to meet the margin requirement. The margin requirement adjusted return is calculated using initial CBOE-based option margin requirements and option- maturity matched LIBOR rate for interest expense. In the right panel, we repeat the analyses for the subsample starting May 2003 using the actual effective option bid-ask spreads obtained from intraday option OPRA data. All of the numbers in this table are monthly returns expressed in percent. To adjust for serial correlation, robust Newey-West (1987) t-statistics are reported in brackets. 50 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 51,
    "page_range": "p.51",
    "total_pages": 78,
    "chunk_index": 91,
    "word_count": 260,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.51)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "the subsample starting May 2003 using the actual effective option bid-ask spreads obtained from intraday option OPRA data. All of the numbers in this table are monthly returns expressed in percent. To adjust for serial correlation, robust Newey-West (1987) t-statistics are reported in brackets. 50 Electronic copy available at: https://ssrn.com/abstract=2698267 Stock-VW Subsample with Effective Bid-Ask Spread from Full sample: 1996.1-2016.4 (10-1) Spread OPRA: 2003.5-20016.4 Assumed Effective Bid-Ask Spread / Quoted Bid-Ask Spread Actual Effective Bid-Ask Spread 0% 50% + With Effective Effective Spread 25% 50% 75% 100% No cost No cost Margin Cost Spread + Margin Cost CFV 0.87*** 0.72*** 0.58*** 0.44*** 0.29** 0.47*** 1.06*** 0.79*** 0.72*** (5.92) (5.19) (4.38) (3.47) (2.40) (3.42) (4.47) (3.86) (3.45) CH 0.48** 0.34 0.20 0.07 -0.06 0.08 0.49 0.24 0.16 (2.02) (1.52) (0.95) (0.34) (-0.27) (0.37) (1.53) (0.87) (0.59) DISP 1.51*** 1.23*** 0.95*** 0.67*** 0.40*** 0.84*** 1.84*** 1.35*** 1.27*** (10.94) (9.08) (7.08) (5.01) (2.94) (6.12) (12.25) (8.92) (8.08) ISSUE_1Y 0.56*** 0.45*** 0.34*** 0.22** 0.12 0.22* 0.84*** 0.56*** 0.49*** (4.86) (4.06) (3.11) (2.08) (1.05) (1.93) (5.67) (4.38) (3.69) ISSUE_5Y 0.73*** 0.63*** 0.53*** 0.43*** 0.33*** 0.41*** 0.71*** 0.47*** 0.40** (7.98) (6.86) (5.65) (4.44) (3.28) (4.25) (4.55) (3.10) (2.58) TEF 1.28*** 0.99*** 0.69*** 0.40*** 0.12 0.57*** 1.37*** 0.92*** 0.85*** (8.88) (7.07) (4.95) (2.77) (0.77) (3.98) (6.92) (5.23) (4.68) –PM 1.92*** 1.49*** 1.08*** 0.67*** 0.26 0.94*** 2.40*** 1.66*** 1.58*** (11.98) (9.50) (6.85) (4.16) (1.55) (5.75) (14.07) (10.75) (9.99) –Ln(PRICE) 4.67*** 3.72*** 2.80*** 1.90*** 1.01*** 2.68*** 3.96*** 2.78*** 2.70*** (25.17) (21.19) (16.19) (10.77) (5.48) (15.71) (18.01) (12.86) (12.21) –PROFIT 1.73*** 1.39*** 1.05*** 0.71*** 0.38** 0.93*** 2.34*** 1.72*** 1.65*** (10.96) (8.84) (6.62) (4.40) (2.28) (5.79) (12.63) (10.68) (9.85) –ZS 1.85*** 1.49*** 1.14*** 0.79*** 0.45** 0.99*** 2.20*** 1.54*** 1.47*** (10.73) (8.89) (6.74) (4.52) (2.43) (5.63) (11.09) (8.89) (8.23) 51 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 52,
    "page_range": "p.52",
    "total_pages": 78,
    "chunk_index": 92,
    "word_count": 293,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.52)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "(10.77) (5.48) (15.71) (18.01) (12.86) (12.21) –PROFIT 1.73*** 1.39*** 1.05*** 0.71*** 0.38** 0.93*** 2.34*** 1.72*** 1.65*** (10.96) (8.84) (6.62) (4.40) (2.28) (5.79) (12.63) (10.68) (9.85) –ZS 1.85*** 1.49*** 1.14*** 0.79*** 0.45** 0.99*** 2.20*** 1.54*** 1.47*** (10.73) (8.89) (6.74) (4.52) (2.43) (5.63) (11.09) (8.89) (8.23) 51 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 53,
    "page_range": "p.53",
    "total_pages": 78,
    "chunk_index": 93,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.53)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Table 7 Potential explanations This table reports the test results for several potential explanations of the option return predictability we document. Panels A, B, and C report Fama- MacBeth regressions with the return to writing delta-neutral call option on stock (expressed in percent) as the dependent variable. Each regression uses one and only one of the stock characteristics as the key regressor. The variance risk premium (VRP) is defined as the difference between a model free estimate of the risk-neutral expected variance implied from stock options at the end of last month and the realized variance estimated from intradaily stock returns over the previous month. The uncertainty in stock volatility (VOL-of-VOL) is the standard deviation of the stock's ATM implied volatilities over all days in the previous month divided by the mean of these same implied volatilities as in Baltussen, Van Bekkum, and Van Der Grient (2018). Option-implied Skewness and Kurtosis are the risk-neutral skewness and kurtosis of stock returns inferred from a cross-section of out-of-the-money calls and puts as in Bakshi, Kapadia, and Madan (2003). Stock PIN is the probability of informed trading in Easley, Hvidkjaer, and O'hara (2002). Option demand pressure is the log difference between the total market value of all options and the market value of underlying stocks at the end of last month. Stock MAX(5) is the average of five highest daily returns of underlying stock in the previous month. All independent variables are winsorized each month at the 0.5% level. Panel D reports the stock-value-weighted average returns of option portfolio strategies after controlling for one of the explanatory variables using dependent double-sorts. Each month, we first sort our option sample into five quintiles by one of the explanatory variables. Within each quintile, we further sort options into five portfolios according to one of our option portfolio strategies. We then aggregate the 25 option portfolios across the five explanatory quintiles to produce five portfolios of delta-neutral equity call writing with similar level in the explanatory variable, but with dispersion in the equity characteristics that predict delta-hedged option returns. Panel D reports the difference in average monthly returns (in percent) of delta-neutral equity call writing between quintile 5 and 1, for each pair of equity characteristics (corresponding to an option portfolio strategy) and explanatory variable. The sample period is from January 1996 to April 2016. To adjust for serial correlation, robust Newey-West (1987) t-statistics are reported in brackets. 52 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 53,
    "page_range": "p.53",
    "total_pages": 78,
    "chunk_index": 94,
    "word_count": 408,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.53)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "writing between quintile 5 and 1, for each pair of equity characteristics (corresponding to an option portfolio strategy) and explanatory variable. The sample period is from January 1996 to April 2016. To adjust for serial correlation, robust Newey-West (1987) t-statistics are reported in brackets. 52 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 54,
    "page_range": "p.54",
    "total_pages": 78,
    "chunk_index": 95,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.54)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "A. Controlling for individual explanation (variance risk premium, uncertainty in volatility, jump risk) Sub-sample with Sub-sample with Sub-sample with Variance Risk Premium Measure Uncertainty in Volatility Measure Jump Risk Measure (Average 93% of Full Sample) (Average 97% of Full Sample) (Average 70% of Full Sample) No Control for No Control for No Control for Controls Variance Risk Premium Controls Uncertainty in Volatility Controls Jump Risk Stock Stock Stock Stock Stock Stock Option- Option- VOL-of- Characteri Characteri VRP Characteri Characteri Characteri Characteri implied implied VOL stics stics stics stics stics stics Skewness Kurtosis CFV 0.482*** 0.411*** 10.228*** 0.458*** 0.442*** 4.545*** 0.407*** 0.175** 0.342*** 9.108*** (4.79) (4.40) (11.11) (4.85) (4.80) (6.08) (3.76) (2.21) (8.84) (8.82) CH 2.848*** 1.946*** 8.704*** 2.877*** 2.845*** 4.448*** 2.679*** 1.743*** 0.347*** 10.099*** (17.01) (11.16) (9.88) (17.97) (17.79) (6.16) (15.16) (9.11) (8.61) (8.23) DISP 0.831*** 0.620*** 9.158*** 0.848*** 0.836*** 4.787*** 0.816*** 0.469*** 0.358*** 10.009*** (10.09) (8.74) (9.82) (10.23) (10.26) (6.97) (7.64) (4.92) (9.68) (8.70) ISSUE_1Y 3.275*** 2.337*** 8.971*** 3.407*** 3.354*** 5.002*** 3.075*** 1.625*** 0.358*** 10.813*** (11.90) (10.78) (9.56) (12.95) (12.79) (6.98) (10.51) (6.20) (9.53) (8.67) ISSUE_5Y 1.453*** 1.071*** 8.727*** 1.470*** 1.448*** 4.613*** 1.332*** 0.846*** 0.311*** 11.022*** (20.85) (16.51) (9.64) (21.31) (20.77) (6.65) (16.42) (10.62) (8.83) (7.75) TEF 3.167*** 2.193*** 8.827*** 3.141*** 3.076*** 5.089*** 2.967*** 1.882*** 0.328*** 10.492*** (18.10) (13.35) (9.77) (17.80) (17.40) (7.17) (14.61) (9.24) (9.18) (8.03) –PM 0.245*** 0.166*** 8.686*** 0.235*** 0.231*** 4.672*** 0.223*** 0.159*** 0.344*** 10.170*** (5.86) (5.54) (9.61) (5.82) (5.80) (6.38) (5.75) (5.52) (9.19) (8.14) –Ln(PRICE) 2.104*** 1.851*** 7.613*** 2.053*** 2.035*** 2.579*** 2.012*** 1.744*** 0.352*** 6.792*** (30.75) (19.36) (10.96) (30.49) (30.39) (4.16) (30.15) (27.75) (11.80) (6.98) –PROFIT 1.359*** 0.994*** 8.722*** 1.377*** 1.364*** 4.747*** 1.318*** 0.884*** 0.348*** 10.105*** (17.25) (13.32) (9.64) (17.88) (17.78) (6.65) (14.59) (10.79) (9.44) (8.19) –ZS 0.326*** 0.234*** 8.618*** 0.333*** 0.329*** 4.395*** 0.320*** 0.225*** 0.367*** 10.156*** (20.93) (14.43) (9.88) (22.68) (22.26) (5.87) (18.20) (13.71) (9.31) (7.81) 53 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 54,
    "page_range": "p.54",
    "total_pages": 78,
    "chunk_index": 96,
    "word_count": 308,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.54)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "(11.80) (6.98) –PROFIT 1.359*** 0.994*** 8.722*** 1.377*** 1.364*** 4.747*** 1.318*** 0.884*** 0.348*** 10.105*** (17.25) (13.32) (9.64) (17.88) (17.78) (6.65) (14.59) (10.79) (9.44) (8.19) –ZS 0.326*** 0.234*** 8.618*** 0.333*** 0.329*** 4.395*** 0.320*** 0.225*** 0.367*** 10.156*** (20.93) (14.43) (9.88) (22.68) (22.26) (5.87) (18.20) (13.71) (9.31) (7.81) 53 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 55,
    "page_range": "p.55",
    "total_pages": 78,
    "chunk_index": 97,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.55)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "B. Controlling for individual explanation (information asymmetry, option demand pressure, lottery preference) Sub-sample with Sub-sample with Sub-sample with Information Asymmetry Measure Option Demand Pressure Measure Lottery Preference Measure (Average 66% of Full Sample) (Average 99% of Full Sample) (Average 99% of Full Sample) No Control for No Control for No Control for Controls Information Asymmetry Controls Option Demand Pressure Controls Lottery Preference Stock Stock Stock Stock Option Stock Stock Stock Stock Characteri Characteri Characteri Characteri demand Characteri Characteri PIN MAX(5) stics stics stics stics pressure stics stics CFV 0.543*** 0.532*** 2.539*** 0.452*** 0.345*** 0.380*** 0.453*** 0.241*** 49.877*** (4.57) (4.47) (7.37) (4.73) (4.36) (13.30) (4.73) (3.94) (19.11) CH 2.338*** 2.247*** 2.299*** 2.840*** 2.339*** 0.270*** 2.841*** 1.899*** 40.823*** (10.30) (9.87) (8.31) (17.63) (14.78) (9.78) (17.61) (12.59) (18.29) DISP 0.934*** 0.915*** 2.525*** 0.833*** 0.659*** 0.355*** 0.833*** 0.531*** 46.898*** (8.52) (8.39) (8.07) (10.44) (9.32) (13.57) (10.45) (8.06) (20.06) ISSUE_1Y 2.433*** 2.347*** 2.713*** 3.268*** 2.586*** 0.390*** 3.270*** 1.616*** 48.473*** (9.26) (8.93) (8.63) (12.00) (10.07) (14.29) (12.01) (8.21) (20.95) ISSUE_5Y 1.248*** 1.216*** 2.358*** 1.442*** 1.146*** 0.345*** 1.443*** 0.889*** 46.838*** (14.84) (14.35) (7.94) (20.80) (17.94) (14.17) (20.82) (15.69) (19.63) TEF 2.624*** 2.533*** 2.466*** 3.161*** 2.624*** 0.335*** 3.156*** 1.980*** 44.293*** (13.29) (12.53) (8.02) (18.43) (15.84) (13.48) (18.42) (12.59) (19.40) –PM 0.317*** 0.310*** 2.520*** 0.232*** 0.202*** 0.362*** 0.231*** 0.182*** 46.853*** (4.24) (4.13) (7.88) (5.90) (5.64) (13.03) (5.89) (5.39) (19.68) –Ln(PRICE) 2.056*** 2.039*** 0.814*** 2.072*** 1.991*** 0.300*** 2.072*** 1.803*** 28.357*** (24.45) (24.54) (3.14) (30.80) (30.07) (13.36) (30.79) (25.74) (14.78) –PROFIT 1.147*** 1.115*** 2.471*** 1.367*** 1.174*** 0.348*** 1.366*** 0.912*** 44.484*** (13.27) (13.07) (7.87) (17.89) (16.69) (13.08) (17.89) (15.48) (19.84) –ZS 0.264*** 0.257*** 2.359*** 0.326*** 0.280*** 0.329*** 0.327*** 0.241*** 41.288*** (12.57) (12.23) (7.66) (22.07) (20.47) (11.99) (22.06) (19.33) (18.05) 54 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 55,
    "page_range": "p.55",
    "total_pages": 78,
    "chunk_index": 98,
    "word_count": 283,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.55)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "(30.80) (30.07) (13.36) (30.79) (25.74) (14.78) –PROFIT 1.147*** 1.115*** 2.471*** 1.367*** 1.174*** 0.348*** 1.366*** 0.912*** 44.484*** (13.27) (13.07) (7.87) (17.89) (16.69) (13.08) (17.89) (15.48) (19.84) –ZS 0.264*** 0.257*** 2.359*** 0.326*** 0.280*** 0.329*** 0.327*** 0.241*** 41.288*** (12.57) (12.23) (7.66) (22.07) (20.47) (11.99) (22.06) (19.33) (18.05) 54 Electronic copy available at: https://ssrn.com/abstract=2698267 C. Controlling for multiple explanations Subsample including VRP, Subsample including VRP, VOL- Subsample including VRP, VOL- VOL-of-VOL, MAX(5), and of-VOL, MAX(5), Option of-VOL, MAX(5), Option Demand Option Demand Pressure Demand Pressure, and Stock PIN Pressure, Stock PIN, and Option- implied Skewness and Kurtosis (Average 90% of Full Sample) (Average 63% of Full Sample) (Average 40% of Full Sample) No Controls With Controls No Controls With Controls No Controls With Controls CFV 0.488*** 0.170*** 0.544*** 0.168*** 0.442*** -0.009 (4.92) (3.36) (4.75) (2.88) (3.46) (-0.10) CH 2.842*** 0.976*** 2.378*** 0.858*** 2.260*** 0.622*** (17.10) (6.75) (10.64) (4.45) (10.31) (3.24) DISP 0.854*** 0.352*** 0.942*** 0.395*** 0.991*** 0.241** (9.98) (5.57) (8.55) (5.20) (5.95) (2.29) ISSUE_1Y 3.327*** 0.907*** 2.559*** 0.714*** 2.388*** 0.045 (12.33) (6.10) (9.88) (4.09) (8.38) (0.23) ISSUE_5Y 1.474*** 0.531*** 1.273*** 0.493*** 1.207*** 0.333*** (21.29) (10.52) (15.25) (8.13) (13.13) (4.25) TEF 3.126*** 0.994*** 2.616*** 0.747*** 2.334*** 0.200 (17.38) (6.98) (12.97) (4.27) (9.73) (0.95) –PM 0.248*** 0.109*** 0.302*** 0.097* 0.262*** 0.070 (5.77) (4.90) (4.06) (1.82) (2.98) (1.06) –Ln(PRICE) 2.092*** 1.552*** 2.034*** 1.545*** 1.982*** 1.361*** (30.34) (16.66) (23.98) (15.52) (23.27) (14.74) –PROFIT 1.365*** 0.575*** 1.167*** 0.531*** 1.152*** 0.407*** (17.07) (10.01) (13.13) (8.53) (10.19) (4.41) –ZS 0.332*** 0.151*** 0.269*** 0.128*** 0.269*** 0.108*** (21.71) (11.36) (12.54) (7.29) (11.65) (5.66) 55 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 56,
    "page_range": "p.56",
    "total_pages": 78,
    "chunk_index": 99,
    "word_count": 256,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.56)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "(4.90) (4.06) (1.82) (2.98) (1.06) –Ln(PRICE) 2.092*** 1.552*** 2.034*** 1.545*** 1.982*** 1.361*** (30.34) (16.66) (23.98) (15.52) (23.27) (14.74) –PROFIT 1.365*** 0.575*** 1.167*** 0.531*** 1.152*** 0.407*** (17.07) (10.01) (13.13) (8.53) (10.19) (4.41) –ZS 0.332*** 0.151*** 0.269*** 0.128*** 0.269*** 0.108*** (21.71) (11.36) (12.54) (7.29) (11.65) (5.66) 55 Electronic copy available at: https://ssrn.com/abstract=2698267 D. Stock-value-weighted return of option portfolio strategies after controlling for explanatory variables Sorted on Control for Option- Option- Option VOL-of- Stock VRP implied implied Stock PIN Demand VOL MAX(5) Skewness Kurtosis Pressure CFV 0.58*** 0.85*** 0.84*** 0.48*** 0.91*** 0.76*** 0.62*** (5.89) (7.89) (6.95) (5.09) (6.64) (8.13) (6.84) CH 0.26* 0.78*** 0.68*** 0.18 0.75*** 0.65*** 0.30** (1.74) (5.72) (4.75) (1.15) (4.25) (5.30) (2.52) DISP 0.65*** 1.26*** 1.21*** 0.51*** 1.29*** 1.05*** 0.63*** (6.64) (11.30) (10.46) (4.72) (10.03) (10.80) (6.91) ISSUE_1Y 0.32*** 0.67*** 0.67*** 0.17* 0.56*** 0.51*** 0.23** (4.01) (8.81) (6.34) (1.74) (5.39) (6.06) (2.30) ISSUE_5Y 0.51*** 0.74*** 0.73*** 0.25** 0.68*** 0.56*** 0.44*** (7.09) (9.71) (7.87) (2.38) (7.14) (7.90) (5.88) TEF 0.40*** 0.88*** 0.76*** 0.37*** 0.82*** 0.78*** 0.35*** (3.93) (7.76) (6.43) (3.29) (6.23) (7.62) (3.60) –PM 0.86*** 1.36*** 1.11*** 0.66*** 1.15*** 1.21*** 0.73*** (10.30) (13.27) (8.26) (5.74) (9.96) (12.12) (7.06) –Ln(PRICE) 2.69*** 3.40*** 3.38*** 2.14*** 3.31*** 3.31*** 2.89*** (18.61) (25.57) (24.57) (14.61) (18.75) (25.77) (20.32) –PROFIT 0.81*** 1.35*** 1.22*** 0.62*** 1.18*** 1.15*** 0.79*** (9.48) (13.24) (9.13) (6.58) (10.49) (12.46) (9.26) –ZS 0.68*** 1.06*** 0.90*** 0.63*** 0.78*** 0.90*** 0.72*** (7.32) (10.96) (6.85) (6.29) (5.90) (10.65) (7.45) 56 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 57,
    "page_range": "p.57-58",
    "total_pages": 78,
    "chunk_index": 100,
    "word_count": 238,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.57-58)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "2.69*** 3.40*** 3.38*** 2.14*** 3.31*** 3.31*** 2.89*** (18.61) (25.57) (24.57) (14.61) (18.75) (25.77) (20.32) –PROFIT 0.81*** 1.35*** 1.22*** 0.62*** 1.18*** 1.15*** 0.79*** (9.48) (13.24) (9.13) (6.58) (10.49) (12.46) (9.26) –ZS 0.68*** 1.06*** 0.90*** 0.63*** 0.78*** 0.90*** 0.72*** (7.32) (10.96) (6.85) (6.29) (5.90) (10.65) (7.45) 56 Electronic copy available at: https://ssrn.com/abstract=2698267 Table 8 Biased expectations and the impact of earnings announcements This table compares the profitability of our equity option strategies when the underlying stocks issue earnings announcements over the holding period (next month) versus when there are no earnings announcements. Column (1) reports the average return of each option portfolio strategy for the full sample. Column (2) reports the average return of each option strategy implemented on stocks without earnings announcements during holding period. Column (3) reports the average return of each option strategy implemented on stocks with earnings announcements during holding period. At the end of each month, we rank stocks with options traded into deciles by the equity characteristics. For each stock, we sell one contract of call option against a long position of ∆ shares of the underlying stock. The stock-value-weighted 10-1 average monthly return spreads (expressed in percent) are reported below. The sample period is from January 1996 to April 2016. To adjust for serial correlation, robust Newey-West (1987) t-statistics are reported in brackets. Stock-VW (10-1) Return Spread to Delta-Neutral Call Writing Stocks Without Stocks With Full sample Earnings Events Earnings Events (1) (2) (3) CFV 0.87*** 0.83*** 1.01*** (5.92) (5.13) (4.05) CH 0.48** 1.01*** 0.90*** (2.02) (5.06) (3.38) DISP 1.51*** 1.51*** 1.70*** (10.94) (10.24) (7.43) ISSUE_1Y 0.56*** 0.73*** 0.31 (4.86) (5.79) (1.09) ISSUE_5Y 0.73*** 0.97*** 0.95*** (7.98) (8.25) (4.27) TEF 1.28*** 1.39*** 0.99*** (8.88) (7.26) (4.32) –PM 1.92*** 2.07*** 1.63*** (11.98) (11.45) (6.72) –Ln(PRICE) 4.67*** 4.88*** 4.16*** (25.17) (25.30) (16.08) –PROFIT 1.73*** 1.76*** 1.53*** (10.96) (9.89) (7.47) –ZS 1.85*** 2.36*** 1.02*** (10.73) (14.76) (3.76) 57 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 58,
    "page_range": "p.58",
    "total_pages": 78,
    "chunk_index": 101,
    "word_count": 315,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.58)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "(5.79) (1.09) ISSUE_5Y 0.73*** 0.97*** 0.95*** (7.98) (8.25) (4.27) TEF 1.28*** 1.39*** 0.99*** (8.88) (7.26) (4.32) –PM 1.92*** 2.07*** 1.63*** (11.98) (11.45) (6.72) –Ln(PRICE) 4.67*** 4.88*** 4.16*** (25.17) (25.30) (16.08) –PROFIT 1.73*** 1.76*** 1.53*** (10.96) (9.89) (7.47) –ZS 1.85*** 2.36*** 1.02*** (10.73) (14.76) (3.76) 57 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 59,
    "page_range": "p.59",
    "total_pages": 78,
    "chunk_index": 102,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.59)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Table 9 Explanatory power of stock market common factors This table reports the alphas of ten option portfolio strategies with respect to various stock market common risk factors. Each month, for each equity characteristics in the row label (corresponding to one option portfolio strategy), we form 10 decile portfolios of delta-neutral equity call writing by sorting on the equity characteristics and take the difference in the stock-value-weighted returns between the top and the bottom decile portfolios. Then we regress the time-series of option spread portfolio returns on a variety of stock market factors, starting with the Fama and French (2015) five factors. UMD is the Carhart (1997) momentum factor. PS is the Pastor and Stambaugh (2003) liquidity factor. The Stambaugh and Yuan (2017) mispricing factor model (SY) includes MKTRF, SMB, MGMT, and PERF factors. The Daniel, Hirshleifer, and Sun (2020) behavioral factors (DHS) include long-horizon financing factor and short-horizon earnings surprise factor. Three volatility risk factors include the Coval and Shumway (2001) zero-beta straddle return of the S&P 500 Index option, the value-weighted zero-beta straddle returns of S&P 500 individual stock options, and change in the Chicago Board Options Exchange Market Volatility Index. Other risk factors include Herskovic, Kelly, Lustig, and Van Nieuwerburgh (2016) innovation in the common idiosyncratic volatility factor (CIV), Adrian, Etula and Muir (2014) leverage shock factor (LEV), He, Kelly, and Manela (2017) intermediary capital risk factor (ICR), Frazzini and Petersen (2014) betting-against-beta factor (BAB), and Kelly and Jiang (2014) tail risk factor (TAIL). All of the numbers in this table are expressed in percent. The sample period is from January 1996 to April 2016. To adjust for serial correlation, robust Newey-West (1987) t-statistics are reported in brackets. Stock-Value-Weighted (10-1) Return Spread Alphas of Different Models Model (1) Model (2) Model (3) Model (4) Model (5) Model (6) Model (7) FF5 + 3 FF5 + FF5 + FF5+ Raw FF5 SY + Volatility All 19 Sorted on UMD + LEV + BAB + Return Model DHS -factors + Factors PS ICR TAIL CIV CFV 0.87*** 0.87*** 0.89*** 0.93*** 0.76*** 0.92*** 1.03*** 0.95*** (5.92) (6.38) (6.58) (6.57) (4.36) (5.38) (6.24) (4.04) CH 0.48** 0.54** 0.53** 0.62** 0.22 0.83*** 0.22 0.53* (2.02) (2.07) (2.03) (2.59) (0.71) (3.70) (0.63) (1.75) DISP 1.51*** 1.39*** 1.43*** 1.46*** 1.38*** 1.43*** 1.37*** 1.39*** (10.94) (9.49) (9.61) (9.95) (6.97) (8.32) (7.16) (5.22) ISSUE_1Y 0.56*** 0.51*** 0.53*** 0.61*** 0.31* 0.60*** 0.39** 0.39** (4.86) (3.83) (4.22) (5.57) (1.75) (4.21) (2.04) (2.06) ISSUE_5Y 0.73*** 0.67*** 0.70*** 0.75*** 0.53*** 0.77*** 0.63*** 0.65*** (7.98) (6.68) (6.81) (8.23) (3.82) (6.77) (5.13) (4.64) TEF 1.28*** 1.26*** 1.27*** 1.33*** 1.10*** 1.28*** 1.15*** 1.10*** (8.88) (9.81) (9.80) (9.39) (5.76) (9.09) (7.33) (5.14) –PM 1.92*** 1.90*** 1.91*** 1.95*** 1.88*** 1.78*** 1.73*** 1.76*** (11.98) (12.11) (12.06) (13.32) (8.70) (10.75) (9.49) (8.60) –Ln(PRICE) 4.67*** 4.52*** 4.55*** 4.44*** 4.89*** 4.36*** 4.82*** 4.82*** (25.17) (21.55) (21.71) (22.72) (17.25) (20.07) (21.05) (15.63) –PROFIT 1.73*** 1.77*** 1.80*** 1.83*** 1.66*** 1.76*** 1.63*** 1.65*** (10.96) (11.82) (12.37) (13.11) (8.55) (11.48) (8.88) (7.47) –ZS 1.85*** 1.78*** 1.76*** 1.77*** 1.61*** 1.71*** 1.56*** 1.49*** (10.73) (9.07) (8.87) (9.66) (6.05) (9.17) (6.00) (5.40) Avg |α| 1.56 1.52 1.54 1.58 1.43 1.54 1.45 1.47 58 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 59,
    "page_range": "p.59",
    "total_pages": 78,
    "chunk_index": 103,
    "word_count": 522,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.59)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "–PROFIT 1.73*** 1.77*** 1.80*** 1.83*** 1.66*** 1.76*** 1.63*** 1.65*** (10.96) (11.82) (12.37) (13.11) (8.55) (11.48) (8.88) (7.47) –ZS 1.85*** 1.78*** 1.76*** 1.77*** 1.61*** 1.71*** 1.56*** 1.49*** (10.73) (9.07) (8.87) (9.66) (6.05) (9.17) (6.00) (5.40) Avg |α| 1.56 1.52 1.54 1.58 1.43 1.54 1.45 1.47 58 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 60,
    "page_range": "p.60",
    "total_pages": 78,
    "chunk_index": 104,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.60)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Table 10 Explanatory power of option market common factors This table reports the alphas of ten option portfolio strategies based on underlying firm characteristics with respect to various option market common risk factors. Each month, for each equity characteristics in the row label (corresponding to one option portfolio strategy), we form 10 decile portfolios of delta-neutral equity call writing by sorting on the equity characteristics and take the difference in the stock-value-weighted returns between the top and the bottom decile portfolios. Then we regress the time-series of the returns of various spread portfolios on several risk factors constructed using equity options data. The Karakaya (2013) three-factor model includes Level, Slope, and Value factors. IVOL factor is the (10-1) stock-value-weighted spread return for portfolios of delta- neutral call writing sorted on underlying stock idiosyncratic volatility. Ln(Amihud) factor is the (10-1) stock- value-weighted spread return for portfolios of delta-neutral call writing sorted on stock Amihud illiquidity measure. All of the numbers in this table are expressed in percent. The sample period is from January 1996 to April 2016. To adjust for serial correlation, robust Newey-West (1987) t-statistics are reported in brackets. Stock-Value-Weighted (10-1) Return Spread Alphas of Different Models Model (1) Model (2) Model (3) Model (4) Model (5) IVOL + Raw Karakaya IVOL + Ln(Amihud) + Sorted on IVOL Ln(Amihud) Return 3-factor Ln(Amihud) Karakaya 3-factor CFV 0.87*** 0.89*** -0.10 0.48 -0.21 0.28 (5.22) (3.13) (-0.35) (1.41) (-0.65) (0.77) CH 0.48* -0.05 -0.51* 1.10* 0.38 -0.18 (1.90) (-0.10) (-1.66) (1.71) (0.67) (-0.31) DISP 1.51*** 1.30*** 0.48* 0.60 -0.05 0.34 (10.52) (5.51) (1.95) (1.54) (-0.16) (1.02) ISSUE_1Y 0.56*** 0.38 -0.19 0.04 -0.45 -0.27 (4.77) (1.47) (-1.06) (0.11) (-1.35) (-0.78) ISSUE_5Y 0.73*** 0.40*** 0.17 0.53** 0.16 0.33 (8.04) (3.08) (1.03) (2.16) (0.65) (1.44) TEF 1.28*** 0.70*** -0.04 0.42 -0.43 -0.16 (8.46) (2.88) (-0.12) (0.84) (-1.21) (-0.39) –PM 1.92*** 1.45*** 3.81*** 1.57*** 1.17*** 0.30 (11.37) (6.76) (7.81) (6.42) (4.38) (0.83) –Ln(PRICE) 4.67*** 4.46*** 0.90*** 0.72 0.09 1.43*** (22.88) (11.43) (2.91) (1.63) (0.24) (4.36) –PROFIT 1.73*** 1.58*** 0.78*** 1.01** 0.40 0.84** (10.34) (7.70) (3.57) (2.13) (1.08) (2.01) –ZS 1.85*** 1.22*** 0.97*** 0.64 0.11 0.24 (10.35) (3.78) (2.88) (1.59) (0.26) (0.65) Avg |α| 1.56 1.24 0.80 0.71 0.34 0.43 59 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 60,
    "page_range": "p.60",
    "total_pages": 78,
    "chunk_index": 105,
    "word_count": 368,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.60)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "0.90*** 0.72 0.09 1.43*** (22.88) (11.43) (2.91) (1.63) (0.24) (4.36) –PROFIT 1.73*** 1.58*** 0.78*** 1.01** 0.40 0.84** (10.34) (7.70) (3.57) (2.13) (1.08) (2.01) –ZS 1.85*** 1.22*** 0.97*** 0.64 0.11 0.24 (10.35) (3.78) (2.88) (1.59) (0.26) (0.65) Avg |α| 1.56 1.24 0.80 0.71 0.34 0.43 59 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 61,
    "page_range": "p.61",
    "total_pages": 78,
    "chunk_index": 106,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.61)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Table 11 Additional results on option return predictability This table reports the 10-1 and 5-1 return spreads of stock-value-weighted portfolios of delta-neutral equity call writing sorted by additional stock/firm characteristics that have not been examined in the literature. For the new option portfolio strategies listed in Panel A that produce significant average returns, we also report their stock-value- weighted 10-1 average return spreads after controlling for exposures to 19 stock market common factors (as in Table 9 Model 7) or 2 option market common factors (as in Table 10 Model 4). All numbers in this table are monthly returns expressed in percent. The definitions of these additional stock characteristics are reported in the supplementary appendix. The sample period is from January 1996 to April 2016. *** denotes statistical significance at 5% level based on robust Newey-West (1987) t-statistics. A. Stock characteristics that significantly predict option returns (10-1) (5-1) Alphas under Alphas under Equity Characteristics Return Return 19 Stock 2 Option Spread Spread Factors Model Factors Model 52-Week High -1.08*** -0.65*** -1.02*** -0.08 Analyst Value -2.10*** -0.65*** -2.29*** 0.13 Asset Turnover -1.15*** -1.21*** -1.14*** -0.03 Beta 1.53*** 1.23*** 1.48*** 0.36 Cash Flow / MV -1.56*** -1.00*** -1.48*** -0.28 Earnings / Price -1.70*** -1.18*** -1.64*** -0.84*** Long-term Reversal -0.97*** -0.52*** -1.03*** 0.51 Organizational Capital 0.69*** 0.50*** 0.85*** -0.09 R&D / MV 1.15*** 0.65*** 0.90*** 0.63 Short Interest 0.80*** 0.89*** 0.32 -0.24 Tax -0.44*** -0.79*** -0.54*** 0.15 Volume Trend 1.13*** 0.92*** 0.79*** -0.12 Volume Variance 0.94*** 0.95*** 1.04*** -0.38 Volume / MV -1.31*** -1.29*** -1.21*** -1.40*** B. Stock characteristics that do not significantly predict option returns (10-1) (5-1) (10-1) (5-1) Equity Characteristics Return Return Equity Characteristics Return Return Spread Spread Spread Spread G-Index -0.03 0.08 Sales Growth -0.04 0.09 Growth in LTNOA 0.09 -0.11 Sales/Price -0.03 0.05 Leverage 0.01 -0.12 Seasonality 0.06 0.05 Net Operating Assets -0.17 0.09 SUE -0.08 -0.03 Operating Leverage 0.04 -0.00 Total Accrual -0.06 0.06 Pension Funding Status -0.24 -0.08 60 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 61,
    "page_range": "p.61",
    "total_pages": 78,
    "chunk_index": 107,
    "word_count": 327,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.61)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Spread Spread G-Index -0.03 0.08 Sales Growth -0.04 0.09 Growth in LTNOA 0.09 -0.11 Sales/Price -0.03 0.05 Leverage 0.01 -0.12 Seasonality 0.06 0.05 Net Operating Assets -0.17 0.09 SUE -0.08 -0.03 Operating Leverage 0.04 -0.00 Total Accrual -0.06 0.06 Pension Funding Status -0.24 -0.08 60 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 62,
    "page_range": "p.62",
    "total_pages": 78,
    "chunk_index": 108,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.62)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Supplementary Online Appendix for Option Return Predictability Jie Cao, Bing Han, Xintong Zhan, with Qing Tong Variable Definitions Delta-Hedged Option Return Measures For each stock at the end of the previous month, we sell one contract of call option against Returns to delta-neutral a long position of ∆ shares of the underlying stock, where ∆ is the Black-Scholes call call writing till monthend option delta. The position is held for one month to compute the buy-and-hold return. For each stock at the end of the previous month, we sell one contract of call option against Returns to delta-neutral a long position of ∆ shares of the underlying stock, where ∆ is the Black-Scholes call call writing till maturity option delta. The position is held until maturity to compute the buy-and-hold return. As in Cao and Han (2013), for each stock at the end of the previous month, we sell one Daily rebalanced and contract of call option against a long position of ∆ shares of the underlying stock, where compounded monthly ∆ is the Black-Scholes call option delta. We then adjust the delta-hedge on each trading returns to delta-neutral day by buying or selling the proper amount of stock, keeping the option position to be call writing one contract until the end of month when it is closed out. The daily buy-and-hold return is compounded over the month to arrive at the monthly return. Stock Characteristics as Predictors of Option Returns Cash flow variance, as in Haugen and Baker (1996), computed as the variance of the CFV monthly ratio of cash flow to market value of equity over the last 60 months. Cash flow is net income plus depreciation and amortization, all scaled by market value of equity. Cash-to-assets ratio, as in Palazzo (2012), defined as the value of corporate cash holdings CH over the value of the firm’s total assets. Analyst earnings forecast dispersion, as in Diether, Malloy, and Scherbina (2002), DISP computed as the standard deviation of annual earnings-per-share forecasts scaled by the absolute value of the average outstanding forecast. 1-year new issues, as in Pontiff and Woodgate (2008), measured as the change in shares ISSUE_1Y outstanding from 11 months ago. 5-year new issues, as in Daniel and Titman (2006), measured as five-year real change in ISSUE_5Y number of shares outstanding. PM Profit margin, as in Soliman (2008), calculated as EBIT scaled by Revenues. Ln(PRICE) The log of stock price at the end of last month, as in Blume and Husic (1972). Profitability, as in Fama and French (2006), calculated as earnings divided by book equity PROFIT in which earnings are defined as income before extraordinary items. Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 62,
    "page_range": "p.62",
    "total_pages": 78,
    "chunk_index": 109,
    "word_count": 444,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.62)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "by Revenues. Ln(PRICE) The log of stock price at the end of last month, as in Blume and Husic (1972). Profitability, as in Fama and French (2006), calculated as earnings divided by book equity PROFIT in which earnings are defined as income before extraordinary items. Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 63,
    "page_range": "p.63",
    "total_pages": 78,
    "chunk_index": 110,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.63)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Total external financing, as in Bradshaw, Richardson, and Sloan (2006), measured as (Net TEF Share Issuance + Net Debt Issuance - Cash Dividends) scaled by Total Assets). Z-Score, as in Dichev (1998), measured as (1.2×(Working Capital/Assets) + 1.4× (Retained Earnings/Assets) + 3.3×(EBIT/Assets)+0.6×(Market Value of Equity/Book ZS Value of Total Liabilities) + (Revenues/Assets)). Higher values of ZS indicate lower probability of bankruptcy. Control Variables The log difference between the realized volatility and the Black-Scholes implied volatility for at-the-money options at the end of last month, as in Goyal and Saretto (2009). The VOL_deviation realized volatility is the annualized standard deviation of stock returns estimated from daily data over the previous twelve months. IVOL Annualized idiosyncratic return volatility, as in Ang, Hodrick, Xing, and Zhang (2006). The natural logarithm of illiquidity, calculated as the average of the daily Amihud (2002) Ln(Amihud) illiquidity measure over the previous month. Ln(ME) The natural logarithm of the market value of the firm's equity. The natural logarithm of book equity for the fiscal year-end in a calendar year divided by Ln(BM) market equity at the end of December of that year, as in Fama and French (1992). RET The lagged one month return. (-1,0) The cumulative return on the stock over the 11 months ending at the beginning of the RET (-12,-2) previous month. Institutional ownership The percentage of common stocks owned by institutions in the previous quarter. Analyst coverage The number of analysts following the firm in the previous month. The Variance risk premium, defined as the difference between a model free estimate of the risk-neutral expected variance implied from stock options at the end of last VRP month and the realized variance estimated from intra-daily stock returns over last month. The volatility of implied volatility, as in Baltussen, Van Bekkum, and Van Der Grient (2018), computed as the standard deviation of the stock's ATM implied volatilities (the VOL-of-VOL average of the ATM call and ATM put implied volatilities) over all days in the previous month divided by the mean of these same implied volatilities. At least 12 daily ATM implied volatilities in a month are required to calculate this measure. The risk-neutral skewness and kurtosis of stock returns, as in Bakshi, Kapadia, and Madan Option-implied Skewness (2003), are inferred from a cross section of out of the money calls and puts at the and Kurtosis beginning of the period. Stock PIN Probability of informed trading in Easley, Hvidkjaer, and O'hara (2002). Stock MAX(5) The average of five highest daily returns of underlying stock in the previous month. The log difference between the total market value of all options and the market value of Option demand pressure underlying stocks at the end of last month. Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 63,
    "page_range": "p.63",
    "total_pages": 78,
    "chunk_index": 111,
    "word_count": 454,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.63)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "O'hara (2002). Stock MAX(5) The average of five highest daily returns of underlying stock in the previous month. The log difference between the total market value of all options and the market value of Option demand pressure underlying stocks at the end of last month. Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 64,
    "page_range": "p.64",
    "total_pages": 78,
    "chunk_index": 112,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.64)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "The ratio of the difference between the bid and ask quotes of option to the midpoint of Option bid-ask spread the bid and ask quotes at the end of previous month. Additional Stock Characteristics in Panel A of Table 11 Stock price at the end of last month scaled by the highest price or bid/ask average during 52-Week High the last 12 months, as in George and Hwang (2004). Asset Turnover (t) = Sales (t)/ ((Net Operating Assets (t) + Net Operating Assets (t-1)) / Asset Turnover 2). See Soliman (2008). Analyst forecasts measure, as in Frankel and Lee (1998), measured as (1 + (FROE – 0.1) t Analyst Value /1.1) + (FROE – 0.1)/ (0.1×1.1)) × (AvgBook / P). FROE is expected return on equity, t t-6 t AvgBook is the average book value, and P is the current stock price. Beta CAPM beta of monthly return, estimated over the past 60 months. Cash Flow / MV Net income plus depreciation and amortization, all scaled by market value of equity. Earnings / Price Net income scaled by market value of equity, as in Basu (1977). Long-Term Reversal The cumulative return on the stock from month t-60 through month t-13. Organizational Capital, as in Eisfeldt and Papanikolaou (2013), measured as cumulating Organizational Capital firms’ selling, general, and administrative (SG&A) expenses using the perpetual inventory method. This value is divided by total assets. R&D / MV R&D expenses scaled by market value of equity. Short Interest Shares shorted / shares outstanding. Tax Income tax scaled by net income, as in Lev and Nissim (2004). Five-year trend in monthly trading volume scaled by average trading volume during the Volume Trend same five-year period. Volume Variance Standard deviation of monthly trading volume over the last 36 months. Volume / MV Average dollar trading volume over the past 12 months scaled by shares outstanding. Additional Stock Characteristics in Panel B of Table 11 The corporate governance index as in Gompers, Ishi, and Metrick (2003), can be G-Index downloaded from Andrew Metrick's website. Growth in LTNOA Growth in net operating assets minus accruals. See Fairfield, Whisenant, and Yohn (2003) Leverage Log of long-term debt scaled by market value of equity. NOA = (operating assets- operating liabilities) / Total Assets . See Hirshleifer, Hou, Net Operating Assets t t t t-1 Teoh, and Zhang (2004). Operating Leverage SG&A + Cost of Goods Sold, all scaled by lagged Assets. See Novy-Marx (2010). Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 64,
    "page_range": "p.64",
    "total_pages": 78,
    "chunk_index": 113,
    "word_count": 410,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.64)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "by market value of equity. NOA = (operating assets- operating liabilities) / Total Assets . See Hirshleifer, Hou, Net Operating Assets t t t t-1 Teoh, and Zhang (2004). Operating Leverage SG&A + Cost of Goods Sold, all scaled by lagged Assets. See Novy-Marx (2010). Electronic copy available at: https://ssrn.com/abstract=2698267 Funding ratio = (fair value of plan assets - projected benefit obligation) / market value of Pension Funding Status equity, as in Franzoni and Marin (2006) Sales Growth Average revenue growth rank over the past five years. Sales/Price Total revenues divided by stock price. Seasonality Average monthly return in the same month over the last 20 years. Most recent standardized unexpected earnings within previous three months, computed SUE as the difference between the reported earnings-per-share and analysts’ consensus forecast (median), scaled by the lagged stock price. See Livnat and Mendenhall (2006). Accounting accruals, as measured in Sloan (1996), defined as the change in non-cash Total Accrual current assets, less the change in current liabilities (exclusive of short-term debt and taxes payable) and depreciation expenses, all divided by average total assets. Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 65,
    "page_range": "p.65-66",
    "total_pages": 78,
    "chunk_index": 114,
    "word_count": 185,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.65-66)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "price. See Livnat and Mendenhall (2006). Accounting accruals, as measured in Sloan (1996), defined as the change in non-cash Total Accrual current assets, less the change in current liabilities (exclusive of short-term debt and taxes payable) and depreciation expenses, all divided by average total assets. Electronic copy available at: https://ssrn.com/abstract=2698267 Table A1: Sample Coverage of Underlying Stocks This table provides details about the stock-month sample for the underlying stocks with qualified option observations of both call and put. At the end of each month, we extract from the Ivy DB database of OptionMetrics one call and one put on each optionable common stock whose price is above $5. The selected options are approximately at-the-money with a common maturity of about one-and-a-half month. We exclude the following option observations: moneyness is lower than 0.8 or higher than 1.2; the option price violates obvious no-arbitrage option bounds; the reported option trading volume is zero; the option bid quote is zero or the midpoint of the bid and ask quotes is less than $1/8; and the underlying stock paid a dividend during the remaining life of the option. Panel A reports the time-series summary statistics and Panel B reports the time-series average of cross-sectional distributions. Panel C reports the time-series average of a Fama-French 12- industry distribution for the sample of stocks with qualified option observations and full CRSP sample. Percent coverage of stock universe (EW) is the number of sample stocks, divided by the total number of CRSP stocks. The percent coverage of the stock universe (VW) is the total market capitalization of sample stocks divided by the total market value of all CRSP stocks. Firm size is the firm’s market capitalization. Book-to-market is the fiscal year-end book value of common equity divided by the calendar year-end market value of equity. Volatility is the standard deviation of daily stock returns over one month. The size, book-to-market, and volatility percentiles are defined using the full CRSP sample. Institutional ownership is the percentage of common stocks owned by institutions in the previous quarter. Analyst coverage is the number of analysts following the firm in the previous month. The sample period is from January 1996 to April 2016. Panel A: Time-Series Distribution (244 Monthly Obs) Jan 1996– April 2016 Mean Std 10-Pctl Q1 Med Q3 90-Pctl Number of stocks in the sample each month 763 155 562 679 771 860 960 Stock % coverage of stock universe (EW) 10.56 2.45 7.48 9.24 10.54 12.13 13.64 Stock % coverage of stock universe (VW) 35.75 11.08 17.48 29.49 36.84 43.94 47.98 Stock % traded at NYSE/AMEX 52.21 4.32 46.25 49.33 52.64 55.33 57.47 Stock % included in S&P500 index 27.10 4.26 21.24 24.27 27.08 30.23 32.35 Stock % already included in previous month 49.76 7.55 39.94 44.96 50.51 55.00 58.68 Panel B: Time-Series Average of Cross-Sectional Distributions (186,220 Stock-Month Obs) Jan 1996– April 2016 Mean Std 10-Pctl Q1 Med Q3 90-Pctl Firm size in million 7,238 18,097 116 745 1,848 5,490 15,883 Firm size CSRP percentile (%) 80 14 37 71 83 92 97 Firm book-to-market CSRP percentile (%) 33 23 1 13 28 48 69 Firm volatility CSRP percentile (%) 51 22 7 34 52 69 81 Institutional ownership (%) 69 21 10 58 72 83 92 Analyst coverage 11.54 7.30 1.00 5.89 10.00 15.94 21.97 Panel C: Time-Series Average of Industry Distribution Stocks with CRSP Stocks with CRSP FF-12 Industry FF-12 Industry options sample options sample Consumer nondurables 4.36% 5.00% Telecom 3.43% 2.83% Consumer durables 2.21% 2.34% Utilities 2.11% 3.13% Manufacturing 9.22% 9.76% Wholesale 11.63% 9.98% Energy 5.06% 3.55% Healthcare 12.52% 8.45% Chemicals 2.29% 2.04% Finance 9.40% 22.92% Business Equipment 22.57% 15.31% Others 15.20% 14.69% Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 66,
    "page_range": "p.66",
    "total_pages": 78,
    "chunk_index": 115,
    "word_count": 615,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.66)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "FF-12 Industry options sample options sample Consumer nondurables 4.36% 5.00% Telecom 3.43% 2.83% Consumer durables 2.21% 2.34% Utilities 2.11% 3.13% Manufacturing 9.22% 9.76% Wholesale 11.63% 9.98% Energy 5.06% 3.55% Healthcare 12.52% 8.45% Chemicals 2.29% 2.04% Finance 9.40% 22.92% Business Equipment 22.57% 15.31% Others 15.20% 14.69% Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 67,
    "page_range": "p.67",
    "total_pages": 78,
    "chunk_index": 116,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.67)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Table A2: Return Spread of Daily Rebalanced Delta-Neutral Call Writing Sorted on Stock Characteristics Equity characteristics used to predict delta-hedged option returns are described in Table 1. At the end of each month, we rank all stocks with options traded into deciles (quintiles) by these equity characteristics. For each stock, we sell one contract of call option against a long position of ∆ shares of the underlying stock, where ∆ is the Black-Scholes call option delta. The delta-hedges are rebalanced daily. For each stock and in each month, we compound the daily returns of the rebalanced delta-hedged call writing over the month to arrive at a monthly return. We use three weighting schemes in computing the average return to delta-neutral call writing for a portfolio of stocks: equal weight, weight by the market capitalization of the underlying stock, and weight by the market value of option open interest at the beginning of the period. The table reports the spread return that is long in the tenth decile (the fifth quintile) and short in the first decile (the first quintile). All returns in this table are expressed in percent. The sample period is from January 1996 to April 2016. To adjust for serial correlation, robust Newey- West (1987) t-statistics are reported in brackets. (10-1) Return Spread (5-1) Return Spread Stock-VW EW Option-VW Stock-VW EW Option-VW CFV 0.39*** 1.03*** 0.86*** 0.24** 1.00*** 0.84*** (3.49) (8.73) (4.46) (2.51) (11.62) (5.30) CH 0.70*** 1.52*** 1.47*** 0.36** 1.07*** 0.75*** (4.25) (10.10) (5.75) (2.29) (8.00) (3.70) DISP 0.61*** 1.24*** 1.33*** 0.46*** 1.12*** 1.17*** (4.43) (12.08) (6.58) (4.17) (13.46) (7.09) ISSUE_1Y 0.15 0.89*** 0.84*** 0.21** 0.75*** 0.71*** (1.59) (6.75) (3.57) (2.36) (6.46) (4.25) ISSUE_5Y 0.34*** 1.21*** 1.05*** 0.21*** 1.03*** 0.78*** (4.10) (11.21) (5.24) (2.80) (12.30) (5.17) TEF 0.53*** 1.13*** 1.11*** 0.27** 0.79*** 0.80*** (2.98) (7.94) (4.21) (2.23) (7.68) (4.22) –PM 1.11*** 1.89*** 2.27*** 0.46*** 1.22*** 1.38*** (6.21) (16.16) (9.58) (3.15) (14.08) (9.35) –Ln(PRICE) 2.72*** 3.52*** 3.95*** 1.81*** 2.59*** 2.94*** (15.92) (22.00) (15.17) (14.26) (19.15) (15.22) –PROFIT 0.89*** 1.77*** 2.06*** 0.50*** 1.24*** 1.27*** (6.72) (16.78) (10.43) (4.24) (14.18) (8.15) –ZS 1.26*** 2.24*** 2.62*** 0.43*** 1.45*** 1.57*** (8.67) (18.21) (11.52) (4.12) (16.30) (9.63) Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 67,
    "page_range": "p.67",
    "total_pages": 78,
    "chunk_index": 117,
    "word_count": 359,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.67)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "(6.21) (16.16) (9.58) (3.15) (14.08) (9.35) –Ln(PRICE) 2.72*** 3.52*** 3.95*** 1.81*** 2.59*** 2.94*** (15.92) (22.00) (15.17) (14.26) (19.15) (15.22) –PROFIT 0.89*** 1.77*** 2.06*** 0.50*** 1.24*** 1.27*** (6.72) (16.78) (10.43) (4.24) (14.18) (8.15) –ZS 1.26*** 2.24*** 2.62*** 0.43*** 1.45*** 1.57*** (8.67) (18.21) (11.52) (4.12) (16.30) (9.63) Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 68,
    "page_range": "p.68",
    "total_pages": 78,
    "chunk_index": 118,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.68)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Table A3: Return Spread of Delta-Neutral Call Writing Held until Maturity Sorted on Stock Characteristics Equity characteristics used to predict delta-hedged option returns are described in Table 1. At the end of each month, we rank all stocks with options traded into deciles (quintiles) by the equity characteristics. For each stock, we sell one contract of call option against a long position of ∆ shares of the underlying stock, where ∆ is the Black- Scholes call option delta. The option position is held till option maturity without rebalancing delta-hedges. We use three weighting schemes in computing the average return to delta-neutral call writing for a portfolio of stocks: weight by the market capitalization of the underlying stock (VW), equal weight (EW), and weight by the market value of option open interest at the beginning of the period (Option-VW). The table reports the spread return that is long in the tenth decile (the fifth quintile) and short in the first decile (the first quintile). All returns in this table are expressed in percent. The sample period is from January 1996 to April 2016. To adjust for serial correlation, robust Newey-West (1987) t-statistics are reported in brackets. (10-1) Return Spread (5-1) Return Spread Stock-VW EW Option-VW Stock-VW EW Option-VW CFV 1.62*** 3.20*** 2.85*** 1.43*** 3.07*** 3.07*** (5.45) (15.20) (6.72) (7.10) (17.02) (9.54) CH 0.81* 3.85*** 3.44*** 0.90*** 3.05*** 2.12*** (1.81) (11.89) (5.95) (3.13) (11.06) (4.94) DISP 3.26*** 4.01*** 4.91*** 2.41*** 3.64*** 4.04*** (12.44) (21.32) (12.20) (12.46) (22.76) (13.00) ISSUE_1Y 1.26*** 3.19*** 2.74*** 1.16*** 2.73*** 2.56*** (4.75) (14.59) (5.56) (5.81) (15.08) (6.95) ISSUE_5Y 1.64*** 3.59*** 4.02*** 1.25*** 3.17*** 3.08*** (8.44) (18.20) (9.53) (8.99) (18.67) (10.66) TEF 2.91*** 3.56*** 4.69*** 1.89*** 2.59*** 3.36*** (8.27) (13.90) (8.91) (7.38) (12.93) (9.97) –PM 3.73*** 4.82*** 5.45*** 2.57*** 3.60*** 4.11*** (11.11) (18.05) (11.54) (10.83) (17.65) (12.09) –Ln(PRICE) 8.93*** 10.05*** 11.28*** 6.59*** 7.85*** 8.80*** (22.12) (28.47) (20.32) (22.13) (28.97) (21.16) –PROFIT 3.60*** 4.82*** 5.93*** 2.61*** 3.78*** 4.39*** (10.76) (19.33) (12.22) (12.45) (17.20) (12.23) –ZS 3.74*** 5.10*** 6.85*** 2.11*** 3.51*** 4.66*** (10.24) (17.79) (12.94) (10.32) (15.96) (14.88) Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 68,
    "page_range": "p.68",
    "total_pages": 78,
    "chunk_index": 119,
    "word_count": 342,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.68)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "(11.11) (18.05) (11.54) (10.83) (17.65) (12.09) –Ln(PRICE) 8.93*** 10.05*** 11.28*** 6.59*** 7.85*** 8.80*** (22.12) (28.47) (20.32) (22.13) (28.97) (21.16) –PROFIT 3.60*** 4.82*** 5.93*** 2.61*** 3.78*** 4.39*** (10.76) (19.33) (12.22) (12.45) (17.20) (12.23) –ZS 3.74*** 5.10*** 6.85*** 2.11*** 3.51*** 4.66*** (10.24) (17.79) (12.94) (10.32) (15.96) (14.88) Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 69,
    "page_range": "p.69",
    "total_pages": 78,
    "chunk_index": 120,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.69)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Table A4: Return Spread of Delta-Neutral Put Writing Sorted on Equity Characteristics Equity characteristics used to predict delta-hedged option returns are described in Table 1. At the end of each month, we rank all stocks with options traded into deciles (quintiles) by equity characteristics. For each stock, we sell one contract of put option hedged by a short position of ∆ shares of the underlying stock, where ∆ is the Black- Scholes put option delta. The option position is held for one month without rebalancing delta-hedges. We use three weighting schemes in computing the average return of buying delta-hedged puts for a portfolio of stocks: weight by the market capitalization of the underlying stock (VW), equal weight (EW), and weight by the market value of option open interest at the beginning of the period (Option-VW). The table reports the spread return that is long in the tenth decile (the fifth quintile) and short in the first decile (the first quintile). All returns in this table are expressed in percent. The sample period is from January 1996 to April 2016. To adjust for serial correlation, robust Newey-West (1987) t-statistics are reported in brackets. (10-1) Return Spread (5-1) Return Spread Stock-VW EW Option-VW Stock-VW EW Option-VW CFV 0.73*** 1.34*** 1.35*** 0.62*** 1.27*** 1.26*** (5.76) (12.83) (7.32) (6.57) (15.78) (7.98) CH 0.34 1.65*** 1.18*** 0.30** 1.30*** 0.66*** (1.61) (15.89) (5.73) (1.99) (13.98) (4.10) DISP 1.26*** 1.60*** 1.81*** 0.97*** 1.48*** 1.62*** (10.13) (19.63) (10.59) (9.96) (23.51) (11.02) ISSUE_1Y 0.56*** 1.34*** 0.88*** 0.49*** 1.17*** 0.79*** (4.99) (13.43) (3.80) (4.99) (15.65) (4.64) ISSUE_5Y 0.58*** 1.40*** 1.24*** 0.46*** 1.26*** 1.09*** (6.14) (16.19) (6.84) (5.32) (19.62) (6.93) TEF 1.06*** 1.45*** 1.57*** 0.70*** 1.08*** 1.28*** (8.16) (14.86) (8.80) (6.75) (13.31) (9.31) –PM 1.61*** 1.98*** 2.15*** 1.09*** 1.48*** 1.63*** (11.81) (20.93) (9.96) (10.98) (18.84) (10.11) –Ln(PRICE) 3.65*** 3.89*** 4.39*** 2.75*** 3.08*** 3.48*** (30.26) (42.02) (20.96) (27.57) (42.83) (22.86) –PROFIT 1.47*** 1.88*** 1.96*** 1.09*** 1.49*** 1.63*** (10.86) (20.73) (9.51) (10.77) (19.26) (10.99) –ZS 1.46*** 1.96*** 1.93*** 0.75*** 1.35*** 1.41*** (10.09) (18.41) (8.27) (7.43) (15.43) (7.66) Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 69,
    "page_range": "p.69",
    "total_pages": 78,
    "chunk_index": 121,
    "word_count": 339,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.69)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "(11.81) (20.93) (9.96) (10.98) (18.84) (10.11) –Ln(PRICE) 3.65*** 3.89*** 4.39*** 2.75*** 3.08*** 3.48*** (30.26) (42.02) (20.96) (27.57) (42.83) (22.86) –PROFIT 1.47*** 1.88*** 1.96*** 1.09*** 1.49*** 1.63*** (10.86) (20.73) (9.51) (10.77) (19.26) (10.99) –ZS 1.46*** 1.96*** 1.93*** 0.75*** 1.35*** 1.41*** (10.09) (18.41) (8.27) (7.43) (15.43) (7.66) Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 70,
    "page_range": "p.70",
    "total_pages": 78,
    "chunk_index": 122,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.70)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Table A5: Average Return Spread of Delta-Neutral Call Writing across Moneyness and Maturity For each stock at the end of each month, we retain its call options within 3x3 moneyness and maturity groups. Three moneyness groups are out-of-the-money (OTM) for Δ in [0.2, 0.4], at-the-money (ATM) for Δ in [0.4, 0.6], and in-the-money (ITM) for Δ in [0.6, 0.8]. Three maturity groups are short-term for days to maturity in [30, 60], medium-term for days to maturity in [90, 180], and long-term for days to maturity in [180, 360]. For each call option, we sell one contract of option against a long position of ∆ shares of the underlying stock, where ∆ is the Black-Scholes call option delta. The position is held for one month to compute the buy-and-hold return of each option which is further averaged within each moneyness-maturity group. Equity characteristics used to predict delta-hedged option returns are described in Table 1. At the end of each month, we rank all stocks with options traded into deciles by the equity characteristics. For each moneyness-maturity group, we compute the stock-value- weighted average return spread that is long in the tenth decile and short in the first decile of equity characteristics. All returns in this table are expressed in percent. The sample period is from January 1996 to April 2016. To adjust for serial correlation, robust Newey-West (1987) t-statistics are reported in brackets. Sorted on Stock-Value-Weighted (10-1) Return Spread Short-term: Medium-term: Long-term: Days to maturity in [30, 60] Days to maturity in [90, 180] Days to maturity in [180, 360] OTM ATM ITM OTM ATM ITM OTM ATM ITM CFV 0.72*** 0.86*** 0.66*** 0.50** 0.46*** 0.35*** 0.38** 0.38*** 0.27** (2.90) (4.83) (5.16) (2.56) (3.15) (3.25) (2.01) (2.69) (2.54) CH 0.82** 0.52* 0.47*** 0.58* 0.44** 0.36** 0.31 0.34* 0.33** (2.05) (1.84) (2.71) (1.96) (2.11) (2.52) (1.24) (1.83) (2.47) DISP 1.72*** 1.63*** 1.10*** 0.87*** 0.74*** 0.56*** 0.66*** 0.69*** 0.54*** (7.56) (10.05) (10.32) (4.74) (5.61) (6.05) (3.14) (4.81) (4.92) ISSUE_1Y 0.78*** 0.62*** 0.55*** 0.44** 0.40*** 0.34*** 0.37* 0.41*** 0.30*** (3.19) (3.30) (5.94) (2.04) (2.83) (4.25) (1.95) (2.88) (3.02) ISSUE_5Y 0.86*** 0.81*** 0.55*** 0.66*** 0.49*** 0.35*** 0.44*** 0.44*** 0.27*** (4.43) (7.20) (7.76) (4.74) (4.94) (5.17) (2.74) (4.10) (3.46) TEF 1.38*** 1.37*** 0.96*** 0.68*** 0.70*** 0.55*** 0.42 0.62*** 0.45*** (4.54) (6.55) (7.08) (2.87) (4.14) (4.81) (1.61) (3.59) (3.57) –PM 1.97*** 2.00*** 1.36*** 1.05*** 0.96*** 0.73*** 0.42 0.70*** 0.58*** (7.31) (10.03) (9.77) (4.85) (5.64) (6.02) (1.53) (3.88) (4.85) –Ln(PRICE) 4.39*** 5.49*** 3.41*** 2.83*** 2.67*** 1.95*** 2.13*** 2.21*** 1.70*** (14.94) (26.17) (22.55) (14.04) (17.01) (15.36) (10.16) (13.32) (12.74) –PROFIT 1.82*** 1.87*** 1.21*** 1.12*** 0.95*** 0.70*** 0.30 0.68*** 0.53*** (6.77) (9.79) (8.86) (5.88) (6.06) (6.10) (1.06) (4.11) (4.74) –ZS 1.95*** 1.95*** 1.34*** 1.23*** 1.08*** 0.78*** 0.44 0.80*** 0.64*** (7.66) (9.32) (8.88) (6.27) (6.90) (6.62) (1.19) (4.50) (4.76) Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 70,
    "page_range": "p.70",
    "total_pages": 78,
    "chunk_index": 123,
    "word_count": 463,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.70)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "(22.55) (14.04) (17.01) (15.36) (10.16) (13.32) (12.74) –PROFIT 1.82*** 1.87*** 1.21*** 1.12*** 0.95*** 0.70*** 0.30 0.68*** 0.53*** (6.77) (9.79) (8.86) (5.88) (6.06) (6.10) (1.06) (4.11) (4.74) –ZS 1.95*** 1.95*** 1.34*** 1.23*** 1.08*** 0.78*** 0.44 0.80*** 0.64*** (7.66) (9.32) (8.88) (6.27) (6.90) (6.62) (1.19) (4.50) (4.76) Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 71,
    "page_range": "p.71",
    "total_pages": 78,
    "chunk_index": 124,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.71)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Table A6: Return Spread of Delta-Vega-Neutral Call Writing Sorted on Stock Characteristics Equity characteristics used to predict delta-hedged option returns are described in Table 1. At the end of each month, we rank all stocks with options traded into deciles by the equity characteristics. For each stock, we sell one contract of at-the-money (ATM) call option, against a long position of (νATM/νOTM) contracts of out-of-money (OTM) call option and (ΔATM ̶ ΔOTM (νATM/νOTM)) shares of the underlying stock, where ν and ∆ are the Black- Scholes call option vega and delta, respectively. For vega-hedge, we use a deep-out-of-money call with delta less than 0.2 and most close to 0.1, or an out-of-money call option with delta in [0,2, 0.4] and most close to 0.3. The position of delta-vega-neutral call writing is held for one month and the monthly buy-and-hold return is described in the equation below. We use three weighting schemes in computing the average return of delta-vega-neutral call writing for a portfolio of stocks: weight by the market capitalization of the underlying stock (VW), equal weight (EW), and weight by the market value of option open interest at the beginning of the period (Option-VW). The table reports the spread return that is long in the tenth decile and short in the first decile. All returns in this table are expressed in percent. The sample period is from January 1996 to April 2016. To adjust for serial correlation, robust Newey-West (1987) t-statistics are reported in brackets. 𝐴𝐴𝐴𝐴𝐴𝐴 𝑂𝑂𝐴𝐴𝐴𝐴 𝐴𝐴𝐴𝐴𝐴𝐴 𝑂𝑂𝐴𝐴𝐴𝐴 𝐴𝐴𝐴𝐴𝐴𝐴 𝑂𝑂𝐴𝐴𝐴𝐴 𝑂𝑂𝐴𝐴𝐴𝐴 𝐴𝐴𝐴𝐴𝐴𝐴 �(∆𝑡𝑡 −∆𝑡𝑡 ∙(𝜈𝜈𝑡𝑡 /𝜈𝜈𝑡𝑡 ))∙𝑆𝑆𝑡𝑡+1+(𝜈𝜈𝑡𝑡 /𝜈𝜈𝑡𝑡 )∙𝐶𝐶𝑡𝑡+1 −𝐶𝐶𝑡𝑡+1 � 𝐻𝐻𝐻𝐻𝐻𝐻 = 𝐴𝐴𝐴𝐴𝐴𝐴 𝑂𝑂𝐴𝐴𝐴𝐴 𝐴𝐴𝐴𝐴𝐴𝐴 𝑂𝑂𝐴𝐴𝐴𝐴 𝐴𝐴𝐴𝐴𝐴𝐴 𝑂𝑂𝐴𝐴𝐴𝐴 𝑂𝑂𝐴𝐴𝐴𝐴 𝐴𝐴𝐴𝐴𝐴𝐴 −1 �(∆𝑡𝑡 −∆𝑡𝑡 ∙(𝜈𝜈𝑡𝑡 /𝜈𝜈𝑡𝑡 ))∙𝑆𝑆𝑡𝑡 +(𝜈𝜈𝑡𝑡 /𝜈𝜈𝑡𝑡 )∙𝐶𝐶𝑡𝑡 −𝐶𝐶𝑡𝑡 � (10-1) Return Spread Use ATM Call and Use ATM Call and Deep OTM Call (Δ≈0.1) OTM Call (Δ≈0.3) Stock-VW EW Option-VW Stock-VW EW Option-VW CFV 0.92*** 2.04*** 2.02*** 0.80*** 1.89*** 1.67*** (4.53) (7.74) (4.21) (4.18) (8.90) (4.42) CH 0.64 2.53*** 2.58*** 0.22 1.67*** 1.91*** (1.60) (7.83) (4.43) (0.85) (8.75) (4.18) DISP 1.18*** 1.86*** 2.15*** 0.82*** 1.85*** 1.66*** (4.72) (8.54) (3.82) (3.61) (9.44) (3.72) ISSUE_1Y 0.51*** 1.70*** 1.21*** 0.47*** 1.36*** 1.04*** (2.83) (9.37) (3.81) (2.66) (9.74) (3.15) ISSUE_5Y 0.67*** 1.47*** 1.83*** 0.38** 1.56*** 1.27*** (3.79) (8.21) (5.35) (2.19) (10.16) (3.86) TEF 1.59*** 2.30*** 3.25*** 0.88*** 1.75*** 2.17*** (5.36) (6.60) (4.13) (4.43) (7.84) (4.08) –PM 2.10*** 2.71*** 3.68*** 1.39*** 2.26*** 2.69*** (7.26) (11.85) (8.85) (6.89) (10.47) (7.59) –Ln(PRICE) 3.15*** 3.61*** 4.69*** 3.97*** 4.55*** 4.79*** (7.87) (8.77) (6.53) (11.35) (16.58) (9.00) –PROFIT 2.01*** 3.11*** 3.93*** 1.30*** 2.35*** 2.86*** (6.56) (12.18) (8.37) (6.04) (12.90) (7.70) –ZS 2.22*** 2.92*** 4.18*** 1.55*** 2.61*** 3.06*** (6.60) (10.97) (8.97) (5.49) (14.13) (6.95) Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 71,
    "page_range": "p.71",
    "total_pages": 78,
    "chunk_index": 125,
    "word_count": 443,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.71)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "(7.26) (11.85) (8.85) (6.89) (10.47) (7.59) –Ln(PRICE) 3.15*** 3.61*** 4.69*** 3.97*** 4.55*** 4.79*** (7.87) (8.77) (6.53) (11.35) (16.58) (9.00) –PROFIT 2.01*** 3.11*** 3.93*** 1.30*** 2.35*** 2.86*** (6.56) (12.18) (8.37) (6.04) (12.90) (7.70) –ZS 2.22*** 2.92*** 4.18*** 1.55*** 2.61*** 3.06*** (6.60) (10.97) (8.97) (5.49) (14.13) (6.95) Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 72,
    "page_range": "p.72",
    "total_pages": 78,
    "chunk_index": 126,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.72)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Table A7: Adjusting for Stock Market Risk Factors (Alternative Weighting Scheme) This table reports the alphas of our option portfolio strategies after adjusting for various stock market common risk factors. Panel A reports equal-weighted return and Panel B reports option-value-weighted return. At the end of each month, we rank all stocks with options traded into deciles by the equity characteristics. Each month and for each optionable stock, we sell one contract of short-maturity at-the-money option, delta-hedged with the underlying stock. The position is held for one month to compute the buy-and-hold return. We compute the spread return that is long in the tenth decile and short in the first decile. The Fama and French (2015) five-factor model includes MKTRF, SMB, HML, RMW, and CMA factors. UMD is the Carhart (1997) momentum factor. PS is the Pastor and Stambaugh (2003) liquidity factor. The Stambaugh and Yuan (2017) mispricing factor model (SY) includes MKTRF, SMB, MGMT, and PERF factors. The Daniel, Hirshleifer, and Sun (2020) behavioral factors (DHS) include long-horizon financing factor (FIN) and short-horizon earnings surprise factor (PEAD). Three volatility risk factors include the Coval and Shumway (2001) zero-beta straddle return of the S&P 500 Index option (ZB-STRAD-Index), the value-weighted zero-beta straddle returns of S&P 500 individual stock options (ZB-STRAD-Stock), and change in the Chicago Board Options Exchange Market Volatility Index (∆VIX). Other risk factors include Herskovic, Kelly, Lustig, and Van Nieuwerburgh (2016) innovation in the common idiosyncratic volatility factor (CIV), Adrian, Etula and Muir (2014) leverage shock factor (LEV), He, Kelly, and Manela (2017) intermediary capital risk factor (ICR), Frazzini and Petersen (2014) betting-against-beta factor (BAB), and Kelly and Jiang (2014) tail risk factor (TAIL). All of the numbers in this table are expressed in percent. The sample period is from January 1996 to April 2016. To adjust for serial correlation, robust Newey-West (1987) t-statistics are reported in brackets. Panel A: Equal-Weighted (10-1) Return Spread Alphas of Different Models Model (1) Model (2) Model (3) Model (4) Model (5) Model (6) Model (7) FF5 + 3 FF5 + FF5 + FF5+ Raw FF5 SY + Volatility All 19 Sorted on UMD + LEV + BAB + Return Model DHS -factors + Factors PS ICR TAIL CIV CFV 1.63*** 1.57*** 1.60*** 1.68*** 1.62*** 1.60*** 1.68*** 1.75*** (11.74) (12.10) (12.99) (11.87) (9.53) (10.91) (9.68) (9.34) CH 2.11*** 2.09*** 2.08*** 2.17*** 1.99*** 2.09*** 1.87*** 1.97*** (15.88) (15.27) (15.49) (16.51) (11.82) (15.70) (10.38) (10.70) DISP 2.03*** 1.96*** 1.98*** 1.99*** 1.98*** 2.00*** 1.92*** 2.01*** (19.81) (17.32) (17.73) (16.87) (13.75) (15.55) (12.31) (10.64) ISSUE_1Y 1.60*** 1.58*** 1.59*** 1.66*** 1.43*** 1.62*** 1.38*** 1.41*** (14.84) (11.88) (12.00) (12.89) (8.41) (11.94) (8.45) (6.97) ISSUE_5Y 1.86*** 1.82*** 1.84*** 1.84*** 1.76*** 1.80*** 1.71*** 1.68*** (19.92) (18.08) (17.50) (18.11) (13.19) (16.12) (15.45) (11.64) TEF 1.87*** 1.83*** 1.84*** 1.86*** 1.78*** 1.85*** 1.73*** 1.72*** (14.63) (12.62) (11.97) (12.13) (9.19) (12.38) (9.06) (7.65) –PM 2.53*** 2.48*** 2.48*** 2.53*** 2.43*** 2.47*** 2.32*** 2.39*** (22.11) (20.56) (20.86) (24.38) (14.85) (21.84) (13.90) (14.17) –Ln(PRICE) 5.01*** 4.89*** 4.90*** 4.77*** 5.18*** 4.68*** 5.11*** 4.95*** (33.23) (28.77) (29.52) (31.60) (24.26) (26.94) (27.86) (22.34) –PROFIT 2.48*** 2.45*** 2.46*** 2.49*** 2.39*** 2.44*** 2.34*** 2.33*** (21.67) (20.84) (21.31) (24.07) (16.50) (21.44) (13.42) (14.74) –ZS 2.60*** 2.57*** 2.57*** 2.66*** 2.47*** 2.58*** 2.36*** 2.50*** (20.11) (18.10) (18.07) (20.43) (14.03) (18.39) (13.07) (13.62) Avg |α| 2.37 2.32 2.33 2.37 2.30 2.31 2.24 2.27 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 72,
    "page_range": "p.72",
    "total_pages": 78,
    "chunk_index": 127,
    "word_count": 551,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.72)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "(22.34) –PROFIT 2.48*** 2.45*** 2.46*** 2.49*** 2.39*** 2.44*** 2.34*** 2.33*** (21.67) (20.84) (21.31) (24.07) (16.50) (21.44) (13.42) (14.74) –ZS 2.60*** 2.57*** 2.57*** 2.66*** 2.47*** 2.58*** 2.36*** 2.50*** (20.11) (18.10) (18.07) (20.43) (14.03) (18.39) (13.07) (13.62) Avg |α| 2.37 2.32 2.33 2.37 2.30 2.31 2.24 2.27 Electronic copy available at: https://ssrn.com/abstract=2698267 Panel B: Option-Value-Weighted (10-1) Return Spread Alphas of Different Models Model (1) Model (2) Model (3) Model (4) Model (5) Model (6) Model (7) FF5 + 3 FF5 + FF5 + FF5+ Raw FF5 SY + Volatility All 19 Sorted on UMD + LEV + BAB + Return Model DHS -factors + Factors PS ICR TAIL CIV CFV 1.51*** 1.48*** 1.55*** 1.51*** 1.56*** 1.55*** 1.64*** 1.69*** (6.36) (6.81) (7.11) (6.05) (4.97) (5.52) (6.65) (4.52) CH 1.43*** 1.49*** 1.46*** 1.74*** 1.38*** 1.67*** 1.05*** 1.74*** (4.92) (4.73) (4.73) (6.23) (3.79) (5.14) (2.65) (4.02) DISP 2.38*** 2.42*** 2.49*** 2.48*** 2.47*** 2.42*** 2.56*** 2.63*** (10.25) (10.21) (10.59) (9.25) (7.05) (8.31) (8.07) (6.12) ISSUE_1Y 1.13*** 1.12*** 1.21*** 1.41*** 0.82** 1.19*** 0.63 0.80* (3.92) (3.36) (3.97) (5.37) (2.06) (3.45) (1.38) (1.85) ISSUE_5Y 1.67*** 1.73*** 1.79*** 1.88*** 1.60*** 1.83*** 1.74*** 1.69*** (8.19) (6.76) (6.94) (6.98) (4.78) (5.70) (5.23) (3.71) TEF 1.85*** 1.94*** 2.01*** 2.21*** 1.55*** 2.14*** 1.98*** 2.01*** (7.76) (6.23) (6.44) (6.56) (3.58) (5.43) (4.71) (3.29) –PM 2.72*** 2.76*** 2.77*** 2.86*** 2.51*** 2.80*** 2.64*** 2.57*** (10.60) (9.80) (9.55) (10.42) (7.19) (8.82) (7.78) (6.31) –Ln(PRICE) 5.85*** 5.72*** 5.78*** 5.54*** 6.06*** 5.57*** 6.11*** 6.05*** (20.18) (16.60) (17.37) (15.49) (13.54) (13.15) (15.10) (10.35) –PROFIT 2.63*** 2.67*** 2.72*** 2.87*** 2.43*** 2.75*** 2.64*** 2.58*** (10.37) (8.86) (8.72) (9.35) (5.22) (8.16) (6.62) (4.36) –ZS 3.12*** 3.15*** 3.15*** 3.20*** 2.95*** 3.14*** 2.86*** 2.83*** (11.82) (9.81) (9.58) (10.13) (6.17) (9.40) (6.80) (4.93) Avg |α| 2.43 2.45 2.49 2.57 2.33 2.51 2.39 2.46 12 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 73,
    "page_range": "p.73",
    "total_pages": 78,
    "chunk_index": 128,
    "word_count": 293,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.73)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "–PROFIT 2.63*** 2.67*** 2.72*** 2.87*** 2.43*** 2.75*** 2.64*** 2.58*** (10.37) (8.86) (8.72) (9.35) (5.22) (8.16) (6.62) (4.36) –ZS 3.12*** 3.15*** 3.15*** 3.20*** 2.95*** 3.14*** 2.86*** 2.83*** (11.82) (9.81) (9.58) (10.13) (6.17) (9.40) (6.80) (4.93) Avg |α| 2.43 2.45 2.49 2.57 2.33 2.51 2.39 2.46 12 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 74,
    "page_range": "p.74",
    "total_pages": 78,
    "chunk_index": 129,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.74)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Table A8: Adjusting for Option Market Risk Factors (Alternative Weighting Scheme) This table reports the return spread and alphas based on various option market common risk factors. Panel A reports equal-weighted return and Panel B reports option-value-weighted return. The equity characteristics used to predict delta-hedged option returns are described in Table 1. At the end of each month, we rank all stocks with options traded into deciles by the equity characteristics. Each month and for each optionable stock, we sell one contract of short-maturity at-the-money option, delta-hedged with the underlying stock. The position is held for one month to compute the buy-and-hold return. We compute the spread return that is long in the tenth decile and short in the first decile. The Karakaya (2013) three-factor model includes Level, Slope, and Value factors. IVOL factor is the (10-1) equal-weighted (option-value-weighted) return spread sorted on idiosyncratic volatility in Panel A (Panel B). Ln(Amihud) factor is the (10-1) equal-weighted (option-value-weighted) return spread sorted on stock Amihud illiquidity measure in Panel A (Panel B). All of the numbers in this table are expressed in percent. The sample period is from January 1996 to April 2016. To adjust for serial correlation, robust Newey-West (1987) t-statistics are reported in brackets. Panel A: Equal-Value-Weighted (10-1) Return Spread Alphas of Different Models Model (1) Model (2) Model (3) Model (4) Model (5) IVOL + Raw Karakaya IVOL + Ln(Amihud) + Sorted on IVOL Ln(Amihud) Return 3-factor Ln(Amihud) Karakaya 3-factor CFV 1.63*** 1.24*** -0.32 1.01*** -0.20 0.23 (10.12) (6.84) (-1.39) (2.70) (-0.91) (0.85) CH 2.11*** 1.77*** 0.33 1.76*** 0.61 0.40 (14.57) (5.69) (0.89) (4.03) (1.48) (0.87) DISP 2.03*** 1.77*** 0.36 1.04*** 0.06 0.20 (21.19) (10.11) (1.51) (3.13) (0.22) (0.73) ISSUE_1Y 1.60*** 1.37*** -0.16 1.30*** 0.15 0.17 (13.50) (5.78) (-0.52) (3.24) (0.43) (0.54) ISSUE_5Y 1.86*** 1.43*** 0.39 0.91*** 0.06 0.22 (19.77) (7.41) (1.61) (3.24) (0.22) (0.86) TEF 1.87*** 1.35*** -0.33 0.58 -0.71* 0.48 (14.09) (5.88) (-1.14) (1.52) (-1.88) (1.45) –PM 2.53*** 2.21*** 0.84*** 1.45*** 0.47 0.80** (22.11) (13.33) (2.67) (3.80) (1.52) (2.31) –Ln(PRICE) 5.01*** 4.79*** 3.35*** 1.49*** 0.91*** 0.40 (33.23) (13.32) (7.12) (5.56) (3.22) (1.29) –PROFIT 2.48*** 2.21*** 0.66** 1.19*** 0.15 -0.44 (21.42) (12.41) (2.31) (3.24) (0.53) (-1.38) –ZS 2.60*** 2.15*** 0.70** 1.50*** 0.38 0.51* (19.39) (9.72) (2.06) (4.48) (1.15) (1.71) Avg |α| 2.37 2.03 0.74 1.22 0.37 0.39 13 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 74,
    "page_range": "p.74",
    "total_pages": 78,
    "chunk_index": 130,
    "word_count": 385,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.74)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "3.35*** 1.49*** 0.91*** 0.40 (33.23) (13.32) (7.12) (5.56) (3.22) (1.29) –PROFIT 2.48*** 2.21*** 0.66** 1.19*** 0.15 -0.44 (21.42) (12.41) (2.31) (3.24) (0.53) (-1.38) –ZS 2.60*** 2.15*** 0.70** 1.50*** 0.38 0.51* (19.39) (9.72) (2.06) (4.48) (1.15) (1.71) Avg |α| 2.37 2.03 0.74 1.22 0.37 0.39 13 Electronic copy available at: https://ssrn.com/abstract=2698267 Panel B: Option-Value-Weighted (10-1) Return Spread Alphas of Different Models Model (1) Model (2) Model (3) Model (4) Model (5) IVOL + Raw Karakaya IVOL + Ln(Amihud) + Sorted on IVOL Ln(Amihud) Return 3-factor Ln(Amihud) Karakaya 3-factor CFV 1.51*** 1.54*** 0.52 0.95** 0.12 0.48 (6.36) (3.65) (1.40) (2.34) (0.33) (1.15) CH 1.43*** 0.63 0.54 1.90*** 1.07** 0.25 (4.92) (0.83) (1.23) (3.94) (2.30) (0.38) DISP 2.38*** 2.09*** 1.13*** 2.14*** 1.02*** 0.91** (10.25) (4.49) (3.63) (5.01) (2.63) (2.37) ISSUE_1Y 1.13*** 0.47 -0.07 1.38*** 0.28 0.06 (3.92) (0.87) (-0.22) (3.23) (0.65) (0.15) ISSUE_5Y 1.67*** 1.19** 0.54* 1.86*** 0.82* 0.61 (8.19) (2.28) (1.76) (5.01) (1.95) (1.20) TEF 1.85*** 0.53 0.59 1.61*** 0.47 -0.25 (7.76) (0.85) (1.57) (4.16) (0.87) (-0.41) –PM 2.72*** 2.19*** 1.69*** 1.75*** 0.87* 0.61 (10.60) (4.35) (3.63) (4.55) (1.85) (1.22) –Ln(PRICE) 5.85*** 5.63*** 4.27*** 3.57*** 2.23*** 2.34*** (20.18) (9.14) (7.46) (7.23) (4.51) (3.75) –PROFIT 2.63*** 2.49*** 1.39*** 1.80*** 0.71 0.99 (10.37) (4.42) (2.74) (3.63) (1.05) (1.42) –ZS 3.12*** 2.41*** 1.98*** 1.65*** 0.68 0.48 (11.82) (3.88) (4.19) (2.85) (1.05) (0.63) Avg |α| 2.43 1.92 1.27 1.86 0.83 0.70 14 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 75,
    "page_range": "p.75-76",
    "total_pages": 78,
    "chunk_index": 131,
    "word_count": 231,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.75-76)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "4.27*** 3.57*** 2.23*** 2.34*** (20.18) (9.14) (7.46) (7.23) (4.51) (3.75) –PROFIT 2.63*** 2.49*** 1.39*** 1.80*** 0.71 0.99 (10.37) (4.42) (2.74) (3.63) (1.05) (1.42) –ZS 3.12*** 2.41*** 1.98*** 1.65*** 0.68 0.48 (11.82) (3.88) (4.19) (2.85) (1.05) (0.63) Avg |α| 2.43 1.92 1.27 1.86 0.83 0.70 14 Electronic copy available at: https://ssrn.com/abstract=2698267 References for Supplementary Appendix: Adrian, Tobias, Erkko Etula, and Tyler Muir, 2014, Financial intermediaries and the cross-section of asset returns, Journal of Finance 69, 2557-2596. Amihud, Yakov, 2002, Illiquidity and stock returns: Cross-section and time-series effects, Journal of Financial Markets 5, 31-56. Ang, Andrew, Robert J. Hodrick, Yuhang Xing, and Xiaoyan Zhang, 2006, The cross-section of volatility and expected returns, Journal of Finance 61, 259-299. Bakshi, Gurdip, Nikunj Kapadia, and Dilip Madan, 2003, Stock return characteristics, skew laws, and differential pricing of individual equity options, Review of Financial Studies 16, 101-143. Baltussen, Guido, Sjoerd Van Bekkum, and Bart Van Der Grient, 2018, Unknown unknowns: Uncertainty about risk and stock returns, Journal of Financial and Quantitative Analysis 53, 1615- 1651. Basu, Sanjoy, 1977, Investment performance of common stocks in relation to their price‐earnings ratios: A test of the efficient market hypothesis, Journal of Finance 32, 663-682. Blume, Marshall E., and Frank Husic, 1973, Price, beta and exchange listing, Journal of Finance 28, 283-299. Bradshaw, Mark. T., Scott A. Richardson, and Richard G. Sloan, 2006, The relation between corporate financing activities, analysts’ forecasts and stock returns, Journal of Accounting and Economics 42, 53-86. Cao, Jie, and Bing Han, 2013, Cross-section of option returns and idiosyncratic stock volatility, Journal of Financial Economics 108, 231-249. Carhart, Mark, 1997, On persistence in mutual fund performance, Journal of Finance 52, 57-82. Christoffersen, Peter, Mathieu Fournier, and Kris Jacobs, 2018, The Factor Structure in Equity Options, Review of Financial Studies 31, 595–637. Coval, Joshua D., and Tyler Shumway, 2001, Expected options returns, Journal of Finance 56, 983-1009. Daniel, Kent, David Hirshleifer, and Lin Sun, 2020, Short- and long-horizon behavioral factors, Review of Financial Studies 33, 1673-1736. Daniel, Kent, and Sheridan Titman, 2006, Market reactions to tangible and intangible information, Journal of Finance 61, 1605-1643. Dichev, Ilia D., 1998, Is the risk of bankruptcy a systematic risk?, Journal of Finance 53, 1131- 1148. Diether, Karl B., Christopher J. Malloy, and Anna Scherbina, 2002, Differences of opinion and the cross section of stock returns, Journal of Finance 57, 2113-2141. 15 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 76,
    "page_range": "p.76",
    "total_pages": 78,
    "chunk_index": 132,
    "word_count": 396,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.76)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "1605-1643. Dichev, Ilia D., 1998, Is the risk of bankruptcy a systematic risk?, Journal of Finance 53, 1131- 1148. Diether, Karl B., Christopher J. Malloy, and Anna Scherbina, 2002, Differences of opinion and the cross section of stock returns, Journal of Finance 57, 2113-2141. 15 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 77,
    "page_range": "p.77",
    "total_pages": 78,
    "chunk_index": 133,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.77)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Easley, David, Soeren Hvidkjaer, and Maureen O'hara, 2002, Is information risk a determinant of asset returns?, Journal of Finance 57, 2185-2221. Eisfeldt, Andrea L., and Dimitris Papanikolaou, 2013, Organization capital and the cross‐section of expected returns, Journal of Finance 68, 1365-1406. Fairfield, Patricia M., J. Scott Whisenant, and Teri Lombardi Yohn, 2003, Accrued earnings and growth: Implications for future profitability and market mispricing, The Accounting Review 78, 353-371. Fama, Eugene F., and Kenneth R. French, 1992, The cross-section of expected stock returns, Journal of Finance 47, 427-465. Fama, Eugene F., and Kenneth R. French, 2006, Profitability, investment and average returns, Journal of Financial Economics 82, 491-518. Fama, Eugene F., and Kenneth R. French, 2015, A five-factor asset pricing model, Journal of Financial Economics 116, 1-22. Frankel, Richard, and Charles MC Lee, 1998, Accounting valuation, market expectation, and cross-sectional stock returns, Journal of Accounting and economics 25, 283-319. Franzoni, Francesco, and Jose M. Marin, 2006, Pension plan funding and stock market efficiency, Journal of Finance 61, 921-956. Frazzini, Andrea, and Lasse Pedersen, 2014, Betting against beta, Journal of Financial Economics 111, 1-25. George, Thomas, and Chuan-yang Hwang, 2004, The 52‐week high and momentum investing, Journal of Finance 59, 2145-2176. Gompers, Paul, Joy Ishii, and Andrew Metrick, 2003, Corporate governance and equity prices, The Quarterly Journal of Economics 118, 107-156. Goyal, Amit, and Alessio Saretto, 2009, Cross-section of option returns and volatility, Journal of Financial Economics 94, 310-326. Haugena, Robert A., and Nardin L. Baker, 1996, Commonality in the determinants of expected stock returns, Journal of Financial Economics 41, 401-439. He, Zhiguo, Bryan Kelly, and Asaf Manela, 2017, Intermediary asset pricing: New evidence from many asset classes, Journal of Financial Economics 126, 1-35. Herskovic, Bernard, Bryan Kelly, Hanno Lustig, and Stijn Van Nieuwerburgh, 2016, The common factor in idiosyncratic volatility: Quantitative asset pricing implications, Journal of Financial Economics 119, 249-283. Hirshleifer, David, Kewei Hou, Siew Hong Teoh, and Yinglei Zhang, 2004, Do investors overvalue firms with bloated balance sheets?, Journal of Accounting and Economics 38, 297-331. 16 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 77,
    "page_range": "p.77",
    "total_pages": 78,
    "chunk_index": 134,
    "word_count": 340,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.77)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "Nieuwerburgh, 2016, The common factor in idiosyncratic volatility: Quantitative asset pricing implications, Journal of Financial Economics 119, 249-283. Hirshleifer, David, Kewei Hou, Siew Hong Teoh, and Yinglei Zhang, 2004, Do investors overvalue firms with bloated balance sheets?, Journal of Accounting and Economics 38, 297-331. 16 Electronic copy available at: https://ssrn.com/abstract=2698267 Karakaya, Mete, 2013, Characteristics and expected returns in individual equity options, Working Paper. Kelly, Bryan, and Hao Jiang, 2014, Tail risk and asset prices, Review of Financial Studies 27, 2841-2871. Lev, Baruch, and Doron Nissim, 2004, Taxable income, future earnings, and equity values, The Accounting Review 79, 1039-1074. Livnat, Joshua, and Richard R. Mendenhall, 2006, Comparing the post–earnings announcement drift for surprises calculated from analyst and time series forecasts, Journal of Accounting Research 44, 177-205. Newey, Whitney, and Kenneth D. West, 1987, A simple positive semi-definite, heteroskedasticity and autocorrelation consistent covariance matrix, Econometrica 55, 703-708. Novy-Marx, Robert, 2011, Operating leverage, Review of Finance 15, 103-134. Palazzo, Berardino, 2012, Cash holdings, risk, and expected returns, Journal of Financial Economics 104, 162-185. Pastor, Lubos, and Robert F. Stambaugh, 2003, Liquidity risk and expected stock returns, Journal of Political Economy 111, 642-685. Pontiff, Jeffery, and Artemiza Woodgate, 2008, Share issuance and cross-sectional returns, Journal of Finance 63, 921-945. Sloan, Richard G, 1996, Do stock prices fully reflect information in accruals and cash flows about future earnings?, The Accounting Review, 289-315. Soliman, Mark T., 2008, The use of DuPont analysis by market participants, The Accounting Review 83, 823-853. Stambaugh, Robert, and Yu Yuan, 2017, Mispricing factors, Review of Financial Studies 30, 1270- 1315. 17 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 78,
    "page_range": "p.78",
    "total_pages": 78,
    "chunk_index": 135,
    "word_count": 265,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.78)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  },
  {
    "text": "in accruals and cash flows about future earnings?, The Accounting Review, 289-315. Soliman, Mark T., 2008, The use of DuPont analysis by market participants, The Accounting Review 83, 823-853. Stambaugh, Robert, and Yu Yuan, 2017, Mispricing factors, Review of Financial Studies 30, 1270- 1315. 17 Electronic copy available at: https://ssrn.com/abstract=2698267",
    "title": "Variable",
    "source_type": "pdf",
    "document_id": "90344784cd33",
    "source_file": "Option Return Predictability.pdf",
    "section": "–PROFIT",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 78,
    "chunk_index": 136,
    "word_count": 50,
    "author": "JIECAO;xintong zhan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "–PROFIT (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220227225941+08'00'",
    "duration": null
  }
]