[
  {
    "text": "With nearly 3 billion contracts worth approximately $1 quadrillion in notional value traded in 2012, CME Group is the world’s leading and most diverse derivatives exchange. Building on the heritage of CME, CBOT and NYMEX, CME Group serves the risk management needs of customers around the globe. As an international marketplace, CME Group brings buyers and sellers together – whether trading on the CME Globex electronic trading platform or on trading floors in Chicago and New York, or clearing OTC transactions through CME ClearPort. CME Group offers the widest range of benchmark products available across all major asset classes, including futures and options based on interest rates, equity indexes, foreign exchange, energy, agricultural commodities, metals, weather and real estate. Options on futures rank among our most versatile risk management tools, and we offer them on most of our products. Whether you trade options for purposes of hedging or speculating, you can limit your risk to the amount you paid up-front for the option while maintaining your exposure to beneficial price movements. CME Group is a trademark of CME Group Inc. The Globe logo, CME, Chicago Mercantile Exchange and Globex are trademarks of Chicago Mercantile Exchange Inc. CBOT and Chicago Board of Trade are trademarks of the Board of Trade of the City of Chicago. NYMEX, New York Mercantile Exchange and ClearPort are trademarks of New York Mercantile Exchange Inc. COMEX is a trademark of Commodity Exchange Inc. All other trademarks are the property of their respective owners. Further information about CME Group and its products can be found at www.cmegroup.com. Copyright © 2008-2013 CME Group. All rights reserved.",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "A SINGLE POWERFUL PLATFORM.",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 32,
    "chunk_index": 0,
    "word_count": 268,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "A SINGLE POWERFUL PLATFORM. (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "Exchange and ClearPort are trademarks of New York Mercantile Exchange Inc. COMEX is a trademark of Commodity Exchange Inc. All other trademarks are the property of their respective owners. Further information about CME Group and its products can be found at www.cmegroup.com. Copyright © 2008-2013 CME Group. All rights reserved.",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "A SINGLE POWERFUL PLATFORM.",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 32,
    "chunk_index": 1,
    "word_count": 50,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "A SINGLE POWERFUL PLATFORM. (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "Pattern evolution: Each illustration demonstrates the effect of time decay on the total option premium involved in the position. The left vertical axis shows the profit/loss scale. The horizontal zero line in the middle is the break-even point, not including commissions. Therefore, anything above that line indicates profits, anything below it, losses. The price of the underlying instrument is represented along the bottom. “A,” “B” and “C” in the diagrams indicate the strike prices. The arrows show the impact of time decay on an option. Arrows on the diagram under the heading of “Pattern Evolution” indicate what impact the decay of option prices with time has on the total position. The purple line reflects the situation with four months left until expiration, the gold line the status with one month left and the green line the situation at expiration. For more information, go to cmegroup.com/options.",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "HOW TO USE THIS BOOKLET",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 32,
    "chunk_index": 2,
    "word_count": 145,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "HOW TO USE THIS BOOKLET (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "indicate what impact the decay of option prices with time has on the total position. The purple line reflects the situation with four months left until expiration, the gold line the status with one month left and the green line the situation at expiration. For more information, go to cmegroup.com/options. Long Futures 1 Short Futures 2 Long Synthetic Futures 3 Short Synthetic Futures 4 Long Risk Reversal 5 (AKA Squash or Combos) Short Risk Reversal 6 (AKA Squash or Combos) Long Call 7 Short Call 8 Long Put 9 Short Put 10 Bull Spread 11 Bear Spread 12 Long Butterfly 13 Short Butterfly 14 Long Iron Butterfly 15 Short Iron Butterfly 16 Long Straddle 17 Short Straddle 18 Long Strangle 19 Short Strangle 20 Ratio Call Spread 21 Ratio Put Spread 22 Call Ratio Backspread 23 Put Ratio Backspread 24 Box or Conversion 25",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "TABLE OF CONTENTS",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 32,
    "chunk_index": 3,
    "word_count": 144,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "TABLE OF CONTENTS (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "11 Bear Spread 12 Long Butterfly 13 Short Butterfly 14 Long Iron Butterfly 15 Short Iron Butterfly 16 Long Straddle 17 Short Straddle 18 Long Strangle 19 Short Strangle 20 Ratio Call Spread 21 Ratio Put Spread 22 Call Ratio Backspread 23 Put Ratio Backspread 24 Box or Conversion 25 A Pattern evolution: When to use: When you are bullish on the market and uncertain about volatility. You will not be affected by volatility changing. However, if you have an opinion on volatility and that opinion turns out to be correct, one of the other strategies may have greater profit potential and/or less risk. Profit characteristics: Profit increases as market rises. Profit is based strictly on the difference between the exit price and the entry price. Loss characteristics: Loss increases as market falls. Loss is based strictly on the difference between the exit price and the entry price. Decay characteristics: None. CATEGORY: Directional SYNTHETICS: Long call A, short put A",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "1 LONG FUTURES",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 32,
    "chunk_index": 4,
    "word_count": 160,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1 LONG FUTURES (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "rises. Profit is based strictly on the difference between the exit price and the entry price. Loss characteristics: Loss increases as market falls. Loss is based strictly on the difference between the exit price and the entry price. Decay characteristics: None. CATEGORY: Directional SYNTHETICS: Long call A, short put A A Pattern evolution: When to use: When you are bearish on the market and uncertain about volatility. You will not be affected by volatility changing. However, if you have an opinion on volatility and that opinion turns out to be correct, one of the other strategies may have greater profit potential and/or less risk. Profit characteristics: Profit increases as market falls. Profit is based strictly on the difference between the entry price and the exit price. Loss characteristics: Loss increases as market rises. Loss is based strictly on the difference between the entry price and the exit price. Decay characteristics: None. CATEGORY: Directional SYNTHETICS: Long put A, short call A",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "SHORT FUTURES 2",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 32,
    "chunk_index": 5,
    "word_count": 160,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "SHORT FUTURES 2 (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "falls. Profit is based strictly on the difference between the entry price and the exit price. Loss characteristics: Loss increases as market rises. Loss is based strictly on the difference between the entry price and the exit price. Decay characteristics: None. CATEGORY: Directional SYNTHETICS: Long put A, short call A",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "3 LONG SYNTHETIC",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 32,
    "chunk_index": 6,
    "word_count": 50,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3 LONG SYNTHETIC (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "A Pattern evolution: When to use: When you are bullish on the market and uncertain about volatility. You will not be affected by volatility changing. However, if you have an opinion on volatility and that opinion turns out to be correct, one of the other strategies may have greater profit potential and/or less risk. May be traded into from initial long call or short put position to create a stronger bullish position. Profit characteristics: Profit increases as market rises. Profit is based strictly on the difference between the exit price and the synthetic entry price. Loss characteristics: Loss increases as market falls. Loss is based strictly on the difference between the exit price and the synthetic entry price. Decay characteristics: None. CATEGORY: Directional Long call A, short put A",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "FUTURES",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 32,
    "chunk_index": 7,
    "word_count": 129,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "FUTURES (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "Profit is based strictly on the difference between the exit price and the synthetic entry price. Loss characteristics: Loss increases as market falls. Loss is based strictly on the difference between the exit price and the synthetic entry price. Decay characteristics: None. CATEGORY: Directional Long call A, short put A",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "SHORT SYNTHETIC 4",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 32,
    "chunk_index": 8,
    "word_count": 50,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "SHORT SYNTHETIC 4 (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "A Pattern evolution: When to use: When you are bearish on the market and uncertain about volatility. You will not be affected by volatility changing. However, if you have an opinion on volatility and that opinion turns out to be correct, one of the other strategies may have greater profit potential and/or less risk. May be traded into from initial short call or long put position to create a stronger bearish position. Profit characteristics: Profit increases as market falls. Profit is based strictly on the difference between the synthetic entry price and the exit price. Loss characteristics: Loss increases as market rises. Loss is based strictly on the difference between the synthetic entry price and the exit price. Decay characteristics: None. CATEGORY: Directional Long put A, short call A",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "FUTURES",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 32,
    "chunk_index": 9,
    "word_count": 129,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "FUTURES (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "Profit is based strictly on the difference between the synthetic entry price and the exit price. Loss characteristics: Loss increases as market rises. Loss is based strictly on the difference between the synthetic entry price and the exit price. Decay characteristics: None. CATEGORY: Directional Long put A, short call A",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "5 LONG RISK REVERSAL",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 32,
    "chunk_index": 10,
    "word_count": 50,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5 LONG RISK REVERSAL (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "Pattern evolution: When to use: When you are bullish on the market and uncertain about volatility. Normally this position is initiated as a follow-up to another strategy. Its risk/reward is the same as a LONG FUTURES except that there is a flat area of little or no gain/loss. Profit characteristics: Profit increases as market rises above the long call strike price. Profit at expiration is open-ended and is based on the exercise price of B +/– price received or paid to initiate position. Loss characteristics: Loss increases as market falls below the short put. Loss at expiration is open-ended and is based on the exercise price of A +/– premium received or paid to initiate position. Decay characteristics: Time decay characteristics vary according to the relationship of the call strike price, put strike price and the underlying futures price at the time the position is established. The position is time decay neutral (not affected) if the futures price is exactly mid-way between the call and put strike prices; long time decay (benefits from time decay) when the futures price is closer to the call than the put strike price and short time decay (time decay erodes the value of the position) when the futures price is closer to the put than the call strike price. CATEGORY: Directional Long call B, short put A",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "(SPLIT STRIKE)",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 32,
    "chunk_index": 11,
    "word_count": 223,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "(SPLIT STRIKE) (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "time decay) when the futures price is closer to the call than the put strike price and short time decay (time decay erodes the value of the position) when the futures price is closer to the put than the call strike price. CATEGORY: Directional Long call B, short put A",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "SHORT RISK REVERSAL 6",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 32,
    "chunk_index": 12,
    "word_count": 50,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "SHORT RISK REVERSAL 6 (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "Pattern evolution: When to use: When you are bearish on the market and uncertain about volatility. Normally this position is initiated as a follow-up to another strategy. Its risk/reward is the same as a SHORT FUTURES except that there is a flat area of little or no gain/loss. Profit characteristics: Profit increases as market falls below the long put strike price. Profit at expiration is open-ended and is based on the exercise price of A +/– premium received or paid to initiate position. Loss characteristics: Loss increases as market rises above the short call. Loss at expiration is open-ended and is based on the exercise price of B +/– premium received or paid to initiate position. Decay characteristics: Time decay characteristics vary according to the relationship of the call strike price, put strike price and the underlying futures price at the time the position is established. The position is time decay neutral (not affected) if the futures price is exactly mid-way between the call and put strike prices; long time decay (benefits from time decay) when the futures price is closer to the put than the call strike price and short time decay (time decay erodes the value of the position) when the futures price is closer to the call than the put strike price. CATEGORY: Directional Long put A, short call B",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "(SPLIT STRIKE)",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 32,
    "chunk_index": 13,
    "word_count": 223,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "(SPLIT STRIKE) (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "time decay) when the futures price is closer to the put than the call strike price and short time decay (time decay erodes the value of the position) when the futures price is closer to the call than the put strike price. CATEGORY: Directional Long put A, short call B A Pattern evolution: When to use: When you are bullish to very bullish on the market. In general, the more out-of-the-money (higher strike) calls, the more bullish the strategy. Profit characteristics: Profit increases as market rises. At expiration, break-even point will be call option exercise price A + price paid for call option. Loss characteristics: Loss limited to amount paid for option. Maximum loss realized if market ends below option exercise A. Decay characteristics: Position is a wasting asset. As time passes, value of position erodes toward expiration value. CATEGORY: Directional SYNTHETICS: Long instrument, long put",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "7 LONG CALL",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 32,
    "chunk_index": 14,
    "word_count": 146,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7 LONG CALL (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "A + price paid for call option. Loss characteristics: Loss limited to amount paid for option. Maximum loss realized if market ends below option exercise A. Decay characteristics: Position is a wasting asset. As time passes, value of position erodes toward expiration value. CATEGORY: Directional SYNTHETICS: Long instrument, long put Pattern evolution: When to use: When you are bearish on the market. Sell out- of-the-money (higher strike) calls if you are less confident the market will fall, sell at-the-money calls if you are confident the market will stagnate or fall. Profit characteristics: Profit limited to premium received. At expiration, break-even is exercise price A + premium received. Maximum profit realized if market settles at or below A. Loss characteristics: Loss potential is open-ended. Loss increases as market rises. At expiration, losses increase by one point for each point market is above break-even. Because risk is open-ended, position must be watched closely. Decay characteristics: Position benefits from time decay. The option seller’s profit increases as option loses its time value. Maximum profit from time decay occurs if option is at-the-money. CATEGORY: Directional SYNTHETICS: Short instrument, short put",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "SHORT CALL A 8",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 32,
    "chunk_index": 15,
    "word_count": 186,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "SHORT CALL A 8 (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "each point market is above break-even. Because risk is open-ended, position must be watched closely. Decay characteristics: Position benefits from time decay. The option seller’s profit increases as option loses its time value. Maximum profit from time decay occurs if option is at-the-money. CATEGORY: Directional SYNTHETICS: Short instrument, short put A Pattern evolution: When to use: When you are bearish to very bearish on the market. In general, the more out-of-the-money (lower strike) the put option strike price, the more bearish the strategy. Profit characteristics: Profit increases as markets fall. At expiration, break-even point will be option exercise price A – price paid for option. For each point below break-even, profit increases by additional point. Loss characteristics: Loss limited to amount paid for option. Maximum loss realized if market ends above option exercise A. Decay characteristics: Position is a wasting asset. As time passes, value of position erodes toward expiration value. CATEGORY: Directional SYNTHETICS: Short instrument, long call",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "9 LONG PUT",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 32,
    "chunk_index": 16,
    "word_count": 158,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "9 LONG PUT (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "below break-even, profit increases by additional point. Loss characteristics: Loss limited to amount paid for option. Maximum loss realized if market ends above option exercise A. Decay characteristics: Position is a wasting asset. As time passes, value of position erodes toward expiration value. CATEGORY: Directional SYNTHETICS: Short instrument, long call A Pattern evolution: When to use: If you firmly believe the market is not going down. Sell out-of-the-money (lower strike) options if you are only somewhat convinced, sell at-the-money options if you are very confident the market will stagnate or rise. If you doubt market will stagnate and are more bullish, sell in-the-money options for maximum profit. Profit characteristics: Profit limited to premium received from put option sale. At expiration, break-even point is exercise price A – premium received. Maximum profit realized if market settles at or above A. Loss characteristics: Loss potential is open-ended. Loss increases as market falls. At expiration, losses increase by one point for each point market is below break-even. Because risk is open-ended, position must be watched closely. Decay characteristics: Position benefits from time decay. The option seller’s profit increases as option loses its time value. Maximum profit from time decay occurs if option is at-the- money. CATEGORY: Directional SYNTHETICS: Long instrument, short call",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "SHORT PUT 10",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 32,
    "chunk_index": 17,
    "word_count": 209,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "SHORT PUT 10 (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "point market is below break-even. Because risk is open-ended, position must be watched closely. Decay characteristics: Position benefits from time decay. The option seller’s profit increases as option loses its time value. Maximum profit from time decay occurs if option is at-the- money. CATEGORY: Directional SYNTHETICS: Long instrument, short call A Pattern evolution: When to use: If you think the market will go up, but with limited upside. Good position if you want to be in the market but are less confident of bullish expectations. You’re in good company. This is the most popular bullish trade. Profit characteristics: Profit limited, reaching maximum if market ends at or above strike price B at expiration. If call-vs.- call version (most common) used, break-even is at A + net cost of spread. If put-vs.-put version used, break-even is at B – net premium collected. Loss characteristics: What is gained by limiting profit potential is mainly a limit to loss if you guessed wrong on market. Maximum loss if market at expiration is at or below A. With call-vs.-call version, maximum loss is net cost of spread. Decay characteristics: If market is midway between A and B, little if any time decay effect. If market is closer to B, time decay is generally a benefit. If market is closer to A, time decay is generally detrimental to profitability. CATEGORY: Directional Long call A, short call B Long put A, short put B",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "11 B BULL SPREAD",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 32,
    "chunk_index": 18,
    "word_count": 238,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "11 B BULL SPREAD (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "midway between A and B, little if any time decay effect. If market is closer to B, time decay is generally a benefit. If market is closer to A, time decay is generally detrimental to profitability. CATEGORY: Directional Long call A, short call B Long put A, short put B B Pattern evolution: When to use: If you think the market will go down, but with limited downside. Good position if you want to be in the market but are less confident of bearish expectations. The most popular position among bears because it may be entered as a conservative trade when uncertain about bearish stance. Profit characteristics: Profit limited, reaching maximum at expiration if market is at or below strike price A. If put-vs.-put version (most common) used, break-even is at B – net cost of spread. If call-vs.-call version, break-even is at A + net premium collected. Loss characteristics: By accepting a limit on profits, you also achieve a limit on losses. Losses, at expiration, increase as market rises to B, where they are at a maximum. With put-vs.- put version, maximum loss is net cost of spread. Decay characteristics: If market is midway between A and B, little if any time decay effect. If market is closer to A, time decay is generally a benefit. If market is closer to B, time decay is generally detrimental to profitability. CATEGORY: Directional Short put A, long put B Short call A, long call B",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "BEAR SPREAD A 12",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 32,
    "chunk_index": 19,
    "word_count": 244,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "BEAR SPREAD A 12 (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "midway between A and B, little if any time decay effect. If market is closer to A, time decay is generally a benefit. If market is closer to B, time decay is generally detrimental to profitability. CATEGORY: Directional Short put A, long put B Short call A, long call B",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "13 B LONG",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 32,
    "chunk_index": 20,
    "word_count": 50,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "13 B LONG (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "A Pattern evolution: When to use: One of the few positions which may be entered advantageously in a long-term options series. Enter when, with one month or more to go, cost of the spread is 10 percent or less of B – A (20 percent if a strike exists between A and B). This is a rule of thumb; check theoretical values. Profit characteristics: Maximum profit occurs if a market is at B at expiration. That profit would be B – A – net cost of spread. This profit develops, almost totally, in the last month. Loss characteristics: Maximum loss, in either direction, is cost of spread. A very conservative trade, break-evens are at A + cost of spread and at C – cost of spread. Decay characteristics: Decay negligible until final month, during which distinctive pattern of butterfly forms. Maximum profit growth is at B. If you are away from (A-C) range entering the last month, you may wish to liquidate position. CATEGORY: Precision Long call A, short 2 calls B, long call C Long put A, short 2 puts B, long put C (Note: B – A generally is equal to C – B)",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "BUTTERFLY",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 32,
    "chunk_index": 21,
    "word_count": 196,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "BUTTERFLY (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "If you are away from (A-C) range entering the last month, you may wish to liquidate position. CATEGORY: Precision Long call A, short 2 calls B, long call C Long put A, short 2 puts B, long put C (Note: B – A generally is equal to C – B)",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "SHORT 14",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 32,
    "chunk_index": 22,
    "word_count": 50,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "SHORT 14 (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "B Pattern evolution: When to use: When the market is either below A or above C and position is overpriced with a month or so left. Or when only a few weeks are left, market is near B, and you expect an imminent move in either direction. Profit characteristics: Maximum profit equals the credit at which spread is established. Occurs when market, at expiration, is below A or above C, thus making all options in- the-money or all options out-of-the-money. Loss characteristics: Maximum loss occurs if market is at B at expiration. Amount of that loss is B – A – credit received when setting up position. Break-evens are at A + initial credit and C – initial credit. Decay characteristics: Decay negligible until final month, during which distinctive pattern of butterfly forms. Maximum loss acceleration is at B. CATEGORY: Precision Short call A, long 2 calls B, short call C Short put A, long 2 puts B, short put C (Note: B – A generally is equal to C – B)",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "BUTTERFLY",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 32,
    "chunk_index": 23,
    "word_count": 172,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "BUTTERFLY (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "negligible until final month, during which distinctive pattern of butterfly forms. Maximum loss acceleration is at B. CATEGORY: Precision Short call A, long 2 calls B, short call C Short put A, long 2 puts B, short put C (Note: B – A generally is equal to C – B)",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "15 LONG IRON",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 32,
    "chunk_index": 24,
    "word_count": 50,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "15 LONG IRON (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "B Pattern evolution: When to use: When the market is either below A or above C and the position is underpriced with a month or so left. Or when only a few weeks are left, market is near B, and you expect an imminent breakout move in either direction. Profit characteristics: Maximum profit equals (B – A) less the net debit to create the position. Occurs when market, at expiration, is below A or above C. Loss characteristics: Maximum loss occurs if market is at B at expiration. Amount of that loss is net debit to create the position. Break-evens are at B + and – initial debit. Decay characteristics: Decay negligible until final month, during which distinctive pattern of butterfly forms. Maximum loss is at B. If you are away from (A-C) range entering last month, you may wish to hold the position. CATEGORY: Precision Long straddle B, short strangle at AC Short put A, long put B, long call B, short call C (Note: B – A generally is equal to C – B)",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "BUTTERFLY",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 32,
    "chunk_index": 25,
    "word_count": 176,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "BUTTERFLY (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "B. If you are away from (A-C) range entering last month, you may wish to hold the position. CATEGORY: Precision Long straddle B, short strangle at AC Short put A, long put B, long call B, short call C (Note: B – A generally is equal to C – B)",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "SHORT IRON B 16",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 32,
    "chunk_index": 26,
    "word_count": 50,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "SHORT IRON B 16 (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "Pattern evolution: When to use: Enter when the Short Iron Butterfly’s net credit is 80 percent or more of C – A, and you anticipate a prolonged period of relative price stability where the underlying will be near the mid-point of the C – A range close to expiration. This is a rule of thumb; check theoretical values. Profit characteristics: Maximum profit occurs if a market is at B at expiration. Profit would be equal to short straddle premium minus long strangle premium. This profit develops, almost totally, in the last month. Loss characteristics: Maximum loss, in either direction, net premium collected minus (B-A). This is a very conservative trade, break-evens are at B + and – net premium collected. Decay characteristics: Decay negligible until final month, during which distinctive pattern of butterfly forms. Maximum profit growth is at B. If you are away from (A-C) range entering the last month, you may wish to liquidate position. CATEGORY: Precision Short 1 call and 1 put at B, buy 1 put at A, buy 1 call at C or sell straddle at strike price B and buy strangle at AC for protection (Note: B – A generally is equal to C – B)",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "A C",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 32,
    "chunk_index": 27,
    "word_count": 202,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "A C (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "may wish to liquidate position. CATEGORY: Precision Short 1 call and 1 put at B, buy 1 put at A, buy 1 call at C or sell straddle at strike price B and buy strangle at AC for protection (Note: B – A generally is equal to C – B)",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "17 LONG",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 32,
    "chunk_index": 28,
    "word_count": 50,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "17 LONG (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "A Pattern evolution: When to use: If market is near A and you expect it to start moving but are not sure which way. Especially good position if market has been quiet, then starts to zigzag sharply, signaling potential eruption. Profit characteristics: Profit open-ended in either direction. At expiration, break-even is at A, +/– cost of spread. However, position is seldom held to expiration because of increasing time decay with passage of time. Loss characteristics: Loss limited to the cost of spread. Maximum loss occurs if market is at A at expiration. Decay characteristics: Time decay accelerates as options approach expiration. Position is generally liquidated well before expiration. CATEGORY: Precision Long call A, long put A SYNTHETICS: Long 2 calls A, short instrument Long 2 puts A, long instrument (All done to initial delta neutrality. A delta neutral spread is a spread established as a neutral position by using the deltas of the options involved. The neutral ratio is determined by dividing the delta of the purchased option by the delta of the written option)",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "STRADDLE",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 32,
    "chunk_index": 29,
    "word_count": 175,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "STRADDLE (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "puts A, long instrument (All done to initial delta neutrality. A delta neutral spread is a spread established as a neutral position by using the deltas of the options involved. The neutral ratio is determined by dividing the delta of the purchased option by the delta of the written option) A STRADDLE Pattern evolution: When to use: If market is near A and you expect market is stagnating. Because you are short options, you reap profits as they decay — as long as market remains near A. Profit characteristics: Profit maximized if market, at expiration, is at A. In call-put scenario (most common), maximum profit is equal to the credit from establishing position; break-even is A +/– total credit. Loss characteristics: Loss potential open-ended in either direction. Position, therefore, must be closely monitored and readjusted to delta neutral if market begins to drift away from A. Decay characteristics: Because you are only short options, you pick up time-value decay at an increasing rate as expiration approaches. Time decay is maximized if market is near A. CATEGORY: Precision Short call A, short put A SYNTHETICS: Short 2 calls A, long instrument Short 2 puts A, short instrument (All done to initial delta neutrality)",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "SHORT 18",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 32,
    "chunk_index": 30,
    "word_count": 202,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "SHORT 18 (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "short options, you pick up time-value decay at an increasing rate as expiration approaches. Time decay is maximized if market is near A. CATEGORY: Precision Short call A, short put A SYNTHETICS: Short 2 calls A, long instrument Short 2 puts A, short instrument (All done to initial delta neutrality)",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "19 LONG",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 32,
    "chunk_index": 31,
    "word_count": 50,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "19 LONG (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "Pattern evolution: When to use: If market is within or near (A-B) range and has been stagnant. If market explodes either way, you make money; if market continues to stagnate, you lose less than with a long straddle. Also useful if implied volatility is expected to increase. Profit characteristics: Profit open-ended in either direction. Break-even levels are at A – cost of spread and B + cost of spread. However, spread is usually not held to expiration. Loss characteristics: Loss limited. Loss is equal to net cost of position. Maximum loss occurs if, at expiration, market is between A and B. Decay characteristics: Decay accelerates as options approach expiration but not as rapidly as with long straddle. To avoid largest part of decay, the position is normally liquidated prior to expiration. CATEGORY: Precision Long put A, long call B (Generally done to initial delta neutrality)",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "A B",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 32,
    "chunk_index": 32,
    "word_count": 145,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "A B (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "market is between A and B. Decay characteristics: Decay accelerates as options approach expiration but not as rapidly as with long straddle. To avoid largest part of decay, the position is normally liquidated prior to expiration. CATEGORY: Precision Long put A, long call B (Generally done to initial delta neutrality)",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "SHORT A B 20",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 32,
    "chunk_index": 33,
    "word_count": 50,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "SHORT A B 20 (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "Pattern evolution: When to use: If market is within or near (A-B) range and, though active, is quieting down. If market goes into stagnation, you make money; if it continues to be active, you have a bit less risk then with a short straddle. Profit characteristics: Maximum profit equals option premium collected. Maximum profit realized if market, at expiration, is between A and B. Loss characteristics: At expiration, losses occur only if market is above B + option premium collected (for put-call) or below A – that amount. Potential loss is open-ended. Although less risky than short straddle, position is risky. Decay characteristics: Because you are short options, time value decays at an increasing rate as the option expiration date approaches; maximized if market is within (A-B) range. CATEGORY: Precision Short put A, short call B (All done to initial delta neutrality)",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "STRANGLE",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 32,
    "chunk_index": 34,
    "word_count": 142,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "STRANGLE (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "Although less risky than short straddle, position is risky. Decay characteristics: Because you are short options, time value decays at an increasing rate as the option expiration date approaches; maximized if market is within (A-B) range. CATEGORY: Precision Short put A, short call B (All done to initial delta neutrality) B SPREAD A Pattern evolution: When to use: Usually entered when market is near A and user expects a slight to moderate rise in market but sees a potential for sell-off. One of the most common option spreads, seldom done more than 1:3 (two excess shorts) because of upside risk. Profit characteristics: Maximum profit, is equal to B – A – net cost of position (for call-vs.-call version), realized if market is at B at expiration or B – A + net credit of position (if long option premium is less than premium collected from the sale of two or more options). Loss characteristics: Loss limited on downside (to net cost of position in call-vs.-call, or no loss if position established at a credit) but open-ended if market rises. Rate of loss, if market rises beyond strike price B, is proportional to number of excess shorts in position. Decay characteristics: Depends on the net time value purchased or sold via this strategy. If more time value sold than bought, then time value decays works to the benefit of the holder of this strategy. CATEGORY: Precision Long call A, short calls B For example long 1 call @ A; short 2 calls @ B",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "21 RATIO CALL",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 32,
    "chunk_index": 35,
    "word_count": 253,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "21 RATIO CALL (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "net time value purchased or sold via this strategy. If more time value sold than bought, then time value decays works to the benefit of the holder of this strategy. CATEGORY: Precision Long call A, short calls B For example long 1 call @ A; short 2 calls @ B",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "21 RATIO CALL",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 32,
    "chunk_index": 36,
    "word_count": 50,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "21 RATIO CALL (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "B Pattern evolution: When to use: Usually entered when market is near B and you expect market to fall slightly to moderately, but see a potential for sharp rise. One of the most common option spreads, seldom done more than 1:3 (two excess shorts) because of downside risk. Profit characteristics: Maximum profit in amount of B – A – net cost of position (for put-vs.-put version), realized if market is at A at expiration, or B – A + net credit of position (if long option premium is less than premium collected from the sale of two or more options). Loss characteristics: Loss limited on upside (to net cost of position in put-vs.-put version, or no loss if position established at a credit) but open-ended if market falls. Rate of loss, if market falls below strike price A, is proportional to number of excess shorts in position. Decay characteristics: Dependent on the net time value purchased or sold via this strategy. If more time value sold than bought, then time value decays work to the benefit of the holder. CATEGORY: Precision Long put B, short puts A For example long 1 put @ B; short 2 puts @ A",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "SPREAD",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 32,
    "chunk_index": 37,
    "word_count": 199,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "SPREAD (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "Dependent on the net time value purchased or sold via this strategy. If more time value sold than bought, then time value decays work to the benefit of the holder. CATEGORY: Precision Long put B, short puts A For example long 1 put @ B; short 2 puts @ A",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "23 CALL RATIO",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 32,
    "chunk_index": 38,
    "word_count": 50,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "23 CALL RATIO (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "B Pattern evolution: When to use: Normally entered when market is near B and shows signs of increasing activity, with greater probability to upside. Profit characteristics: Profit limited on downside (if net credit taken in when position was established) but open-ended in rallying market. Loss characteristics: Maximum loss, is amount of B – A – initial credit (or B – A + initial debit), realized if market is at B at expiration. This loss is less than for equivalent long straddle, the trade-off for sacrificing profit potential on the downside. Decay characteristics: Dependent on the net time value purchased or sold via this strategy. If more time value sold than bought, then time value decays work to the benefit of the holder. CATEGORY: Precision Short call A, long 2 or more calls B",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "BACKSPREAD",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 32,
    "chunk_index": 39,
    "word_count": 133,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "BACKSPREAD (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "for sacrificing profit potential on the downside. Decay characteristics: Dependent on the net time value purchased or sold via this strategy. If more time value sold than bought, then time value decays work to the benefit of the holder. CATEGORY: Precision Short call A, long 2 or more calls B",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "PUT RATIO 24",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 32,
    "chunk_index": 40,
    "word_count": 50,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PUT RATIO 24 (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "A Pattern evolution: When to use: Normally entered when market is near A and shows signs of increasing activity, with greater probability to downside (for example, if last major move was up, followed by stagnation). Profit characteristics: Profit limited on upside (to net credit taken in when position was established) but open-ended in collapsing market. Loss characteristics: Maximum loss, is amount of B – A – initial credit (or B – A + initial debit), realized if market is at A at expiration. This loss is less than for the equivalent long straddle, the trade-off for sacrificing profit potential on the upside. Decay characteristics: Dependent on the net time value purchased or sold via this strategy. If more time value sold than bought, then time value decays work to the benefit of the holder. CATEGORY: Precision Short 1 put B, long 2 or more puts A",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "BACKSPREAD B",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 32,
    "chunk_index": 41,
    "word_count": 146,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "BACKSPREAD B (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "sacrificing profit potential on the upside. Decay characteristics: Dependent on the net time value purchased or sold via this strategy. If more time value sold than bought, then time value decays work to the benefit of the holder. CATEGORY: Precision Short 1 put B, long 2 or more puts A",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "25 BOX OR",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 32,
    "chunk_index": 42,
    "word_count": 50,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "25 BOX OR (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "Pattern evolution: When to use: Occasionally, a market will get out of line enough to justify an initial entry into one of these positions. However, they are most commonly used to “lock” all or part of a portfolio by buying or selling to create the missing “legs” of the position. These are alternatives to closing out positions at possibly unfavorable prices. Long box: Long a bull spread, long a bear spread — that is, long call A, short call B, long put B, short put A. Value = B – A – Net Debit. Short box: Long call B, short call A, long put A, short put B. Value = Net Credit + (A – B). Long-instrument conversion: Long instrument, long put A, short call A. Value = 0. “Price” = instrument + put – A – call. Short-instrument conversion: Short instrument, long call A, short put A. Value = 0. “Price” = A + call – instrument – put. CATEGORY: Locked or arbitrage trade. These spreads are referred to as “locked trades” because their value at expiration is totally independent of the price of the underlying instrument. If you can buy them for less than that value or sell them for more, you will make a profit (ignoring commission costs).",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "A B",
    "page_number": 30,
    "page_range": "p.30-31",
    "total_pages": 32,
    "chunk_index": 43,
    "word_count": 211,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "A B (p.30-31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "Locked or arbitrage trade. These spreads are referred to as “locked trades” because their value at expiration is totally independent of the price of the underlying instrument. If you can buy them for less than that value or sell them for more, you will make a profit (ignoring commission costs). For more information, go to cmegroup.com/options. Trading futures and options on futures is not suitable for all investors, and involves risk of loss. Futures are a leveraged instrument, and because only a percentage of a contract's value is required to trade, it is possible to lose more than the amount of money initially deposited for a futures product. The information presented here has been compiled by CME Group for general purposes only. Although every attempt has been made to ensure the accuracy of the information within this brochure, CME Group assumes no responsibility for any errors or omissions. Additionally, all examples in this brochure are hypothetical situations, used for explanation purposes only, and should not be considered investment advice or the results of actual market experience. All matters pertaining to rules and specifications herein are made subject to and superseded by official CME, CBOT NYMEX, COMEX and CME Group rules. Current rules should be consulted in all cases concerning contract specifications.",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "A B",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 32,
    "chunk_index": 44,
    "word_count": 211,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "A B (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  },
  {
    "text": "only, and should not be considered investment advice or the results of actual market experience. All matters pertaining to rules and specifications herein are made subject to and superseded by official CME, CBOT NYMEX, COMEX and CME Group rules. Current rules should be consulted in all cases concerning contract specifications. 20 South Wacker Drive info@cmegroup.com Chicago, Illinois 60606 +1 800 331 3332 cmegroup.com +1 312 930 1000 CME GROUP GLOBAL OFFICES New York Hong Kong +1 212 299 2000 +852 3101 7696 Calgary Seoul +1 403 444 6876 +82 2 6336 6722 São Paulo Singapore +55 11 2565 5999 +65 6593 5555 Washington D.C. Houston +1 202 638 3838 +1 713 658 9292 London Tokyo +44 20 3379 3700 +81 3242 6232 ED159/1M/0413",
    "title": "25 for trading options on CME Group futures",
    "source_type": "pdf",
    "document_id": "95088080d130",
    "source_file": "OPTIONS - CME-113_21brochure_SIDE_SR.pdf",
    "section": "CME GROUP HEADQUARTERS",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 32,
    "chunk_index": 45,
    "word_count": 123,
    "author": "CME Group",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "CME GROUP HEADQUARTERS (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130425155900-05'00'",
    "duration": null
  }
]