[
  {
    "text": "Overconfidence and Trading Volume Markus Glaser, Martin Weber∗ Final Version, Geneva Risk and Insurance Review, forthcoming March 26, 2007 Abstract Theoretical models predict that overconfident investors will trade more than rational investors. Wedirectlytestthishypothesisbycorrelatingindividualoverconfidencescoreswithseveralmeasures of trading volume of individual investors. Approximately 3,000 online broker investors were asked to answer an internet questionnaire which was designed to measure various facets of overconfidence (miscalibration,volatilityestimates,betterthanaverageeffect).Themeasuresoftradingvolumewere calculated by the trades of 215 individual investors who answered the questionnaire. We find that investors who think that they are above average in terms of investment skills or past performance (butwhodidnothaveaboveaverageperformanceinthepast)trademore.Measuresofmiscalibration are,contrarytotheory,unrelatedtomeasuresoftradingvolume.Thisresultisstrikingastheoretical models that incorporate overconfident investors mainly motivate this assumption by the calibration literatureandmodeloverconfidenceasunderestimationofthevarianceofsignals.Inconnectionwith other recent findings, we conclude that the usual way of motivating and modeling overconfidence whichismainlybasedonthecalibrationliteraturehastobetreatedwithcaution.Moreover,ourway of empirically evaluating behavioral finance models - the correlation of economic and psychological variables and the combination of psychometric measures of judgment biases (such as overconfidence scores) and field data - seems to be a promising way to better understand which psychological phe- nomena actually drive economic behavior. Keywords:Overconfidence,DifferencesofOpinion,TradingVolume,IndividualInvestors,InvestorBehavior,Cor- relation of Economic and Psychological Variables, Combination of Psychometric Measures of Judgment Biases and Field Data JEL Classification Code: D8, G1 ∗Markus Glaser is from the Lehrstuhl fu¨r Bankbetriebslehre, Universita¨t Mannheim, L 5, 2, 68131 Mannheim. E-Mail: glaser@bank.BWL.uni-mannheim.de.MartinWeberisfromtheLehrstuhlfu¨rBankbetriebslehre,Universit¨atMannheim,L5, 2,68131MannheimandCEPR,London.E-Mail:weber@bank.BWL.uni-mannheim.de.WewouldliketothankNicholasBar- beris,DanielDorn,MartinHellwig,TerryOdean,KlausR¨oder,andseminarparticipantsattheUniversitiesofMannheim, Frankfurt/Oder,Tilburg,Fribourg,Frankfurt/Main,theNorwegianSchoolofManagementinOslo,Caltech,theTinbergen InstituteinAmsterdam,theEuropeanSummerSymposiuminFinancialMarketsatGerzensee,the10thAnnualMeetingof theGermanFinanceAssociationinMainz,the64thAnnualMeetingoftheAmericanFinanceAssociationinSanDiego,the annualmeetingoftheVerbandderHochschullehrerfu¨rBetriebswirtschaftinGraz,andtheInquireEuropeAutumnSemi- naronEmpiricalBehavioralFinanceinPragueforvaluablecommentsandinsights.FinancialSupportfromtheDeutsche Forschungsgemeinschaft(DFG)andINQUIREEuropeisgratefullyacknowledged. 1",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 51,
    "chunk_index": 0,
    "word_count": 218,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "economic behavior. Keywords:Overconfidence,DifferencesofOpinion,TradingVolume,IndividualInvestors,InvestorBehavior,Cor- relation of Economic and Psychological Variables, Combination of Psychometric Measures of Judgment Biases and Field Data JEL Classification Code: D8, G1 ∗Markus Glaser is from the Lehrstuhl fu¨r Bankbetriebslehre, Universita¨t Mannheim, L 5, 2, 68131 Mannheim. E-Mail: glaser@bank.BWL.uni-mannheim.de.MartinWeberisfromtheLehrstuhlfu¨rBankbetriebslehre,Universit¨atMannheim,L5, 2,68131MannheimandCEPR,London.E-Mail:weber@bank.BWL.uni-mannheim.de.WewouldliketothankNicholasBar- beris,DanielDorn,MartinHellwig,TerryOdean,KlausR¨oder,andseminarparticipantsattheUniversitiesofMannheim, Frankfurt/Oder,Tilburg,Fribourg,Frankfurt/Main,theNorwegianSchoolofManagementinOslo,Caltech,theTinbergen InstituteinAmsterdam,theEuropeanSummerSymposiuminFinancialMarketsatGerzensee,the10thAnnualMeetingof theGermanFinanceAssociationinMainz,the64thAnnualMeetingoftheAmericanFinanceAssociationinSanDiego,the annualmeetingoftheVerbandderHochschullehrerfu¨rBetriebswirtschaftinGraz,andtheInquireEuropeAutumnSemi- naronEmpiricalBehavioralFinanceinPragueforvaluablecommentsandinsights.FinancialSupportfromtheDeutsche Forschungsgemeinschaft(DFG)andINQUIREEuropeisgratefullyacknowledged. 1 1 Introduction Trading volume appears high in financial markets. The annualized monthly turnover on the New York Stock Exchange (NYSE) in the last years was about 100 %. The num- ber of shares traded on the NYSE in the year 2004 was 367,098,489,000 and the daily value of trading is currently about 55 billion.1 De Bondt and Thaler (1995), p. 392, note that the high trading volume observed in financial markets “is perhaps the single most embarrassing fact to the standard finance paradigm”. Why do investors trade such enormous quantities? Rational investors must be heteroge- neous for trade to be mutually advantageous for the buyer and the seller of an asset. Differences in information alone cannot explain high levels of trading volume. This is a result of various no trade theorems, among them, for example, Milgrom and Stokey (1982).2 Introduction of noise traders or liquidity traders who trade for reasons exogenous to models helps to circumvent no trade theorems.3 This noise or liquidity trading is not necessarily irrational. For example, endowment shocks, such as bequests or accidents, can be interpreted as liquidity trading motives.4 But common sense suggests that ascribing the high levels of trading volume mentioned above solely to noise or liquidity trading is unsatisfying.5 Two further strands of literature have emerged that are able to explain high levels of trading volume. These strands of literature are labeled as the “differences of opinion” literature and the “overconfidence” literature.6 1Seewww.nyse.com. 2See,forexample,Brunnermeier(2001),pp.30-37,foradiscussionofvariousnotradetheorems. 3See Pagano and R¨oell (1992), p. 680, and Brunnermeier (2001), p. 31. Shleifer and Summers (1990) survey the noise traderapproachtofinance. 4See,forexample,PaganoandR¨oell(1992),p.680. 5SeealsoHirshleifer(2001),p.1564,andWang(1998),p.322. 6Morris(1994)showsthatevenina“differencesofopinion”settingnotradetheoremscanariseundercertainconditions. 2",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 51,
    "chunk_index": 1,
    "word_count": 315,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "able to explain high levels of trading volume. These strands of literature are labeled as the “differences of opinion” literature and the “overconfidence” literature.6 1Seewww.nyse.com. 2See,forexample,Brunnermeier(2001),pp.30-37,foradiscussionofvariousnotradetheorems. 3See Pagano and R¨oell (1992), p. 680, and Brunnermeier (2001), p. 31. Shleifer and Summers (1990) survey the noise traderapproachtofinance. 4See,forexample,PaganoandR¨oell(1992),p.680. 5SeealsoHirshleifer(2001),p.1564,andWang(1998),p.322. 6Morris(1994)showsthatevenina“differencesofopinion”settingnotradetheoremscanariseundercertainconditions. 2",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 51,
    "chunk_index": 2,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "The“differencesofopinion”literaturewas,amongothers,motivatedbyVarian(1985)and Varian (1989). Differences of opinion can arise due to differences in prior beliefs or due to differences in the way investors interpret public information. Furthermore, it is assumed that these differences in beliefs or models for interpreting signals are common knowledge. Although everyone knows that others have different opinions, there is no adjustment of beliefs, i.e. investors “agree to disagree”. Modeling differences of opinion is mainly motivated by mere plausibility: differences of opinion are present in every day life (see, for example, Harris and Raviv (1993)). The models are usually silent about the reason why there are differences of opinion in the first place. Varian (1989), Harris and Raviv (1993), and Kandel and Pearson (1995) show that differences of opinion help explain high levels of trading volume and that a higher degree of differences of opinion leads to a higher degree of trading volume. The “overconfidence” literature assumes that investors overestimate the precision of in- formation. Overconfidence models thus incorporate findings of a large set of psycholog- ical studies that are often referred to as the “calibration literature” (see, for example, Lichtenstein, Fischhoff, and Phillips (1982)). However, overconfidence models are usually motivated by a richer set of psychological results that are often summarized as overcon- fidence.7 These theoretical models predict that overconfident investors trade more than rational investors. De Bondt and Thaler (1995) argue that “the key behavioral factor needed to understand the trading puzzle is overconfidence”.8 The discussion so far raises the following questions that our study will tackle empirically: 1. Is trading volume of an investor a function of the degree of miscalibration of the respective investor as claimed by the “overconfidence” literature? 2. Is trading volume of an investor a function of other overconfidence measures that are 7WewilldiscussthesefurtherresultsinSubsection3.1. 8DeBondtandThaler(1995),p.393. 3",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 51,
    "chunk_index": 3,
    "word_count": 294,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "following questions that our study will tackle empirically: 1. Is trading volume of an investor a function of the degree of miscalibration of the respective investor as claimed by the “overconfidence” literature? 2. Is trading volume of an investor a function of other overconfidence measures that are 7WewilldiscussthesefurtherresultsinSubsection3.1. 8DeBondtandThaler(1995),p.393. 3",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 51,
    "chunk_index": 4,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "often used as a motivation of overconfidence models? 3. Are the various overconfidence measures used to motivate overconfidence models positively correlated? We analyze these questions by correlating various overconfidence measures with measures of trading volume. A sample of approximately 3,000 individual investors with online bro- ker accounts was asked to answer an online questionnaire which was designed to measure various facets of overconfidence, among them their degree of miscalibration. For the sub- group of 215 respondents we are able to correlate overconfidence measures and measures of trading volume which are calculated by the trades over a 51 month period. By correlating miscalibration scores with measures of trading volume we are able to empirically test the hypothesis of overconfidence models that, the higher the degree of miscalibration (modeled as the degree of the overestimation of the precision of informa- tion), the higher the trading volume of the respective investor. In addition, we explore whether other biases which are often summarized as overconfidence and are used to moti- vate overconfidence models are related to trading volume. Such an analysis is necessary to guide modeling. Psychologists have found several judgment biases but it remains unclear which bias affects economic behavior or whether these biases affect economic behavior at all. These points are often put forth as a major drawback of behavioral finance models. In this vein, Fama (1998) argues that “given the demonstrated ingenuity of the theory branch of finance, and given the long litany of apparent judgment biases unearthed by cognitive psychologists, it is safe to predict that we will soon see a menu of behavioral models that can be mixed and matched to explain specific anomalies.”9 This statement shows the importance of analyzing the link or correlation between judgment biases and economic variables such as trading volume as the only way to test which bias actually influences economic behavior. Our paper is among the few recent papers that measures 9Fama(1998),p.291. 4",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 51,
    "chunk_index": 5,
    "word_count": 320,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "matched to explain specific anomalies.”9 This statement shows the importance of analyzing the link or correlation between judgment biases and economic variables such as trading volume as the only way to test which bias actually influences economic behavior. Our paper is among the few recent papers that measures 9Fama(1998),p.291. 4",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 51,
    "chunk_index": 6,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "psychological biases and correlate them with economic choices. Other recent examples are Graham, Harvey, and Huang (2005) or Puri and Robinson (2005). Our main findings can be summarized as follows. Investors who think that they are above average in terms of investment skills or past performance (but who did not have above average performance in the past) trade more. This finding is consistent with other re- cent studies (see Deaves, Lu¨ders, and Luo (2003), Graham, Harvey, and Huang (2005), Hales (2005), Oberlechner and Osler (2003)). Measures of miscalibration are, contrary to predictions of overconfidence models, unrelated to measures of trading volume. The rest of the paper is organized as follows. Section 2 discusses related research. Section 3 surveys overconfidence in the literature on heuristics and biases and in the finance literature. Section 4 describes the data set and the design of our study, especially our overconfidence measures. Section 5 shows the results on the relation between measures of overconfidence and trading volume and presents several robustness checks. Section 6 discusses the results and the last section concludes. 2 Related Research Ourresearchisrelatedtothestudiesineconomicsandfinancethatcorrelatepsychological data (such as measures of overconfidence) with economic variables (such as trading vol- ume).Statman,Thorley,andVorkink(2006)useU.S.marketleveldatatotestthehypoth- esis that overconfidence leads to high trading volume. They argue that after high returns subsequent trading volume will be higher as investment success increases the degree of overconfidence.10 Theyfindanincreaseintradingactivityafterbullmarkets:stocktrading volume (turnover) is positively related to lagged stock returns. This finding is consistent with the hypothesis that a higher degree of overconfidence leads to higher trading volume 10SeeSubsection5.3forafurtherdiscussionofdynamicoverconfidencemodels. 5",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 51,
    "chunk_index": 7,
    "word_count": 253,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "They argue that after high returns subsequent trading volume will be higher as investment success increases the degree of overconfidence.10 Theyfindanincreaseintradingactivityafterbullmarkets:stocktrading volume (turnover) is positively related to lagged stock returns. This finding is consistent with the hypothesis that a higher degree of overconfidence leads to higher trading volume 10SeeSubsection5.3forafurtherdiscussionofdynamicoverconfidencemodels. 5",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 51,
    "chunk_index": 8,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "aslongashighpastreturnsareaproxyforoverconfidence.Theproxyforoverconfidencein Barber and Odean (2001) is gender. In their paper, they summarize psychological studies that find a higher degree of overconfidence among men than among women. Consequently, they partition their data set, a sample of U.S. online broker investors, on gender. They find that men trade more than women which is consistent with overconfidence models. Fenton-O’Creevy, Nicholson, Soane, and Willman (2003) analyze the link between psy- chological and economic variables empirically using data on the behavior of professional traders. They measure illusion of control (Langer (1975), Presson and Benassi (1996)) by a computer-based task. They find that their measure of illusion of control is negatively associated with performance as measured by traders’ self-ratings, total annual earnings, and the performance assessments of a senior trader-manager.11 Biais, Hilton, Mazurier, and Pouget (2005) analyze experimentally whether psychological traits and cognitive bi- ases affect trading and performance. Based on the answers of 245 subjects (students) to a psychological questionnaire they measured, among other psychological traits, the degree of overconfidence via calibration tasks. The subjects also participated in an experimental asset market. They find that overconfidence (miscalibration) reduces trading performance in the experimental asset market. However, their overconfidence measure is unrelated to trading volume. Contrary to predictions of overconfidence models, overconfident subjects donotplacemoreorders.UsingdatafromseveralUBS/GallupInvestorSurveys,Graham, Harvey, and Huang (2005) measure investor competence through survey responses. They find that investors who feel competent trade more often and have a more internationally 11There are other studies (Dorn and Huberman (2002) and Dorn and Huberman (2005)) which analyze, among other things, the link between psychological variables (overconfidence) and economic variables (portfolio turnover) empirically using a transaction data set of online broker investors which is similar to ours. They measure overconfidence via a ques- tionnaireasthedifferencebetweenperceivedandactualfinancialmarketknowledgeandaself-attributionbiasscore.Their findingisthattheseoverconfidencemeasuresfailtoexplainadditionalvariationintradingvolume(p.33).Theoverconfi- dencemeasuresinDornandHuberman(2002)are,however,notbasedontheoriginalpsychologicaloverconfidencestudies, apointwhichtheythemselvesacknowledgeastheyconcludeintheirpaperthatoneshould“conductexperimentaltestsof overconfidenceandcomparetheresultswithactualtradingbehavior”(p.34). 6",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 51,
    "chunk_index": 9,
    "word_count": 289,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "Huberman (2002) and Dorn and Huberman (2005)) which analyze, among other things, the link between psychological variables (overconfidence) and economic variables (portfolio turnover) empirically using a transaction data set of online broker investors which is similar to ours. They measure overconfidence via a ques- tionnaireasthedifferencebetweenperceivedandactualfinancialmarketknowledgeandaself-attributionbiasscore.Their findingisthattheseoverconfidencemeasuresfailtoexplainadditionalvariationintradingvolume(p.33).Theoverconfi- dencemeasuresinDornandHuberman(2002)are,however,notbasedontheoriginalpsychologicaloverconfidencestudies, apointwhichtheythemselvesacknowledgeastheyconcludeintheirpaperthatoneshould“conductexperimentaltestsof overconfidenceandcomparetheresultswithactualtradingbehavior”(p.34). 6 diversified portfolio. Puri and Robinson (2005) link optimism to major economic choices. They create a measure of optimism using the Survey of Consumer Finance by comparing a person’s self-reported life expectancy to that implied by statistical tables. Optimists are more likely to believe that future economic conditions will improve. In addition, they tilt their investment portfolios more toward individual stocks. Ben-David, Graham, and Harvey (2006) test whether managerial overconfidence is associated with corporate poli- cies and find that firms with overconfident CFOs invest more, pay out fewer dividends, maintain long-term debt, exhibit higher investment-cash flow sensitivity, repurchase more equity as a response to low returns but issue less equity following high returns, and tilt executive compensation towards performance. 3 Overconfidence as a Judgment Bias and in Finance Models 3.1 Overconfidence as a Judgment Bias In the literature on heuristics and biases there is no precise definition of overconfidence. There are several findings that are often summarized as overconfidence. Under this view, overconfidencecanmanifestitselfinthefollowingforms:miscalibration,tootightvolatility estimates, and the better than average effect.12 We will discuss these manifestations of overconfidence in turn. 12Griffin and Brenner (2004), for example, argue that these concepts are linked. They present theoretical perspectives on (mis)calibration, among them the most influential perspective, optimistic overconfidence. According to the authors, theoptimisticoverconfidenceperspectivebuilds,forexample,onthebetterthanaverageeffect,unrealisticoptimism,and illusionofcontrol. 7",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 51,
    "chunk_index": 10,
    "word_count": 261,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "overconfidencecanmanifestitselfinthefollowingforms:miscalibration,tootightvolatility estimates, and the better than average effect.12 We will discuss these manifestations of overconfidence in turn. 12Griffin and Brenner (2004), for example, argue that these concepts are linked. They present theoretical perspectives on (mis)calibration, among them the most influential perspective, optimistic overconfidence. According to the authors, theoptimisticoverconfidenceperspectivebuilds,forexample,onthebetterthanaverageeffect,unrealisticoptimism,and illusionofcontrol. 7",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 51,
    "chunk_index": 11,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "Studies that analyze assessments of uncertain quantities using the fractile method usu- ally find that people’s probability distributions are too tight (Lichtenstein, Fischhoff, and Phillips (1982)). For example, studies that ask people to state a 90 percent confidence interval for several uncertain quantities find that the percentage of surprises, i.e. the per- centage of true values that fall outside the confidence interval, are higher than 10 percent, the percentage of surprises of a perfectly calibrated person. Other studies analyze the calibration of probability judgments. People are asked to answer questions with two an- swer alternatives. After that, they are asked to state the probability that their answer is correct. The usual finding is that for all questions assigned a given probability the pro- portion of correct answers is lower than the assigned probability (Lichtenstein, Fischhoff, and Phillips (1982)). The result that people form probability distributions over uncertain quantitiesthataretootightseemstoberobustespeciallywhenpeoplejudgedifficultitems (see Klayman, Soll, Gonz´ales-Vallejo, and Barlas (1999) or Soll and Klayman (2004)). 3.1.2 Volatility estimates There are several questionnaire studies that elicit the volatility estimate of investors by asking for confidence intervals for the return or value of an index or the return or price of a stock in the future. These studies usually find that the intervals provided are too tight. Thus,historicalvolatilitiesareunderestimated(see,forexample,Glaser,N¨oth,andWeber (2004) and Hilton (2001)). The finding that confidence intervals for uncertain quantities are too tight is usually called “miscalibration” or “overconfidence” (see the subsection above). One example is the study of Graham and Harvey (2003). On a quarterly basis, Chief Financial Officers (CFOs) of U.S. corporations are asked to provide their estimates of the market risk premium. They find that historical volatilities are underestimated. De Bondt (1998) presents results from a study of 46 individual investors. One important 8",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 51,
    "chunk_index": 12,
    "word_count": 290,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "study of Graham and Harvey (2003). On a quarterly basis, Chief Financial Officers (CFOs) of U.S. corporations are asked to provide their estimates of the market risk premium. They find that historical volatilities are underestimated. De Bondt (1998) presents results from a study of 46 individual investors. One important 8",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 51,
    "chunk_index": 13,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "finding is that the confidence intervals are too narrow compared to the actual variability of prices. Similar results are obtained by Glaser, Langer, and Weber (2005) for students and professional stock traders. 3.1.3 Better than average effect People think that they are above average. Taylor and Brown (1988) document in their surveythatpeoplehaveunrealisticallypositiveviewsoftheself.Oneimportantmanifesta- tion is that people judge themselves as better than others with regard to skills or positive personality attributes. One of the most cited examples states that 82 % of a group of students rank themselves among the 30 percent of drivers with the highest driving safety (Svenson (1981)). 3.2 Overconfidence in Finance Models AlthoughmotivatedbyallofitsmanifestationsdiscussedinSubsection3.1,overconfidence is exclusively modeled as overestimation of the precision of private information. Assume there is a risky asset with liquidation value v which is a realization of v˜ ∼ N(0,σ2). v˜ Investors receive private signals s˜ = v˜ + c · e˜ with e˜ ∼ N(0,σ2). It is assumed that v˜ e˜ and e˜ are independent such that s˜∼ N(0,σ2 +c2 ·σ2). If c = 1, investors are rational, if v˜ e˜ 0 ≤ c < 1, investors are overconfident. Conditional variance of v˜, given the realization s are (assuming that v˜ and e˜ are independent) (Cov[v˜,s˜])2 σ4 Var[v˜ | s˜= s] = Var(v˜)− = σ2 − v˜ (1) Var[s˜] v˜ σ2 +c2 ·σ2 v˜ e˜ Overconfident investors underestimate the variance of the risky asset or overestimate its precision. Stated equivalently, their confidence intervals for the value of the risky asset are too tight. In the extreme case (c = 0), an investor even believes that he knows the 9",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 51,
    "chunk_index": 14,
    "word_count": 265,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "v˜ σ2 +c2 ·σ2 v˜ e˜ Overconfident investors underestimate the variance of the risky asset or overestimate its precision. Stated equivalently, their confidence intervals for the value of the risky asset are too tight. In the extreme case (c = 0), an investor even believes that he knows the 9",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 51,
    "chunk_index": 15,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "value of the risky asset with certainty. Benos (1998), Caball´e and S´akovics (2003), Kyle and Wang (1997), Odean (1998b), and Wang (1998) incorporate this way of modeling overconfidence in different types of models such as those of Diamond and Verrecchia (1981), Hellwig (1980), Grossman and Stiglitz (1980), Kyle (1985), and Kyle (1989).13 All the above mentioned models predict that overconfidence leads to high trading volume. At the individual level, overconfident investors will trade more aggressively: The higher the degree of overconfidence of an investor, the higher her or his trading volume. Odean (1998b) calls this finding “the most robust effect of overconfidence”. 4 Data Sets, Design of the Study, and Overconfidence Measures 4.1 Data Sets This study is based on the combination of several data sets. The main data set consists of 563,104 buy and sell transactions of 3,079 individual investors from a German online broker in the period from January 1997 to April 2001. We considered all investors who trade via the internet, had opened their account prior to January 1997, had at least one transaction in 1997, and have an e-mail-address.14 The second data set consists of several demographic and other self-reported information (age, gender, income, investment strategy, investment experience), that was collected by the online broker at the time each 13There are other overconfidence models that address questions like the dynamics of overconfidence, the survival of overconfident investors in markets, and the cross-section of expected returns. Examples are Daniel, Hirshleifer, and Sub- rahmanyam(1998),Daniel,Hirshleifer,andSubrahmanyam(2001),HirshleiferandLuo(2001),GervaisandOdean(2001), andWang(2001). 14SeeGlaser(2003)andGlaser(2005)fordescriptivestatisticsandfurtherdetails.Notnecessarilyallordersareplaced onlinebutallinvestorstradedviatheinternetatleastonceinoursampleperiod.Weconsideralltradesbytheseinvestors, i.e.weincludethetradesthatwereplacedbytelephone,forexample. 10",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 51,
    "chunk_index": 16,
    "word_count": 251,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "experience), that was collected by the online broker at the time each 13There are other overconfidence models that address questions like the dynamics of overconfidence, the survival of overconfident investors in markets, and the cross-section of expected returns. Examples are Daniel, Hirshleifer, and Sub- rahmanyam(1998),Daniel,Hirshleifer,andSubrahmanyam(2001),HirshleiferandLuo(2001),GervaisandOdean(2001), andWang(2001). 14SeeGlaser(2003)andGlaser(2005)fordescriptivestatisticsandfurtherdetails.Notnecessarilyallordersareplaced onlinebutallinvestorstradedviatheinternetatleastonceinoursampleperiod.Weconsideralltradesbytheseinvestors, i.e.weincludethetradesthatwereplacedbytelephone,forexample. 10",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 51,
    "chunk_index": 17,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "investor opened her or his account.15 The third data set consists of the answers to an online questionnaire that was designed to elicit several measures of overconfidence (see Subsection 4.3). Data on the securities traded are obtained from Datastream, our fourth data source. 4.2 Design of the Study and Descriptive Statistics All 3,079 investors received an e-mail from the online broker on Thursday, August, 2nd, 2001 with a link to the online questionnaire. 129 investors answered around the following week-end. The remaining group of investors received a second e-mail on Thursday, the 20th of September, 2001. 86 investors answered around the following weekend. So, we have a response rate of 6.98 %, which is comparable to the response rates of similar questionnaires.16 In this study, we use the following measures of trading volume which are calculated by the trades of the investors: the number of stock market transactions, the number of stock market purchases, and the mean monthly stock portfolio turnover over the period from January1997toApril2001.Wefocusonstockmarkettransactionsasthemodelsdiscussed in Section 3.2 make predictions about the link between overconfidence measures and stock market trading volume. Stock portfolio turnover in a given month is calculated as follows. We only consider stocks that are covered in Datastream. We calculate the sum of the absolute values of purchases and sales per month for each investor and divide this sum by the respective end-of-month stock portfolio position. To calculate the monthly average turnover per investor we only consider investors who have at least five end-of-month stock portfolio positions. 15SeeGlaser(2005)fordescriptivestatistics.Notethatmeanturnovervaluesof33%permonthseemquitehigh.However, Shu,Chiu,Chen,andYeh(2004)andBauer,Cosemans,andEichholtz(2007)findturnovervaluesthataresimilartoours. 16See,forexample,GrahamandHarvey(2003). 11",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 51,
    "chunk_index": 18,
    "word_count": 255,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "sum of the absolute values of purchases and sales per month for each investor and divide this sum by the respective end-of-month stock portfolio position. To calculate the monthly average turnover per investor we only consider investors who have at least five end-of-month stock portfolio positions. 15SeeGlaser(2005)fordescriptivestatistics.Notethatmeanturnovervaluesof33%permonthseemquitehigh.However, Shu,Chiu,Chen,andYeh(2004)andBauer,Cosemans,andEichholtz(2007)findturnovervaluesthataresimilartoours. 16See,forexample,GrahamandHarvey(2003). 11",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 51,
    "chunk_index": 19,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "The motivation for the use of the number of stock market purchases as a separate measure of trading volume is as follows. Buy and sell transactions are driven by different factors.17 An investor who wants to buy a security has the choice between thousands of stocks whereas a sell decision only requires an analysis of the usually very few stocks in the investor’s own portfolio (assuming that investors do not sell short). Furthermore, when investors buy a security they have to consider the future performance of the stocks they want to buy whereas they consider future as well as past performance when they choose a security to sell. The relevance of past performance for the selling decision is the finding of some empirical and experimental studies on the disposition effect, the tendency to sell winners too early and ride losers too long.18 These studies suggest that there might be explanations for the sell decision, which are, for example, based on prospect theory (see Kahneman and Tversky (1979)). To summarize, overconfidence affects the expectations of future stock price performance. The fact that, when selling a security the effect of overconfidence is mixed with reference point dependent decision behavior of investors, justifies in our view a separate analysis of buy transactions. We conjecture that the effect of overconfidence is stronger when only buying transactions are considered. Table 1 compares descriptive statistics of several variables for the 2,864 investors who did not answer and the 215 investors who answered (at least one question of) the question- naire. Table 1 shows that means and medians of all variables are similar in both groups. For example, the median age of investors in the two groups are 39 and 38, respectively. Furthermore, in both groups, about 95 % of investors are male (not shown in Table 1). Non-parametric tests show that none of the differences in both groups is significant (see 17See,forexample,Odean(1999),p.1294. 18SeeShefrinandStatman(1985),Odean(1998a),andWeberandCamerer(1998)forempiricalandexperimentalevidence onthedispositioneffect. 12",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 51,
    "chunk_index": 20,
    "word_count": 319,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "For example, the median age of investors in the two groups are 39 and 38, respectively. Furthermore, in both groups, about 95 % of investors are male (not shown in Table 1). Non-parametric tests show that none of the differences in both groups is significant (see 17See,forexample,Odean(1999),p.1294. 18SeeShefrinandStatman(1985),Odean(1998a),andWeberandCamerer(1998)forempiricalandexperimentalevidence onthedispositioneffect. 12 last column of Table 1).19 Thus, there is no indication of a sample selection bias.20 4.3 Measures of Overconfidence We consider the following forms of overconfidence: miscalibration in knowledge questions, overconfidence in volatility estimates, and the better than average effect.21 In this sub- section, we will present the questions designed to measure overconfidence as well as the overconfidence measures obtained from the answers to these questions. 4.3.1 Miscalibration (misc) The investors were asked to state upper and lower bounds of 90 % confidence intervals to fivequestionsconcerninggeneraleconomicsandfinanceknowledge.Thiswayofmeasuring the degree of miscalibration is widely used.22 137 of 215 Investors answered at least one question. 114 investors answered all questions.23 If the correct answer lies outside the 90 % confidence interval given by the investor we call this a surprise. For the questions which were actually answered by the respondents we calculate the percentage of surprises. Note, again, that the percentage of surprises of well calibrated investors should be 10 %. Table 2 presents the mean, minimum, maximum, and several percentiles of the percentage 19SeeGlaser(2005)forfurtherdescriptivestatistics. 20There are also no significant differences between investors who did not answer the questionnaire and those investors whoansweredallquestions.Furthermore,therearenosignificantdifferencesbetweeninvestorswhoansweredatleastone questionandinvestorswhoansweredallquestions. 21Wealsoelicitedillusionofcontrolscores.Thesescoresareneithercorrelatedwiththeoverconfidencescorespresented in this paper nor with our trading volume measures. See the CEPR version of this paper for details (Glaser and Weber (2003)). 22SeeSubsection3.1.1and,forexample,Cesarini,Sandewall,andJohannesson(2006),Klayman,Soll,Gonz´ales-Vallejo, andBarlas(1999),Biais,Hilton,Mazurier,andPouget(2005),SollandKlayman(2004). 237 investors answered 1 question, 3 investors answered 2 questions, 4 investors answered 3 questions, and 9 investors answered4questions. 13",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 51,
    "chunk_index": 21,
    "word_count": 286,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "and those investors whoansweredallquestions.Furthermore,therearenosignificantdifferencesbetweeninvestorswhoansweredatleastone questionandinvestorswhoansweredallquestions. 21Wealsoelicitedillusionofcontrolscores.Thesescoresareneithercorrelatedwiththeoverconfidencescorespresented in this paper nor with our trading volume measures. See the CEPR version of this paper for details (Glaser and Weber (2003)). 22SeeSubsection3.1.1and,forexample,Cesarini,Sandewall,andJohannesson(2006),Klayman,Soll,Gonz´ales-Vallejo, andBarlas(1999),Biais,Hilton,Mazurier,andPouget(2005),SollandKlayman(2004). 237 investors answered 1 question, 3 investors answered 2 questions, 4 investors answered 3 questions, and 9 investors answered4questions. 13",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 51,
    "chunk_index": 22,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "ofsurprisesinknowledgequestions(i.e.thenumberofcorrectanswersthatfalloutsidethe 90 % confidence interval for knowledge questions stated by investors in % of the number of questions answered by these investors). The mean percentage of surprises is 75 %. The median is even higher (80 %). A median of 0.8 shows that, for the median investor, 4 out of 5 correct answers fall outside the 90 % confidence interval given by this investor. These figures are much higher than 10 %, the expected proportion of answers outside a well calibrated 90 % confidence interval. These findings are in line with prior research. Russo and Schoemaker (1992), for example, find percentage of surprises in the range from 42 % to 64 %. Other studies find percentages of surprises that are even closer to ours.24 4.3.2 Stock Market Forecasts (volest) The investors were asked to provide median as well as upper and lower bounds of 90 % confidence intervals to five questions concerning stock market forecasts (Deutscher Aktienindex DAX, Nemax50 Performance Index, three German Stocks) for the end of the year 2001 (see Figure 1).25 The use of confidence interval questions is widely used to elicit subjects’ probability distributions, perceptions of expected returns, and variance estimations of stock returns.26 190of215Investorsansweredatleastonequestion.165investorsansweredallquestions.27 We calculate the volatility forecasts of investors implied by their subjective confidence intervals as follows (see also Glaser and Weber (2005a), Klos, Weber, and Weber (2005) 24See,forexample,Hilton(2001),p.42,andthereferencestherein. 25Therespondentstothefirstquestionnairehadaforecasthorizonof21weeks,respondentstothesecondquestionnaire hada14weekhorizon.Wealsoaskedforthemedianestimate.SeeGlaserandWeber(2005a)fordetails. 26See Subsection 3.1.2, for example, Deaves, Lu¨ders, and Schro¨der (2004), Graham and Harvey (2003), Graham and Harvey(2005),Klos,Weber,andWeber(2005)andSiebenmorgenandWeber(2004)foradiscussion. 274 investors answered 1 question, 6 investors answered 2 questions, 5 investors answered 3 questions, and 10 investors answered4questions. 14",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 51,
    "chunk_index": 23,
    "word_count": 265,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "also Glaser and Weber (2005a), Klos, Weber, and Weber (2005) 24See,forexample,Hilton(2001),p.42,andthereferencestherein. 25Therespondentstothefirstquestionnairehadaforecasthorizonof21weeks,respondentstothesecondquestionnaire hada14weekhorizon.Wealsoaskedforthemedianestimate.SeeGlaserandWeber(2005a)fordetails. 26See Subsection 3.1.2, for example, Deaves, Lu¨ders, and Schro¨der (2004), Graham and Harvey (2003), Graham and Harvey(2005),Klos,Weber,andWeber(2005)andSiebenmorgenandWeber(2004)foradiscussion. 274 investors answered 1 question, 6 investors answered 2 questions, 5 investors answered 3 questions, and 10 investors answered4questions. 14 or Graham and Harvey (2003) and Graham and Harvey (2005)). We first transform these price or index value forecasts of individual k into returns28: x(p) ik r(p) = −1, p ∈ {0.05,0.50,0.95}, i ∈ {1,2,3,4,5}, j ∈ {1,2}, k ∈ {1,...,215}. ik value itj (2) t indicates August 2nd, t September 20th.29 x(p) denotes the p fractile of the stock 1 2 price or index value forecast (see Figure 1), r(p) denotes the p fractile of the respective return forecast with p ∈ {0.05,0.50,0.95}. The five time series are denoted by i, i ∈ {1,2,3,4,5}. The return volatility estimate of individual k, k ∈ {1,...,215}, for time series i, i ∈ {1,2,3,4,5}, is calculated as follows (see Keefer and Bodily (1983)):30 (cid:113) stddev = 0.185·(r(0.05) )2 +0.63·(r(0.50) )2 +0.185·(r(0.95) )2 −(mean )2, ik ik ik ik ik (3) with mean as given by ik mean = 0.185·r(0.05) +0.63·r(0.50) +0.185·r(0.95) . (4) ik ik ik ik Keefer and Bodily (1983) show numerically that equation (3) serves as a good three-point approximation of the standard deviation of a continuous random variable. 28Some studies ask directly for returns, others ask for prices, see Glaser, Langer, Reynders, and Weber (2007). They provideanextensivesurveyoftheliteratureonstockmarketforecastsoffinancialmarketsparticipantsandshowthatthe elicitationmode(pricesorreturns)drivestheresultsonwhetherinvestorsexpectmeanreversionortrendcontinuationin stockprices.However,studiesusuallydocumentoverconfidence,i.e.tootightintervals,irrespectiveoftheelicitationmode. 29Theexacttimeofresponseisnotavailable.Furthermore,wedonotknowwhetherinvestorsansweredThursdaynight, or on Friday, Saturday, or Sunday. Thus, we use the Thursday closing price in both groups to calculate expected returns. WhenweusetheaverageoftheThursdayclosingpriceandtheFridayclosingprice,theresultsaresimilar. 30Forfurtherdetails,seeGlaserandWeber(2005a). 15",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 51,
    "chunk_index": 24,
    "word_count": 274,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "of a continuous random variable. 28Some studies ask directly for returns, others ask for prices, see Glaser, Langer, Reynders, and Weber (2007). They provideanextensivesurveyoftheliteratureonstockmarketforecastsoffinancialmarketsparticipantsandshowthatthe elicitationmode(pricesorreturns)drivestheresultsonwhetherinvestorsexpectmeanreversionortrendcontinuationin stockprices.However,studiesusuallydocumentoverconfidence,i.e.tootightintervals,irrespectiveoftheelicitationmode. 29Theexacttimeofresponseisnotavailable.Furthermore,wedonotknowwhetherinvestorsansweredThursdaynight, or on Friday, Saturday, or Sunday. Thus, we use the Thursday closing price in both groups to calculate expected returns. WhenweusetheaverageoftheThursdayclosingpriceandtheFridayclosingprice,theresultsaresimilar. 30Forfurtherdetails,seeGlaserandWeber(2005a). 15",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 51,
    "chunk_index": 25,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "Glaser and Weber (2005a) show that investors in the first group underestimate the volatil- ityofstockreturns(asmeasuredbythestandarddeviationofhistoricalreturns).However, aftertheterrorattacksofSeptember11,volatilityforecastsarehigherthanbeforeSeptem- ber 11. In two out of five cases, historical volatilities are overestimated. Table 3 presents median volatility forecasts of the two groups of respondents for the German stock mar- ket index DAX and the BASF stock as examples. In addition, the table shows historical volatilities of (non-overlapping) 21 week returns (column 3) and 14 week returns (column 4), respectively. For the DAX, the table reports the implied volatility of the respective response date as well. These implied volatilities were calculated using the VDAX. The VDAX expresses the fluctuation range or implied volatility of the DAX index, as expected by the forward market. Column 5 contains p-values of a two-sided Mann-Whitney test (Wilcoxon ranksum test). Null hypothesis is that the two populations are from the same distribution (volatility forecasts are equal in both groups). Table 3 shows that before September 11, 2001, objective volatility benchmarks were clearly underestimated. How- ever, after the terror attacks, the picture is less clear. For the DAX, for example, the median volatility forecast is higher than the historical standard deviation but lower than the implied volatility closely after September 11, 2001. The terror attacks of September 11 make it impossible to include the degree of the un- derestimation of the variance of stock returns directly in our analysis. However, this is no problem as we do not need the absolute amount of overconfidence, but only a ranking of people. Studies show that the amount of misclibration of people varies from task to task. However, the ranking of people is similar especially when all miscalibration measures are based on the tightness of intervals stated by subjects (see, for example, Glaser, Langer, and Weber (2005) and the papers cited therein). Thus, it is likely that investors in the second group would have - without the terror attacks shortly before the date of response - stated values comparable to the first group and that the ranking of people would have been similar to the ranking of their actual responses in our data set. 16",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 51,
    "chunk_index": 26,
    "word_count": 351,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "likely that investors in the second group would have - without the terror attacks shortly before the date of response - stated values comparable to the first group and that the ranking of people would have been similar to the ranking of their actual responses in our data set. 16",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 51,
    "chunk_index": 27,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "Therefore, we proceed as follows. We calculate the standardized deviation from the mean volatility estimate per investor in each of the two groups to rank investors according to their volatility estimates. For each investor group and for each time series we calculate the mean and the standard deviation of the volatility forecasts. For each investor we then calculate the standardized deviation from the mean volatility estimate by subtracting the mean volatility estimate from an investor’s volatility estimate and by dividing this difference by the standard deviation of the volatility forecast. For each investor, we then calculate the average across these measures. The overconfidence measure volest based on the width confidence intervals for future stock price or index value is 1 minus this standardized standard deviation.31 4.3.3 Better than Average Effect (bta1 and bta2) We measure the degree of the better than average effect using the following two questions concerning skills and performance relative to others. Investors were asked to answer the following two questions: 1) What percentage of customers of your discount brokerage house have better skills (e.g. in the way they interpret information; general knowledge) than you at identi- fying stocks with above average performance in the future? (Please give a number between 0 % and 100 %) 2) What percentage of customers of your discount brokerage house had higher returns than you in the four-year period from January 1997 to December 2000? (Please give a number between 0 % and 100 %) 31We note that all the results presented in this paper are also robust for the subgroup of investors who answered the questionnairebeforetheterrorattacksofSeptember11. 17",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 51,
    "chunk_index": 28,
    "word_count": 267,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "brokerage house had higher returns than you in the four-year period from January 1997 to December 2000? (Please give a number between 0 % and 100 %) 31We note that all the results presented in this paper are also robust for the subgroup of investors who answered the questionnairebeforetheterrorattacksofSeptember11. 17",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 51,
    "chunk_index": 29,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "We find that about half of the investors assess their skills and their abilities as above average (see Table 4). The median investor assesses her or his investment skills and her or his past performance as average.32 For both questions, we calculate better than average answer scores of investor i (bta1 and bta2 ) as 50− i. These ratios yield 0 if respondents i i 50 think they are average, 1 if they think they are better than everybody else, and -1 if they think to be worse than everybody else. Table 4 presents the results. The mean better than average scores are positive (0.12 and 0.06 for bta1 and bta2, respectively). This result indicates a slight better than average effect. High standard deviations are signs of large individual differences.33 4.3.4 Correlation of Overconfidence Measures The two miscalibration scores based on subjective confidence intervals, misc and volest, are significantly positively correlated (p = 0.0001). The Spearman rank correlation co- efficient is 0.3377, as Table 5 shows. Although knowledge questions and stock market prediction questions are completely different tasks, we find stable individual differences in the degree of miscalibration. This finding is in line with several psychological studies (see, for example, Alba and Hutchinson (2000), Klayman, Soll, Gonz´ales-Vallejo, and Barlas (1999), Pallier, Wilkinson, Danthiir, Kleitman, Knezevic, Stankov, and Roberts (2002), Soll (1996), Soll and Klayman (2004), and Stanovich and West (1998)). Usually, individ- ual differences are especially strong when subjects are asked to state subjective confidence intervals (see, for example, Klayman, Soll, Gonz´ales-Vallejo, and Barlas (1999), p. 240). 32Glaser and Weber (2005b) find that correlation between the assessment of past portfolio performance compared to others(viapercentiles)andtheactualpercentileisinsignificant.Furthermore,investorsinthedatasetusedinthisstudy overestimatetheirrelativepositionintermsofreturnpercentiles. 33Furthermore,welatershowthathighpastportfolioreturnsarenotrelatedtotheself-assessmentofinvestors.Inother words,investorswhothinkthattheyareaboveaverageintermsofinvestmentskillsorpastperformancedidnothaveabove averageperformanceinthepast. 18",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 51,
    "chunk_index": 30,
    "word_count": 279,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "(1998)). Usually, individ- ual differences are especially strong when subjects are asked to state subjective confidence intervals (see, for example, Klayman, Soll, Gonz´ales-Vallejo, and Barlas (1999), p. 240). 32Glaser and Weber (2005b) find that correlation between the assessment of past portfolio performance compared to others(viapercentiles)andtheactualpercentileisinsignificant.Furthermore,investorsinthedatasetusedinthisstudy overestimatetheirrelativepositionintermsofreturnpercentiles. 33Furthermore,welatershowthathighpastportfolioreturnsarenotrelatedtotheself-assessmentofinvestors.Inother words,investorswhothinkthattheyareaboveaverageintermsofinvestmentskillsorpastperformancedidnothaveabove averageperformanceinthepast. 18",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 51,
    "chunk_index": 31,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "Furthermore, Biais, Hilton, Mazurier, and Pouget (2005) use ten confidence interval ques- tions to rank people and show the psychometric validity of their miscalibration measure using the Cronbach alpha. Glaser, Langer, and Weber (2005) show that even five confi- dence interval questions are enough to reliably rank subjects with regard to their degree of miscalibration. The two better than average scores, bta1 and bta2, have a correlation coefficient of 0.6461 (p < 0.0001, see Table 5). Investors who rank themselves as above average with regard to investment skills also assess their past portfolio performance as above average when compared to other investors. The other correlations between overconfidence scores are insignificant. The lack of cor- relation between our overconfidence measures is consistent with findings of other recent studies that are similar to this part of our study. Deaves, Lu¨ders, and Luo (2003) measure miscalibration and the better than average effect using our questions or a slightly changed version of our questions. Their correlation matrix also shows no significant positive corre- lations. Oberlechner and Osler (2003) find a negative (but statistically and economically insignificant)correlationbetweenmiscalibrationandthebetterthanaverageeffectusinga questionnaire similar to ours. R´egner, Hilton, Cabantous, and Vautier (2004) find little or now correlation between miscalibration, positive illusions such as unrealistic optimism, a general tendency to consider oneself as better than average, and illusion of control. Glaser, Langer, and Weber (2005) also find that miscalibration and the better than average effect are unrelated.34 Our results and the results in the literature can be summarized as follows: • There are stable individual differences in reasoning or decision making competence (see Parker and Fischhoff (2005), Schunk and Betsch (2006), Stanovich and West (1998), and Stanovich and West (2000)). 34Larrick,Burson,andSoll(2007)find,however,thatmiscalibrationandthebetterthanaverageeffectcanbepositively correlatedwhentheyarebothelicitedforthesametaskorinthesamedomain. 19",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 51,
    "chunk_index": 32,
    "word_count": 282,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "average effect are unrelated.34 Our results and the results in the literature can be summarized as follows: • There are stable individual differences in reasoning or decision making competence (see Parker and Fischhoff (2005), Schunk and Betsch (2006), Stanovich and West (1998), and Stanovich and West (2000)). 34Larrick,Burson,andSoll(2007)find,however,thatmiscalibrationandthebetterthanaverageeffectcanbepositively correlatedwhentheyarebothelicitedforthesametaskorinthesamedomain. 19 • There are stable individual differences in the degree of overconfidence within tasks (see Glaser, Langer, and Weber (2005), Jonsson and Allwood (2003), Klayman, Soll, Gonz´ales-Vallejo,andBarlas(1999),R´egner,Hilton,Cabantous,andVautier(2004)). This is consistent with the common modeling assumption in finance that investors with different degrees of overconfidence can be regarded as different investor “types” (see, for example, Benos (1998)). • People often show different levels of overconfidence depending on the task or domain but the same rank-order over tasks or domains (see Jonsson and Allwood (2003), p. 561, and Glaser, Langer, and Weber (2005)). Note, that to test the hypothesis that, the higher overconfidence the higher trading volume, not the amount or level of overconfidence but the ranking of investors is important. • There is evidence that overconfidence and the rank order across people is stable over time (see Jonsson and Allwood (2003) or Glaser, Langer, and Weber (2005)). • Overconfidence scores based on confidence interval tasks and better than average scores are hardly correlated (see Deaves, Lu¨ders, and Luo (2003), Glaser, Langer, and Weber (2005), Oberlechner and Osler (2003), or R´egner, Hilton, Cabantous, and Vautier (2004)). 5 Overconfidence and Trading Volume: Empirical Results 5.1 Cross-Sectional Regressions This subsection presents cross-sectional regression results on the relation between the measures of trading volume (logarithm of the number of stock market transactions, log- arithm of the number of stock market purchases, logarithm of mean monthly turnover) 20",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 51,
    "chunk_index": 33,
    "word_count": 281,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "Vautier (2004)). 5 Overconfidence and Trading Volume: Empirical Results 5.1 Cross-Sectional Regressions This subsection presents cross-sectional regression results on the relation between the measures of trading volume (logarithm of the number of stock market transactions, log- arithm of the number of stock market purchases, logarithm of mean monthly turnover) 20 and the overconfidence measures described in Subsection 4.3 (see Tables 7 and 8).35 Table 7 presents regression results on the relation between our trading volume measures and several explanatory variables that are known to affect financial decision making (a gender dummy variable, age, investment experience, a warrant trader dummy variable, a highriskinvestmentstrategydummy,thelogarithmofmeanmonthlystockportfoliovalue, and information in hours per week).36 The information variable is included to control for the level of commitment or involvement. The intuition behind this is the finding of some studies that overconfidence increases with the level of active involvement in a task.37 We regard the information variable as a proxy for the level of involvement in the task of investing or trading. In each regression, we include one overconfidence variable (Overconfidence).38. The only significant overconfidence variable is bta (see Regressions (3), (6), and (9) in Table 7). As hypothesized,thiseffectisstrongerforstockmarketpurchaseswhencomparedtoallstock market transactions (higher coefficient and higher t-value in Regression (6) compared to Regression (3)). However, miscalibrated investors do not exhibit a higher trading volume (see Regressions (1), (2), (4), (5), (7) and (8) in Table 7). The variables misc and volest are not significant. Other variables that significantly affect the number of stock market transactions and 35We use the natural logarithm of the stock portfolio value, and the trading volume measures as these variables are positivelyskewed.Testsshow,thatwethusavoidproblemslikenon-normality,non-linearity,andheteroscedasticityinthe cross-sectionalregressionanalysis.SeeSpanos(1986),chapter21,especially,pp.455-456,DavidsonandMacKinnon(1993), chapter14,andAtkinson(1985),pp.80-81. 36See,e.g.,BarberandOdean(2001),DornandHuberman(2002),Glaser(2005),GlaserandWeber(2004),orGrinblatt andKeloharju(2001). 37See,forexample,PressonandBenassi(1996),p.496. 38Note,thatweassumethatoverconfidenceisastableindividualtraitandthusconstantovertime.Thisassumptionis consistentwithstaticoverconfidencemodelspresentedSubsection3.2.Experimentalstudiesindeedshowstabilityovertime fortheconceptofmiscalibration(see,forexample,JonssonandAllwood(2003)orGlaser,Langer,andWeber(2005)). 21",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 51,
    "chunk_index": 34,
    "word_count": 276,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "7). The variables misc and volest are not significant. Other variables that significantly affect the number of stock market transactions and 35We use the natural logarithm of the stock portfolio value, and the trading volume measures as these variables are positivelyskewed.Testsshow,thatwethusavoidproblemslikenon-normality,non-linearity,andheteroscedasticityinthe cross-sectionalregressionanalysis.SeeSpanos(1986),chapter21,especially,pp.455-456,DavidsonandMacKinnon(1993), chapter14,andAtkinson(1985),pp.80-81. 36See,e.g.,BarberandOdean(2001),DornandHuberman(2002),Glaser(2005),GlaserandWeber(2004),orGrinblatt andKeloharju(2001). 37See,forexample,PressonandBenassi(1996),p.496. 38Note,thatweassumethatoverconfidenceisastableindividualtraitandthusconstantovertime.Thisassumptionis consistentwithstaticoverconfidencemodelspresentedSubsection3.2.Experimentalstudiesindeedshowstabilityovertime fortheconceptofmiscalibration(see,forexample,JonssonandAllwood(2003)orGlaser,Langer,andWeber(2005)). 21",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 51,
    "chunk_index": 35,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "stock market purchases are the warrant trader dummy variable (positive sign) and the mean monthly stock portfolio value (positive sign). Investors who trade warrants do trade more stocks and the higher the value of the stock portfolio the higher the number of transactions.39 The warrant trader dummy variable might be interpreted as a measure of investor sophistication. Bank-issued warrants are comparable to options but with some institutional differences. For example, warrants are always issued by financial institutions (see Schmitz, Glaser, and Weber (2005) and Glaser and Schmitz (2007) for details). Per- haps surprising, gender is not significantly related to our trading volume measures. This contradicts the findings of Barber and Odean (2001) who find that men trade more than women. However, our results are consistent with other studies analyzing the behavior of investors such as Dorn and Huberman (2002), Glaser (2005), Glaser and Weber (2004), and Grinblatt and Keloharju (2001). These studies show that the sign and the signif- icance of the gender variable depends on the specification of the regression. The main determinants of turnover are the warrant trader dummy (positive sign) and the mean monthly stock portfolio value (negative sign). The result that the sign of portfolio size is either positive (with the number of transactions as dependent variable) or negative (with turnover as dependent variable) in the different regressions is intuitive. Given that there are fixed transaction costs per transaction it makes sense that investors with a higher portfolio value place more orders. In contrast, portfolio value and turnover are negatively correlated as turnover is trading volume relative to portfolio size. Furthermore, our find- ings are consistent with other papers. Dorn and Huberman (2005) also analyze a sample of online broker investors and find that wealthier investors place more trades but churn over their portfolio less frequently, other things equal. Vissing-Jorgensen (2003) analyzes the 1998 and the 2001 Survey of Consumer Finances and finds that wealthier investors make much more trades than less wealthy investors. InTable8, were-run theregressions shownin Table7,but wenowexcludeinvestorsin the 39SeeGlaser(2005)forfurtherresultsonthegeneraldeterminantsoftradingvolumeinthewholedataset. 22",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 51,
    "chunk_index": 36,
    "word_count": 337,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "that wealthier investors place more trades but churn over their portfolio less frequently, other things equal. Vissing-Jorgensen (2003) analyzes the 1998 and the 2001 Survey of Consumer Finances and finds that wealthier investors make much more trades than less wealthy investors. InTable8, were-run theregressions shownin Table7,but wenowexcludeinvestorsin the 39SeeGlaser(2005)forfurtherresultsonthegeneraldeterminantsoftradingvolumeinthewholedataset. 22",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 51,
    "chunk_index": 37,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "highest turnover quintile. This is motivated by the following finding. Glaser (2005) shows that the stock portfolio value in the highest turnover quintile is very low. The median value is about 10,000 Euro. The fact that the median of the average stock portfolio value across months is very low in the highest turnover quintile (median of monthly turnover is 166 %) is important. Thus, we cannot dismiss the argument that these accounts are entertainment accounts that are characterized by low portfolio values and high turnover ratios so that the potential effect of overconfidence is swamped.40 Table 8 shows that all the results are similar, when we exclude investors in the highest turnover quintile. The bta variable is highly significantly positively related to all trading volume measures (in Regression (6) at the 1 % level). Note, that in Regression (8), the miscalibration variable volest is also significant with the expected sign. As this is the only regression with a significantly positive effect of volest, we cannot regard its influence on trading volume as robust. 5.2 Robustness Checks All the results presented in the previous subsection are robust as unreported regression results show. The better than average scores remain significant for different sets of ex- planatory variables. The results hold for different turnover definitions and are always stronger when only buy transactions are considered. Furthermore, most of the overconfi- dence measures are not significantly correlated with other explanatory variables. Only the better than average scores are significantly positively related to the information variable. In addition, the overconfidence measures are not significantly different for men/women, warrant-trader/non-warrant-trader, and investors that describe their investment strategy 40Glaser(2005)presentsfurthercharacteristicsofinvestorsinthehighestturnoverquintilewhichstrengthenthisconjec- ture.Forexample,about70%ofinvestorsinthehighestturnoverquintileactivelytradewarrantsandonly1.39%ofthese investorsusetheiraccountforretirementsavings.SeeAnderson(2006),DornandSengmueller(2006),andKumar(2006) forindepthanalysesoftheroleofgamblingandentertainmentintrading. 23",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 51,
    "chunk_index": 38,
    "word_count": 275,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "the overconfi- dence measures are not significantly correlated with other explanatory variables. Only the better than average scores are significantly positively related to the information variable. In addition, the overconfidence measures are not significantly different for men/women, warrant-trader/non-warrant-trader, and investors that describe their investment strategy 40Glaser(2005)presentsfurthercharacteristicsofinvestorsinthehighestturnoverquintilewhichstrengthenthisconjec- ture.Forexample,about70%ofinvestorsinthehighestturnoverquintileactivelytradewarrantsandonly1.39%ofthese investorsusetheiraccountforretirementsavings.SeeAnderson(2006),DornandSengmueller(2006),andKumar(2006) forindepthanalysesoftheroleofgamblingandentertainmentintrading. 23",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 51,
    "chunk_index": 39,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "as high-risk/not high-risk. Furthermore, past (portfolio or market) returns do not influ- ence our overconfidence measures. Thus, our overconfidence measures seem to capture investor characteristics that differ from other determinants of trading volume. Toanalyzetheeffectofpotentialsampleselectionbias,were-runtheregressionspresented in Table 7 using the Heckman procedure. The results are presented in Table 9. This table confirmsourpriorresults.Theonlysignificantoverconfidencevariableisbta(seeColumns (3), (6), and (9)). Furthermore, there is no indication of a sample selection bias as rho is only significant in one out of nine regressions (Regression (6)). This lack of a sample selection bias is not surprising given the results of Table 1. This table documents that there are no significant differences in the two investor groups. The results also hold for different turnover definitions. We also analyzed another measure of trading activity, the average volume per transaction. The models presented in Sub- section 3.2 also predict larger bets for overconfident investors. We find that the average volumepertransactionisalmostcompletelydrivenbythestockportfoliovalue:thehigher the stock portfolio value, the higher the average volume per transaction (see also Glaser (2005)). When we scale the average volume per transaction by the stock portfolio value, the only significant variable is, again, the stock portfolio value, but with a negative sign. Wealsointerpretedthenumberofstocktransactionsandthenumberofstockpurchasesas (overdispersed)countdata(see,forexample,Wooldridge(2002)andWinkelmann(2003)). Overdispersion means that the variance of the number of stock transactions is larger than the mean of the number of stock transactions. In our data set, the variance of the number of stock transactions is 32,533 whereas the mean of the number of stock transactions is 105 (see Glaser (2005)). When we use appropriate regression models (Poisson regression model, negative binomial regression model), the results and conclusions are similar to the results of the ordinary least squares regressions presented in this subsection. 24",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 51,
    "chunk_index": 40,
    "word_count": 277,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "transactions is 32,533 whereas the mean of the number of stock transactions is 105 (see Glaser (2005)). When we use appropriate regression models (Poisson regression model, negative binomial regression model), the results and conclusions are similar to the results of the ordinary least squares regressions presented in this subsection. 24",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 51,
    "chunk_index": 41,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "We used a logarithmic transformation of some regression variables (see footnote 35). An applied-econometricians’ rule-of-thumb to avoid problems like non-normality, non- linearity, and heteroscedasticity is to use the logarithmic transformation of positively skewed variables (see Spanos (1986)). The transformed variables are approximately nor- mally distributed. A more formal way to transform variables is to use the Box-Cox trans- formation.InregressionsusingtheBox-Coxtransformationofdependentandindependent variables, our basic results are even stronger. 5.3 Portfolio Performance and Overconfidence Up to this point in the paper we maintained the assumption that overconfidence is a stable individual trait and thus constant over time. This assumption is consistent with overconfidencemodelspresentedinSubsection3.2andexperimentalevidence(seeJonsson and Allwood (2003) and Glaser, Langer, and Weber (2005)). Note, that this assumption is necessary to argue that a high overconfidence score, measured at the end of the sample pe- riod, leads to high trading volume during the sample period, as overconfidence is constant through time and it does not matter when overconfidence is measured. However, there are other models assuming that overconfidence dynamically changes over time (see, e.g., Ger- vais and Odean (2001)). This modeling assumption is usually motivated by psychological studies that find biased self-attribution (see Wolosin, Sherman, and Till (1973), Langer and Roth (1975), Miller and Ross (1975), Schneider, Hastorf, and Ellsworth (1979)): Peo- ple overestimate the degree to which they are responsible for their own success. In these overconfidence models, the degree of overconfidence is a function of past investment suc- cess, i.e. the higher the performance in the past the higher the degree of overconfidence at the end of the period (learning-to-be-overconfident hypothesis; Gervais and Odean (2001)).41 There is another story that involves a time-varying degree of overconfidence. 41SeeGlaser,N¨oth,andWeber(2004)forafurtherdiscussionofthesemodels. 25",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 51,
    "chunk_index": 42,
    "word_count": 275,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "degree of overconfidence is a function of past investment suc- cess, i.e. the higher the performance in the past the higher the degree of overconfidence at the end of the period (learning-to-be-overconfident hypothesis; Gervais and Odean (2001)).41 There is another story that involves a time-varying degree of overconfidence. 41SeeGlaser,N¨oth,andWeber(2004)forafurtherdiscussionofthesemodels. 25",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 51,
    "chunk_index": 43,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "Assume that (some) investors are overconfident at the start of the sample period. As a consequence, they trade more. If high trading volume is associated with low returns, the most overconfident investors at the beginning of the sample period might end up with the lowest overconfidence measures at the end of the period as a consequence of high trading volume (and low returns) during the sample period. To empirically test these two stories, we correlate overconfidence scores with the perfor- mance of the investors in the past.42 Moreover, we are able to analyze whether investors who assess their investment skills or performance as above average compared to others really had above average performance in the past. Furthermore, we analyze the relation between portfolio performance and portfolio turnover. We calculate the monthly gross portfolio performance of each investor making the follow- ing simplifying assumptions: - We assume that all stocks are bought and sold at the end of the month. - We ignore intra-month trading. Barber and Odean (2000) show that these simplifying assumptions do not bias the mea- surement of portfolio performance. The gross portfolio return Rgr of investor h in month t is calculated as follows: ht (cid:88)Sht P n Rgr = w R with w = it iht (5) ht iht it iht S(cid:80)ht i=1 P n it iht i=1 R is the return of stock i in month t, S is the number of stocks held by individual h it ht in month t, P is the price of stock i at the beginning of month t, and n is the number it iht 42Anotherpossibilitytotestthelearning-to-be-overconfidenthypothesisistoanalyzethelinkbetweenpastreturnsand tradingvolume.SeeGlaserandWeber(2004)andStatman,Thorley,andVorkink(2006). 26",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 51,
    "chunk_index": 44,
    "word_count": 270,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "iht i=1 R is the return of stock i in month t, S is the number of stocks held by individual h it ht in month t, P is the price of stock i at the beginning of month t, and n is the number it iht 42Anotherpossibilitytotestthelearning-to-be-overconfidenthypothesisistoanalyzethelinkbetweenpastreturnsand tradingvolume.SeeGlaserandWeber(2004)andStatman,Thorley,andVorkink(2006). 26",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 51,
    "chunk_index": 45,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "of stocks of company i held by investor h in month t. w is the beginning-of-month-t iht market value of the holding of stock i of investor h divided by the beginning-of-month-t market value of the whole stock portfolio of investor h. The cross-sectional distribution of the monthly gross returns is similar to the results in Barber and Odean (2000), Table IV, p. 791. We observe a large cross-sectional variation in the performance across investors. When we exclude investors with stock positions in 12 or fewer months, we find gross returns between −16% and +24% per month. On average,investorsunderperformrelevantbenchmarks.Forexample,thearithmeticaverage monthly return of the German blue chip index DAX from January 1997 to March 2001 is 2.02% whereas the mean gross monthly return of investors in our data set is 0.54%. We find that investors who trade more do not have higher monthly gross returns. We cannot reject the hypothesis that monthly gross returns are equal in turnover quintiles using a non-parametric Kruskal-Wallis test.43 Furthermore, we do not find significant correlations between the monthly gross return in our 51 month period and our overconfidence measures.44 High returns in the past do not lead to high overconfidence measures in our questionnaire at the end of the sample period. Thus, we do not find support for the learning-to-be-overconfident hypothesis, i.e. a high degree of overconfidence as a result of past investment success. Furthermore we do not find support for the second story presented at the beginning of this subsection as we do 43Note,thatBarberandOdean(2000)findexactlythesameresultforgrossreturns(BarberandOdean(2000),Figure 1,p.775).Theunderperformanceofinvestorswhotrademoreiscompletelydrivenbytransactioncosts. 44Wealsocheckedtherobustnessofthisresult.Pastreturnsoverthepast12,6,and3monthsarealsonotrelatedtoour overconfidencemeasures.Note,however,thatthereareaboutfourmonthsbetweentheendofourobservationperiodandthe datethequestionnairewasanswered.Furthermore,cross-sectionalregressionswithanoverconfidencemeasureasdependent variableandseveralsetsofexplanatoryvariables(pastrealizedreturnsovervarioushorizons;variablesmentionedinTable1) donotyieldaclearpictureorsignificantresults.Thiscomplementsthefindingsmentionedbeforethatouroverconfidence measures are not significantly correlated with other explanatory variables. We conclude that our overconfidence scores measuretraitsorinvestorcharacteristicsthatareorthogonaltopastreturnsorotherexplanatoryvariables. 27",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 51,
    "chunk_index": 46,
    "word_count": 273,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "a result of past investment success. Furthermore we do not find support for the second story presented at the beginning of this subsection as we do 43Note,thatBarberandOdean(2000)findexactlythesameresultforgrossreturns(BarberandOdean(2000),Figure 1,p.775).Theunderperformanceofinvestorswhotrademoreiscompletelydrivenbytransactioncosts. 44Wealsocheckedtherobustnessofthisresult.Pastreturnsoverthepast12,6,and3monthsarealsonotrelatedtoour overconfidencemeasures.Note,however,thatthereareaboutfourmonthsbetweentheendofourobservationperiodandthe datethequestionnairewasanswered.Furthermore,cross-sectionalregressionswithanoverconfidencemeasureasdependent variableandseveralsetsofexplanatoryvariables(pastrealizedreturnsovervarioushorizons;variablesmentionedinTable1) donotyieldaclearpictureorsignificantresults.Thiscomplementsthefindingsmentionedbeforethatouroverconfidence measures are not significantly correlated with other explanatory variables. We conclude that our overconfidence scores measuretraitsorinvestorcharacteristicsthatareorthogonaltopastreturnsorotherexplanatoryvariables. 27",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 51,
    "chunk_index": 47,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "not find a significant correlation between overconfidence and (gross) performance. 6 Discussion We show that overconfidence as measured by calibration questions is not sigificantly re- latedtotradingvolume.Thisresultisinconsistentwiththeorybutconsistentwithfindings of Biais, Hilton, Mazurier, and Pouget (2005). Note, again, that overconfidence models almost exclusively model overconfidence via miscalibrated investors. Why is miscalibra- tion not positively related to trading volume, as predicted by overconfidence models? One important point to remember is that the link between miscalibration and trading vol- ume has never been shown or even analyzed empirically or experimentally. Biais, Hilton, Mazurier, and Pouget (2005) and our study are the only exceptions that analyze this link. We find that investors who think that they are above average do trade more. Deaves, Lu¨ders, and Luo (2003) measure miscalibration and the better than average effect using questions similar to ours and correlate these overconfidence scores with trading activity in an experimental asset market. They also find that people who think that they are above average trade more.45 Oberlechner and Osler (2003), p. 27, also argue and find that the better than average effect, not miscalibration, explains excess trading volume using survey data from U.S. currency market professionals. Our results are also consistent with Graham, Harvey, and Huang (2005). They find that investors who feel competent trade more often. Our better than average questions can also be interpreted as perceived competence. Our findings are also related to Hales (2005). He shows experimentally that 45Furthermore,Deaves,Lu¨ders,andLuo(2003)findthatthedegreeofmiscalibrationisrelatedtotradingactivitywhich is consistent with overconfidence models. However, experimental subjects were told that those who had exhibited higher generalknowledgeinthequestionnairewouldreceivemoreaccurateprivatenoisysignalsintheexperimentalassetmarket. Deaves, Lu¨ders, and Luo (2003) even admit that “overconfident people will tend to think that their answers are more accurate, implying that their signals are more revealing and trade accordingly” (Deaves, Lu¨ders, and Luo (2003), p. 8). Thus,their“miscalibrationscore”justcapturesanotherfacetofthebetterthanaverageeffect. 28",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 51,
    "chunk_index": 48,
    "word_count": 293,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "experimental subjects were told that those who had exhibited higher generalknowledgeinthequestionnairewouldreceivemoreaccurateprivatenoisysignalsintheexperimentalassetmarket. Deaves, Lu¨ders, and Luo (2003) even admit that “overconfident people will tend to think that their answers are more accurate, implying that their signals are more revealing and trade accordingly” (Deaves, Lu¨ders, and Luo (2003), p. 8). Thus,their“miscalibrationscore”justcapturesanotherfacetofthebetterthanaverageeffect. 28",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 51,
    "chunk_index": 49,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "a willingness to engage in speculative trade in laboratory markets is largely driven by a failure of traders to account for information about value implicit in other trader’s actions. He argues that this behavior arises because traders construct myopic mental models that ignore the perspective of other traders. This can be explained by the fact that some investors think that they are better than others. The finding that investors who think that they are above average do trade more is in line with the differences of opinion literature. Although this strand of literature is usually not regarded as a part of the behavioral finance literature and although differences of opinion can be motivated rationally we propose a psychological motivation of the differences in opinions assumption. This conjecture is not completely new (see Shiller (1999), Barberis and Thaler (2003), Hong and Stein (2003), and Diether, Malloy, and Scherbina (2002)). In their model of trading in speculative markets based on differences of opinion among traders, Harris and Raviv (1993) state that, “we assume that each speculator is absolutely convinced that his or her model is correct. Indeed, each group believes the other group is basing its decision on an incorrect model (i.e. is irrational in this sense)”.46 Although Harris and Raviv (1993) stress that they “maintain the assumption of rational agents”, this assumption is in line with the finding that people think that they are above average in terms of investment skills. Shiller (1999), for example, argues that “if we connect the phenomenon of overconfidence with the phenomenon of anchoring, we see the origins of differences of opinion among investors, and some of the source of the high volume of trade among investors. ... Apparently, many investors do feel that they do have speculative reasons to trade often, and apparently this must have to do with some tendency for each individual to have beliefs that he or she perceives as better than others’ beliefs. It is as if most people think they are above average.”47 46HarrisandRaviv(1993),p.480. 47Shiller(1999),pp.1322-1323. 29",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 51,
    "chunk_index": 50,
    "word_count": 336,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "feel that they do have speculative reasons to trade often, and apparently this must have to do with some tendency for each individual to have beliefs that he or she perceives as better than others’ beliefs. It is as if most people think they are above average.”47 46HarrisandRaviv(1993),p.480. 47Shiller(1999),pp.1322-1323. 29",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 51,
    "chunk_index": 51,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "There are other studies which show empirically that differences in opinion creates trading volume (see also the survey by Hong and Stein (2007)). Bamber, Barron, and Stober (1999) and Antweiler and Frank (2004) are two examples. Bamber, Barron, and Stober (1999) measure differential interpretations using data on analysts’ revisions of forecasts of annual earnings after the announcement of quarterly earnings. They find that differential interpretations explain a significant amount of trading. Antweiler and Frank (2004) study the effect of more than 1.5 million messages posted on Yahoo! Finance and Raging Bull about the 45 companies in the Dow Jones Industrial Average and the Dow Jones Internet Index.TheyfindthatdisagreementamongthepostedInternetmessagesisassociatedwith increased trading volume. Glaser and Weber (2004) find that both past market returns as well as past portfolio returns affect trading activity of individual investors. However, the effect of market returns on subsequent trading volume is stronger. These findings show that an overconfidence story (or, to be more precise, the learning-to-be-overconfident hypothesis) is at best only one part of the story because as it is unclear why past market returns should affect trading volume. This is even more so as Glaser and Weber (2004), using survey data of this investor sample, show that individual investors in this investor sample are unable to give a correct estimate of their own past realized stock portfolio performance. One explanation of why past market returns should affect trading activity is that high past market returns might increase differences of opinion. In their survey of CFO stock return expectations, Graham and Harvey (2003) show that past market returns are related to differences of opinion. High past (absolute) returns lead to higher differences of opinion.48 Besides mentioning the strengths of our approach - the ability to directly test the hy- 48AlthoughGrahamandHarvey(2003)findthatbothlargenegativeandpositivereturnsaffectdifferencesofopinion,we arguethatnegativereturnsthatareassociatedwithdifferencesofopiniondonotleadtothesameleveloftradingactivity aspositivereturnsinconnectionwithdifferencesofopinion.Negativereturnsareassociatedwithpaperlossesandinvestors usuallyarereluctanttorealizethesepaperlosses.SeeShefrinandStatman(1985),Odean(1998a),andWeberandCamerer (1998). 30",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 51,
    "chunk_index": 52,
    "word_count": 297,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "CFO stock return expectations, Graham and Harvey (2003) show that past market returns are related to differences of opinion. High past (absolute) returns lead to higher differences of opinion.48 Besides mentioning the strengths of our approach - the ability to directly test the hy- 48AlthoughGrahamandHarvey(2003)findthatbothlargenegativeandpositivereturnsaffectdifferencesofopinion,we arguethatnegativereturnsthatareassociatedwithdifferencesofopiniondonotleadtothesameleveloftradingactivity aspositivereturnsinconnectionwithdifferencesofopinion.Negativereturnsareassociatedwithpaperlossesandinvestors usuallyarereluctanttorealizethesepaperlosses.SeeShefrinandStatman(1985),Odean(1998a),andWeberandCamerer (1998). 30",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 51,
    "chunk_index": 53,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "pothesis that a higher degree of overconfidence leads to higher trading volume - we want to discuss some possible weaknesses as well. We conducted the questionnaire part of our study via the internet. Internet experiments increase the variance of responses when com- pared to experiments in a controlled laboratory environment (Anderhub, Mu¨ller, and Schmidt (2001)). Thus, too much noise might be a possible reason why we are unable to prove a link between miscalibration scores and measures of trading volume. We note, however, that Biais, Hilton, Mazurier, and Pouget (2005) find results similar to ours in a controlled environment. Furthermore, if we find a significant effect despite the noise inherent in internet questionnaires, such as in the case of the better than average scores, we can be very confident about the presence of this link in reality. 7 Conclusion The contribution of this paper is to measure overconfidence of a group of online broker investors in various dimensions (miscalibration, volatility estimates, better than average effect) and to analyze whether these overconfidence measures are significantly related with trading volume of individual investors. One implication of our study is that one has to be careful when deriving theoretical assumptions from psychological experiments unrelated to financial tasks. It is important to specify what kind of overconfidence may be influencing trading behavior. Hirshleifer (2001), for example, argues that “it is often not obvious how to translate preexisting evidence from psychological experiments into assumptions about investors in real financial settings. Routine experimental testing of the assumptions and conclusions of asset-pricing theories is needed to guide modeling.”49 It is especially important for descriptive behavioral finance theories to model as precisely as possible. 49Hirshleifer(2001),p.1577. 31",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 51,
    "chunk_index": 54,
    "word_count": 278,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "obvious how to translate preexisting evidence from psychological experiments into assumptions about investors in real financial settings. Routine experimental testing of the assumptions and conclusions of asset-pricing theories is needed to guide modeling.”49 It is especially important for descriptive behavioral finance theories to model as precisely as possible. 49Hirshleifer(2001),p.1577. 31",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 51,
    "chunk_index": 55,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "We find that investors who think that they are above average trade more and are thus able to confirm other recent papers (Deaves, Lu¨ders, and Luo (2003), Graham, Harvey, and Huang (2005), Hales (2005)). One of the most striking results of our study is that overconfidence, as measured by calibration questions, is unrelated to trading volume. This result seems to be robust as Biais, Hilton, Mazurier, and Pouget (2005) report similar findings. These results are even more important as theoretical models that incorporate overconfident investors mainly motivate this assumption by the calibration literature and model overconfidence as underestimation of the variance of signals (or overestimation of their precision), i.e. by too tight confidence intervals. In connection with other recent findings,weconcludethattheusualwayofmotivatingandmodelingoverconfidencewhich is mainly based on the calibration literature has to be treated with caution. But why is it important to look at subtle modeling differences? Descriptive models have to be as precise as possible and have to rely on empirical and experimental observations. This is also discussed in Hales (2005). He provides evidence that a willingness to engage in speculative trade is largely driven by a failure to account for information about value implicit in other trader’s actions. Unlike overconfidence models, which focus on erroneous estimates of signal precision, these participants do not trade too much because they un- derestimate the error of noisy signals. Rather, participants engage in too much speculative trade because they tend not to think about the implications of disagreement. The evi- dence presented in Hales (2005) also supports the general technique of modeling investor behavior using differences of opinion by showing that, even though traders are capable of adjusting for other’s behavior, they will not naturally do so. He also argues that, as a result, investors might often act like they believe they are better than average traders (or have better than average information). There are several suggestions for future research. We measure various facets of overcon- fidence. Numerous studies suggest or argue, at least implicitly, that these manifestations 32",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 51,
    "chunk_index": 56,
    "word_count": 334,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "argues that, as a result, investors might often act like they believe they are better than average traders (or have better than average information). There are several suggestions for future research. We measure various facets of overcon- fidence. Numerous studies suggest or argue, at least implicitly, that these manifestations 32 of overconfidence are related. In other words: answers to experimental tasks should be positively correlated. Our study is a hint that this need not be the case. Future research shouldfurtheranalyzewhetheroverconfidenceisarobustphenomenonacrossseveraltasks that are often assumed to be related. Furthermore, our way of empirically evaluating be- havioral finance models - the correlation of economic and psychological variables and the combination of psychometric measures of judgment biases (such as overconfidence scores) and field data - seems to be a promising way to better understand which psychologi- cal phenomena drive economic behavior. This empirical methodology should be routinely used to guide modeling. 33",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "3.1.1 Miscalibration",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 51,
    "chunk_index": 57,
    "word_count": 149,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1.1 Miscalibration (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "correlation of economic and psychological variables and the combination of psychometric measures of judgment biases (such as overconfidence scores) and field data - seems to be a promising way to better understand which psychologi- cal phenomena drive economic behavior. This empirical methodology should be routinely used to guide modeling. 33 Alba, J. W., and J. W. Hutchinson, 2000, “Knowledge Calibration: What Consumers Know and What They Think They Know,” Journal of Consumer Research, 27, 123– 156. Anderhub, V., R. Mu¨ller, and C. Schmidt, 2001, “Design and evaluation of an economic experiment via the internet,” Journal of Economic Behavior and Organization, 46, 227– 247. Anderson, A., 2006, “Is Online Trading Gambling with Peanuts?,” Working paper. Antweiler, W., and M. Z. Frank, 2004, “Is All That Talk Just Noise? The Information Content of Internet Stock Message Boards,” Journal of Finance, 59(3), 1259 – 1294. Atkinson, A., 1985, Plots, Transformations, and Regression. Clarendon Press, Oxford. Bamber, L. S., O. E. Barron, and T. L. Stober, 1999, “Differential Interpretations and Trading Volume,” Journal of Financial and Quantitative Analysis, 34(3), 369–386. Barber, B. M., and T. Odean, 2000, “Trading Is Hazardous to Your Wealth: The Common Stock Investment Performance of Individual Investors,” Journal of Finance, 55(2), 773– 806. , 2001, “Boys Will Be Boys: Gender, Overconfidence, And Common Stock Invest- ment,” Quarterly Journal of Economics, 116(1), 261–292. Barberis, N., and R. Thaler, 2003, “Behavioral Finance,” in Handbook of the Economics of Finance, ed. by G. M. Constantinides, M. Harris, and R. M. Stulz. North Holland, Amsterdam, pp. 1053–1123. Bauer, R., M. Cosemans, and P. M. Eichholtz, 2007, “The Performance and Persistence of Individual Investors: Rational Agents or Tulip Maniacs?,” Working paper, University of Maastricht. Ben-David, I., J. R. Graham, and C. R. Harvey, 2006, “Managerial Overconfidence and Corporate Policies,” Working paper. 34",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "References",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 51,
    "chunk_index": 58,
    "word_count": 297,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "Stulz. North Holland, Amsterdam, pp. 1053–1123. Bauer, R., M. Cosemans, and P. M. Eichholtz, 2007, “The Performance and Persistence of Individual Investors: Rational Agents or Tulip Maniacs?,” Working paper, University of Maastricht. Ben-David, I., J. R. Graham, and C. R. Harvey, 2006, “Managerial Overconfidence and Corporate Policies,” Working paper. 34 Benos, A. V., 1998, “Aggressiveness and survival of overconfident traders,” Journal of Financial Markets, 1, 353–383. Biais, B., D. Hilton, K. Mazurier, and S. Pouget, 2005, “Judgemental overconfidence, self-monitoring and trading performance in an experimental financial market,” Review of Economic Studies, 72, 287–312. Brunnermeier, M. K., 2001, Asset Pricing under Asymmetric Information: Bubbles, Crashes, Technical Analysis, and Herding. Oxford University Press, Oxford. Caball´e,J.,andJ.S´akovics,2003,“Speculatingagainstanoverconfidentmarket,” Journal of Financial Markets, 6, 199–225. ¨ Cesarini, D., O. Sandewall, and M. Johannesson, 2006, “Confidence interval estimation tasks and the economics of overconfidence,” Journal of Economic Behavior and Orga- nization, 61(3), 453–470. Daniel, K., D. Hirshleifer, and A. Subrahmanyam, 1998, “Investor Psychology and Secu- rity Market Under- and Overreactions,” Journal of Finance, 53(6), 1839–1885. , 2001, “Overconfidence, Arbitrage, and Equilibrium Asset Pricing,” Journal of Finance, 56(3), 921–965. Davidson, R., and J. G. MacKinnon, 1993, Estimation and Inference in Econometrics. Oxford University Press, Oxford. De Bondt, W. F., 1998, “A portrait of the individual investor,” European Economic Re- view, 42, 831–844. De Bondt, W. F., and R. H. Thaler, 1995, “Financial Decision Making in Markets and Firms: A Behavioral Perspective,” in Handbooks in Operations Research and Manage- ment Science, Volume 9, Finance, ed. by R. A. Jarrow, V. Maksimovic, and W. T. Ziemba. Elsevier, Amsterdam, pp. 385–410. Deaves, R., E. Lu¨ders, and R. Luo, 2003, “An Experimental Test of the Impact of Over- confidence and Gender on Trading Activity,” Working paper, McMaster University. 35",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "References",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 51,
    "chunk_index": 59,
    "word_count": 287,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "Research and Manage- ment Science, Volume 9, Finance, ed. by R. A. Jarrow, V. Maksimovic, and W. T. Ziemba. Elsevier, Amsterdam, pp. 385–410. Deaves, R., E. Lu¨ders, and R. Luo, 2003, “An Experimental Test of the Impact of Over- confidence and Gender on Trading Activity,” Working paper, McMaster University. 35 Deaves, R., E. Lu¨ders, and M. Schr¨oder, 2004, “The dynamics of overconfidence: Evidence from stock market forecasters,” Working paper. Diamond, D. W., and R. E. Verrecchia, 1981, “Information aggregation in a noisy rational expectations economy,” Journal of Financial Economics, 9, 221–235. Diether, K. B., C. J. Malloy, and A. Scherbina, 2002, “Differences of Opinion and the Cross Section of Stock Returns,” Journal of Finance, 57(5), 2113–2141. Dorn, D., and G. Huberman, 2002, “Who trades?,” Working paper, Columbia University. , 2005, “Talk and Action: What Individual Investors Say and What They Do,” Review of Finance, 9, 437–481. Dorn, D., and P. Sengmueller, 2006, “Trading as Entertainment,” Working paper. Fama, E. F., 1998, “Market efficiency, long-term returns, and behavioral finance,” Journal of Financial Economics, 49, 283–306. Fenton-O’Creevy,M.,N.Nicholson,E.Soane,andP.Willman,2003,“Tradingonillusions: unrealistic perceptions of control and trading performance,” Journal of Occupational and Organizational Psychology, 76, 53–68. Gervais, S., and T. Odean, 2001, “Learning to Be Overconfident,” Review of Financial Studies, 14(1), 1–27. Glaser, M., 2003, “Online Broker Investors: Demographic Information, Investment Strat- egy, Portfolio Positions, and Trading Activity,” SFB 504 discussion paper 03-18, Uni- versity of Mannheim. ,2005,“DeterminantsofPortfolioRisk,Return,andTradingActivityofIndividual Investors,” Working paper, University of Mannheim. Glaser, M., T. Langer, J. Reynders, and M. Weber, 2007, “Framing Effects in Stock Market Forecasts: The Difference Between Asking for Prices and Asking for Returns,” Review of Finance, pp. –, forthcoming. 36",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "References",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 51,
    "chunk_index": 60,
    "word_count": 271,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "Activity,” SFB 504 discussion paper 03-18, Uni- versity of Mannheim. ,2005,“DeterminantsofPortfolioRisk,Return,andTradingActivityofIndividual Investors,” Working paper, University of Mannheim. Glaser, M., T. Langer, J. Reynders, and M. Weber, 2007, “Framing Effects in Stock Market Forecasts: The Difference Between Asking for Prices and Asking for Returns,” Review of Finance, pp. –, forthcoming. 36 Glaser, M., T. Langer, and M. Weber, 2005, “Overconfidence of Professionals and Lay Men: Individual Differences Within and Between Tasks?,” Working paper, University of Mannheim. Glaser, M., M. N¨oth, and M. Weber, 2004, “Behavioral Finance,” in Blackwell Handbook of Judgment and Decision Making, ed. by D. J. Koehler, and N. Harvey. Blackwell, Malden, Mass., pp. 527–546. Glaser, M., and P. Schmitz, 2007, “Privatanleger am Optionsscheinmarkt,” Zeitschrift fu¨r Bankrecht und Bankwirtschaft, pp. –, forthcoming. Glaser,M.,andM.Weber,2003,“OverconfidenceandTradingVolume,”CEPRDiscussion Paper No. 3941. , 2004, “Which Past Returns Affect Trading Volume?,” Working paper, University of Mannheim. , 2005a, “September 11 and Stock Return Expectations of Individual Investors,” Review of Finance, 9, 243–279. , 2005b, “Which Investors are able to Correctly Estimate their Past Realized Portfolio Performance?,” Working paper, University of Mannheim. Graham, J. R., and C. R. Harvey, 2003, “Expectations of equity risk premia, volatility and asymmetry,” Working paper, Fuqua School of Business, Duke University. , 2005, “The long-run equity risk premium,” Finance Research Letters, 2(4), 185– 194. Graham, J. R., C. R. Harvey, and H. Huang, 2005, “Investor Competence, Trading Fre- quency, and Home Bias,” Working paper, Duke University. Griffin, D., and L. Brenner, 2004, “Perspectives on Probability Judgment Calibration,” in Blackwell Handbook of Judgment and Decision Making, ed. by D. Koehler, and N. Har- vey. Blackwell, Malden, Mass., pp. 177–199. 37",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "References",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 51,
    "chunk_index": 61,
    "word_count": 267,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "Harvey, and H. Huang, 2005, “Investor Competence, Trading Fre- quency, and Home Bias,” Working paper, Duke University. Griffin, D., and L. Brenner, 2004, “Perspectives on Probability Judgment Calibration,” in Blackwell Handbook of Judgment and Decision Making, ed. by D. Koehler, and N. Har- vey. Blackwell, Malden, Mass., pp. 177–199. 37 Grinblatt, M., and M. Keloharju, 2001, “What Makes Investors Trade?,” Journal of Fi- nance, 56(2), 589–616. Grossman, S., and J. E. Stiglitz, 1980, “On the impossibility of informationally efficient markets,” American Economic Review, 70, 393–408. Hales, J., 2005, “Are Investors Really Willing to Agree to Disagree? An Experimental Investigation of How Disagreement and Attention to Disagreement Affect Trading Vol- ume,” Working paper, University of Texas at Austin. Harris, M., and A. Raviv, 1993, “Differences of Opinion Make a Horse Race,” Review of Financial Studies, 6(3), 473–506. Hellwig,M.F.,1980,“Ontheaggregationofinformationincompetitivemarkets,”Journal of Economic Theory, 22, 477–498. Hilton, D. J., 2001, “The Psychology of Financial Decision-Making: Applications to Trad- ing, Dealing, and Investment Analysis,” Journal of Psychology and Financial Markets, 2(1), 37–53. Hirshleifer, D., 2001, “Investor Psychology and Asset Pricing,” Journal of Finance, 56(4), 1533–1597. Hirshleifer, D., and G. Y. Luo, 2001, “On the survival of overconfident traders in a com- petitive securities market,” Journal of Financial Markets, 4, 73–84. Hong, H., and J. C. Stein, 2003, “Differences of Opinion, Short-Sales Constraints and Market Crashes,” Review of Financial Studies, 16, 487–525. , 2007, “Disagreement and the Stock Market,” Journal of Economic Perspectives, pp. –, forthcoming. Jonsson, A.-C., and C. M. Allwood, 2003, “Stability and variability in the realism of con- fidence judgments over time, content domain, and gender,” Personality and Individual Differences, 34, 559–574. 38",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "References",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 51,
    "chunk_index": 62,
    "word_count": 270,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "Review of Financial Studies, 16, 487–525. , 2007, “Disagreement and the Stock Market,” Journal of Economic Perspectives, pp. –, forthcoming. Jonsson, A.-C., and C. M. Allwood, 2003, “Stability and variability in the realism of con- fidence judgments over time, content domain, and gender,” Personality and Individual Differences, 34, 559–574. 38 Kahneman, D., and A. Tversky, 1979, “Prospect Theory: An Analysis of Decision under Risk,” Econometrica, 47(2), 263–292. Kandel, E., and N. D. Pearson, 1995, “Differential Interpretation of Public Signals and Trade in Speculative Markets,” Journal of Political Economy, 103(4), 831–872. Keefer, D. L., and S. E. Bodily, 1983, “Three-Point Approximations for Continuous Ran- dom Variables,” Management Science, 29(5), 595–609. Klayman, J., J. B. Soll, C. Gonz´ales-Vallejo, and S. Barlas, 1999, “Overconfidence: It Depends on How, What, and Whom You Ask,” Organizational Behavior and Human Decision Processes, 79(3), 216–247. Klos, A., E. U. Weber, and M. Weber, 2005, “Investment decisions and time horizon: Risk perceptionandriskbehaviorinrepeatedgambles,”Management Science,51,1777–1790. Kumar, A., 2006, “Who Gambles in the Stock Market?,” Working paper. Kyle,A.S.,1985,“ContinuousAuctionsandInsiderTrading,”Econometrica,53(6),1315– 1336. , 1989, “Informed Speculation with Imperfect Competition,” Review of Economic Studies, 56, 317–356. Kyle, A. S., and F. A. Wang, 1997, “Speculation Duopoly with Agreement to Disagree: Can Overconfidence Survive the Market Test?,” Journal of Finance, 52(5), 2073–2090. Langer, E. J., 1975, “The Illusion of Control,” Journal of Personality and Social Psychol- ogy, 32(2), 311–328. Langer, E. J., and J. Roth, 1975, “Heads I Win, Tail It’s Chance: The Illusion of Control as a Function of the Sequence of Outcomes in a Purely Chance Task,” Journal of Personaliy and Social Psychology, 32(6), 951–955. Larrick, R. P., K. A. Burson, and J. B. Soll, 2007, “Social comparison and confidence: When thinking you’re better than average predicts overconfidence (and when it does not),” Organizational Behavior and Human Decision Processes, 102(1), 76–94. 39",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "References",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 51,
    "chunk_index": 63,
    "word_count": 298,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "in a Purely Chance Task,” Journal of Personaliy and Social Psychology, 32(6), 951–955. Larrick, R. P., K. A. Burson, and J. B. Soll, 2007, “Social comparison and confidence: When thinking you’re better than average predicts overconfidence (and when it does not),” Organizational Behavior and Human Decision Processes, 102(1), 76–94. 39 Lichtenstein, S., B. Fischhoff, and L. D. Phillips, 1982, “Calibration of probabilities: The state of the art to 1980,” in Judgment under uncertainty: Heuristics and Biases, ed. by D. Kahneman, P. Slovic, and A. Tversky. Cambridge University Press, Cambridge, pp. 306–334. Milgrom,P.,andN.Stokey,1982,“Information,TradeandCommonKnowledge,”Journal of Economic Theory, 26, 17–27. Miller, D., and M. Ross, 1975, “Self-serving Biases in Attribution of Causality: Fact or Fiction?,” Psychological Bulletin, 82, 213–225. Morris, S., 1994, “Trade With Heterogeneous Prior Beliefs and Asymmetric Information,” Econometrica, 62(6), 1327–1347. Oberlechner, T., and C. L. Osler, 2003, “Overconfidence in Currency Markets,” Working paper. Odean, T., 1998a, “Are Investors Reluctant to Realize their Losses?,” Journal of Finance, 53, 1775–1798. , 1998b, “Volume, Volatility, Price, and Profit When All Traders Are Above Av- erage,” Journal of Finance, 53(6), 1887–1934. , 1999, “Do Investors Trade Too Much?,” American Economic Review, 89(5), 1279–1298. Pagano, M., and A. R¨oell, 1992, “Trading Volume,” in The New Palgrave Dictionary of Money and Finance, ed. by P. Newman, J. Eatwell, and M. Milgate. Macmillan, London, pp. 679–683. Pallier, G., R. Wilkinson, V. Danthiir, S. Kleitman, G. Knezevic, L. Stankov, and R. D. Roberts, 2002, “The Role of Individual Differences in the Accuracy of Confidence Judg- ments,” Journal of General Psychology, 129(3), 257–299. 40",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "References",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 51,
    "chunk_index": 64,
    "word_count": 255,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "Finance, ed. by P. Newman, J. Eatwell, and M. Milgate. Macmillan, London, pp. 679–683. Pallier, G., R. Wilkinson, V. Danthiir, S. Kleitman, G. Knezevic, L. Stankov, and R. D. Roberts, 2002, “The Role of Individual Differences in the Accuracy of Confidence Judg- ments,” Journal of General Psychology, 129(3), 257–299. 40 Parker,A.M.,andB.Fischhoff,2005,“Decision-makingCompetence:ExternalValidation throughanindividual-differenceApproach,”Journal of Behavioral Decision Making,18, 1–27. Presson, P. K., and V. A. Benassi, 1996, “Illusion of Control: A Meta-Analytic Review,” Journal of Social Behavior and Personality, 11(3), 493–510. Puri, M., and D. T. Robinson, 2005, “Optimism and Economic Choices,” Working paper, Duke University. R´egner,I.,D.Hilton,L.Cabantous,andS.Vautier,2004,“Overconfidence,Miscalibration and Positive Illusions,” Working paper, University of Toulouse. Russo, J. E., and P. J. H. Schoemaker, 1992, “Managing Overconfidence,” Sloan Manage- ment Review, 33(2), 7–17. Schmitz, P., M. Glaser, and M. Weber, 2005, “Individual Investor Sentiment and Stock Returns - What Do We Learn from Individual Warrant Traders?,” Working paper, University of Mannheim. Schneider, D. J., A. H. Hastorf, and P. C. Ellsworth, 1979, Person Perception. Addison- Wesley, Reading, Mass. Schunk, D., and C. Betsch, 2006, “Explaining heterogeneity in utility functions by indi- vidual differences in decision modes,” Journal of Economic Psychology, 27(3), 386–401. Shefrin, H., and M. Statman, 1985, “The Disposition to sell winners too Early and Ride Losers too Long: Theory and Evidence,” Journal of Finance, 40, 777–790. Shiller, R. J., 1999, “Human Behavior and the Efficiency of the Financial System,” in Handbook of Macroeconomics, ed. by J. Taylor, and M. Woodford. Elsevier Science, Amsterdam, pp. 1305–1340. Shleifer, A., and L. H. Summers, 1990, “The Noise Trader Approach to Finance,” Journal of Economic Perspectives, 4(2), 19–33. 41",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "References",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 51,
    "chunk_index": 65,
    "word_count": 264,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "777–790. Shiller, R. J., 1999, “Human Behavior and the Efficiency of the Financial System,” in Handbook of Macroeconomics, ed. by J. Taylor, and M. Woodford. Elsevier Science, Amsterdam, pp. 1305–1340. Shleifer, A., and L. H. Summers, 1990, “The Noise Trader Approach to Finance,” Journal of Economic Perspectives, 4(2), 19–33. 41 Shu, P.-G., S.-B. Chiu, H.-C. Chen, and Y.-H. Yeh, 2004, “Does Trading Improve In- dividual Investor Performance?,” Review of Quantitative Finance and Accounting, 22, 199–217. Siebenmorgen, N., and M. Weber, 2004, “The Influence of Different Investment Horizons on Risk Behavior,” Journal of Behavioral Finance, 5, 75–90. Soll, J. B., 1996, “Determinants of overconfidence and miscalibration: The roles of ran- dom error and ecological structure,” Organizational Behavior and Human Decision Processes, 65(2), 117–137. Soll, J. B., and J. Klayman, 2004, “Overconfidence in Interval Estimates,” Journal of Experimental Psychology: Learning, Memory, and Cognition, 30(2), 299–314. Spanos, A., 1986, Statistical foundations of econometric modelling. Cambridge University Press, Cambridge. Stanovich, K. E., and R. F. West, 1998, “Individual differences in Rational Thought,” Journal of Experimental Psychology, 127(2), 161–188. , 2000, “Individual differences in reasoning: Implications for the rationality de- bate,” Behavioral and Brain Sciences, 23, 645–726. Statman, M., S. Thorley, and K. Vorkink, 2006, “Investor Overconfidence and Trading Volume,” Review of Financial Studies, 19, 1531–1565. Svenson, O., 1981, “Are we all less risky and more skillful than our fellow drivers?,” Acta Psychologica, 47, 143–148. Taylor, S., and J. Brown, 1988, “Illusion and well being: A social psychology perspective on mental health,” Psychological Bulletin, 103, 193–210. Varian, H. R., 1985, “Divergence of Opinion in Complete Markets: A Note,” Journal of Finance, 40(1), 309–317. , 1989, “Differences of Opinion in Financial Markets,” in Financial Risk: Theory, Evidence, and Implications, ed. by C. C. Stone. Kluwer, Boston, pp. 3–37. 42",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "References",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 51,
    "chunk_index": 66,
    "word_count": 293,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "perspective on mental health,” Psychological Bulletin, 103, 193–210. Varian, H. R., 1985, “Divergence of Opinion in Complete Markets: A Note,” Journal of Finance, 40(1), 309–317. , 1989, “Differences of Opinion in Financial Markets,” in Financial Risk: Theory, Evidence, and Implications, ed. by C. C. Stone. Kluwer, Boston, pp. 3–37. 42 Vissing-Jorgensen, A., 2003, “Perspectives on Behavioral Finance: Does ”Irrationality” Disappear with Wealth? Evidence from Expectations and Actions,” NBER Macroeco- nomics Annual 2003, pp. 139–194. Wang, F. A., 1998, “Strategic trading, asymmetric information and heterogeneous prior beliefs,” Journal of Financial Markets, 1, 321–352. , 2001, “Overconfidence, Investor Sentiment, and Evolution,” Journal of Financial Intermediation, 10, 138–170. Weber, M., and C. Camerer, 1998, “The Disposition Effect in Securities Trading: Exper- imental Evidence,” Journal of Economic Behavior and Organization, 33, 167–184. Winkelmann, R., 2003, Econometric analysis of count data. Springer, Heidelberg. Wolosin, R., S. Sherman, and A. Till, 1973, “Effects of Cooperation and Competition on Responsibility Attribution After Success and Failure,” Journal of Experimental Social Psychology, 9, 220–235. Wooldridge, J. M., 2002, Econometric Analysis of Cross Section and Panel Data. MIT Press, Cambridge, Mass. 43",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "References",
    "page_number": 43,
    "page_range": "p.43-44",
    "total_pages": 51,
    "chunk_index": 67,
    "word_count": 182,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.43-44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "analysis of count data. Springer, Heidelberg. Wolosin, R., S. Sherman, and A. Till, 1973, “Effects of Cooperation and Competition on Responsibility Attribution After Success and Failure,” Journal of Experimental Social Psychology, 9, 220–235. Wooldridge, J. M., 2002, Econometric Analysis of Cross Section and Panel Data. MIT Press, Cambridge, Mass. 43 Table1:DescriptiveStatistics:InvestorswhoAnsweredversusInvestorswhodidnotAnswer the Questionnaire Thistablecomparesdescriptivestatisticsoftheage,thestockmarketinvestmentexperience(inyears),thenumber of transactions in all security categories (sum over the period from January 1997 to April 2001), the number of stock transactions (sum over the period from January 1997 to April 2001), the number of warrant transactions (sum over the period from January 1997 to April 2001), the average of the monthly stock portfolio value (in EUR), the average of the monthly stock portfolio turnover from January 1997 to April 2001, and the monthly stock portfolio performance for the 2,864 investors who did not answer and the 215 investors who answered the questionnaire. See Glaser (2005) for further details on these variables. The table contains means and medians of these variables as well as the number of observations of the respective variable (Obs.), and the number of observations of the respective variable in percent of the number of accounts in both groups (Obs. in % of no. of accounts). The last column presents the p-values of a two-sample Wilcoxon rank-sum test (Mann-Whitney test). Null hypothesis is that the two samples are from populations with the same distribution. Investorswho Investorswho p-value didnotanswer answered (Mann-Whitneytest) questionnaire questionnaire No.ofaccounts 2,864 215 Age Mean 40.92 40.02 0.2942 Median 39 38 Obs. 2,369 183 Obs.in%ofno.ofaccounts 82.72 85.12 Investmentexperience Mean 5.50 5.46 0.8011 Median 7.5 7.5 Obs. 2,227 159 Obs.in%ofno.ofaccounts 77.76 73.95 Transactions Mean 184.89 156.17 0.5621 Median 103 105 Obs. 2,864 215 Obs.in%ofno.ofaccounts 100.00 100.00 Stocktransactions Mean 106.37 92.87 0.9422 Median 54 52 Obs. 2,793 205 Obs.in%ofno.ofaccounts 97.52 95.35 Warranttransactions Mean 88.99 69.81 0.8194 Median 27 29 Obs. 1530 120 Obs.in%ofno.ofaccounts 53.42 55.81 Stockportfolio Mean 36590.83 37061.01 0.5614 value Median 15629.70 15887.10 Obs. 2,762 202 Obs.in%ofno.ofaccounts 96.44 93.95 Stockportfolio Mean 1.37 1.21 0.9692 turnover Median 0.33 0.33 Obs. 2,675 199 Obs.in%ofno.ofaccounts 93.40 92.56 Stockportfolio Mean 0.0056 0.0030 0.4538 performance Median 0.0057 0.0053 Obs. 2,598 195 Obs.in%ofno.ofaccounts 90.71 90.70 44",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "References",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 51,
    "chunk_index": 68,
    "word_count": 357,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "120 Obs.in%ofno.ofaccounts 53.42 55.81 Stockportfolio Mean 36590.83 37061.01 0.5614 value Median 15629.70 15887.10 Obs. 2,762 202 Obs.in%ofno.ofaccounts 96.44 93.95 Stockportfolio Mean 1.37 1.21 0.9692 turnover Median 0.33 0.33 Obs. 2,675 199 Obs.in%ofno.ofaccounts 93.40 92.56 Stockportfolio Mean 0.0056 0.0030 0.4538 performance Median 0.0057 0.0053 Obs. 2,598 195 Obs.in%ofno.ofaccounts 90.71 90.70 44 Table 2: Overconfidence in Knowledge Questions (Miscalibration): Results Thistablepresentsthemean,minimum,maximum,andseveralpercentilesofthepercentageofsurprises in knowledge questions (i.e. the number of correct answers that fall outside the 90 % confidence interval forknowledgequestionsstatedbyinvestorsin%ofthenumberofquestionsansweredbytheseinvestors). Forexample,themedianof0.8showsthat,forthemedianinvestor,4outof5correctanswersfalloutside the 90 % confidence interval given by this investor. Number of observations 137 Mean 0.75 Standard deviation 0.24 Minimum 0 5th percentile 0.4 10th percentile 0.4 25th percentile 0.6 Median 0.8 75th percentile 1 90th percentile 1 95th percentile 1 Maximum 1 Table 3: Volatility Forecasts: Results This table presents median volatility forecasts of the two groups of respondents for the German stock market index DAX and the BASF stock as examples. Investors were asked to state median as well as upper and lower bound of a 90 % confidence interval (see also Figure 1). In addition, the table shows historicalvolatilitiesovertherespectiveforecasthorizon,i.e.historicalvolatilitiesof(non-overlapping)21 weekreturns(column3)and14weekreturns(column4),respectively.FortheDAX,thetablereportsthe implied volatility of the respective response date as well. These implied volatilities were calculated using theVDAX.TheVDAXexpressesthefluctuationrangeorimpliedvolatilityoftheDAXindex,asexpected bytheforwardmarket.Column5containsp-valuesofatwo-sidedMann-Whitneytest(Wilcoxonranksum test). Null hypothesis is that the two populations are from the same distribution (volatility forecasts are equalinbothgroups).ForanindepthanalysisoftheeffectsofSeptember11onstockreturnexpectations, see Glaser and Weber (2005a). Firstgroup Secondgroup p-value August2nd,2001 September20,2001 (Mann-Whitney) DAX Medianacrosssubjects 6.53% 12.39% <0.0001 Numberofobservations 115 75 Historicalstandard 14.65% 12.31% deviation(January1988-timeofresponse) Impliedvolatility 12.73% 22.90% BASF Medianacrosssubjects 6.97% 14.43% <0.0001 Numberofobservations 99 65 Historicalstandard 15.65% 11.80% deviation(January1988-timeofresponse) 45",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "References",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 51,
    "chunk_index": 69,
    "word_count": 253,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "two populations are from the same distribution (volatility forecasts are equalinbothgroups).ForanindepthanalysisoftheeffectsofSeptember11onstockreturnexpectations, see Glaser and Weber (2005a). Firstgroup Secondgroup p-value August2nd,2001 September20,2001 (Mann-Whitney) DAX Medianacrosssubjects 6.53% 12.39% <0.0001 Numberofobservations 115 75 Historicalstandard 14.65% 12.31% deviation(January1988-timeofresponse) Impliedvolatility 12.73% 22.90% BASF Medianacrosssubjects 6.97% 14.43% <0.0001 Numberofobservations 99 65 Historicalstandard 15.65% 11.80% deviation(January1988-timeofresponse) 45 Table 4: Better Than Average Effect: Results This table presents summary statistics (mean, median, and standard deviation) for our better than average scores based on Question 1 and Question 2: Question1:Whatpercentageofcustomersofyourdiscountbrokeragehousehavebetterskills (e.g.inthewaytheyinterpretinformation;generalknowledge)thanyouatidentifyingstocks with above average performance in the future? (Please give a number between 0 % and 100 %) Question2:Whatpercentageofcustomersofyourdiscountbrokeragehousehadhigherreturns thanyouinthefour-yearperiodfromJanuary1997toDecember2000?(Pleasegiveanumber between 0 % and 100 %) Forbothquestions,wecalculatebetterthanaveragescoresofinvestori(bta1 i andbta2 i )as 50−an 50 swer i. Observations Mean Median Standard deviation Question 1 212 43.821 % 50 % 18.42 Question 2 212 46.986 % 50 % 19.33 bta1 (based on Question 1) 212 0.124 0 0.37 bta2 (based on Question 2) 212 0.060 0 0.39 Table 5: Correlation of Overconfidence Variables This table presents pairwise Spearman rank correlation coefficient between our overconfidence measures describedinSubsection4.3aswellasthesignificancelevelofeachcorrelationcoefficient(inparentheses) andthenumberofobservationsusedincalculatingthecorrelationcoefficient.miscdenotesthepercentage ofsurprisesinknowledgequestions.volestisanoverconfidencemeasurebasedonthewidthofconfidence intervalsforfuturestockpricesorindexvalues.bta1isabetterthanaveragescorebasedonself-assessment of investment skills in relation to other investors’ investment skills. bta2 denotes a better than average score based on self-assessment of past performance in relation to other investors’ past performance. * indicates significance at 10%; *** indicates significance at 1%. misc volest bta1 bta2 misc 1 137 volest 0.3377 1 (0.0001)*** 137 190 bta1 -0.0327 -0.0304 1 (0.7040) (0.6774) 137 190 212 bta2 0.1708 -0.0077 0.6461 1 (0.0460)* (0.9164) (<0.0001)*** 137 190 212 212 46",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "References",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 51,
    "chunk_index": 70,
    "word_count": 252,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "to other investors’ past performance. * indicates significance at 10%; *** indicates significance at 1%. misc volest bta1 bta2 misc 1 137 volest 0.3377 1 (0.0001)*** 137 190 bta1 -0.0327 -0.0304 1 (0.7040) (0.6774) 137 190 212 bta2 0.1708 -0.0077 0.6461 1 (0.0460)* (0.9164) (<0.0001)*** 137 190 212 212 46 selbairaV fo noitinfieD :6 elbaT .ecruosatadevitcepserriehtstneserpdnarepapsihtnidesuselbairavehtsenfieddnasezirammuselbatsihT noitpircseD ecruoSataD selbairaV .elamsirotsevniehtnehw1eulavehtsekathcihwelbairavymmuD rekorbenilnoehtybdetcellocataddetroper-fleS )ymmud(redneG .tnuoccaehtdeneporotsevnihcaeemitehtta .rotsevnifoegA rekorbenilnoehtybdetcellocataddetroper-fleS egA .tnuoccaehtdeneporotsevnihcaeemitehtta .sraeyniecneirepxetnemtsevnitekramkcotS rekorbenilnoehtybdetcellocataddetroper-fleS ecneirepxE .tnuoccaehtdeneporotsevnihcaeemitehtta ygetartstnemtsevniehtnehw1eulavehtsekathcihwelbairavymmuD rekorbenilnoehtybdetcellocataddetroper-fleS )ymmud(ksirhgiH .ksir-hgihsadeziretcarahcsi .tnuoccaehtdeneporotsevnihcaeemitehtta sedartrotsevniehtnehw1eulavehtsekathcihwelbairavymmuD atadnoitcasnarT )ymmud(redarttnarraW .1002lirpAot7991yraunaJmrofdoirepehtniecnotsaeltastnarraw .)1002lirpAot7991yraunaJmorfdoirepehtrevomuS(snoitcasnartkcotsforebmuN atadnoitcasnarT snoitcasnartkcotsforebmuN .)1002lirpAot7991yraunaJmorfdoirepehtrevomuS(sesahcrupkcotsforebmuN atadnoitcasnarT sesahcrupkcotsforebmuN .1002lirpAot7991yraunaJmorfrevonrutylhtnomehtfoegarevA atadnoitcasnarT revonruT thguoberewtahtskcotsfoeulavoiloftropylhtnomehtfoegarevA atadnoitcasnarT eulavoiloftroP .maertsataDniderevoceratahtdnaRUEroMEDni .keewrepsruohninoitamrofnI eriannoitseuQ noitamrofnI .snoitseuqegdelwonknisesirprusfoegatnecreP eriannoitseuQ csim .seulavxednirosecirpkcotserutufrofslavretniecnedfinocfohtdiwehtnodesaberusaemecnedfinocrevO eriannoitseuQ tselov sllikstnemtsevnifotnemssessa-flesnodesaberocsegarevanahtretteB eriannoitseuQ 1atb .sllikstnemtsevni’srotsevnirehtootnoitalerni ecnamrofreptsapfotnemssessa-flesnodesaberocsegarevanahtretteB eriannoitseuQ 2atb .ecnamrofreptsap’srotsevnirehtootnoitalerni .2atbdna1atbfoegarevacitemhtirA eriannoitseuQ atb 47",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "References",
    "page_number": 47,
    "page_range": "p.47-48",
    "total_pages": 51,
    "chunk_index": 71,
    "word_count": 114,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.47-48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "rekorbenilnoehtybdetcellocataddetroper-fleS egA .tnuoccaehtdeneporotsevnihcaeemitehtta .sraeyniecneirepxetnemtsevnitekramkcotS rekorbenilnoehtybdetcellocataddetroper-fleS ecneirepxE .tnuoccaehtdeneporotsevnihcaeemitehtta ygetartstnemtsevniehtnehw1eulavehtsekathcihwelbairavymmuD rekorbenilnoehtybdetcellocataddetroper-fleS )ymmud(ksirhgiH .ksir-hgihsadeziretcarahcsi .tnuoccaehtdeneporotsevnihcaeemitehtta sedartrotsevniehtnehw1eulavehtsekathcihwelbairavymmuD atadnoitcasnarT )ymmud(redarttnarraW .1002lirpAot7991yraunaJmrofdoirepehtniecnotsaeltastnarraw .)1002lirpAot7991yraunaJmorfdoirepehtrevomuS(snoitcasnartkcotsforebmuN atadnoitcasnarT snoitcasnartkcotsforebmuN .)1002lirpAot7991yraunaJmorfdoirepehtrevomuS(sesahcrupkcotsforebmuN atadnoitcasnarT sesahcrupkcotsforebmuN .1002lirpAot7991yraunaJmorfrevonrutylhtnomehtfoegarevA atadnoitcasnarT revonruT thguoberewtahtskcotsfoeulavoiloftropylhtnomehtfoegarevA atadnoitcasnarT eulavoiloftroP .maertsataDniderevoceratahtdnaRUEroMEDni .keewrepsruohninoitamrofnI eriannoitseuQ noitamrofnI .snoitseuqegdelwonknisesirprusfoegatnecreP eriannoitseuQ csim .seulavxednirosecirpkcotserutufrofslavretniecnedfinocfohtdiwehtnodesaberusaemecnedfinocrevO eriannoitseuQ tselov sllikstnemtsevnifotnemssessa-flesnodesaberocsegarevanahtretteB eriannoitseuQ 1atb .sllikstnemtsevni’srotsevnirehtootnoitalerni ecnamrofreptsapfotnemssessa-flesnodesaberocsegarevanahtretteB eriannoitseuQ 2atb .ecnamrofreptsap’srotsevnirehtootnoitalerni .2atbdna1atbfoegarevacitemhtirA eriannoitseuQ atb 47 snoissergeR lanoitceS-ssorC :ecnedfinocrevO fo serusaeM dna emuloV gnidarT :7 elbaT ot)1(snoissergeR(snoitcasnarttekramkcotsforebmunehtfomhtiragoleht(emulovgnidartfoserusaemneewtebnoitalerehtnostlusernoissergerstneserpelbatsihT yrotanalpxe lareves dna )))9( ot )7( snoissergeR( revonrut fo mhtiragol eht dna ,))6( ot )4( snoissergeR( sesahcrup tekram kcots fo rebmun eht fo mhtiragol eht ,))3( elbairav ymmud redart tnarraw a ,ecneirepxe tnemtsevni tekram kcots ,ega ,)elam si rotsevni eht fi 1 eulav eht sekat elbairav eht( elbairav ymmud redneg a( selbairav elbairav eht( ymmud ksir hgih a ,)1002 lirpA litnu 7991 yraunaJ morf doirep emit eht ni ecno tsael ta stnarraw sedart rotsevni eht fi 1 eulav eht sekat elbairav eht( nI.)keewrepsruohninoitamrofni,eulavoiloftropkcotsylhtnomnaemfomhtiragoleht,)ksirhgihsaygetartstnemtsevnirehsefiissalcrotsevniehtfi1eulavehtsekat setacidni ** ;%01 ta ecnacfiingis setacidni * .sesehtnerap ni era scitsitats t fo eulav etulosbA .)ecnedfinocrevO( elbairav ecnedfinocrevo eno edulcni ew ,noisserger hcae .%1taecnacfiingissetacidni***;%5taecnacfiingis )9( )8( )7( )6( )5( )4( )3( )2( )1( )revonruT(nl )revonruT(nl )revonruT(nl kcotS(nl kcotS(nl kcotS(nl kcotS(nl kcotS(nl kcotS(nl )sesahcrup )sesahcrup )sesahcrup )snoitcasnart )snoitcasnart )snoitcasnart atb tselov csim atb tselov csim atb tselov csim elbairavecnedfinocrevO 935.0 984.0 263.0- 870.0- 901.0- 504.0- 690.0- 621.0- 894.0- )ymmud(redneG )67.0( )76.0( )83.0( )41.0( )91.0( )26.0( )61.0( )12.0( )07.0( 800.0- 110.0- 110.0- 800.0- 500.0- 900.0- 700.0- 600.0- 800.0- egA )36.0( )68.0( )36.0( )97.0( )74.0( )17.0( )17.0( )25.0( )36.0( 110.0- 610.0- 910.0- 710.0 310.0 520.0 800.0 200.0 500.0 ecneirepxE )92.0( )83.0( )63.0( )85.0( )04.0( )07.0( )72.0( )70.0( )41.0( 615.0 193.0 533.0 936.0 275.0 764.0 296.0 516.0 905.0 )ymmud(redarttnarraW **)72.2( )26.1( )70.1( ***)26.3( ***)50.3( **)02.2( ***)26.3( ***)10.3( **)12.2( 473.0 473.0 812.0 431.0- 940.0- 350.0 282.0- 542.0- 441.0- )ymmud(ksirhgiH )51.1( )30.1( )84.0( )55.0( )81.0( )71.0( )80.1( )48.0( )54.0( 832.0- 071.0- 090.0- 225.0 755.0 455.0 045.0 965.0 465.0 )eulavoiloftroP(nl ***)00.3( **)99.1( )18.0( ***)95.8( ***)74.8( ***)04.7( ***)82.8( ***)10.8( ***)50.7( 330.0- 810.0- 020.0- 010.0- 200.0- 500.0- 810.0- 010.0- 410.0- noitamrofnI *)08.1( )40.1( )49.0( )76.0( )71.0( )33.0( )51.1( )96.0( )39.0( 496.0 390.0 953.0 974.0 411.0- 673.0- 574.0 511.0- 693.0- ecnedfinocrevO **)01.2( )26.0( )85.0( *)98.1( )89.0( )98.0( *)47.1( )09.0( )78.0( 700.1 685.0 015.0 184.1- 317.1- 831.1- 340.1- 741.1- 174.0- tnatsnoC )20.1( )55.0( )43.0( *)49.1( **)60.2( )11.1( )62.1( )72.1( )24.0( 521 311 97 721 511 08 821 611 18 snoitavresbO 31.0 60.0 00.0 34.0 34.0 44.0 14.0 04.0 14.0 derauqs-RdetsujdA 48",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "References",
    "page_number": 48,
    "page_range": "p.48",
    "total_pages": 51,
    "chunk_index": 72,
    "word_count": 394,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "ecnedfinocrevO **)01.2( )26.0( )85.0( *)98.1( )89.0( )98.0( *)47.1( )09.0( )78.0( 700.1 685.0 015.0 184.1- 317.1- 831.1- 340.1- 741.1- 174.0- tnatsnoC )20.1( )55.0( )43.0( *)49.1( **)60.2( )11.1( )62.1( )72.1( )24.0( 521 311 97 721 511 08 821 611 18 snoitavresbO 31.0 60.0 00.0 34.0 34.0 44.0 14.0 04.0 14.0 derauqs-RdetsujdA 48",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "References",
    "page_number": 49,
    "page_range": "p.49",
    "total_pages": 51,
    "chunk_index": 73,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "dedulcxE elitniuQ revonruT tsehgiH ni srotsevnI :ecnedfinocrevO fo serusaeM dna emuloV gnidarT :8 elbaT ot)1(snoissergeR(snoitcasnarttekramkcotsforebmunehtfomhtiragoleht(emulovgnidartfoserusaemneewtebnoitalerehtnostlusernoissergerstneserpelbatsihT yrotanalpxe lareves dna )))9( ot )7( snoissergeR( revonrut fo mhtiragol eht dna ,))6( ot )4( snoissergeR( sesahcrup tekram kcots fo rebmun eht fo mhtiragol eht ,))3( elbairav ymmud redart tnarraw a ,ecneirepxe tnemtsevni tekram kcots ,ega ,)elam si rotsevni eht fi 1 eulav eht sekat elbairav eht( elbairav ymmud redneg a( selbairav elbairav eht( ymmud ksir hgih a ,)1002 lirpA litnu 7991 yraunaJ morf doirep emit eht ni ecno tsael ta stnarraw sedart rotsevni eht fi 1 eulav eht sekat elbairav eht( .)keew rep sruoh ni noitamrofni ,eulav oiloftrop kcots ylhtnom naem fo mhtiragol eht ,)ksir hgih sa ygetarts tnemtsevni reh sefiissalc rotsevni eht fi 1 eulav eht sekat ni era scitsitats tfo eulav etulosbA .dedulcxe era elitniuq revonrut tsehgih eht ni srotsevnI .)ecnedfinocrevO( elbairav ecnedfinocrevo eno edulcni ew ,noisserger hcae nI .%1taecnacfiingissetacidni***;%5taecnacfiingissetacidni**.sesehtnerap )9( )8( )7( )6( )5( )4( )3( )2( )1( )revonruT(nl )revonruT(nl )revonruT(nl kcotS(nl kcotS(nl kcotS(nl kcotS(nl kcotS(nl kcotS(nl )sesahcrup )sesahcrup )sesahcrup )snoitcasnart )snoitcasnart )snoitcasnart atb tselov csim atb tselov csim atb tselov csim elbairavecnedfinocrevO 862.0 171.0 185.0- 250.0 570.0- 281.0- 550.0 730.0- 012.0- )ymmud(redneG )94.0( )43.0( )08.0( )90.0( )21.0( )02.0( )80.0( )50.0( )22.0( 300.0- 700.0- 200.0- 200.0- 200.0- 100.0 300.0- 400.0- 100.0 egA )93.0( )98.0( )71.0( )42.0( )41.0( )70.0( )62.0( )23.0( )80.0( 900.0 100.0 200.0- 110.0 400.0 600.0 800.0 100.0 900.0- ecneirepxE )53.0( )40.0( )70.0( )73.0( )31.0( )41.0( )62.0( )30.0( )02.0( 404.0 432.0 212.0 965.0 774.0 843.0 336.0 045.0 204.0 )ymmud(redarttnarraW **)35.2( )65.1( )41.1( ***)12.3( **)64.2( )25.1( ***)82.3( **)65.2( )26.1( 072.0 260.0 122.0 451.0- 491.0- 731.0 963.0- 694.0- 531.0- )ymmud(ksirhgiH )50.1( )32.0( )77.0( )65.0( )85.0( )83.0( )82.1( )34.1( )73.0( 151.0- 270.0- 680.0- 645.0 106.0 945.0 475.0 316.0 665.0 )eulavoiloftroP(nl ***)57.2( )73.1( )83.1( ***)41.9( ***)60.9( ***)01.7( ***)39.8( ***)75.8( ***)78.6( 710.0- 300.0- 700.0- 800.0- 400.0 300.0- 310.0- 000.0- 010.0- noitamrofnI )63.1( )62.0( )36.0( )26.0( )03.0( )32.0( )68.0( )20.0( )26.0( 295.0 791.0 302.0 517.0 260.0- 752.0- 886.0 170.0- 503.0- ecnedfinocrevO **)35.2( **)21.2( )45.0( ***)08.2( )15.0( )55.0( **)05.2( )45.0( )16.0( 103.0- 048.0- 161.0- 761.2- 444.2- 357.1- 798.1- 879.1- 382.1- tnatsnoC )24.0( )32.1( )61.0( ***)57.2( ***)77.2( )24.1( **)22.2( **)60.2( )79.0( 89 78 26 001 98 36 101 09 46 snoitavresbO 41.0 50.0 00.0 35.0 15.0 74.0 15.0 84.0 44.0 derauqs-RdetsujdA 49",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "References",
    "page_number": 49,
    "page_range": "p.49",
    "total_pages": 51,
    "chunk_index": 74,
    "word_count": 374,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "ecnedfinocrevO **)35.2( **)21.2( )45.0( ***)08.2( )15.0( )55.0( **)05.2( )45.0( )16.0( 103.0- 048.0- 161.0- 761.2- 444.2- 357.1- 798.1- 879.1- 382.1- tnatsnoC )24.0( )32.1( )61.0( ***)57.2( ***)77.2( )24.1( **)22.2( **)60.2( )79.0( 89 78 26 001 98 36 101 09 46 snoitavresbO 41.0 50.0 00.0 35.0 15.0 74.0 15.0 84.0 44.0 derauqs-RdetsujdA 49",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "References",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 51,
    "chunk_index": 75,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "erudecorP namkceH :ecnedfinocrevO fo serusaeM dna emuloV gnidarT :9 elbaT eht ,))3( ot )1( snoissergeR( snoitcasnart tekram kcots fo rebmun eht fo mhtiragol eht( emulov gnidart fo serusaem neewteb noitaler eht no stluser stneserp elbat sihT a(selbairavyrotanalpxelarevesdna)))9(ot)7(snoissergeR(revonrutfomhtiragolehtdna,))6(ot)4(snoissergeR(sesahcruptekramkcotsforebmunehtfomhtiragol elbairaveht(elbairavymmudredarttnarrawa,ecneirepxetnemtsevnitekramkcots,ega,)elamsirotsevniehtfi1eulavehtsekatelbairaveht(elbairavymmudredneg 1eulavehtsekatelbairaveht(ymmudksirhgiha,)1002lirpAlitnu7991yraunaJmorfdoirepemitehtniecnotsaeltastnarrawsedartrotsevniehtfi1eulavehtsekat namkceH eht gnisu )keew rep sruoh ni noitamrofni ,eulav oiloftrop kcots ylhtnom naem fo mhtiragol eht ,)ksir hgih sa ygetarts tnemtsevni reh sefiissalc rotsevni eht fi ;%01taecnacfiingissetacidni*.sesehtnerapnierascitsitatstfoeulavetulosbA.)ecnedfinocrevO(elbairavecnedfinocrevoenoedulcniew,noissergerhcaenI.erudecorp .%1taecnacfiingissetacidni***;%5taecnacfiingissetacidni** )9( )8( )7( )6( )5( )4( )3( )2( )1( )revonruT(nl )revonruT(nl )revonruT(nl kcotS(nl kcotS(nl kcotS(nl kcotS(nl kcotS(nl kcotS(nl )sesahcrup )sesahcrup )sesahcrup )snoitcasnart )snoitcasnart )snoitcasnart atb tselov csim atb tselov csim atb tselov csim elbairavecnedfinocrevO 294.0 224.0 444.0- 781.0 340.0 712.0- 280.0 490.0- 254.0- )ymmud(redneG )56.0( )06.0( )94.0( )13.0( )70.0( )33.0( )31.0( )41.0( )36.0( 900.0- 210.0- 210.0- 700.0- 500.0- 900.0- 700.0- 600.0- 800.0- egA )57.0( )00.1( )37.0( )07.0( )44.0( )17.0( )76.0( )45.0( )56.0( 315.0 883.0 143.0 667.0 236.0 574.0 247.0 326.0 705.0 )ymmud(redarttnarraW **)02.2( *)56.1( )51.1( ***)26.3( ***)20.3( **)21.2( ***)52.3( ***)58.2( **)33.2( 283.0 414.0 342.0 613.0- 722.0- 620.0- 563.0- 962.0- 651.0- )ymmud(ksirhgiH )99.0( )50.1( )65.0( )11.1( )27.0( )80.0( )31.1( )27.0( )84.0( 732.0- 761.0- 980.0- 805.0 435.0 635.0 725.0 465.0 065.0 )eulavoiloftroP(nl ***)20.3( *)59.1( )48.0( ***)33.7( ***)85.7( ***)07.6( ***)96.7( ***)82.6( ***)44.6( 330.0- 810.0- 910.0- 700.0- 100.0- 300.0- 810.0- 010.0- 410.0- noitamrofnI *)68.1( )50.1( )79.0( )15.0( )60.0( )42.0( )71.1( )27.0( )00.1( 607.0 390.0 753.0 155.0 311.0- 553.0- 284.0 511.0- 493.0- ecnedfinocrevO **)32.2( )46.0( )26.0( **)72.2( )20.1( )98.0( *)87.1( )49.0( )29.0( 351.1 019.0 539.0 462.4- 256.3- 012.3- 806.2- 054.1- 958.0- tnatsnoC )23.0( )04.0( )33.0( ***)04.3( **)32.2( *)18.1( )78.0( )24.0( )42.0( noitauqenoitceleS 442.0 991.0 491.0 262.0 512.0 702.0 852.0 112.0 402.0 )ymmud(redneG )19.0( )47.0( )36.0( )79.0( )08.0( )76.0( )69.0( )87.0( )66.0( 000.0 100.0 100.0- 000.0 000.0 100.0- 000.0 000.0 100.0- egA )60.0( )31.0( )81.0( )70.0( )90.0( )12.0( )30.0( )70.0( )22.0( 200.0- 900.0- 010.0- 600.0- 010.0- 410.0- 300.0- 900.0- 900.0- ecneirepxE )11.0( )55.0( )55.0( )05.0( )27.0( )68.0( )02.0( )55.0( )15.0( 650.0 740.0 220.0- 350.0 250.0 710.0- 460.0 950.0 800.0- )ymmud(redarttnarraW )06.0( )94.0( )02.0( )75.0( )45.0( )61.0( )96.0( )26.0( )70.0( 851.0- 412.0- 590.0- 831.0- 191.0- 211.0- 311.0- 261.0- 070.0- )ymmud(ksirhgiH )22.1( )45.1( )46.0( )80.1( )14.1( )57.0( )98.0( )22.1( )84.0( 210.0- 620.0- 810.0- 220.0- 530.0- 220.0- 420.0- 830.0- 820.0- )eulavoiloftroP(nl )73.0( )57.0( )84.0( )66.0( )30.1( )65.0( )47.0( )11.1( )47.0( 446.1- 684.1- 416.1- 745.1- 393.1- 665.1- 135.1- 473.1- 035.1- tnatsnoC ***)49.3( ***)84.3( ***)03.3( ***)37.3( ***)82.3( ***)12.3( ***)96.3( ***)32.3( ***)41.3( 260.0- 941.0- 561.0- 124.1 170.1 541.1 587.0 961.0 812.0 ohR )40.0( )61.0( )61.0( ***)14.3( )75.1( )16.1( )95.0( )90.0( )11.0( 721.0 541.0 091.0 634.0 072.0 232.0 381.0 210.0- 790.0- amgiS )72.1( )80.1( )71.1( *)19.1( )07.0( )65.0( )72.0( )40.0( )72.0( 4291 2191 8781 6291 4191 9781 7291 5191 0881 snoitavresbO 521 311 97 721 511 08 821 611 18 derosneC 50",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "References",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 51,
    "chunk_index": 76,
    "word_count": 446,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  },
  {
    "text": "ohR )40.0( )61.0( )61.0( ***)14.3( )75.1( )16.1( )95.0( )90.0( )11.0( 721.0 541.0 091.0 634.0 072.0 232.0 381.0 210.0- 790.0- amgiS )72.1( )80.1( )71.1( *)19.1( )07.0( )65.0( )72.0( )40.0( )72.0( 4291 2191 8781 6291 4191 9781 7291 5191 0881 snoitavresbO 521 311 97 721 511 08 821 611 18 derosneC 50 Figure 1: Stock Market Forecasts With Confidence Intervals Toelicitstockmarketforecastsforeachtimeseries,weaskinvestorstostatemedianaswellasupperand lower bound of a 90 % confidence interval. In the paper, we use the following expressions: lower bound: x(0.05), median: x(0.50), upper bound: x(0.95) (see also Figure 1). 116 5% 112 x(0.95) 108 x(0.50) 90% 104 x(0.05) 100 5% 96 0 5 10 15 20 25 30 35 40 51",
    "title": "Overconfidence and Trading Volume",
    "source_type": "pdf",
    "document_id": "0e2d12adcef6",
    "source_file": "Overconfidence and Trading Volume.pdf",
    "section": "References",
    "page_number": 51,
    "page_range": "p.51",
    "total_pages": 51,
    "chunk_index": 77,
    "word_count": 109,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.51)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070326151147+01'00'",
    "duration": null
  }
]