[
  {
    "text": "Retail trading: an analysis of global trends and drivers Pedro Gurrola-Perez, Kaitao Lin, Bill Speth September 2022",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 43,
    "chunk_index": 0,
    "word_count": 17,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "Executive Summary ................................................................................................................................. 3 1. Introduction ..................................................................................................................................... 5 2. Defining and identifying retail investors ......................................................................................... 7 2.1. Textual analysis of the definitions............................................................................................. 8 2.2. Identifying retail trades ...........................................................................................................10 3. Trends in retail participation .........................................................................................................14 3.1. Evolution of retail trading in equity cash and derivative markets ..........................................17 4. Research approach ........................................................................................................................21 5. Market conditions and retail trading .............................................................................................22 6. The impact of Covid-19 ..................................................................................................................26 6.1. Evidence of a structural break.................................................................................................27 7. The behaviour of retail participants ..............................................................................................28 7.1. Average value of retail trades .................................................................................................28 7.2. Retail as net buyers in times of stress .....................................................................................30 8. Retail programmes and policy initiatives ......................................................................................34 8.1. Retail policies and programmes and retail trading .................................................................37 9. Conclusions ....................................................................................................................................40 10. Annex: The WFE survey ................................................................................................................41 11. References ....................................................................................................................................43 2",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "Contents",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 43,
    "chunk_index": 1,
    "word_count": 122,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Contents (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "of retail participants ..............................................................................................28 7.1. Average value of retail trades .................................................................................................28 7.2. Retail as net buyers in times of stress .....................................................................................30 8. Retail programmes and policy initiatives ......................................................................................34 8.1. Retail policies and programmes and retail trading .................................................................37 9. Conclusions ....................................................................................................................................40 10. Annex: The WFE survey ................................................................................................................41 11. References ....................................................................................................................................43 2",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "Executive Summary",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 43,
    "chunk_index": 2,
    "word_count": 50,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Executive Summary (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "The participation of retail investors in the financial markets contributes to the well-functioning of those markets, improving liquidity and depth of the order book. Yet, it may increase volatility and must be complemented with strong investor protection policies. While some markets have seen a constant growth in retail participation in the last five or even ten years, the sharp increase that many markets observed during the Covid-19 pandemic highlighted a radical change in the forms of access to the market and in the profile and behaviour of the retail investors. In the light of these changes, in early 2021 the WFE conducted a survey among its members with the aim of capturing the trends in retail participation across jurisdictions. We gathered 34 responses from exchanges, covering developed, emerging, and frontier markets; and distributed across all regions. The survey also collected data, covering the period from January 2010 to September 2020, with the purpose of conducting an empirical study of the factors that correlate with the levels of retail participation across markets. This report presents both the qualitative outcomes of the survey and the results of the econometric analysis. The qualitative responses and case studies led to the following key findings: • Exchanges reported widely varying levels of retail participation in their equity markets, measured as the percentage of trading volume by retail with respect to total trading volume. However, some patterns emerged: while in Europe and in the Americas region the average was 31% and 13% respectively, the average in the Middle East and Asia Pacific regions was of 52% and 61% respectively, with some exchanges exceeding 80%. On the other hand, higher income countries tend to have a lower percentage of retail participation on average. • Half of the respondents have seen steady to growing retail participation in the past 5 and 10 years although in some cases such growth is in line with other segments, such as institutional investors, with the retail share of overall activity remaining steady. • Overall, retail activity increased during the Covid-19 pandemic. Exchanges cited easier access to markets; more opportunities to buy at lower prices; growing availability of research and data; and more free time to focus on trading during the lockdown as some of the main causes. • However, it is worth noting that there is no homogeneous definition of a retail investor across markets. The concept broadly refers to an individual trading in a personal account for his/her own benefit, but there are many nuances. In some jurisdictions the characterization and treatment of retail investors is defined by law or regulation. • Most exchanges distinguish between retail and other investor types through explicit identifiers on orders. The most common identification is through the exchange members, where orders are tagged as retail, although in some cases the exchange can identify the individual investor. In some cases, the distinction can only be done implicitly, through individual trade characteristics (e.g., trade quantity or value). • Most respondents are seeking to attract retail investors with a combination of initiatives, particularly with the development of educational programs and financial literacy initiatives; the launch of new products; the introduction of dedicated liquidity providers; and the establishment of special fee schemes. 3",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "Executive Summary",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 43,
    "chunk_index": 3,
    "word_count": 534,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Executive Summary (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "characteristics (e.g., trade quantity or value). • Most respondents are seeking to attract retail investors with a combination of initiatives, particularly with the development of educational programs and financial literacy initiatives; the launch of new products; the introduction of dedicated liquidity providers; and the establishment of special fee schemes. 3",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "Executive Summary",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 43,
    "chunk_index": 4,
    "word_count": 50,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Executive Summary (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "• Roughly half of exchanges noted that a key driver of retail growth was improved access to data and analysis. In particular, they acknowledged the impact of ease of access to trading via mobile phone applications offered by brokers. • Less than a third of exchanges reported discernible differences in the patterns of activity of retail participants compared to other types of traders. • A few respondents indicated a preference for retail to focus on trading products that provide diversified exposures (e.g., ETFs, ETNs, funds) or reduced risk (e.g., bonds). The econometric analysis examined the impact of different factors on the number of retail investors and their trading activity in the stock markets. The results of the cross-sectional analysis of the sample largely supported the findings of the qualitative analysis, and provided some additional insights: • Retail participants tend to react to market conditions: they trade more after observing high market returns and trade less after observing high market volatilities. There are more retail account openings when the stock market index increases. Such an increase is also observed after an increase in market volatility. • Retail investors tend to be net buyers in time of stress. In the markets analysed we observe net buying values increasing at the time when the local market index was decreasing. Such an asymmetry in retail buying and selling points to the loss aversion bias (i.e., investors placing more value on losses than on gains even when both are of the same magnitude). • Furthermore, the retail accounts growth rate and the number of trades per retail account increase with the country’s literacy score. This positive association suggests that education could facilitate participation in the financial markets. • The Covid-19 pandemic and the changes it brought increased the correlation between market conditions and retail trading. • We find that reducing trading fees, reducing the capital gain tax rate, providing broadcast materials, and improving access to research tools have been effective ways to attract retail participation in the stock market. 4",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "Executive Summary",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 43,
    "chunk_index": 5,
    "word_count": 335,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Executive Summary (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "pandemic and the changes it brought increased the correlation between market conditions and retail trading. • We find that reducing trading fees, reducing the capital gain tax rate, providing broadcast materials, and improving access to research tools have been effective ways to attract retail participation in the stock market. 4",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "Executive Summary",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 43,
    "chunk_index": 6,
    "word_count": 50,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Executive Summary (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "The direct participation of retail investors in the market has always played an important role in well- functioning markets. On the one hand, there is substantial academic evidence that retail participation may contribute positively to market liquidity and to the depth of the order book (Kaniel, Saar and Titman 2008), including during periods of market instability (Barrot, Kaniel and Sraer 2016). This follows from the observation that retail traders tend to sell when prices increase and tend to buy (or refrain from selling) when prices decrease.1 The WFE’s 2016 report (WFE 2016) on enhancing liquidity in emerging markets also noted the importance of developing a diversified investor base, comprising both retail and institutional investors, with different time horizons and investment perspectives, to ensure the health and vibrancy of financial markets. Retail participation can be beneficial to the economy. Retail participants can gain from diversifying their savings and from better opportunities to ensure above-inflation returns in the long run. Retail investment also brings additional liquidity to the market, especially for small and mid-cap stocks, bringing new and cheaper funding, freeing capital for investing in innovation and development. And innovation is a driver of economic growth. Retail trading can also have a positive effect on the volatility of stock returns (Foucault, Sraer and Thesmar 2011). There are also risks and cautionary tales about retail investment. Retail trading may increase correlated trading activity that could amplify systemic risk (Kumar and Lee 2006). And without minimum levels of financial literacy and education, retail investors may be easily driven into misleading investment strategies. If lacking adequate protection, investors may fall victims of financial scams. Given the benefits and risks involved, a balance must be struck so that the various trade-offs are resolved in a socially optimal outcome. And because of the different economic and social conditions, the adequate balance between retail and institutional participation will be different for different markets. It is therefore important to understand what drives retail trading and its evolution across jurisdictions. This was the purpose of the analysis that the WFE conducted in 2017, which focused on emerging markets and examined the effectiveness of various levers in promoting retail participation in those economies (WFE 2017). That study found, for example, that • Increases in interest rates have a strong negative influence on the breadth and depth of retail trading. In addition, GDP growth rates and retail participation are positively linked, with countries with higher GDP growth rates showing a greater level of retail trading. 1 There are some studies suggesting the opposite: that retail investors tend to buy when prices are increasing (for fear of missing out), but panic sell when prices drop (for fear of losing all). This is often attributed to inadequate knowledge and low levels of sophistication of the retail investors. See, for example, Hsieh et al. (2020) or Elkind et al. (2022). 5",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 43,
    "chunk_index": 7,
    "word_count": 476,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "buy when prices are increasing (for fear of missing out), but panic sell when prices drop (for fear of losing all). This is often attributed to inadequate knowledge and low levels of sophistication of the retail investors. See, for example, Hsieh et al. (2020) or Elkind et al. (2022). 5",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 43,
    "chunk_index": 8,
    "word_count": 50,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "• Reductions in exchange trading fees alone do not spur retail participation unless they are passed on and result in a reduced cost-to-trade for the retail investor. In the reverse, increases in cost-to- trade, such as clearing fees, do negatively impact the depth of retail activity. • There is a positive relationship between financial literacy programmes, such as trading games and training courses, and both breadth and depth of retail trading. • The existence of brokers who are willing and able to effectively service retail investors and contribute to broader literacy objectives is critical to support retail participation. In 2020, as the Covid-19 coronavirus spread, it became clear that patterns of retail trading were changing. First, as countries went into lockdown, many exchanges observed an increase in retail participation both in terms of traded volumes and in the number of retail accounts,2 suggesting that retail participants were not only trading more but also that new participants were entering the markets for the first time. On the other hand, technological developments have changed behaviours, for example, by facilitating the access the trading platforms via mobile phone. At the same time, the GameStop events3 highlighted the influence of social media in shaping retail investor behaviour and pointed to the need of enhancing investor protection.4 So, five years after the publication of the 2017 WFE report on retail investment in emerging markets, the impact of the pandemic and new technological and social developments make it clear that it is time to reassess the retail landscape and to extend the analysis beyond the emerging economies. This is the purpose of this paper. For this report, the WFE conducted a survey of its members to identify the driving factors of retail investment in the equity markets (mainly the cash markets, but also in equity derivatives and equity ETFs). The survey comprised a qualitative section, aimed at understanding how exchanges perceived and evaluated retail participation in their markets, and a quantitative questionnaire where we collected historical data with the objective of performing an empirical analysis to investigate the factors that correlate with, and potentially drive, retail participation. The data was collected between October 2020 and June 2021 and included monthly level data from January 2010 to September 2020 on the number, volume, and value of retail trades and the number of retail accounts. We gathered 34 responses from exchanges, covering developed, emerging, and frontier markets; and distributed across all regions. The list of respondents can be found in the Appendix. 2 As we will discuss in Section 2.2, individual retail accounts often sit with the broker. 3 In January 2021, the price of the American video game retailer GameStop (NYSE: GME) and of other stocks skyrocketed as individual users of an Internet forum on the social news website Reddit massively went buying them, causing major losses to some hedge funds and short sellers. On January 28, the app-based brokerage service Robinhood halted the buying of GameStop and other securities, citing their inability to post sufficient collateral at clearing houses to execute their clients' orders. For a description and assessment of these events, see the SEC report (https://www.sec.gov/files/staff-report-equity-options-market-struction-conditions-early- 2021.pdf) 4 It is worthwhile distinguishing between direct access and intermediated access (see Section 2.2) as the risk measures in the latter reside with the broker. 6",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 43,
    "chunk_index": 9,
    "word_count": 548,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "sufficient collateral at clearing houses to execute their clients' orders. For a description and assessment of these events, see the SEC report (https://www.sec.gov/files/staff-report-equity-options-market-struction-conditions-early- 2021.pdf) 4 It is worthwhile distinguishing between direct access and intermediated access (see Section 2.2) as the risk measures in the latter reside with the broker. 6",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "1. Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 43,
    "chunk_index": 10,
    "word_count": 50,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "The report is organised as follows: Section 2 discusses the differences in the definition of a retail participant across jurisdictions. Section 3 analyses the recent trends in retail investment and discusses its potential drivers. In Section 4 we present the methodology and the data used for the quantitative analysis In Section 5 we examine the impact of different market factors in retail participation. In Section 6 we document and analyse the impact of Covid-19. Section 7 discusses the characteristics of retail trading and examines the buying trend observed during periods of stress. Section 8 discusses some of the initiatives that exchanges have implemented to increase retail trading and analyses the impact of these and other policy initiatives in the last years. In Section 9 we conclude. 2. Defining and identifying retail investors While the concept of a “retail” investor is generally understood as an individual trading in a personal account for his/her own benefit, the precise legal or operational definition, often enshrined in law, varies across jurisdictions. Definitions can differ in the segment of the population they aim to capture, as well as on their degree of precision. While the sets captured by these definitions largely overlap, they are not necessarily identical, a limitation one should bear in mind when making cross-country comparisons. One way of classifying the different approaches to defining retail investment is to identify the underlying question that the definition implicitly tries to answer. Using this criterion, we show in Table 1 the frequency at which different types of definitions occurred in the survey. Table 1. Frequency of different types of definitions of what constitutes a “retail” investor Basis for a definition Example Frequency Who the investor is “a physical (or a natural) person with individual ID” 37% Is the investor agent or “An individual who buys and sells securities on his own 19% principal? behalf” How does the investor access “one who buys and sells shares through their broker” 15% the market? What the investor is not? \"anyone other than an institutional investor\" 12% What is the investor’s “An investor who places small orders by size” or “less than 10% volume/size of trading? 390 equity orders per day on average” What is the professional status? \"a non-professional investor\" 4% What is the investor’s wealth? “Any investor with an investable net worth of less than 1 2% million USD.” Their role in the economy “individuals or groups of individuals as producers of goods 2% and nonfinancial services for exclusively own final use” The table shows the frequency of different types of definitions observed in the WFE Survey. There were 34 responses. The sum does not add to 100% due to rounding. 7",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "1. Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 43,
    "chunk_index": 11,
    "word_count": 445,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "the economy “individuals or groups of individuals as producers of goods 2% and nonfinancial services for exclusively own final use” The table shows the frequency of different types of definitions observed in the WFE Survey. There were 34 responses. The sum does not add to 100% due to rounding. 7",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "1. Introduction",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 43,
    "chunk_index": 12,
    "word_count": 50,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "The classification proposed in Table 1 offers a heuristic approach to whether there are any identifiable patterns among the diversity of approaches used to define retail investment. In addition, we can also apply textual analysis tools to identify, for example, the concepts that are used more frequently or whether any characteristics can be associated with specific regions. First, we can identify the words most frequently used across definitions. To each definition provided in the survey, we apply the Part of Speech (POS) algorithm to classify the words into noun, verb, adjective, or adverb. With the corresponding tag classification, we then lemmatise the word back to its original form. We also remove meaningless stop words and the words “retail” and “participant”. The word cloud in Figure 1 depicts the most frequent words and terms used in the definitions, ranked by the Term Frequency-Inverse Document Frequency Measure (TF-IDF).5 The fact that “person” and “individual” are some of the most frequent words confirms the overlapping usage of these terms in a large number of definitions. Figure 1. Word cloud of retail investor definitions The figure shows the word cloud based on the retail definitions, according to the frequency of the terms used. Another interesting question is whether there are similarities which could naturally lead to clusters or groups of definitions. One way to do this is to perform a Latent Semantic Analysis (LSA) to detect terms that are closely related to each other. Relying on the transformed definition and terms, we first categorise the definitions according to the terms they use. The LSA then measures the similarity of the words by vectorising the words in the definition and converting them into a matrix, extracting the 𝐷 5 𝑇𝐹−𝐼𝐷𝐹 =(1+log𝑓 )×log where 𝑓 is the frequency of term t in definition d, D is the total 𝑡,𝑑 𝑡,𝑑 𝑑𝑓𝑡 𝑡,𝑑 number of definitions, and 𝑑𝑓 is the number of definitions in which the term t appears. 𝑡 8",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "2.1. Textual analysis of the definitions",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 43,
    "chunk_index": 13,
    "word_count": 324,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.1. Textual analysis of the definitions (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "and converting them into a matrix, extracting the 𝐷 5 𝑇𝐹−𝐼𝐷𝐹 =(1+log𝑓 )×log where 𝑓 is the frequency of term t in definition d, D is the total 𝑡,𝑑 𝑡,𝑑 𝑑𝑓𝑡 𝑡,𝑑 number of definitions, and 𝑑𝑓 is the number of definitions in which the term t appears. 𝑡 8 principal components using the Single Value Decomposition (SVD), and measuring the relationship based on the first two principal components. Figure 2 plots the result of applying a LSA to the definitions. Figure 2. Latent Semantic Analysis (LSA) The figure shows the clustering of words used in the definition of retail participant according to similarity, based on the LSA measure. Source: WFE survey. Confirming the observations in Table 1, we see that words used in the retail definitions are roughly clustered in two groups. The first group of words characterises “who the investor is,” such as “individual,” “client,” “account,” “trade,” and “service.” The second group of words indicates “how they access the market” or “by what they are not,” such as “fund,” “company,” “institution,” and “bank.” While the LSA can group words according to their relationship in the definitions, a Latent Dirichlet Allocation (LDA) can assign probabilities to the words according to the definition topic and associate an exchange’s response to the topic. Table 2 summarises the output of the LDA analysis. The first way to define a retail trader (topic 1-who the investors is) relies on the words “account client trading person natural” and the second way (topic 2-how the investor accesses the market/ by what the investor is not) relies on the words “security company fund client market.” The result also shows that slightly more than half (56%) of the exchanges’ retail definition fall into topic 1. Across jurisdictions, 9",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "2.1. Textual analysis of the definitions",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 43,
    "chunk_index": 14,
    "word_count": 291,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.1. Textual analysis of the definitions (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "person natural” and the second way (topic 2-how the investor accesses the market/ by what the investor is not) relies on the words “security company fund client market.” The result also shows that slightly more than half (56%) of the exchanges’ retail definition fall into topic 1. Across jurisdictions, 9",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "2.1. Textual analysis of the definitions",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 43,
    "chunk_index": 15,
    "word_count": 50,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.1. Textual analysis of the definitions (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "we observe that two-thirds of exchanges in the APAC and Americas region use the definition topic 1, while exchanges in the EMEA region marginally prefer topic 2.6 From a methodological perspective, a single, clear, and uniform identification metric is a prerequisite to ensure comparability and to avoid any ambiguity that would leave research findings, insights, and conclusions questionable or of limited value. The heterogeneity of definitions and of identification approaches contribute to complexity and impair comparability. Table 2. Latent Dirichlet Allocation Topic Region Count Topic words 1 APAC 8 account client trading person natural 1 Americas 4 account client trading person natural 1 EMEA 7 account client trading person natural 2 APAC 4 security company fund client market 2 Americas 2 security company fund client market 2 EMEA 9 security company fund client market Topic 1 refers to answering the question “who the investor is”. Topic 2 refers to answering the questions “How the investor accesses the market or What the investor is not”. Based on responses to WFE survey. 2.2. Identifying retail trades The survey also investigated how exchanges identify retail orders, bearing in mind that, in general, retail investors do not have direct access to the exchange, but can only access through an intermediary (a broker). The identification can happen in different ways and with different granularities: • The exchange can identify individual investors. In some cases, exchanges can identify a retail investor directly. For example, when opening an account, an investor is required to provide personal information (ID number and tax report) and this information is available to the exchange, either directly or through the broker. The Dalian Commodity Exchange, for example, reports that, to open an account, the investor must submit their permanent identity card or passport as identification documents. At B3- Brasil Bolsa Balcão, there is a legal requirement to trace security ownership down to the individual level (through the Individual Taxpayer Registration Number), so not only the account is identified but the information goes all the way to individual trades. The model is 100% vertical: clearing, settlement and central depository at the final beneficial owner level. Some exchanges offer a separate access point dedicated to retail investors, where the investor must self-identify as retail if he wants to benefit from approved retail programs, such as sub-penny fills, queuing priority, or fee discounts (Box 1). 6 This could in part reflect different regulatory regimes. For example, in the EU, retail investors do not have direct access and require an intermediary – therefore the trading activity becomes the prevailing characteristic. 10",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "2.1. Textual analysis of the definitions",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 43,
    "chunk_index": 16,
    "word_count": 425,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.1. Textual analysis of the definitions (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "from approved retail programs, such as sub-penny fills, queuing priority, or fee discounts (Box 1). 6 This could in part reflect different regulatory regimes. For example, in the EU, retail investors do not have direct access and require an intermediary – therefore the trading activity becomes the prevailing characteristic. 10",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "2.1. Textual analysis of the definitions",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 43,
    "chunk_index": 17,
    "word_count": 50,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.1. Textual analysis of the definitions (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "• The exchange identifies retail orders through the broker. In many cases, brokers label and register some of their clients as “retail”. In such cases, it is the broker’s definition of retail that applies (see Box 2), but there is often no mandate for them to share the investment profile of their clients with the exchanges. The order submitted by the member of the exchange to the trading platform bears only a trading code, which can correspond to “retail”, but the profile of the investor behind the trading code is only known to the member. In the case of Deutsche Börse Group, for example, trading participants may flag orders that are generated by private investors to get access to special fee offerings and orders generated within the framework of Robo-Advisory. However, this feature does not reflect the full scope of retail flow as it is only used by a few trading participants, who take the opportunity to offer this service to their retail clients. • At some stage of the post-trade process. In other cases, the identification may happen at a later stage of the trade lifecycle, when the investor is required to identify himself to operate with an individual account at the Central Securities Depository. • Implicitly, through trade characteristics. Some exchanges rely on individual trade characteristics (e.g., trade quantity, trade value, and originating broker) to identify these trades as retail. One caveat to keep in mind is that order sizes have reduced due to routing which (if no retail indicator is present) may give the impression activity is retail flow – which may not reflect the reality. Most of the exchanges in the survey (88%, 30/34) confirmed that they identify retail trades and distinguish them from institutional investor trades. The most common identification is through the exchange members, where orders are tagged as retail. In some cases, identification can be both explicit and implicit;7 as shown in Figure 3. Figure 3. Identifying retail trading at the exchanges The figure shows the frequency of approaches reported by exchanges to identify retail trading. The category ‘None’ corresponds to exchanges that did not have a program to actively identify retail trades. Source: WFE survey. 7 For identification of retail trades in the case of U.S. see https://www.nasdaq.com/articles/who-counts-as-a- retail-investor-2020-12-17 and https://www.nasdaq.com/articles/a-new-way-to-look-at-retail-trading-trends 11",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "2.1. Textual analysis of the definitions",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 43,
    "chunk_index": 18,
    "word_count": 380,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.1. Textual analysis of the definitions (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "figure shows the frequency of approaches reported by exchanges to identify retail trading. The category ‘None’ corresponds to exchanges that did not have a program to actively identify retail trades. Source: WFE survey. 7 For identification of retail trades in the case of U.S. see https://www.nasdaq.com/articles/who-counts-as-a- retail-investor-2020-12-17 and https://www.nasdaq.com/articles/a-new-way-to-look-at-retail-trading-trends 11",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "2.1. Textual analysis of the definitions",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 43,
    "chunk_index": 19,
    "word_count": 50,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.1. Textual analysis of the definitions (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "Box 1. U.S. exchanges retail programs Although the majority of U.S. retail flow is routed to and executed by wholesalers and executed off exchange, there are retail programs operated by exchanges. However, exchange programs remain relatively small, as they must remain open to all, so lack the benefits of bilateral customer pricing arrangements. Below are three examples of specific programs or access points offered by exchanges and dedicated to retail investors. To benefit from the advantages offered by the retail program, the investor must self-identify as retail. NYSE Retail Liquidity Program (RLP) offers retail brokers (“Retail Member Organizations”) the opportunity to receive price improvement on retail orders across NYSE & Arca platforms. The program’s open and fair-access model means that any retail broker can seek consistent liquidity inside the bid-offer spread. Cboe Retail Priority seeks to enhance execution quality for individual investors who trade U.S. equities on the Cboe EDGX Exchange (EDGX). Retail Priority offers a distinct allocation model, which differs from the traditional time-based allocation model used by most U.S. equities markets that allocate trades to orders that arrive first in time at each price point (i.e., time priority). The Retail Priority model focuses on improving execution quality and trading outcomes for individual investors, and the firms facilitating their orders, by reducing their time to execution. Under the mechanism, individual investors' displayed limit orders will post at the front of the order queue for same-priced orders submitted to Cboe EDGX. Nasdaq Comprehensive Retail Infrastructure Solutions Platform (CRISP) is a complementary model to access and aggregate price-improving liquidity allowing trading to benefit from transparent prices. Nasdaq BX’s Retail Price Improvement (RPI) program allows retail investors to interact with pools of non-displayed liquidity with price improvement opportunities. In addition, Nasdaq’s proprietary routing platform determines optimal order handling for retail investors by acting as an agnostic platform to access price-improvement by partnering with top liquidity providers. In addition, the U.S. exchanges retail programs give retail “liquidity taker” orders price improvement versus the public NBBO. 12",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "2.1. Textual analysis of the definitions",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 43,
    "chunk_index": 20,
    "word_count": 333,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.1. Textual analysis of the definitions (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "price improvement opportunities. In addition, Nasdaq’s proprietary routing platform determines optimal order handling for retail investors by acting as an agnostic platform to access price-improvement by partnering with top liquidity providers. In addition, the U.S. exchanges retail programs give retail “liquidity taker” orders price improvement versus the public NBBO. 12",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "2.1. Textual analysis of the definitions",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 43,
    "chunk_index": 21,
    "word_count": 50,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.1. Textual analysis of the definitions (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "Box 2. Retail from a broker’s perspective TD Ameritrade (U.S.) TD Ameritrade - one of the largest retail brokers for listed options in the US - offers electronic access to a wide range of financial assets that include stocks, options, ETFs and mutual funds, fixed income, and many others. Over 95% of TD’s retail accounts are “self-directed;” i.e., trading decisions are made by the account owner. TD’s retail option trading is concentrated in individual stocks, over 80%, while options on ETFs comprise about 10%-12%. While TD Ameritrade has seen steady growth of self-directed retail accounts in the past ten years, the Covid-19 pandemic brought a surge of new retail activity to US options markets. The TD Ameritrade representative we interviewed sees declining transaction fees, advances in electronic trading platforms and trade analytics, access to an ever-expanding array of educational and strategy resources, and simply more time to focus on trading during lockdowns as the key drivers of growth. Notably, the level of retail activity at TD has only slightly declined post-pandemic. Demand for education, trade ideas and research has grown along with the rise in retail options trading. TD uses multiple channels to deliver a wide array of educational material targeted to retail investors, including interactive and media content delivered through their own TD Ameritrade Network, which had 25 million views in 2021. The TD Ameritrade representative observed that what motivates retail investors changes with time and a growing level of sophistication. Less experienced retail traders tend to focus on broker fees and other direct costs and often select the lowest-cost broker. Direct fees become less important as retail traders gain experience. More sophisticated retail investors tend to value the quality and ease of use of a broker’s trading platform, execution quality, and education over “headline costs.” Yingda Securities (China) We also interviewed representatives from Yingda Securities, a broker in China, to share their insights on retail trading in the region. Yingda is a broker established by the State Grid Corporation of China, specializing in the electricity and energy sector. When identifying and classifying retail investors, Yingda relies on the investors’ year-end total asset value, financial asset value, and experience in investment. With the growth in wealth, investment experience, or related working experience, the retail investor could be classified as a “professional” investor. Combining the classification of different types of retail traders with the individual’s capability to assume risk, Yingda alerts the investors when their investment is riskier than the pre- determined level. While retail participation has been relatively high in China, Yingda observed no significant changes in retail trading activity in the past decade and since the onset of the Covid-19 pandemic. Moreover, Yingda also commented that they had seen increasing demand for financial products. Yingda cited the slowdown in the business cycle, national and international unstable financial environment, relatively volatile stock market, and the investors’ limited capability to assume risks as the key factors deterring retail participation. To attract retail investors, Yingda has provided educational materials and implemented a special fee structure. For instance, they established a research unit, enhanced analysis and research on the 13",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "2.1. Textual analysis of the definitions",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 43,
    "chunk_index": 22,
    "word_count": 518,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.1. Textual analysis of the definitions (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "financial environment, relatively volatile stock market, and the investors’ limited capability to assume risks as the key factors deterring retail participation. To attract retail investors, Yingda has provided educational materials and implemented a special fee structure. For instance, they established a research unit, enhanced analysis and research on the 13",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "2.1. Textual analysis of the definitions",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 43,
    "chunk_index": 23,
    "word_count": 50,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.1. Textual analysis of the definitions (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "macroeconomy, regional economy, and industry sectors. The research outputs were shared with investors. In the same period, Yingda saw 8200 new basic account openings and 140 new margin account openings. These figures corresponded to a year-to-year growth of 300% and 4%, respectively. When commenting on the trading behaviours, Yingda observed that retail investors behaved differently from institutional traders. More specifically, retail investors intend to overly analyse publicly available data and news information, hoping to gain unique insights. In addition, due to the lack of funds, retail investors also tend to under-diversify---betting on one or two small stocks. Yingda also observed some herding behaviour from the retail traders, similar to the GameStop events. 3. Trends in retail participation Differences in the definition of a retail participant imply that one should be careful when comparing absolute levels of retail participation across markets. Nevertheless, it may still be possible to derive some broad conclusions and to analyse general trends in retail participation, especially since the definitions, although different, still largely overlap. Even with the above caveat in mind, it is evident that the levels of retail participation in equity markets vary significantly across jurisdictions. While some exchanges, such as the Shenzhen Stock Exchange, Dhaka Stock Exchange, Saudi Stock Exchange (Tadawul) or Taipei Exchange reported a high retail share of volume trading (around 80%), half of the respondents (53%) reported that retail accounted less than 50% of their overall volumes (Figure 4. A). Looking at the diversity in the percentages of retail participation, one question is whether there may be any regional, economic, or demographic patterns we can identify. Comparing across regions, for example, we see that the higher percentages of retail participation were reported in Middle-East and Asia-Pacific, but these regions also showed a greater dispersion in the reported percentages. Europe, the Americas, and Africa reported much lower percentages of retail activity (Figure 5.A). If we group exchanges according to the income level of their country we find that, on average, in higher income countries retail volumes tend to represent a lower share of the total volume traded, but there is a wide variation within any of the three income groups (Figure 5.B). Finally, although a few exchanges reported a larger participation of young people in the retail segment, overall, there seems to be no consistent relation between the median age of the population and the levels of retail participation, with countries like Nigeria and Tanzania, whose population is very young (around 18 years on average) having less than a 30% retail share of total volumes, just as it happens with countries with older populations like Japan (48.4 years) and Germany (45.7 years) (Figure 4.B). Moreover, if we look to a wider set of data, it is even clearer that other factors, including cultural, also play a role. Within the OECD countries, for example, even though these countries share common 14",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "2.1. Textual analysis of the definitions",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 43,
    "chunk_index": 24,
    "word_count": 478,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.1. Textual analysis of the definitions (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "countries with older populations like Japan (48.4 years) and Germany (45.7 years) (Figure 4.B). Moreover, if we look to a wider set of data, it is even clearer that other factors, including cultural, also play a role. Within the OECD countries, for example, even though these countries share common 14 political and economic traits,8 there is a substantial variation in the levels of households’ direct stock market participation, with Nordic and Baltic markets ranking highly (Figure 6). While in this study we focus on the equity markets, it is worth noting that the percentage of total volumes corresponding to retail participation also vary across assets classes, with bonds usually on the lower end. This lower participation rate in the fixed income market is probably due to its higher minimum trading size, which acts as a barrier to entry for retail investment. For example, in the survey, the Kazakhstan Stock Exchange reported the following percentages of retail investment, as of October 2020: 53.2% in stocks; 0.02% in government securities; 0.8% in corporate bonds; 62.5% for investment fund securities and 1.1% for derivatives. Figure 4. Share of total trading volumes corresponding to retail trading in equity in 2020 A: Distribution of retail share B: Retail share and median age Panel A shows frequency distribution of retail share across respondents. Panel B plots the share of retail volume against the estimates for 2020 of the median age of the country’s population. Source: WFE Survey and United Nations World Population Prospects 2019 (https://population.un.org/wpp/Download/Standard/Population/) 8 The Organization for Economic Co-operation and Development (OECD) is an organization with 38 member countries, which are committed to democracy and market economy. The majority are high income economies. 15",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "2.1. Textual analysis of the definitions",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 43,
    "chunk_index": 25,
    "word_count": 280,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.1. Textual analysis of the definitions (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "of the median age of the country’s population. Source: WFE Survey and United Nations World Population Prospects 2019 (https://population.un.org/wpp/Download/Standard/Population/) 8 The Organization for Economic Co-operation and Development (OECD) is an organization with 38 member countries, which are committed to democracy and market economy. The majority are high income economies. 15 Figure 5. Distribution of the percentages of retail participation in equity products in 2020 A. By region B: By country’s income level Panel A shows exchanges that responded to the survey according to the percentage of volumes attributable to direct retail accounts, grouped per regions. Average values are: Africa 27%; the Americas 13%; APAC 52%; Europe 31%; and Middle-East 61%, In Panel B, the same set is grouped according to the World Bank classification of countries by their income: High Income (HI) , Upper Middle Income (UMI), and Lower Middle Income (LMI). The horizontal bars mark the average values: 48% for Lower Middle Income, 45% for Upper Middle Income, and 37% for High Income. Source: WFE survey. Figure 6: Shares and other equity as percentage of household financial assets Percentage of total household financial assets corresponding to shares and other equity. Data from OECD countries from 2021 (or latest available). Source OECD (2022), Household financial assets (indicator). doi: 10.1787/7519b9dc-en (Accessed on 20 July 2022). 16",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "2.1. Textual analysis of the definitions",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 43,
    "chunk_index": 26,
    "word_count": 215,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.1. Textual analysis of the definitions (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "WFE survey. Figure 6: Shares and other equity as percentage of household financial assets Percentage of total household financial assets corresponding to shares and other equity. Data from OECD countries from 2021 (or latest available). Source OECD (2022), Household financial assets (indicator). doi: 10.1787/7519b9dc-en (Accessed on 20 July 2022). 16",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "3.1. Evolution of retail trading in equity cash and derivative markets",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 43,
    "chunk_index": 27,
    "word_count": 50,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Evolution of retail trading in equity cash and derivative markets (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "The evolution of retail trading is expected to differ across jurisdictions, as different markets have different backgrounds and are at different stages of development. In our survey, half of the exchanges (17/34) reported a steady growth in retail participation in the five years preceding the survey (2016- 2020). In some cases, however, the exchanges stated that the retail growth was in line with other segments (e.g., institutional investors) and the share of retail out of the overall market activity remaining steady. Hence, to capture the evolution of retail trading over time, we look at the values and volumes of retail trading as well as the number of retail accounts. While historical volumes and trading values provide information on the absolute changes in retail trading, they need to be compared with the overall growth of the market to distinguish whether the changes observed are specific to retail or just part of an overall trend. On the other hand, an increase in the number of retail accounts, both in absolute terms and relative to the total number of accounts, could be a direct indicator of greater participation of retail investors and of a shift in the balance between institutional and retail investors. In Figure 7, we present some examples to illustrate the variety of trends observed over the recent years. For each of these exchanges, to capture the relative change in retail trading, we plot the share of trading value (market share) and the volumes directly attributed to retail accounts; and the retail share of the total number of accounts. We observe that, in all three examples, the number of accounts has been increasing in the last years and the retail share of accounts has remain very high (above 90%). In the cases of SET and B3, the share of retail accounts has also been growing. However, when we look at retail volumes and the market share value, we see different patterns. Finally, it is worth noting that in all these markets we observe a sharp increase in retail share of trading value and in retail trading volumes in the first quarter of 2020, coinciding with the first months of the Covid-19 pandemic. We will analyse this in more detail in Section 6 below. 17",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "3.1. Evolution of retail trading in equity cash and derivative markets",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 43,
    "chunk_index": 28,
    "word_count": 373,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Evolution of retail trading in equity cash and derivative markets (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "worth noting that in all these markets we observe a sharp increase in retail share of trading value and in retail trading volumes in the first quarter of 2020, coinciding with the first months of the Covid-19 pandemic. We will analyse this in more detail in Section 6 below. 17 Figure 7: Different patterns in the evolution of retail trading in equities Stock Exchange of Thailand (SET) Borsa Istanbul (BIST) B3- Brasil Bolsa Balcão The figure show three examples of the evolution of retail trading in recent years. In most cases, when data is available, the graphs capture the 10 years from January 2010 to September 2020. The left graphs show the retail volume traded and the retail market share of total trading value. The graphs on the right show the total number of retail accounts and the share of retail accounts vs total number of accounts. Source: WFE Survey and WFE Database 18 Retail participation in equity derivatives Information on retail participation in equity derivatives markets was more limited and, while the data from some of the reporting exchanges suggests a positive trend in retail participation in the period considered (from January 2017 to September 2020), especially in index futures and options (Figure 8), this was not the case for single stock derivatives. Figure 8: Evolution of direct retail trading in equity derivatives B3- Brasil Bolsa Balcão Taiwan Futures Exchange (TAIFEX) The figure presents two examples of the evolution of retail trading in equity derivatives. The plots show the monthly number of contracts traded in equity futures and options corresponding to direct retail accounts in B3- Brasil Bolsa Balcão and in the Taiwan Futures Exchange (TAIFEX). The period considered is from January 2017 to September 2020. Source: WFE Survey 19",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "3.1. Evolution of retail trading in equity cash and derivative markets",
    "page_number": 18,
    "page_range": "p.18-19",
    "total_pages": 43,
    "chunk_index": 29,
    "word_count": 291,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Evolution of retail trading in equity cash and derivative markets (p.18-19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "retail trading in equity derivatives. The plots show the monthly number of contracts traded in equity futures and options corresponding to direct retail accounts in B3- Brasil Bolsa Balcão and in the Taiwan Futures Exchange (TAIFEX). The period considered is from January 2017 to September 2020. Source: WFE Survey 19 Retail participation in equity ETFs In the case of equity ETFs, there were a limited number of responses to the survey, as not all exchanges offer these products. However, the responses coincide in showing significant increases in the value of retail trading during 2020. For instance, from February to March 2020 the value of ETFs traded by retail investors increase by 286% in B3 and by 126% in Japan Exchange Group (JPX). On the other hand, Borsa Istanbul experienced a monthly increase but at a later stage: 126% and 160% in July and August, respectively (Figure 9). Figure 9. ETF value traded through EOB B3- Brasil Bolsa Balcão Borsa Istanbul (BIST) JPX The figure shows three examples of monthly value traded in ETFs through electronic order books (EOB) corresponding to direct retail accounts.The period considered is from January 2017 to September 2020 and the examples correspond to B3- Brasil Bolsa Balcão, Borsa Istanbul (BIST), and Japan Exchange Group (JPX). Numbers are reported in local currency. Source: WFE Survey Drivers of retail participation When asked about the main drivers for retail participation, most exchanges in the survey included access to data and research as a main driver, followed by changes in the regulatory and market structures (Figure 10). Figure 10. Drivers promoting growth of retail participation Source: WFE Survey 20",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "3.1. Evolution of retail trading in equity cash and derivative markets",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 43,
    "chunk_index": 30,
    "word_count": 269,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Evolution of retail trading in equity cash and derivative markets (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "of retail participation When asked about the main drivers for retail participation, most exchanges in the survey included access to data and research as a main driver, followed by changes in the regulatory and market structures (Figure 10). Figure 10. Drivers promoting growth of retail participation Source: WFE Survey 20",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "3.1. Evolution of retail trading in equity cash and derivative markets",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 43,
    "chunk_index": 31,
    "word_count": 50,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Evolution of retail trading in equity cash and derivative markets (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "Box 3. Bolsa Mexicana de Valores (BMV) In Mexico, retail participants are defined as any investor with an investable net worth of less than 1 million US$. Since the exchange only deals with brokerage firms and it is not mandatory for these firms to share with the exchange the profile of their clients, the exchange can only provide a rough estimate of retail participation. In 2020, BMV estimated that around 1% of market volumes were retail and they were expecting to see this number increase to 3%-5% in the following years. BMV is currently in the process of identifying retail trades at the exchange. The low level of retail participation is particularly puzzling because Mexico has a young population and therefore a significant potential for retail investment to grow. The median age of the population is 29.5 years and there are 22.2 million people between 15 and 24 years old (United Nations, 2019). Moreover, since 2016, there has been no restriction for retail investors from trading in certain products, except for securities offered through restricted public offerings. Retail investors are not limited in the amount of trading they can do, although financial agents or brokers classify them according to investment profiles which may include risk limits. Taking into consideration the low percentage of the Mexican population that has an individual investor account, BMV is convinced that there is an opportunity to explore and take actions to grow the number of accounts. They acknowledge that retail participation will increase market depth, strengthen the secondary market, and is fundamental for future market growth. 4. Research approach In addition to the qualitative responses to the survey and case studies, we performed a quantitative analysis using data collected from participating member exchanges. The analysis aims to identify market conditions and policy initiatives that correlate with changes in the overall levels of retail participation or with its characteristics (i.e., whether they are net buyers or net sellers, or whether their average trade size changes). We will also examine the impact of Covid-19. For the empirical analysis, we consider different measures of retail participation, both in terms of depth (size of trading activity) and breath (number of participants). For the explanatory variables, we consider the factors we identified as likely to have an impact on levels of retail participation, including those factors identified in previous analyses as, for example, in (WFE 2017). The variables defined in Table 3 include retail participation measures, retail buying and selling activity measures, market condition measures, and dummy variables indicating retail policy implementations. The data was collected within the first quarter of 2021 and included monthly level data from January 2010 to September 2020 on the number, volume, and value of retail trades and the number of retail accounts. In addition, exchanges also provided information on the factors that we identified as likely to affect the levels of retail participation. 21",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "3.1. Evolution of retail trading in equity cash and derivative markets",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 43,
    "chunk_index": 32,
    "word_count": 480,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Evolution of retail trading in equity cash and derivative markets (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "of 2021 and included monthly level data from January 2010 to September 2020 on the number, volume, and value of retail trades and the number of retail accounts. In addition, exchanges also provided information on the factors that we identified as likely to affect the levels of retail participation. 21 Using this database, we conducted regression analyses to assess how the above factors correlated with the depth and breadth of retail activity. The data and analysis are specific to equity markets. 5. Market conditions and retail trading In the case of emerging markets, the (WFE 2017) analysis finds that increases in interest rates have a strong and negative influence on the breadth and depth of retail trading. In addition, GDP growth rates and retail participation are positively linked, with countries with higher GDP growth rates showing a higher level of retail trading. In this section, we extend such an analysis to the global setting and include other factors, such as the level of literacy scores and the employment rate in the jurisdiction. To analyse the retail trading under different market conditions, we run the following panel regression 𝑅𝑒𝑡𝑎𝑖𝑙 𝑃𝑎𝑟𝑡𝑖𝑐𝑖𝑝𝑎𝑡𝑖𝑜𝑛 = 𝛽′𝑀𝑎𝑟𝑘𝑒𝑡 𝐶𝑜𝑛𝑑𝑖𝑡𝑖𝑜𝑛 + 𝛽′𝑀𝑎𝑟𝑘𝑒𝑡 𝐶𝑜𝑛𝑑𝑖𝑡𝑖𝑜𝑛 +𝛼 +𝜀 𝑖,𝑡 1 𝑖,𝑡 2 𝑖,𝑡−1 𝑖 𝑖,𝑡 Where 𝑅𝑒𝑡𝑎𝑖𝑙 𝑃𝑎𝑟𝑡𝑖𝑐𝑖𝑝𝑎𝑡𝑖𝑜𝑛 is the dependent variable, which can take different measures of retail trading activities listed in Panel A of the variable definition table (Table 3). 𝑀𝑎𝑟𝑘𝑒𝑡 𝐶𝑜𝑛𝑑𝑖𝑡𝑖𝑜𝑛 is the collection of the market condition measures listed in Panel B of Table 3. Subscript 𝑖 indicates the exchange, 𝑡 indicates the concurrent measure, and 𝑡−1 indicates the measure one period ahead (one lag). We also include exchange fixed effects, and the standard errors are clustered by exchanges. 22",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "3.1. Evolution of retail trading in equity cash and derivative markets",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 43,
    "chunk_index": 33,
    "word_count": 283,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Evolution of retail trading in equity cash and derivative markets (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "is the collection of the market condition measures listed in Panel B of Table 3. Subscript 𝑖 indicates the exchange, 𝑡 indicates the concurrent measure, and 𝑡−1 indicates the measure one period ahead (one lag). We also include exchange fixed effects, and the standard errors are clustered by exchanges. 22 Table 3. Variable definitions The variables are based on the data and information collected from the member survey, the WFE Statistics Portal, and Refinitiv Eikon Table 4 and Table 5 report the estimation results regarding both the breadth and the depth of retail trading. Regarding the breadth measures, in Table 4, we observe that there are more retail trading activities when the stock market index increases. On average, a 1 percentage point increase in market index return is associated with a 5.6 bps increase in the number of retail trades. Such an increase (e.g., in the proportion of retail accounts out of all accounts, the number of retail trades, and the number of trades per retail account) is also positively associated with the jurisdiction’s market size, measured by the trading value to GDP ratio. Intuitively, the more participation from investors, including the retail ones, the more import the financial market. Therefore, our results fit such a prediction. Furthermore, the growth rate of retail accounts and the number of trades per retail account increases with the literacy score. This positive association suggests that education could motivate participation in the 23",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "3.1. Evolution of retail trading in equity cash and derivative markets",
    "page_number": 23,
    "page_range": "p.23-24",
    "total_pages": 43,
    "chunk_index": 34,
    "word_count": 239,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Evolution of retail trading in equity cash and derivative markets (p.23-24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "investors, including the retail ones, the more import the financial market. Therefore, our results fit such a prediction. Furthermore, the growth rate of retail accounts and the number of trades per retail account increases with the literacy score. This positive association suggests that education could motivate participation in the 23 financial markets. Moving on to the one period lagged variables, we find that past GDP growth rate is negatively associated with the number of retail trades as a percentage of number of all trades in the market. This negative association suggestion that retail investors tend to be more actively after a slowdown in economic condition. Table 4. Market condition and retail participation (1) Moving to the depth of retail participation, we see in Table 5 that the coefficients of contemporaneous market index return are positive and significant for retail value traded, the proportion of retail value traded out of total market value traded, and value traded per retail account. A one percentage point increase in the market index return is associated with a 0.87% increase in retail value traded, a 4.1 bps increase in the proportion of retail value traded, and a 0.63% increase in value traded per retail account. In contrast, the estimated coefficients are not statically significant, although positive, for the retail trading volume measures. We caution that the value traded measures are positively correlated with the market return by construction, as the former is (the sum of) the product of price and traded volume. With the insignificant and positive coefficients shown in other trading activity measures, we 24",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "3.1. Evolution of retail trading in equity cash and derivative markets",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 43,
    "chunk_index": 35,
    "word_count": 261,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Evolution of retail trading in equity cash and derivative markets (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "for the retail trading volume measures. We caution that the value traded measures are positively correlated with the market return by construction, as the former is (the sum of) the product of price and traded volume. With the insignificant and positive coefficients shown in other trading activity measures, we 24 interpret the results as that the retail trading is weakly correlated with the market index return. More interestingly, the coefficient of lagged market index return is positive and significant all measures except for the proportion retail value traded. These results confirm that retail participants tend to follow the market trend---they trade more (less) after observing good (bad) market returns. Table 5. Market condition and retail participation (2) In addition to the lagged market returns, we also observe a negative and significant relationship between lag market volatility and various retail trading measures (e.g., value traded per retail account, the retail volume traded, and volume traded per retail account). The result points to the risk aversion of the retail traders, as they would hold back after seeing a volatile market. Overall, analysing the relationship between retail trading activities and stock market conditions, we find that retail participants tend to react to market conditions---they trade more after observing high market returns and trade less after observing high market volatilities. 25",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "3.1. Evolution of retail trading in equity cash and derivative markets",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 43,
    "chunk_index": 36,
    "word_count": 217,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Evolution of retail trading in equity cash and derivative markets (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "traders, as they would hold back after seeing a volatile market. Overall, analysing the relationship between retail trading activities and stock market conditions, we find that retail participants tend to react to market conditions---they trade more after observing high market returns and trade less after observing high market volatilities. 25",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "6. The impact of Covid-19",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 43,
    "chunk_index": 37,
    "word_count": 50,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "6. The impact of Covid-19 (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "The global disruptions from the Covid-19 pandemic in 2020 had a significant impact on the levels of retail participation in many markets. Around 65% (22/34) of exchanges in the survey reported an increase in retail participation during the first months of the Covid-19 pandemic, against 24% who did not observe any change. Figure 7 already showed a noticeable increase in retail value traded and volumes during March 2020. Cboe, for example, hit a record trading volume in the U.S. cash equities and multi-listed options markets during the second quarter of 2020, fuelled by a spike in retail trading activity (Figure 11). In Q3 2020, there was robust engagement from retail investors, which was accompanied by a decline in trading from institutional investors. In fact, growing retail participation helped drive a 26% year-over-year increase in U.S. equities trading for the quarter. Similarly, TMX in Canada reported a 64% increase in the monthly trading volumes in March 2020 (compared to an increase of 6% the same month in 2019) followed by a decrease of 4% and 5% in April and June 2020, respectively (Figure 11). In the Nasdaq First North market, a large number of first-time traders entered the market in March and April 2020, and retail investors were net buyers across all industries---a pattern that was not observed before and since. Similarly, the Australian Securities Exchange (ASX) saw a 100% increase in retail investor trading activity and a 340% increase in the number of retail trading accounts between late February and early March 2020.9 During this period, retail investors were net buyers of assets, aggressively purchasing large market capitalisation stocks, high risk highly leveraged stocks, and stocks exhibiting large price declines.10 It is also interesting to note that half of the exchanges in the survey observed a decrease in foreign participation or in domestic institutional participation during the same period. Exchanges attributed the increase in retail participation during Covid-19 to different factors: • macroeconomic conditions, including a decline in foreign institution investors participation, an increased risk of a depreciation of the local currency, and low interest rates • new technologies that make access to markets easier • lower prices and higher volatility offering opportunities to profit • people in lockdown having more free time to focus on trading and to benefit from research and data • User-friendly interfaces of mobile apps. Currently, almost all major banks and brokers have their own mobile application with a user-friendly interface that allows retail investors to compare securities • the influence of social media. 9 See the Australian Securities and Investments Commission (ASIC) report: Retail investor trading during COVID- 19 volatility. 10 Carole Comerton-Forde and Zhuo Zhong. “Retail traders take a punt.” Available at: https://sites.google.com/view/carole-comerton-forde/opinion-and-policy 26",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "6. The impact of Covid-19",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 43,
    "chunk_index": 38,
    "word_count": 451,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "6. The impact of Covid-19 (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "application with a user-friendly interface that allows retail investors to compare securities • the influence of social media. 9 See the Australian Securities and Investments Commission (ASIC) report: Retail investor trading during COVID- 19 volatility. 10 Carole Comerton-Forde and Zhuo Zhong. “Retail traders take a punt.” Available at: https://sites.google.com/view/carole-comerton-forde/opinion-and-policy 26",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "6. The impact of Covid-19",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 43,
    "chunk_index": 39,
    "word_count": 50,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "6. The impact of Covid-19 (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "Figure 11. Two examples of the impact of Covid-19 on retail trading in equities Cboe TMX The graphs show volume and value traded by retail investors in the last three years, from March 2018 to September 2020. The examples correspond to Cboe and TMX. 6.1. Evidence of a structural break11 The Covid-19 pandemic and changes related to the pandemic, such as the work from home schedule and stimulus packages, might affect the relationship between retail net buying activities and the market conditions. To examine whether the onset of the pandemic causes a structural break in the phenomena discussed above, we conduct Chow tests for several individual exchanges.12 The Chow test relies on the following model: 𝑅𝑒𝑡𝑎𝑖𝑙 𝑇𝑟𝑎𝑑𝑖𝑛𝑔 = 𝛽′𝑀𝑎𝑟𝑘𝑒𝑡 𝐶𝑜𝑛𝑑𝑖𝑡𝑖𝑜𝑛 +𝛽′𝑀𝑎𝑟𝑘𝑒𝑡 𝐶𝑜𝑛𝑑𝑖𝑡𝑖𝑜𝑛 𝑡 1 𝑡 2 𝑡−1 + 𝐶𝑜𝑣𝑖𝑑+𝛾′𝑀𝑎𝑟𝑘𝑒𝑡 𝐶𝑜𝑛𝑑𝑖𝑡𝑖𝑜𝑛 ×𝐶𝑜𝑣𝑖𝑑+𝛾′𝑀𝑎𝑟𝑘𝑒𝑡 𝐶𝑜𝑛𝑑𝑖𝑡𝑖𝑜𝑛 ×𝐶𝑜𝑣𝑖𝑑+𝜀 1 𝑡 2 𝑡−1 𝑡 Where 𝐶𝑜𝑣𝑖𝑑 is a dummy variable that equals one for observations after March 2020 (included), and zero otherwise. The null hypothesis is: 𝐻 :𝛾 = 0 𝑎𝑛𝑑 𝛾 = 0 0 1 2 which indicates the lack of structural break and suggests that the market conditions after the onset of the pandemic have no differential effects compared with the pre-pandemic relationships. For all the retail net buying measures and for all tested exchanges we reject the null hypothesis.13 We find 11 A structural break is an unexpected change over time in the coefficients of regression models. 12 The exchanges are B3 - Brasil Bolsa Balcão, Bolsa de Valores de Colombia, and the Philippine Stock Exchange, which provided retail information before and after March 2020. 13 Results not reported. 27",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "6. The impact of Covid-19",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 43,
    "chunk_index": 40,
    "word_count": 267,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "6. The impact of Covid-19 (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "find 11 A structural break is an unexpected change over time in the coefficients of regression models. 12 The exchanges are B3 - Brasil Bolsa Balcão, Bolsa de Valores de Colombia, and the Philippine Stock Exchange, which provided retail information before and after March 2020. 13 Results not reported. 27",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "6. The impact of Covid-19",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 43,
    "chunk_index": 41,
    "word_count": 50,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "6. The impact of Covid-19 (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "supporting evidence of structural breaks caused by the pandemic across different regions. Overall, the pandemic and the changes it brings intensify the relationship between market conditions and retail trading discussed above. 7. The behaviour of retail participants A frequently asked question is whether retail investors behave differently from institutional investors and, if so, in what ways. In a recent analysis of the U.S. markets, for example, Nasdaq observed that, relative to institutional investors, retail traders tend to trade earlier in the morning (even before markets open) and trade outside market hours, although in smaller quantities.14 In the same vein, academic literature has identified various patterns in retail participants’ trading behaviour. For example, retail investors tend to hold undiversified portfolios; they tend to sell winning stocks while holding on to their losing investments (“disposition effect”); they are overconfident (believing they will outperform the market); they prefer stocks with which they have some geographical or professional proximity; and they often trade because of the excitement generated by trading (Barber and Odean 2013). In the survey, when asked about perceived patterns in retail trading behaviour, only 35% (12/34) of the respondents perceived activity patterns that may differentiate retail participants from other investors, while the rest did not observe any pattern or did not have available data. The most common trading patterns observed include a larger amount of trading in ETFs, shorter holding periods, and a higher frequency of trading. Retail traders were also seen as more likely to trade at round price increments or more prone to overreact to high market volatility. However, these patterns were not consistent across jurisdictions. While in some markets, retail investors do not engage in day trading, in others they often do it; in other markets, they have longer holding periods instead of shorter ones. Further research would be needed to understand the cross-sectional differences in retail trading behaviour. However, a common theme was the increasingly important role social platforms play in influencing retail behaviour, the GameStop events being the most evident, but not the only, example. There were other reports of online social groups where most participants are retail investors, giving each other advice (sometimes bad), amplifying the risk of herd behaviour. 7.1. Average value of retail trades One common assumption is that retail participants trade in smaller amounts than the rest of the market (Lee and Radhakrishna 2000). One way to assess this is to measure the average value of a retail trade relative to the average value of trades in general. Figure 12 shows how these ratios changed for six exchanges in the sample. While in the Philippine Stock Exchange (PSE) or in the Bolsa de Valores 14 See https://www.nasdaq.com/articles/when-does-retail-trade 28",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "6. The impact of Covid-19",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 43,
    "chunk_index": 42,
    "word_count": 446,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "6. The impact of Covid-19 (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "this is to measure the average value of a retail trade relative to the average value of trades in general. Figure 12 shows how these ratios changed for six exchanges in the sample. While in the Philippine Stock Exchange (PSE) or in the Bolsa de Valores 14 See https://www.nasdaq.com/articles/when-does-retail-trade 28 de Colombia (BVC), retail trades are small on average, less than 50% of the size of a non-retail trade, in TMX, B3-Brasil Bolsa Balcão, or in the New Zealand Exchange (NZX), retail trades appear comparable in size with non-retail ones, with ratios fluctuating around one. Figure 12. Ratio of average value of retail trade to average value of a general trade The figure shows, for five exchanges, the ratio between the average monthly value of a retail trade and the average monthly value of all non-retail trades. Averages are estimated by dividing the monthly trading values by the number of trades. The exchanges are B3-Brasil Bolsa Balcão, New Zealand Exchange (NZX), TMX, Bolsa de Valores de Colombia (BVC), and the Philippine Stock Exchange (PSE). Source: WFE Survey. Comparing changes in average trade volume against changes in average value traded can also indicate whether retail traders change their choices on the size of the traded assets. The trends here are diverse (Figure 13). While in some cases, such as NZX, the average trade value and volume has been decreasing in the last years, with a significant drop in 2020, showing the retail investors preferences for smaller trades, in other cases, such as B3- Brasil Bolsa Balcão, the trend seems to be the opposite, with retail participants trading on higher value on average. 29",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "6. The impact of Covid-19",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 43,
    "chunk_index": 43,
    "word_count": 272,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "6. The impact of Covid-19 (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "value and volume has been decreasing in the last years, with a significant drop in 2020, showing the retail investors preferences for smaller trades, in other cases, such as B3- Brasil Bolsa Balcão, the trend seems to be the opposite, with retail participants trading on higher value on average. 29 Figure 13. Average value and average volume of retail trades NZX B3- Brasil Bolsa Balcão The figure shows three examples of the average value and average volume of retail trades. Averages are estimated by dividing the monthly values by the number of trades. The exchanges New Zealand Exchange (NZX) and B3- Brasil Bolsa Balcão. Source WFE Survey 7.2. Retail as net buyers in times of stress Another aspect to consider is whether retail participants tend to buy more and sell less than usual when stocks lose value. In Figure 14, we examine the net buying (value bought minus value sold) by retail participants during the years before the pandemic. In all markets, we observe an increase in net buying when the local market index was decreasing. 30 Figure 14. Retail net buying in equity markets The figures show the net retail buying (buying minus selling value traded) observed at B3- Brasil Bolsa Balcão, the Bolsa de Valores de Colombia (BVC), Borsa Istanbul, Cboe, and The Stock Exchange of Thailand (SET) against the local broad market index. Source: WFE Survey 31",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "6. The impact of Covid-19",
    "page_number": 30,
    "page_range": "p.30-32",
    "total_pages": 43,
    "chunk_index": 44,
    "word_count": 230,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "6. The impact of Covid-19 (p.30-32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "net buying in equity markets The figures show the net retail buying (buying minus selling value traded) observed at B3- Brasil Bolsa Balcão, the Bolsa de Valores de Colombia (BVC), Borsa Istanbul, Cboe, and The Stock Exchange of Thailand (SET) against the local broad market index. Source: WFE Survey 31 Market conditions and retail net buying To complement the observation that retail net buying or holding is correlated with market performance, we run the following regression model. Our analysis includes the period before and after the onset of the Covid-19 to provide a more comprehensive understanding instead of focusing only on the pandemic period. 𝑅𝑒𝑡𝑎𝑖𝑙 𝑇𝑟𝑎𝑑𝑖𝑛𝑔 = 𝛽′𝑀𝑎𝑟𝑘𝑒𝑡 𝐶𝑜𝑛𝑑𝑖𝑡𝑖𝑜𝑛 +𝛽′𝑀𝑎𝑟𝑘𝑒𝑡 𝐶𝑜𝑛𝑑𝑖𝑡𝑖𝑜𝑛 +𝛼 +𝜀 𝑖,𝑡 1 𝑖,𝑡 2 𝑖,𝑡−1 𝑖 𝑖,𝑡 For exchange 𝑖 and period 𝑡, 𝑅𝑒𝑡𝑎𝑖𝑙 𝑇𝑟𝑎𝑑𝑖𝑛𝑔 represents the measures of retail buying, selling, or net buying activities. Market conditions include the concurrent and one lag of market index return, market return volatility, interest rate, inflation rate, GDP growth, employment rate, literacy score, and trading value to GDP ratio. The list of variables and definitions can be found in the definition table above. Table 6 reports the estimation results. All standard errors are clustered by exchanges and reported in parenthesis. The estimated coefficients of market return on retail net buying measures (columns (1), (4), and (7) in the table) show that retail net buying is negatively related to the market index performance---when the market crashes, retail investors tend to increase their net buying. Such a relationship is statistically significant. To further distinguish whether the increase in retail net buying when the market declines is driven by the increase in buying or decrease in selling, we analyse retail buying activities and selling activities and report the estimation results in columns (2), (3), (4), and (6) in the table. The estimated results for retail buying number of trades and value are statistically insignificant. Therefore, as a proportion of the total market activity, retail purchasing activities are not related to the performance of the market. In other words, retail buying activities are in line with other market participants’ trading activities, facing changes in market performances. Moreover, columns (3) and (6) indicate a positive and statistically significant negative relationship between retail selling activities and market performance. 32",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "6. The impact of Covid-19",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 43,
    "chunk_index": 45,
    "word_count": 374,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "6. The impact of Covid-19 (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "are not related to the performance of the market. In other words, retail buying activities are in line with other market participants’ trading activities, facing changes in market performances. Moreover, columns (3) and (6) indicate a positive and statistically significant negative relationship between retail selling activities and market performance. 32 Table 6. Market condition and retail net buying Such an asymmetry in retail buying and selling points to the loss aversion bias individual investors face. Loss aversion bias is an emotional bias stating that investors could place different values on losses and gains of the same magnitude and react differently. The difference between retail buying and selling also sheds light on the regret aversion bias, which states that regret can arise from taking (error of commission) or not taking (error of omission) actions. More specifically, avoiding selling when market crashes might arise from the error of commission---retail investors refrain from selling to avoid regrets arising from realizing losses. In addition, selling during bull markets might arise from the error of omission---retail investors capture and realize gains to avoid regrets of not acting. Moreover, the results also show a negative and statistically significant coefficient for the concurrent market volatility and employment rate on two retail net buying measures (number of trades and value traded). This negative association indicates that retail participants tend to hold on to their equity investment when facing uncertainty---both market uncertainty and job uncertainty. 33",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "6. The impact of Covid-19",
    "page_number": 33,
    "page_range": "p.33-34",
    "total_pages": 43,
    "chunk_index": 46,
    "word_count": 237,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "6. The impact of Covid-19 (p.33-34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "a negative and statistically significant coefficient for the concurrent market volatility and employment rate on two retail net buying measures (number of trades and value traded). This negative association indicates that retail participants tend to hold on to their equity investment when facing uncertainty---both market uncertainty and job uncertainty. 33 For the lagged market condition measures, we find that retail net buying activities are negatively correlated with lagged market returns and positively correlated with lagged market volatility. In other words, retail investors tend to increase their equity holdings after periods of volatile market conditions. 8. Retail programmes and policy initiatives In general, domestic institutional investors provide stability as they tend to hold long-term and trade in larger amounts. Retail participants bring liquidity to the market but tend to be more volatile and more responsive to liquidity or volatility shocks. Hence, a diversified base of investors seems to be an optimal goal (WFE 2017). Across jurisdictions, markets may be at different points of the balance between retail and institutional. In our survey, while 70% (21/30) of respondents are looking to attract more retail participation, others are either content with maintaining the current balance between retail and institutional participation or, as in the cases of Dhaka Stock Exchange or Shenzhen Stock Exchange, are more interested at this stage in increasing institutional participation in their markets. Expectations for future growth of retail were also mixed, with some exchanges seeing gradual, continued growth and others seeing the share of retail activity staying steady over a 5- and 10-year horizon. There are also structural issues that may be hold back retail participation. For example, in some cases like in Colombia, brokers might be more interested in driving retail investors into mutual funds than into trading individual stocks. Exchanges interested in fostering the retail sector are actively undertaking strategies to facilitate retail investment. In the survey, most of the of the initiatives reported were related to education and to enhancing financial literacy (Figure 15) followed by the introduction of new products (e.g., retail/micro-saving bonds). Other relevant initiatives included changes in the market structure (for example, increasing trading time on the market by adding an evening trading session) and the introduction of access platforms and information resources dedicated to investors (Box 4). Figure 15. Exchanges’ initiatives to promote retail participation Source: WFE Survey 34",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "6. The impact of Covid-19",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 43,
    "chunk_index": 47,
    "word_count": 387,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "6. The impact of Covid-19 (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "bonds). Other relevant initiatives included changes in the market structure (for example, increasing trading time on the market by adding an evening trading session) and the introduction of access platforms and information resources dedicated to investors (Box 4). Figure 15. Exchanges’ initiatives to promote retail participation Source: WFE Survey 34",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "6. The impact of Covid-19",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 43,
    "chunk_index": 48,
    "word_count": 50,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "6. The impact of Covid-19 (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "Box 4: Exchanges’ initiatives: some examples EDUCATION: The Mexican Stock Exchange (Bolsa Mexicana de Valores) offers a variety of media initiatives, including trading games; competitions (“Peeptrade Investment Challenge”); a blog focused on university students and young people to talk about the Mexican Stock Exchange and promote financial education (“Let’s talk about the stock market”); segments in TV/radio programs to discuss the behaviour of the stock and financial markets and economic news about Mexico and the listed companies (“From the Mexican Stock Exchange”); and a podcast about the companies listed on the exchange (“Mexican Stock, the podcast”). NSE India has implemented a centralized digital market knowledge hub and a simulated market environment for students / investors to understand investment concepts and practice them on the platform. TAILORED INFORMATION: Deutsche Börse Group (DBG) offers a dedicated website that provides investors with detailed product characteristics, search functionality (e.g., for ESG-ETFs), and market news. The introduction of the intraday Xetra Liquidity Measure can be used by investors as an indicator for determining favourable trading times and thereby reduce their implicit trading costs. The Nigerian Exchange is developing mobile applications (X-Mobile) linked to Dealing Members’ sites and which offers access to free and user-friendly information about saving, investing, listed companies, and NGX offerings such as market data, events, training and information on products and services. The Philippine Stock Exchange is also working on a data analytics platform that will facilitate retail investors to obtain and analyse data. ACCESS: While providing direct access would often depend on the legal provisions in each country allowing direct access, initiatives that facilitate access either directly or through an intermediary are an important element. On the other hand, it is worthwhile noting that with intermediated access, the risk measures reside with the broker. Philippine Stock Exchange (PSE) has launched various services: PSETradex, a web- and app-based trading platform for brokerage firms who want to offer online trading services to their clients. It allows users to trade shares of stock, monitor and manage their stock portfolio, and get real-time market information; PSE EASy, a web-based portal and mobile app, allows Local Small Investors (LSIs) to subscribe to initial public offerings anytime, anywhere. For the next two to three years, PSE will undertake several initiatives geared towards improving an investor’s end-to-end digital experience, including the implementation of PSE EASy Phase 2 which will integrate an online payment system for IPO subscriptions and extend the service to other forms of public offerings. The exchange also plans to promote a faster and easier way for retail investors to open their trading accounts by exploring the development of an electronic know-your-client (eKYC) platform. MARKET DESIGN: The Saudi Stock Exchange (Tadawul) has been introducing several enhancements to the market benefiting retail investors participation, starting from reduced tick size in 2017, the introduction of the Nomu–parallel market in 2017 to scaling down the par value in the 35",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "6. The impact of Covid-19",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 43,
    "chunk_index": 49,
    "word_count": 481,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "6. The impact of Covid-19 (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "development of an electronic know-your-client (eKYC) platform. MARKET DESIGN: The Saudi Stock Exchange (Tadawul) has been introducing several enhancements to the market benefiting retail investors participation, starting from reduced tick size in 2017, the introduction of the Nomu–parallel market in 2017 to scaling down the par value in the 35",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "6. The impact of Covid-19",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 43,
    "chunk_index": 50,
    "word_count": 50,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "6. The impact of Covid-19 (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "debt market from 1 million riyals to 1,000 riyals for more access to retail investors, as well as a reduced trading commission in the debt market. In Canada, TMX designed its cash equity market, the TSX Alpha Exchange, as a healthy environment for retail trading: retail clients are protected from latency arbitration strategies by HFT counterparties by means of a “speed bump” on all incoming orders, with exception made for passive-only orders exceeding a minimum size threshold. The Taiwan Stock Exchange (TWSE) introduced in 2017 the “Fixed- term Fixed-amount Investment Plan,” which offers the investor the opportunity to buy shares in small amounts at regular intervals and launched intraday odd lot trading on 26 October 2020 so the execution could be smaller than the minimum trade size (i.e., 1 share). B3-Brasil Bolsa Balcão changed the round-lot of several instruments, including Brazilian Depositary Receipts (BDRs). The minimum traded amount of Level I Unsponsored BDRs, variable income ETFs and options on variable income ETFs went from 10 to 1 unit. In addition, Level II or III Sponsored BDRs will decrease from 100 units to 1 unit. NEW PRODUCTS: In response to the growing need of retail investors for portfolio diversification, exchanges continue launching new instruments aimed at retail. In 2020, B3-Brasil Bolsa Balcão working together with the authorities, approved changes to the regulation to enable individual investors to negotiate Brazilian Depositary Receipts (BDR). Thus, the retail now also has the possibility of investing in the shares of foreign companies without having to buy shares on the exchanges where they are listed abroad. In the first month after the release, B3 reached 50,000 new investors in the product and have made available over 600 BDRs so far. with an increase of 10 times in average daily trading volume. REGULATORY AND FISCAL INCENTIVES. Introducing tax exemptions on capital gains, and tax breaks on coupon payments of corporate bonds. An example is the introduction of ISK (Investment Securities Accounts) in Sweden, Finland, and Denmark. This type of account simplifies tax administration for retail as the holders of these accounts do not have to worry about declaring capital gains but are taxed on the total value of the account measured a number of times per year and the tax is calculated at a flat rate. 36",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "6. The impact of Covid-19",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 43,
    "chunk_index": 51,
    "word_count": 380,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "6. The impact of Covid-19 (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "type of account simplifies tax administration for retail as the holders of these accounts do not have to worry about declaring capital gains but are taxed on the total value of the account measured a number of times per year and the tax is calculated at a flat rate. 36",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "6. The impact of Covid-19",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 43,
    "chunk_index": 52,
    "word_count": 50,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "6. The impact of Covid-19 (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "Over the past decade, exchanges, and regulators have implemented various programs and measures to facilitate the trading of retail participants, enhance their investment experience, and enforce retail protection. To evaluate the efficacy of these retail policies and programs, we investigate the changes in the retail trading pattern around the implementation or changes in such policies. More specifically, we investigate the changes in retail trading activities and retail net buying measures one year before and after the policy change. The policies are measured as dummy variables equal to one for the one year after the policy implementation and zero for the one year before the implementation. By restricting the event window to the two-year period surrounding the policy changes, we intend to isolate and study one specific policy and alleviate the endogeneity created by other policy changes introduced around the same period. With this event window, we run the following regression model. 𝑅𝑒𝑡𝑎𝑖𝑙 𝑀𝑒𝑎𝑠𝑢𝑟𝑒 = 𝛽𝑅𝑒𝑡𝑎𝑖𝑙 𝑃𝑜𝑙𝑖𝑐𝑦 +Γ′𝐶𝑜𝑛𝑡𝑟𝑜𝑙𝑠 +Γ′𝐶𝑜𝑛𝑡𝑟𝑜𝑙𝑠 +𝛼 +𝜀 𝑖,𝑡 𝑖,𝑡 1 𝑖,𝑡 2 𝑖,𝑡−1 𝑖 𝑖,𝑡 For exchange 𝑖 and period 𝑡, 𝑅𝑒𝑡𝑎𝑖𝑙 𝑀𝑒𝑎𝑠𝑢𝑟𝑒 is the dependent variable and can take the retail trading measures or retail net buying measures listed in Table 3. 𝑅𝑒𝑡𝑎𝑖𝑙 𝑃𝑜𝑙𝑖𝑐𝑦 is a dummy variable that indicates the changes in retail policies. We also control for the concurrent and lagged market conditions, and we include exchange fixed effects. Due to the infrequent implementation of some policies, we require at least 30 available observations to ensure the power of test. We report the result of models with less than 30 observations as “-”. Standard errors are clustered by exchanges. Table 7 reports the estimated 𝛽 coefficients for the retail trading measures. Panel A, which groups the policies related to trading costs and access, shows that retail trading declines (increases), in general, after the increase (decrease) in trading fees. Yet, such a negative relationship is only marginally significant for trading fee changes and value traded per retail account and statistically insignificant for other measures. Regarding taxes rates, we see a negative and statistically significant relationship between capital gain tax rate and retail trading value, the proportion of retail value traded, and retail trading volume. Reducing the capital gain tax rate could increase retail participation. Counterintuitively, we find that introducing app trading functions seem to reduce retail participation. 37",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "8.1. Retail policies and programmes and retail trading",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 43,
    "chunk_index": 53,
    "word_count": 383,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "8.1. Retail policies and programmes and retail trading (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "see a negative and statistically significant relationship between capital gain tax rate and retail trading value, the proportion of retail value traded, and retail trading volume. Reducing the capital gain tax rate could increase retail participation. Counterintuitively, we find that introducing app trading functions seem to reduce retail participation. 37 Table 7. Retail policies and retail participation Panel B in Table 7 reports the estimated coefficients of educational materials provided exchanges on retail trading activities. We distinguish these materials between broadcast materials, which include TV, radio, and Podcast materials; and education materials, which include brochures and booklets. Overall, we find that exchange broadcast materials could increase retail trading volume per account, and access to exchange research tools could increase retail value traded. In addition, educational courses seem to be negatively associated with retail participation. Moreover, Panel C shows the estimated results for various retail protection policies. We see that introducing stricter rules of retail qualification and restricting retail trading (e.g., volume cap, limited access to derivative market, 38",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "8.1. Retail policies and programmes and retail trading",
    "page_number": 38,
    "page_range": "p.38-39",
    "total_pages": 43,
    "chunk_index": 54,
    "word_count": 168,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "8.1. Retail policies and programmes and retail trading (p.38-39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "increase retail value traded. In addition, educational courses seem to be negatively associated with retail participation. Moreover, Panel C shows the estimated results for various retail protection policies. We see that introducing stricter rules of retail qualification and restricting retail trading (e.g., volume cap, limited access to derivative market, 38 trading frequency limit) reduces retail participation. These rules are intended to protect retail investors by regulating retail identity and limiting the risks retail traders can take. The presence of designated market makers (DMMs) to fulfil retail liquidity significantly increases the number of trades per retail account and the retail volume traded. However, the result also shows that the DMMs could reduce (at a relatively small magnitude) the value traded by retail investors. Finally, we see mixed results regarding the enforcement of corporate disclosure requirements, which increases the number of trades per retail account but reduces by a small magnitude the total value traded by retail participants. Table 8. Retail policies and retail net buying We also investigate the relationship between the policies mentioned above and retail net buying. The results are reported in Table 8 and show that App trading, retail qualification regulations, and designated market makers tend to increase retail net buying. In contrast, exchange trading games tend to reduce retail net buying. Overall, by studying the changes in various retail participation measures, we find that reducing trading fees, reducing the capital gain tax rate, providing broadcast materials, and improving access to 39",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "8.1. Retail policies and programmes and retail trading",
    "page_number": 39,
    "page_range": "p.39-40",
    "total_pages": 43,
    "chunk_index": 55,
    "word_count": 244,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "8.1. Retail policies and programmes and retail trading (p.39-40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "designated market makers tend to increase retail net buying. In contrast, exchange trading games tend to reduce retail net buying. Overall, by studying the changes in various retail participation measures, we find that reducing trading fees, reducing the capital gain tax rate, providing broadcast materials, and improving access to 39 research tools are the more efficient way for the exchanges or regulators to attract retail participation in the stock market. 9. Conclusions The results of the survey and the analysis confirmed that, while the retail landscape is diverse, there are some regional patterns. The econometric analysis examined the impact of different factors on the number of retail investors and their trading activity in the stock markets. The analysis provided some interesting insights: retail investors tend to be net buyers in times of stress. In the markets analysed, we observe net buying values increasing at the time when the local market index was decreasing. Such an asymmetry in retail buying and selling points to the loss aversion bias (i.e., investors place different values on losses and gains of the same magnitude and react differently). Also, retail participants tend to react to market conditions, as they trade more after observing high market returns and trade less after observing high market volatilities. With regards to the impact of Covid-19, we found supporting evidence of structural breaks caused by the pandemic across different regions. Overall, the pandemic and the changes it brings intensified the relationship between market conditions and retail trading. It also highlighted the importance of new ways of accessing the markets. The analysis also confirmed the effectiveness of policies and programmes designed to stimulate retail participation and the relevance of financial literacy within the population. 40",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "8.1. Retail policies and programmes and retail trading",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 43,
    "chunk_index": 56,
    "word_count": 284,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "8.1. Retail policies and programmes and retail trading (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "the changes it brings intensified the relationship between market conditions and retail trading. It also highlighted the importance of new ways of accessing the markets. The analysis also confirmed the effectiveness of policies and programmes designed to stimulate retail participation and the relevance of financial literacy within the population. 40",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "8.1. Retail policies and programmes and retail trading",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 43,
    "chunk_index": 57,
    "word_count": 50,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "8.1. Retail policies and programmes and retail trading (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "To gather data for this report, we designed and fielded a questionnaire to collect information on retail trading activity from exchanges across different jurisdictions. The questionnaire was divided in two parts: in the first, we collected qualitative information and in the second, quantitative data points were extracted to conduct an empirical analysis. The questionnaire was distributed among WFE members and affiliates between October 2020 and June 2021 and response collection continued till we obtained a sample with satisfactory diversity between geographies and jurisdictions. We gathered 34 responses, evenly split between High-Income (15 responses), Upper Middle-Income (11 responses) and Lower Middle-Income markets (8 responses). 15 All regions were represented, with 14F14F 15 exchanges from EMEA, 13 exchanges from the Asia-Pacific, and six from the Americas. Figure 16 below provides a graphical representation of the respondents' jurisdictions Finally, to bolster the questionnaire results with additional evidence on themes of relevance, we conducted unstructured interviews with selected exchanges and brokers. Figure 16. Respondents to the WFE survey. Distribution by regions 15 This, according to the World Bank classification by income level 2021-2022. See https://blogs.worldbank.org/opendata/new-world-bank-country-classifications-income-level-2021-2022 41",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "10. Annex: The WFE survey",
    "page_number": 41,
    "page_range": "p.41-42",
    "total_pages": 43,
    "chunk_index": 58,
    "word_count": 182,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10. Annex: The WFE survey (p.41-42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "the respondents' jurisdictions Finally, to bolster the questionnaire results with additional evidence on themes of relevance, we conducted unstructured interviews with selected exchanges and brokers. Figure 16. Respondents to the WFE survey. Distribution by regions 15 This, according to the World Bank classification by income level 2021-2022. See https://blogs.worldbank.org/opendata/new-world-bank-country-classifications-income-level-2021-2022 41 Exchanges that participated in the survey (October 2020- June 2021) Amman Stock Exchange Moscow Exchange Athens Stock Exchange (ATHEX) Multi Commodity Exchange of India Ltd. B3- Brasil Bolsa Balcão Nasdaq Bahrain Bourse Nasdaq USA BME Spanish Exchanges National Stock Exchange of India Limited Bolsa de Valores de Colombia Nigerian Exchange Group Bolsa Mexicana de Valores NZX Limited Borsa Istanbul Palestine Exchange Bursa Malaysia Saudi Stock Exchange (Tadawul) Cboe Global Markets Shenzhen Stock Exchange Dalian Commodity Exchange Taipei Exchange Dar es Salaam Stock Exchange PLC Taiwan Futures Exchange Deutsche Börse Group Taiwan Stock Exchange Dhaka Stock Exchange Limited (“DSE”) The Egyptian Exchange Japan Exchange Group, Inc. The Philippine Stock Exchange, Inc. Kazakhstan Stock Exchange The Stock Exchange of Thailand Malta Stock Exchange TMX Group 42",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "10. Annex: The WFE survey",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 43,
    "chunk_index": 59,
    "word_count": 174,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10. Annex: The WFE survey (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "Commodity Exchange Taipei Exchange Dar es Salaam Stock Exchange PLC Taiwan Futures Exchange Deutsche Börse Group Taiwan Stock Exchange Dhaka Stock Exchange Limited (“DSE”) The Egyptian Exchange Japan Exchange Group, Inc. The Philippine Stock Exchange, Inc. Kazakhstan Stock Exchange The Stock Exchange of Thailand Malta Stock Exchange TMX Group 42",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "11. References",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 43,
    "chunk_index": 60,
    "word_count": 50,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "11. References (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "Abudy, Menachem Meni, and Avi Wohl. 2018. Corporate bond trading on a limit order book exchange. Review of Finance (Oxford University Press) 22: 1413–1440. Barber, Brad M., and Terrance Odean. 2013. The behavior of individual investors. Vol. 2, in Handbook of the Economics of Finance, 1533–1570. Elsevier. Barrot, Jean-Noel, Ron Kaniel, and David Sraer. 2016. Are retail traders compensated for providing liquidity? Journal of Financial Economics (Elsevier) 120, 146–168. Elkind, Daniel, Kathryn Kaminski, Andrew W. Lo, Kien Wei Siah and Chi Heem Wong. When Do Investors Freak Out? Machine Learning Predictions of Panic Selling. The Journal of Financial Data Science Winter 2022, 4 (1) 11-39; DOI: https://doi.org/10.3905/jfds.2021.1.085 Foucault, Thierry, David Sraer, and David J. Thesmar. 2011. Individual investors and volatility. The Journal of Finance (Wiley Online Library) 66: 1369–1406. Guiso, Luigi, Tullio Jappelli, and Michael Haliassos. 2000. Household portfolios: An international comparison. Available at SSRN 245805. Hsieh, Shu-Fan, Chia-Ying Chan, and Ming-Chun Wang. 2020. Retail investor attention and herding behavior, Journal of Empirical Finance, Volume 59, 109-132, https://doi.org/10.1016/j.jempfin.2020.09.005. Kaniel, Ron, Gideon Saar, and Sheridan Titman. 2008. Individual investor trading and stock returns. The Journal of Finance (Wiley Online Library) 63: 273–310. Kumar, Alok, and Charles M. C. Lee. 2006. Retail investor sentiment and return comovements. The Journal of Finance (Wiley Online Library) 61: 2451–2486. Lee, Charles M. C., and Balkrishna Radhakrishna. 2000. Inferring investor behavior: Evidence from TORQ data. Journal of Financial Markets (Elsevier) 3: 83–111. Linnainmaa, Juhani. 2003. Who makes the limit order book? implications for contrarian strategies, attention- grabbing hypothesis, and the disposition effect. Available at SSRN 474222 (Citeseer). Rubin, Amir. 2007. Ownership level, ownership concentration and liquidity. Journal of financial Markets (Elsevier) 10: 219–248. WFE 2017. Enhancing Retail Particiation in Emerging Markets. WFE Report, August 2017. https://www.world- exchanges.org/our-work/articles/wfe-enhancing-emerging-market-retail-trading-report-3-august- 2017. WFE and Oliver Wyman. 2016. Enhancing Liquidity in Emerging Market Exchanges. WFE and Oliver Wyman Report. October 2016. https://www.world-exchanges.org/storage/app/media/research/Studies_Reports/liquidity-in-emerging- market-exchanges-wfe-amp-ow-report.pdf 43",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "11. References",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 43,
    "chunk_index": 61,
    "word_count": 313,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "11. References (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  },
  {
    "text": "2007. Ownership level, ownership concentration and liquidity. Journal of financial Markets (Elsevier) 10: 219–248. WFE 2017. Enhancing Retail Particiation in Emerging Markets. WFE Report, August 2017. https://www.world- exchanges.org/our-work/articles/wfe-enhancing-emerging-market-retail-trading-report-3-august- 2017. WFE and Oliver Wyman. 2016. Enhancing Liquidity in Emerging Market Exchanges. WFE and Oliver Wyman Report. October 2016. https://www.world-exchanges.org/storage/app/media/research/Studies_Reports/liquidity-in-emerging- market-exchanges-wfe-amp-ow-report.pdf 43",
    "title": "Retail trading an analysis of global trends",
    "source_type": "pdf",
    "document_id": "20aa689676a4",
    "source_file": "Retail trading an analysis of global trends.pdf",
    "section": "11. References",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 43,
    "chunk_index": 62,
    "word_count": 50,
    "author": "Pedro Gurrola",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "11. References (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221005144803+00'00'",
    "duration": null
  }
]