[
  {
    "text": "Retail Option Traders and the Implied Volatility Surface Gregory W. Eaton, T. Clifton Green, Brian S. Roseman, and Yanbin Wu* September 2022 Abstract Retail investors dominate option trading in recent years. Individuals are net purchasers of options, particularly call, short-dated, and out-of-the-money options, although they tend to write long-dated puts. Retail brokerage outages are associated with reduced implied volatility overall, and the effect is stronger for options purchased by retail investors. In contrast, implied volatility increases for long-dated options during outages, consistent with reduced retail writing activity. The findings highlight the importance of retail demand pressure on the implied volatility surface and suggest that retail trading can have important effects on the implied volatility term structure, moneyness curve, and call-put spread. JEL: G11, G12, G14 Keywords: Retail Traders, Option Markets, Implied Volatility * Eaton and Roseman are from the Spears School of Business, Oklahoma State University (gregory.eaton@okstate.edu; brian.roseman@okstate.edu). Green is from Goizueta Business School, Emory University (clifton.green@emory.edu). Wu is from Warrington College of Business, University of Florida (yanbin.wu@warrington.ufl.edu). We thank Amit Goyal and Dmitriy Muravyev and seminar participants at Baruch College, Colorado State University, Iowa State University, Oklahoma State University, and Texas Tech University for helpful comments. Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 48,
    "chunk_index": 0,
    "word_count": 202,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "Business School, Emory University (clifton.green@emory.edu). Wu is from Warrington College of Business, University of Florida (yanbin.wu@warrington.ufl.edu). We thank Amit Goyal and Dmitriy Muravyev and seminar participants at Baruch College, Colorado State University, Iowa State University, Oklahoma State University, and Texas Tech University for helpful comments. Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 48,
    "chunk_index": 1,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "Option traders are typically regarded as sophisticated, and prior research finds evidence of informed trading in option markets (e.g. Johnson and So, 2012; Hu, 2014; Ge, Lin, and Pearson, 2016). In recent years, reductions in trading commissions, greater work flexibility, and increased attention from social media and the financial press have led to dramatic increases in option trading by retail investors.1 Individual investors are often inexperienced and prone to gambling behavior (e.g. Boyer and Vorkink, 2014; and Byun and Kim, 2016)2, and widespread retail option trading could have important financial market implications. In this article, we analyze retail option trading data and rely on brokerage platform outages to study the effects of retail investors on option markets. Option market makers cannot hedge perfectly due to transaction costs and other market frictions, and they are sensitive to inventory risk due to capital constraints and agency issues (Garleanu, Pedersen, and Poteshman, 2009; and Muravyev, 2016). As a result, demand pressure can have effects on option prices and implied volatility (Bollen and Whaley, 2004). A well- developed literature has established several stylized facts regarding implied volatility. In particular, the call-put volatility spread has been shown to predict future stock returns and macro conditions (e.g. Bali and Hovakimian, 2009; Cremers and Weinbaum, 2010; An, et al., 2014; Han and Li, 2021). A second stream of literature analyzes how implied volatility varies across strike prices, and the volatility moneyness smile/smirk has been attributed to an aversion to price jumps (Dennis and Mayhew, 2002; Pan, 2002; Xing, Zhang, and Zhao, 2010; Yan, 2011). Other work focuses on the term structure of implied volatility and finds an association between future returns 1 For example, Banerji (2021) reports a fourfold increase in retail option trading over a five-year period. 2 Other work suggesting that retail option traders are less sophisticated include Poteshman and Serbin (2003), Pan and Poteshman (2006), and Eisdorfer, Goyal, and Zhdanov (2020). 1 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 48,
    "chunk_index": 2,
    "word_count": 323,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "returns 1 For example, Banerji (2021) reports a fourfold increase in retail option trading over a five-year period. 2 Other work suggesting that retail option traders are less sophisticated include Poteshman and Serbin (2003), Pan and Poteshman (2006), and Eisdorfer, Goyal, and Zhdanov (2020). 1 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 48,
    "chunk_index": 3,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "and volatility (Mixon, 2007; Vazquez, 2017). While existing work emphasizes the role of fundamentals, hedging demands, and informed trading, in recent years speculative trading by retail investors may play an important role in shaping the implied volatility surface. Capturing the effects of retail investors on option markets is challenging since trading is endogenously related to market conditions. Our identification approach exploits retail brokerage outages to isolate the effects of retail trading on financial markets (Eaton, et al., 2022). DownDetector.com, a website that tracks user complaints, documents 80 unique platform outages with at least 200 complaints at large retail brokers during the sample period from January 2019 to July 2021. The median outage length is 45 minutes. We employ a difference-in-differences type approach that contrasts option volume and implied volatility during outages with similar times of day during the previous week, and we use indicator variables to compare options favored by retail investors to a set of control options. We begin by characterizing individual investor option trading preferences using a measure of retail trading.3 We find evidence that retail option demand is concentrated in short-dated options that are often overlooked in existing work.4 For example, 40% of retail option trading occurs in contracts that expire within one week. Retail investors also favor calls over puts, and they prefer out-of-the-money over in-the-money options. More broadly, we find that retail investors account for up to 70% of non-market maker option volume during our sample period, considerably higher than in past years. Consistent with uninformed trading, we find little evidence that aggregate retail option trading predicts stock returns overall or in the types of options favored by retail investors. 3 Our implied volatility analysis relies on retail brokerage outages, which create negative shocks specifically to retail volume without requiring a direct measure of trading by individual investors. 4 For example, Johnson and So (2012) exclude options expiring within five trading days, and Hu (2014) excludes options expiring within ten days. 2 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 48,
    "chunk_index": 4,
    "word_count": 332,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "retail brokerage outages, which create negative shocks specifically to retail volume without requiring a direct measure of trading by individual investors. 4 For example, Johnson and So (2012) exclude options expiring within five trading days, and Hu (2014) excludes options expiring within ten days. 2 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 48,
    "chunk_index": 5,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "The effect of individual investors on implied volatility depends on the nature of their option trading. In an environment with imperfect market maker hedging and inventory risks, widespread uninformed purchasing of options (either calls or puts) will create upward pressure on prices that manifests as higher implied volatility. On the other hand, if retail investors tend to sell options, this will create downward pressure on prices and reduce implied volatility. Empirically, we find that retail investors’ tendency to purchase vs write options varies considerably across contracts. In aggregate, retail investors are more likely to purchase options than write them, and net option purchases are strongest for short-dated out-of-the-money options. However, retail traders show a net tendency to write long-dated options and specifically in put contracts. As a result, we conjecture that retail investors will have an upward effect on short- horizon implied volatility, whereas they may have a downward effect on implied volatility at longer horizons, and specifically when inferred from put options. We take these predictions to the data in the context of retail broker outages. We show that retail brokerage platform outages have a significant impact on option trading activity. In particular, total retail option dollar volume is roughly 10% lower during outages for options with high retail interest, as proxied by retail option trading in the five days prior to the outage. In contrast, we find no evidence that non-retail option trading changes during outages, which helps mitigate concerns that outages are directly caused by market conditions. The evidence that retail broker outages are associated with reduced retail option trading is consistent with the findings in Eaton et al., (2022) that outages decrease retail stock trading. Thus, retail broker outages can be viewed as creating negative shocks to retail investor participation in both stock and option markets. Analyzing the effects of retail broker outages on the implied volatility surface, and in particular the call-put spread, the moneyness smile/smirk, and the term structure of volatilities, 3 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 48,
    "chunk_index": 6,
    "word_count": 333,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "can be viewed as creating negative shocks to retail investor participation in both stock and option markets. Analyzing the effects of retail broker outages on the implied volatility surface, and in particular the call-put spread, the moneyness smile/smirk, and the term structure of volatilities, 3 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 48,
    "chunk_index": 7,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "provides an opportunity to isolate a unique effect of retail investors on the option market distinct from their effect on the underlying stock market. Retail investors’ impact on implied volatility will be shaped specifically by their net proclivity towards purchasing vs. writing options, and we next examine the effects of outages on net retail option dollar volume. We find that retail broker outages are associated with a drop in net retail purchasing activity on average across contracts, yet we observe a decline in retail writing behavior for long-dated puts, consistent with the trading preferences documented above. Having confirmed that brokerage outages significantly impact retail investors’ ability to trade options, we then turn to analyze the effects of retail broker outages on implied volatility. We find that when retail investors are unable to trade during platform outages, average implied volatility for options that are favored by retail investors falls by 0.039, relative to a median implied volatility of 0.444, equating to a drop of 8.8%. We observe that the negative effects of outages on implied volatility are significantly stronger for calls than puts (-0.052 vs -0.031), which is consistent with retail traders’ preferences towards purchasing call over put options. Broker outages are also associated with shifts in the implied volatility moneyness curve. Specifically, we find that outages have a larger effect on out-of-the-money options than in-the-money ones (-0.064 vs -0.013), and the difference between the two is statistically significant at the 5% significance level. Taken together, outages are associated with a flattened moneyness smile or smirk. Retail broker outages have the most dramatic effect on the term structure of implied volatility. In particular, implied volatility falls by 0.091 for options with less than seven days to maturity and 0.041 for options with middle maturities of between 8 and 20 days. In contrast, implied volatility for long-dated options significantly rises by 0.021 during brokerage outages. The overall effect is a significant steepening of the slope of the implied volatility maturity structure for 4 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 48,
    "chunk_index": 8,
    "word_count": 336,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "and 0.041 for options with middle maturities of between 8 and 20 days. In contrast, implied volatility for long-dated options significantly rises by 0.021 during brokerage outages. The overall effect is a significant steepening of the slope of the implied volatility maturity structure for 4 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 48,
    "chunk_index": 9,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "options on stocks favored by retail investors. The impact of outages on the term structure of implied volatility matches the observed net trading behavior, in particular retail investors’ proclivity towards purchasing short-dated options and writing long-dated options, which provides convincing support for the interpretation that retail investors impact implied volatility. Moreover, the evidence that outages have distinct effects on calls and puts as well as affecting the moneyness smile and term structure of implied volatility helps rule out that option markets are merely reacting to the effects of outages on stock markets. We consider a number of robustness checks. In each analysis we compare outage periods to post-outage periods measured one hour after the end of the actual outage. Inconsistent with outages being driven by persistent changes in underlying market conditions, we find some evidence of a reversal of outage conditions, with pent-up demand leading to elevated retail option trading and increased implied volatility in the post-outage period relative to the control period. To further address endogeneity concerns, we also consider event-time plots for the subset of 30-minute outages, and the resulting plots support the view that outages represent exogenous and impactful shocks to implied volatility. Additional tests show that the results continue to hold during sub-sample periods and also if we omit the 30 stocks with the most actively traded options, which suggests meme stocks are not driving the findings. Our work contributes to several strands of literature. One area of research emphasizes the role of demand pressures on option markets. For example, Bollen and Whaley (2004) argue that buying pressure helps explain differences in the shape of the moneyness curves between index and stock options. Garleanu, Pedersen, and Poteshman (2009) models demand-pressure effects and finds that proxies for option demand are related to the moneyness smirk. In other work, Muravyev (2016) highlights the effects of demand pressures on dealer risk and finds evidence that inventory 5 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 48,
    "chunk_index": 10,
    "word_count": 323,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "index and stock options. Garleanu, Pedersen, and Poteshman (2009) models demand-pressure effects and finds that proxies for option demand are related to the moneyness smirk. In other work, Muravyev (2016) highlights the effects of demand pressures on dealer risk and finds evidence that inventory 5 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 48,
    "chunk_index": 11,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "risk accounts for a large portion of option order imbalances. Our study focuses on the demand- pressure effects of a specific option trading clientele that has grown substantially in recent years, and our setting allows us to isolate the effects of retail investors on option markets. The findings also contribute more broadly to studies that seek to understand the shape of the implied volatility surface, including the term structure (e.g., Mixon, 2007; Vazquez, 2017), and the moneyness smile or smirk (e.g., Dennis and Mayhew, 2002; Pan, 2002; Xing, Zhang, and Zhao, 2010; Yan, 2011). Our evidence documents the important role that speculative retail investor demand pressure can have on the implied volatility surface, which suggests caution is warranted when interpreting the implied volatility surface as reflecting information about underlying firm fundamentals. Our results add to contemporaneous work on retail investors in options markets. Ernst and Spatt (2022) highlight that retail broker payment for order flow is much larger for options than stocks, which creates incentives for retail brokers to encourage option trading. Bryzgalova, Pavlova, and Sikorskaya (2022) characterize retail option trading and find evidence that retail investors sub-optimally leave open calls on cum-dividend dates, and de Silva, So, and Smith (2022) find evidence that retail option traders herd into options for stocks with upcoming earnings announcements, resulting in losses and wealth transfers to market makers.5 Our analysis also provides evidence that retail option traders are generally uninformed, yet our emphasis is on the effects on retail investors on the implied volatility surface, a fundamental summary statistic that emerges from option markets. In other work, Jones, Reed, and Waller (2021) studies the effects of retail broker restrictions that affected 38 stocks in the first quarter of 2021, and they document a substitution effect from stocks to options with associated increases in implied volatility. Our broker 5 In early work, Lakonishok et al., (2007) also characterize retail option trading and document that discount broker customers tend to trade speculatively and are more likely to buy and write calls than puts. 6 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 48,
    "chunk_index": 12,
    "word_count": 344,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "to options with associated increases in implied volatility. Our broker 5 In early work, Lakonishok et al., (2007) also characterize retail option trading and document that discount broker customers tend to trade speculatively and are more likely to buy and write calls than puts. 6 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 48,
    "chunk_index": 13,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "outage setting provides broad exogenous shocks to stock and option markets, which allows us to shed light on the overall effect of retail investors on the implied volatility surface. Taken together, our findings show that individual investors can play an important role in determining the shape of the implied volatility surface. In stocks with high retail interest, retail option traders push up implied volatility measures overall and to the call-put volatility spread. Moreover, retail investor demand increases implied volatility most intensely for out of the money options, which contributes to the implied volatility smile. Finally, retail investors have their largest effect on the term structure of volatility. By pushing up short-dated volatility and decreasing long- maturity volatility, their trading adds considerable negative slope to the volatility term structure. 2. Data and Descriptive Statistics 2.1 Data Sources, Construction of the Sample, and Key Variables Our option sample is obtained from the Nasdaq Options Trade Outline (NOTO) and the PHLX Options Trade Outline (PHOTO) ten-minute intraday and end-of-day files. The data is sourced from the Nasdaq Options Market (NOM) and Nasdaq Philadelphia (PHLX) exchanges, which represent two of the sixteen options exchanges and approximately 20-25% of the total option market volume during our sample period.6 The data contains information on the daily number of open-to-buy, open-to-sell, close-to- buy, and close-to-sell trades for each option by different categories of traders: Market Makers, Broker-Dealers, Firms, Professional Customers, and (non-professional) Customers. Market Makers are financial institutions registered as market makers on an options exchange, Broker- Dealers trade on behalf of institutional investors and may also serve as de facto market makers, 6 CBOE tracks volume statistics for each option exchange and posts recent market share information at the following link: https://www.cboe.com/us/options/market_statistics/?mkt=exo. 7 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 48,
    "chunk_index": 14,
    "word_count": 292,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "as market makers on an options exchange, Broker- Dealers trade on behalf of institutional investors and may also serve as de facto market makers, 6 CBOE tracks volume statistics for each option exchange and posts recent market share information at the following link: https://www.cboe.com/us/options/market_statistics/?mkt=exo. 7 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 48,
    "chunk_index": 15,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "and Firm trades capture orders from proprietary accounts at Options Clearing Corporation (OCC) member firms. Professional Customers are traders who place more than 390 option orders per day (i.e., one per minute during the trading day) on average over the last month.7 Similar to de Silva, So, and Smith (2022), we proxy for individual investors using trades from non-professional customers. Small institutions that trade options infrequently could also be classified as customers, which adds noise to our retail volume analysis and may overstate the level of retail option volume market share. However, we note that this data limitation is not relevant for our primary analysis that analyzes the effects of retail broker platform outages on implied volatility. The NOTO and PHOTO data provides information on trader type, but it does not contain option pricing information, and we therefore compute implied volatility using intraday option trade and price data from the historical Nasdaq ITCH to Trade Options (ITTO) files.8 2.1.1 Computing Implied Volatility One concern with inferring volatility from option markets in an intraday setting is that market frictions could influence implied volatility. Option markets tend to be less liquid than equity markets, and option price staleness may influence observed implied volatility. As a result, we focus on option transactions during outages to capture option market prices. Bid-ask bounce may influence implied volatility, and we use the option price mid-quote, matched with the prevailing underlying stock price mid-quote (NBBO), at the time of the option transaction. Time to expiration is measured in seconds from the transaction time to the expiration date’s market close, and we use end-of-day 3-month Treasury bills for the risk free rate. With these inputs, we estimate 7 Each option leg of complex multi-leg orders counts as a separate order, and orders that cancel and replace an existing order are also counted as a separate order. https://cdn.cboe.com/resources/regulation/circulars/regulatory/RG16- 064.pdf 8 As with NOTO and PHOTO, the ITTO files include observations from the NOM and NASDAQ PHLX exchanges. The ITTO files do not include trader designation information, which is why we rely on both datasets for our analysis. 8 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 48,
    "chunk_index": 16,
    "word_count": 354,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "as a separate order. https://cdn.cboe.com/resources/regulation/circulars/regulatory/RG16- 064.pdf 8 As with NOTO and PHOTO, the ITTO files include observations from the NOM and NASDAQ PHLX exchanges. The ITTO files do not include trader designation information, which is why we rely on both datasets for our analysis. 8 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 48,
    "chunk_index": 17,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "implied volatility for each option transaction using the Black-Scholes option pricing model. Transaction-level implied volatility is then volume-weighted across contracts for each stock at the 15-minute level. We merge the data with OptionMetrics for information on option-day prices, CRSP for information on stock-day price and volume, and TAQ to measure intraday stock prices. We focus on options for individual common stocks (share codes 10 or 11 in CRSP), and we exclude LEAPS (options with maturities greater than one year)9. We also require a minimum retail volume of 50 option contracts per option chain each day. Figure 1 plots total retail option dollar trading volume as well as the fraction of retail volume to overall non-market maker volume for the January 2019 – June 2021 sample period. The plot shows that retail trading has grown considerably in recent years. For example, monthly non- professional customer dollar volume on Nasdaq’s Option Market and PHLX venues has increased from about $50 million in 2019 to as much as $160 million in 2021, and the share of these trades as percentage of non-market maker option volume is as high as 70% in 2021. These large retail volumes underscore retail traders’ dominant role in modern option markets. Panel A of Table 1 presents summary statistics from the set of options that meet our data filters from January 2019 to June 2021. Moneyness is on average negative, suggesting that the typical option is out of the money. Calls present 68% of the option sample, and the mean (median) days to expiration is 34.64 (11). 3. Characterizing Retail Option Trading This section characterizes retail option trading. Individual investors are often inexperienced and prone to gambling behavior (e.g. Boyer and Vorkink, 2014; and Byun and Kim, 2016) and 9 LEAPS account for a low fraction of retail volume (1.2% during our sample period). 9 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 48,
    "chunk_index": 18,
    "word_count": 311,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "Option Trading This section characterizes retail option trading. Individual investors are often inexperienced and prone to gambling behavior (e.g. Boyer and Vorkink, 2014; and Byun and Kim, 2016) and 9 LEAPS account for a low fraction of retail volume (1.2% during our sample period). 9 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 48,
    "chunk_index": 19,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "influenced by sentiment (Lemmon and Ni, 2014). Thus, we conjecture that retail investors have exposure to options with strong lottery-like features, such as purchases of short-dated, out-of-the- money options. Furthermore, consistent with uninformed speculation, we do not anticipate a strong relation between option trading and future stock returns. 3.1 Retail Option Trading Contract Characteristics How do retail investors trade options? We address this question by analyzing retail option volume for each of the eight different option transaction types. In particular, Panel B of Table 1 reports the fraction of overall retail option volume that is accounted for by purchasing calls, closing purchased call positions, writing calls, and closing written call positions, as well as the same set of trade positions for put options. Purchasing and later closing call option positions are the most common trades carried out by retail investors, and these two trade types accounts for 51% (30% + 21%) of all retail options trades. We observe that retail investors trade calls more than puts, and unsurprisingly many written positions expire without being closed out. In Figure 2 (top row), we plot cumulative retail volume partitioned by maturity and moneyness levels. In particular, we aggregate retail dollar volume across the eight trade position types within each maturity-moneyness category, and we scale each bin by total retail dollar volume. Additional plots separate calls and puts, again scaling by total retail volume. The most prominent trading feature emerging from the plots is that retail option traders emphasize short- dated options. For both calls and puts, maturities of one week account for a large fraction of overall trading, although there is nontrivial trading in options with maturities greater than four months. We also see that retail investors emphasize near-the-money and out-of-the money options over deep in- or out-of-the money options. 10 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 48,
    "chunk_index": 20,
    "word_count": 304,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "maturities of one week account for a large fraction of overall trading, although there is nontrivial trading in options with maturities greater than four months. We also see that retail investors emphasize near-the-money and out-of-the money options over deep in- or out-of-the money options. 10 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 48,
    "chunk_index": 21,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "In Table IA in the Internet Appendix, we regress retail dollar volume on firm and option contract characteristics. Consistent with the plots in Figure 2, we find that retail option trading is significantly higher in call contracts, in short maturity contracts, and for near- and out-of-the- money contracts. Regarding firm characteristics, we observe that retail option traders tend to purchase options on large stocks that have high volatility, idiosyncratic skewness, and recent returns, whereas retail underwriting activity is generally less related to firm characteristics other than emphasizing value stocks. 3.2 The Informativeness of Retail Option Trading Option traders have traditionally been viewed as sophisticated, and past work finds evidence of informed trading in option markets (e.g. Johnson and So, 2012; Hu, 2014; Ge, Lin, and Pearson, 2016). On the other hand, individual investors’ lack of experience may lead them to trade options in less sophisticated ways. In this section, we examine the informativeness of retail option trading for future stock returns by estimating a Fama-Macbeth regression model in which in which returns are regressed on a measure derived from the ratio of option-to-stock (O/S) volume (Roll, Schwartz, Subrahmanyam, 2010; Johnson and So, 2012; Ge, Lin, and Pearson, 2016). Specifically, future cumulative five-day stock returns are first regressed on the measure of retail option trading cross-sectionally each day, and we report point estimates from the time-series averages of the daily coefficients. The key regressor is a quintile index variable constructed from retail O/S ratios, which mitigates outlier effects (Johnson and So, 2012; Ge, Lin, and Pearson, 2016). The quintile indicators are computed from the O/S ratios for each stock and day by combining the alternative open-position retail option volume (call buying volume, put buying volume, etc.) with stock volume. To explore the informativeness of the options across different moneyness and maturity, we aggregate option volumes within each maturity or moneyness bin. 11 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 48,
    "chunk_index": 22,
    "word_count": 316,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "each stock and day by combining the alternative open-position retail option volume (call buying volume, put buying volume, etc.) with stock volume. To explore the informativeness of the options across different moneyness and maturity, we aggregate option volumes within each maturity or moneyness bin. 11 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 48,
    "chunk_index": 23,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "Short maturity, mid maturity, and long maturity are defined based on whether the maturity of the option is less than 7 days, 7 days to 20 days, or greater than 20 days, respectively. For call options, OTM, ATM, and ITM is defined as whether the ratio of the strike price to the stock price is greater than 1.025, between 0.975 and 1.025, or lower than 0.975, respectively. Analogously, for put option out-of-the-money (OTM), at-the-money (ATM), and in-the-money (ITM) is defined as whether the ratio of the strike price to the stock price is lower than 0.975, between 0.975 and 1.025, or greater than 1.025, respectively. In Table 2, we present results for bullish positions (call purchases) in Panel A, non-bullish positions (call writing) in Panel B, bearish positions (put purchases) in Panel C, and non-bearish positions (put writing) in Panel D. The findings suggest that short- and mid-term maturity option trades are uninformed, regardless of moneyness level or option position type. On the other hand, there is some evidence of informativeness for long-dated options, particularly for calls. In additional analysis, we also examine overall retail trade informativeness for each of the four open position transaction types (purchase call, write call, purchase put, write put). After aggregating across maturity and moneyness categories, we observe no significant relation between retail option trading and future stock returns for any position type. The return evidence provides little support to the view that retail option trading is informed overall or particularly in the maturity/moneyness categories preferred by retail traders.10 3.3 Retail Option Trading Implications for Implied Volatility Different retail trading patterns can have distinct implications for implied volatility. In particular, trading demand that pushes option prices up, without changes in underlying firm 10 Our findings are consistent with recent work by Ni et al., (2021) and Goncalves-Pinto, et al., (2020) that suggest noninformational trading and in particular stock price pressure may influence option / stock market predictability. 12 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 48,
    "chunk_index": 24,
    "word_count": 328,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "pushes option prices up, without changes in underlying firm 10 Our findings are consistent with recent work by Ni et al., (2021) and Goncalves-Pinto, et al., (2020) that suggest noninformational trading and in particular stock price pressure may influence option / stock market predictability. 12 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 48,
    "chunk_index": 25,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "fundamentals, will have the effect of increasing implied volatility. Analogously, trades that exert downward pressure on option prices will have the effect of reducing implied volatility. We therefore create a net option trading measure designed to capture the net expected effect of retail option trading on implied volatility. The net retail trading measure aggregates dollar volume across the eight position types by adding trades which put upward pressure on option prices and subtracting trades that create downward pressure. Trades expected to create upward pressure on option prices and included with a positive sign are: (1) new position call option purchases, (2) new position put option purchases, (3) closing previously written call positions (by buying calls), and (4) closing previously written put positions (by buying puts). Trades expected to create downward pressure on prices and included with a negative sign are: (5) closing previously purchased call positions (by selling calls), (6) closing previously purchased put positions (by selling puts), (7) new position call writing, and (8) new position put writing. The bottom row of Figure 2 presents the net trade analysis for bins sorted by maturity and moneyness. We continue to see an emphasis on short-dated options. However, the specific interpretation that is short-dated options tend to be purchased more than sold, which suggests retail investor demand will have upward pressure on short-dated options. On the other hand, we see that net trading of long dated options is negative overall, suggesting retail investors are more likely to write these options than purchase them, which can create downward pressure on long-maturity implied volatility. After separating the sample into calls and puts, we see that most of the net selling in long-dated options is focused on puts. The distinct retail trading patterns in Figure 2 offer testable hypotheses regarding their effects on implied volatility. 4. The Effects of Retail Trading on Option Markets 13 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 48,
    "chunk_index": 26,
    "word_count": 316,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "calls and puts, we see that most of the net selling in long-dated options is focused on puts. The distinct retail trading patterns in Figure 2 offer testable hypotheses regarding their effects on implied volatility. 4. The Effects of Retail Trading on Option Markets 13 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 48,
    "chunk_index": 27,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "The preceding evidence suggests that retail trading accounts for a large portion of overall option market activity. Retail investors specifically prefer to purchase short-dated, near- and out- of-the-money call options, while they tend to write long-dated puts. Further, we find little evidence that trading in these positions predict future stock returns, consistent with a speculative trading in options markets. Since option market makers cannot hedge perfectly due to market frictions and are sensitive to inventory risk (Garleanu, Pedersen, and Poteshman, 2009; and Muravyev, 2016), demand pressure can have effects on option prices and implied volatility (Bollen and Whaley, 2004). In this section, we examine retail trading pressure and its impact on implied volatility. 4.1 Identification Approach Option trading varies with market conditions, which makes it difficult to isolate the effects of retail option trading on implied volatility. Our approach relies on retail brokerage platform outages, in which option markets are open for trading but a considerable number of retail investors are unable to trade due to technical difficulties at their broker (Eaton et al., 2022). We identify brokerage outages using Downdetector.com, a web platform that compiles user complaints. Outage information on the website is updated at 15-minute time intervals and reflects both external user reports and internal verification checks. We focus on outages during market hours, and to ensure that the scale of an outage is material, we require a minimum of at least 200 outage reports during each 15-minute window. We restrict the sample to outages unique to a single broker to alleviate concerns that outages may be driven by market-related factors. The brokers in our sample include Charles Schwab, E-Trade, Fidelity, Robinhood, and TD Ameritrade. We do not include other major brokers (such as Interactive Brokers) because they do not have sufficient outages reported on Downdetector. Our sample brokers experienced a total of 80 outages with at least 200 complaints from the beginning 14 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 48,
    "chunk_index": 28,
    "word_count": 321,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "E-Trade, Fidelity, Robinhood, and TD Ameritrade. We do not include other major brokers (such as Interactive Brokers) because they do not have sufficient outages reported on Downdetector. Our sample brokers experienced a total of 80 outages with at least 200 complaints from the beginning 14 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 48,
    "chunk_index": 29,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "of 2019 through June 2021, when the Downdetector data is no longer available. The median length of outages is 45 minutes. Figure 1 plots the timing of platform outages using grey vertical lines. We see that broker outages are distributed throughout the sample period. Analyzing the effects of brokerage outages on option markets requires an assessment of which options retail investors would have traded in the absence of the outage. Our approach is to identify options that are heavily traded by retail investors in the days prior to the outage. We measure high retail interest using the top quintile of retail stock option trading measured over the 5 days prior to the day of the outage, while options in the other four quintiles of retail trading are considered to have relatively low retail interest. Our approach involves performing a difference-in-differences type analysis to examine the effects of retail option trading on option market outcomes. The time dimension compares the effects during outages to similar times of day during the previous five trading days, and the cross- sectional difference uses indicator variables to compare the options that retail investors are most likely to trade to options they are less likely to trade. One potential concern is that market conditions or implied volatility may change mechanically as the time to maturity falls, which could influence comparisons of outages to the previous five-day benchmark period. To address this issue, we also separately analyze post-outage periods that are measured one hour after the actual outage ends. If the passage of time mechanically influences the results, any changes during outages would also be observed during the post-outage period. Another concern is that market conditions may have caused the broker outage. As an additional robustness check, we plot intraday event-time figures to assess market conditions immediately before and after outages. 4.2 Brokerage Outages and Option Volume 15 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 48,
    "chunk_index": 30,
    "word_count": 316,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "also be observed during the post-outage period. Another concern is that market conditions may have caused the broker outage. As an additional robustness check, we plot intraday event-time figures to assess market conditions immediately before and after outages. 4.2 Brokerage Outages and Option Volume 15 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 48,
    "chunk_index": 31,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "We begin by exploring whether retail brokerage outages impact option trading volume. Our approach relies on the following model, estimated with OLS regressions: 𝑇𝑟𝑑 = 𝛼 +𝛽 𝑅𝑒𝑡𝑎𝑖𝑙 +𝛽 𝑂𝑢𝑡𝑎𝑔𝑒 +𝛽 𝑅𝑒𝑡𝑎𝑖𝑙 ×𝑂𝑢𝑡𝑎𝑔𝑒 + 𝛾 + 𝛿 +𝜀 . (1) 𝑖,𝑡 1 𝑖,𝑑−1 2 𝑡 3 𝑖,𝑑−1 𝑡 𝑖 𝑑 𝑖,𝑡 The sample consists of fifteen-minute intervals, t, for options aggregated up to each stock i during the outage window on day d, matched with fifteen-minute intervals for the same stock and time for each of the 5 trading days preceding the outage date. We include firm, γ, and day, δ , fixed i d effects in the model. The Retail variable represents an indicator variable that takes a value of i,d-1 one if the underlying stock is in the top quintile of retail option trading and zero otherwise. The Outage variable is an indicator variable equal to one during the outage period and zero otherwise. t We consider two alternative definitions for the retail option volume measure, 𝑇𝑟𝑑 . The 𝑖,𝑡 first measure captures total retail volume, which is defined as the natural log of retail option dollar volume aggregated across the option chain to the stock-day level. The second definition measures net retail trading volume, and it is designed to capture the implications of retail trading demand pressure for implied volatility, as discussed in Section 3.2. In particular, the net retail volume measure adds retail dollar volume for open-purchased-call, open-purchased-put, close-written- call, and close-written-put positions, and subtracts dollar volume for close-purchased-call, close- purchased-put, and open-written-call and open-writren-put positions. Table 3 reports the results for overall volume, with the regression estimates for the outage period reported in Panel A, and the post-outage period (beginning one hour after the actual outage ends) reported in Panel B. The results confirm that brokerage outages have a significant impact on retail option trading. For example, overall retail option volume drops by over 10% during outages for options favored the most by retail traders, relative to options on stocks less favored by retail traders. We also observe evidence of a bounce back after the outage, with volume being modestly 16 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 48,
    "chunk_index": 32,
    "word_count": 361,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "example, overall retail option volume drops by over 10% during outages for options favored the most by retail traders, relative to options on stocks less favored by retail traders. We also observe evidence of a bounce back after the outage, with volume being modestly 16 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 48,
    "chunk_index": 33,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "higher than during the benchmark period, consistent with pent up trading demand during outages from retail investors and inconsistent with market conditions or mechanical option features (such as shorter maturities) driving the outage evidence. In Table IA2 in the Internet Appendix, we analyze the effects of retail broker outages on non-retail option trading. Consistent with outages uniquely influencing retail trading, we find no evidence that outages significantly affect non-retail, non-market maker volume. The non-result helps alleviate endogeneity concerns that market conditions directly cause retail broker outages. The effects of retail traders on implied volatility depends on their relative tendency to purchase and sell options, and Table 4 therefore presents the outage evidence for net retail dollar volume, which measures retail option buying net of selling (as in Figure 2). In addition to studying the effects on options overall and calls versus puts, we also partition the option sample by maturity and moneyness. We observe that net option dollar volume significantly falls overall during the brokerage outages for options favored by retail investors. The significant drop is especially salient for the types of options that Figure 2 suggests retail investors trade the most, such as calls and options that are short-dated and out-of-the-money. In contrast, long-maturity options exhibit a significant increase in net dollar volume during broker outages, consistent with retail investors tendency to write rather than purchase long-dated options as evidenced in Figure 2. The outage findings regarding net retail trading in Table 4 create testable implications for our subsequent analysis on implied volatility. In particular, we anticipate that implied volatility will decrease overall and for option types that retail option investors are net buyers of on average. However, we would expect implied volatility to increase during outages for certain long-dated options, where retail investors are net sellers on average. 17 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 48,
    "chunk_index": 34,
    "word_count": 306,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "we anticipate that implied volatility will decrease overall and for option types that retail option investors are net buyers of on average. However, we would expect implied volatility to increase during outages for certain long-dated options, where retail investors are net sellers on average. 17 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 48,
    "chunk_index": 35,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "We also report net buying volume effects for a post-outage window beginning one hour after the actual outage ends (Panel B). The post-outage period effects tend to be statistically insignificant, although there is some evidence that net option trading bounces back after the outage ends, consistent with delayed demand. For example, options that retail investors trade the most: call options, short-dated options, and out-of-the-money options, experience a significant increase in net buying dollar volume measured one hour after the outage ends. 4.3 Brokerage Outages and Implied Volatility The previous section documents that broker outages have a significant negative impact on retail option activity and in particular on net retail demand pressure. As a result, outages have clear testable implications for implied volatility. Specifically, we anticipate a drop in implied volatility overall during outages, as well as variation across the maturity/moneyness surface based on the relative tendency of retail investors to purchase rather than write options. We test these predictions using the following OLS model: 𝐼𝑉𝑜𝑙𝑎 = 𝛼 +𝛽 𝑅𝑒𝑡𝑎𝑖𝑙 +𝛽 𝑂𝑢𝑡𝑎𝑔𝑒 +𝛽 𝑅𝑒𝑡𝑎𝑖𝑙 ×𝑂𝑢𝑡𝑎𝑔𝑒 + 𝛾 + 𝛿 +𝜀 . (2) 𝑖,𝑡 1 𝑖,𝑑−1 2 𝑡 3 𝑖,𝑑−1 𝑡 𝑖 𝑑 𝑖,𝑡 The dependent variable, 𝐼𝑉𝑜𝑙𝑎 , represents implied volatility. The sample, subscript denotations, 𝑖,𝑡 and independent variables are the same as those described for Eq. (1). Table 5 presents regression results for the aggregate option sample as well as separating options in to call and put contracts. Panel A presents results for the outage period, and we see that overall implied volatility significantly drops for options favored by retail investors when they are unable to trade. The estimated effect for the decrease in implied volatility of 0.039, relative to a median of 0.444 (from Table 1), which corresponds to a drop of roughly 8.8%. The call-put volatility spread has been shown to predict future stock returns and macro conditions (e.g. Bali and Hovakimian, 2009; Cremers and Weinbaum, 2010; An, et al., 2014; Han 18 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 48,
    "chunk_index": 36,
    "word_count": 330,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "a median of 0.444 (from Table 1), which corresponds to a drop of roughly 8.8%. The call-put volatility spread has been shown to predict future stock returns and macro conditions (e.g. Bali and Hovakimian, 2009; Cremers and Weinbaum, 2010; An, et al., 2014; Han 18 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 48,
    "chunk_index": 37,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "and Li, 2021), consistent with informed trading. Our evidence suggests that demand pressure from retail investors may also play a role, and we next consider whether retail broker outages impact implied volatilities for calls differently than puts. Consistent with stronger retail pressure in call options, we observe in the last three columns of Table 5 that implied volatility during retail broker outages decreases more for calls than for puts, and this difference is statistically significant.11 The stronger evidence for calls align with the evidence in Table 4 that the outage decline in net retail trading is stronger for calls than puts. Overall, the evidence in Table 5 is consistent with price pressure in options decreasing when retail investors leave the market. In the period one hour after the outage ends (Panel B), the coefficient signs generally flip, consistent with a post-outage rebound, although none of the effects are statistically significant. Moreover, the evidence that outages have a distinct effect on calls relative to puts is inconsistent with the view that the option market effect is driven by changes in volatility in the stock market (Eaton et al., 2022). The evidence that retail investors have larger effects on call implied volatility suggest that retail interest may help explain the call-put spread more generally. We examine this hypothesis in Figure IA1 in the Internet Appendix by plotting implied volatility separately for calls and puts for each quintile of retail option interest. The plots show that put-implied volatility is higher than call- implied volatility for quintiles 1 through 3, and both are similar in magnitude for quintile 4. However, for the quintile of stocks with the highest retail interest, call-implied volatility is greater than put-implied volatility. While the evidence is not definitive, it is consistent with outage evidence and supports the view that retail investors can affect the call-put implied volatility spread. 11 The call (put) sample only requires calls (puts) to be traded for a given stock (during the outage and the control periods), whereas in order to test that call implied volatility is different than put implied volatility, we require both calls and puts to be traded for each stock. 19 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 48,
    "chunk_index": 38,
    "word_count": 365,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "requires calls (puts) to be traded for a given stock (during the outage and the control periods), whereas in order to test that call implied volatility is different than put implied volatility, we require both calls and puts to be traded for each stock. 19 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 48,
    "chunk_index": 39,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "We next consider how the impact of outages on implied volatility is influenced by option moneyness. Previous research documents an implied volatility smile or smirk in stock options, and some authors suggest that demand pressure drives the variation in implied volatility across strike price (Bollen and Whaley, 2004; Garleanu, Pedersen, and Poteshman, 2009; Xing, Zhang, and Zhao, 2010). Our analysis focuses on the effects of retail investor demand pressure on the implied volatility moneyness curve. Table 6 presents the regression estimates of the effects of retail broker outages on implied volatility separately for out-of-the-money, at-the-money, and in-the-money options. For options on stocks favored by retail investors, implied volatility significantly drops for ATM and, particularly, OTM options, while the implied volatility for ITM options is not significantly different during the outages. The last column formally compares OTM to ITM options and confirms that implied volatility drops significantly more for OTM options. The evidence suggests that retail option demand pressure can impact how implied volatility varies with moneyness. We next consider the relation between implied volatility and option term-to-maturity. As with the other observed cross-sectional differences, the Black and Scholes (1973) assumptions predict that implied volatility should be flat across option maturities. However, evidence suggests that implied volatility does relate to maturity and that this relation varies over time (Mixon, 2007). Much of the research on implied volatility term structure studies index options rather than individual stock options. Further, there is little evidence on the role of individual investors. We exploit retail broker outages to examine whether retail trading pressure impacts implied volatility term structure. Table 7 shows that there is large variation in the broker outage effects on implied volatility across option term-to-maturity. In particular, implied volatility significantly decreases during 20 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 48,
    "chunk_index": 40,
    "word_count": 295,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "individual investors. We exploit retail broker outages to examine whether retail trading pressure impacts implied volatility term structure. Table 7 shows that there is large variation in the broker outage effects on implied volatility across option term-to-maturity. In particular, implied volatility significantly decreases during 20 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 48,
    "chunk_index": 41,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "outages for short- and mid-term options favored by retail investors, but significantly increases for long-dated options. We also observe evidence that implied volatility partially reverses in the post- outage period, and significantly so for short-dated options. The specific pattern of shifts in implied volatility is again consistent with the net option buying results in Table 4. Buying (selling) pressure lessens for short-dated (long-dated) options favored by retail investors during outages, which leads to decreases (increases) in implied volatility. The pent-up trading pressure picks up after the outage ends, leading the implied volatility effects to partially reverse. One implication of demand pressure by retail investors in short-dated options is that implied volatility will rise throughout the life of the option. In Figure IA2 in the Internet Appendix, we explore this conjecture by plotting the evolution of implied volatility throughout the life of an option. We observe that when the remaining time to maturity is between two and four months, the plots show small, non-monotonic differences between the implied volatilities of stock options in quintiles with low or high retail investor interest. However, implied volatility increases as maturity nears, and a monotonic spread emerges for stocks with low and high retail option interest, with the largest implied volatility being exhibited for short-dated options on stocks with high retail option interest. Although the evidence is primarily descriptive, it is consistent with outage evidence and supports the hypothesis that retail investors can have an impact on the term structure of implied volatility. To illustrate the effects of the retail brokerage outages on the implied volatility surface, we present 3-dimensional figures that consider variation in both maturity and moneyness. In particular, we partition options into more narrow maturity and moneyness bins and plot implied volatility during the control period, the outage period, and the post-outage period beginning one 21 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 48,
    "chunk_index": 42,
    "word_count": 309,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "implied volatility surface, we present 3-dimensional figures that consider variation in both maturity and moneyness. In particular, we partition options into more narrow maturity and moneyness bins and plot implied volatility during the control period, the outage period, and the post-outage period beginning one 21 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 48,
    "chunk_index": 43,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "hour after the end of the outage. As before, we compare options in the top quintile of retail activity (bottom three panels) to those in the lower four quintiles of retail interest (top three panels). Figure 4 confirms and fleshes out the earlier evidence. For options with low retail interest, the outages have minimal effects, as implied volatility does not change much over the event time for these options. In contrast, Figure 4 illustrates that options that retail investors buy the most, i.e., short-dated options near- or out-of-the-money, experience dramatic drops in implied volatility during the outages, while implied volatility reverts back to pre-outage levels in the post-outage period. The figure also highlights a modest increase in implied volatility for long-dated options during outages. 4.4 Additional Analyses and Robustness Tests An important potential concern in our setting is that outages may reflect capacity constraints that are reached during episodes of heightened market activity, and therefore outages may be endogenous with market conditions.12 In addition to the post-outage analysis we have already presented, we perform a number of additional analyses to address concerns that the findings may be spurious. Our approach is to repeat the difference-in-differences type model defined in Equations (1) and (2) for a number of data subsamples. The results are presented in Table 8, where for brevity we present only estimated coefficients and t-statistics on the interaction of the high retail interest and outage indicator variables. Specifically, we report the estimated effects on net retail dollar volume and then provide implied volatility results for all options as well as cross-sectional splits between calls and puts, OTM and ITM, and long-dated and short-dated options. 12 Platform capacity constraint issues may arise due to server capacity, hardware failure, software efficiency, or other issues related to platform overload. 22 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 48,
    "chunk_index": 44,
    "word_count": 303,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "volatility results for all options as well as cross-sectional splits between calls and puts, OTM and ITM, and long-dated and short-dated options. 12 Platform capacity constraint issues may arise due to server capacity, hardware failure, software efficiency, or other issues related to platform overload. 22 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 48,
    "chunk_index": 45,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "To address concerns that the findings are driven by a small number of meme stocks, Panel A of Table 8 removes the top 30 stocks by option volume proceeding each outage. In particular, it is possible that a few popular companies release firm-specific news that leads to a flurry of retail option trading that creates an outage. However, the resulting outage would also lead to a (relatively exogenous) negative shock to trading in no-news options, and we can study the effect of outages for this subsample. We find that the results remain robust after excluding 30 meme-type stocks for each outage, which suggests that the findings are not driven by news-related shocks for a small number of actively traded options. We next consider the possibility that outages may be particularly susceptible to after-hours market news by excluding outages that begin before 9:45am in New York. Panel B shows that the results are unchanged if we remove morning outages, which relieves concerns that our findings are driven by volatility after the market opens. Figure 1 shows retail option trading generally rises throughout the sample period, and we may therefore expect retail broker outages to have a larger effect later in the sample. Panels C and D break the sample into two periods: January 2019 to February 2020, and March 2020 to June 2021, respectively. Consistent with the greater prevalence of retail trading, the effects appear to stronger in the later sample period, although the results are generally statistically significant in both sample periods, suggesting that our main results are not driven by a short time period with outlier trading activity (such as the COVID-19 pandemic era). Eaton et al., (2022) find evidence that Robinhood stock market investors are more speculative and liquidity-demanding than investors at other retail brokers, and Panels E and F distinguish between Robinhood and other brokers. The results are largely similar across brokers. For example, both sets of outages experience a significantly drop in net retail option volume (- 0.120 and -0.114 for Robinhood and non-Robinhood outages, respectively) and implied volatility 23 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 48,
    "chunk_index": 46,
    "word_count": 349,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "E and F distinguish between Robinhood and other brokers. The results are largely similar across brokers. For example, both sets of outages experience a significantly drop in net retail option volume (- 0.120 and -0.114 for Robinhood and non-Robinhood outages, respectively) and implied volatility 23 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 48,
    "chunk_index": 47,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "(-0.051 and -0.039 for outages at Robinhood versus other brokers) for the options most favored by retail investors. While Eaton et al., (2022) find evidence that stock traders differ in trading styles on average across retail brokers, our evidence suggests that retail option traders trade in similar ways on average across retail brokers. Another potential concern is that the variation in implied volatility around outages may primarily reflect movements in the underlying stock market rather than the option market (e.g. Muravyev, Pearson, and Broussard, 2013). In Table IA3 in the Internet Appendix, we replace implied volatility with the level of option prices. The coefficient estimates suggest that retail brokerage outages lead option prices to significantly fall, with the exception of prices for long- dated options which significantly rise. The option price evidence matches the observed pattern in implied volatility and supports the interpretation that retail investors create demand pressure on option prices. Finally, we present event-time figures that provide convincing evidence of the effects of retail brokerage outages on implied volatility. In particular, for the subset of 26 outages with a 30 minute duration, Figure 3 plots implied volatility for 30 minutes before outages to 60 minutes after outages. The figures separately plot implied volatility for options in the top quintile of retail interest and options in the remaining four quintiles. Regardless of option sample studied, we see that during the pre-outage window standardized implied volatility is similar for options on stocks favored by retail investors as well as options that are less favored. Implied volatility changes abruptly during the outage period, but only for the options favored by retail investors. The outage effects for the high retail group are especially dramatic for call options, out-of-the-money options, and short- dated options, which are the contracts with the highest net retail trading in Figure 2. Consistent 24 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 48,
    "chunk_index": 48,
    "word_count": 311,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "period, but only for the options favored by retail investors. The outage effects for the high retail group are especially dramatic for call options, out-of-the-money options, and short- dated options, which are the contracts with the highest net retail trading in Figure 2. Consistent 24 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 48,
    "chunk_index": 49,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "with the results in the tables, implied volatility for these options partially bounces back for the high interest group in the post-outage period. 5. Conclusions Option market volume has dramatically increased in recent years, led by an influx of retail investors. This paper examines the trading behavior of retail traders and the effects they have on option markets. We show that the retail option trading is particularly concentrated in short-dated, out-of-the-money call options. Further, our evidence suggests that retail trades are on average uninformed about future stock returns. This evidence is consistent with speculative trading by retail investors. We go on to study the effects of retail trading on option market volume and implied volatility, using brokerage outages as exogenous shocks to retail option trading. We find that net buying volume by retail investors significantly drops during outages for the types of options retail investors prefer, such as call, short-dated, and OTM options. In contrast, net buying volume increases during outages for long-dated options, suggesting that retail investor are usually writers of such options. The outage evidence further suggests that retail investors significantly impact option implied volatility. Consistent with the net volume effects, we find that implied volatility significantly decreases overall and in particular for call, OTM, and short-dated options during outages. In contrast, implied volatility significantly increases for long-dated options. Additional analysis finds that these results are unique to the outage period, continue to hold during sub-sample periods, and are not driven by a small number of the most actively traded options. This paper provides new evidence on the effects of retail trading in option markets. Our results suggest that retail demand pressure and its effects on implied volatility substantially 25 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 48,
    "chunk_index": 50,
    "word_count": 287,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "sub-sample periods, and are not driven by a small number of the most actively traded options. This paper provides new evidence on the effects of retail trading in option markets. Our results suggest that retail demand pressure and its effects on implied volatility substantially 25 Electronic copy available at: https://ssrn.com/abstract=4104788 unwinds when retail investors are unable to trade and that retail option trading can significantly impact the implied volatility call-put spread, moneyness curve, and term structure. 26 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 27,
    "page_range": "p.27-28",
    "total_pages": 48,
    "chunk_index": 51,
    "word_count": 82,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.27-28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "suggest that retail demand pressure and its effects on implied volatility substantially 25 Electronic copy available at: https://ssrn.com/abstract=4104788 unwinds when retail investors are unable to trade and that retail option trading can significantly impact the implied volatility call-put spread, moneyness curve, and term structure. 26 Electronic copy available at: https://ssrn.com/abstract=4104788 Appendix A: Variable Definitions A.1 Key Explanatory Variables • Retail – Indicator variable equal to one for stock options with high retail option trading i,d-1 volume over the five trading days preceding the outage. • Outage – An indicator variable that denotes periods experiencing brokerage platform outages (1 if an outage occurs during period t and 0 otherwise). A.2 Outcome Variables • Retail Option Dollar Volume – The sum of open-buy, open-write, close-write, and close-sell option dollar volume. • Net Retail Option Dollar Volume – The sum of open-buy and close-write dollar volume minus close-sell and open-write dollar volume. • Return[1,5] – This variable represents future stock returns computed from day t+1 through day t+5. • Implied Volatility – The volatility implied by the Black-Scholes option pricing model given the characteristics and price of each option trade, volume-weighted to fifteen-minute intervals. A.3 Control Variables • Short Maturity – An indicator variable equals 1 if the maturity of the option is less or equal to 7 days and 0 otherwise. • Mid Maturity – An indicator variable equals 1 if the maturity of the option is between 7 days and 20 days and 0 otherwise. • Long Maturity – An indicator variable equals 1 if the maturity of the option is greater than 20 days and 0 otherwise. • Out of the Money –An indicator variable equals 1 if the ratio of the strike price to the stock price is lower than 0.975 for put options and greater than 1.025 for call options and 0 otherwise. • At the Money – An indicator variable equals 1 if the ratio of the strike price to the stock price is between 0.975 and 1.025 for both call and put options and 0 otherwise. • In the Money – An indicator variable equals 1 if the ratio of the strike price to the stock price is greater than 1.025 for put options and lower than 0.975 for call options and 0 otherwise. 27 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 48,
    "chunk_index": 52,
    "word_count": 384,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "and put options and 0 otherwise. • In the Money – An indicator variable equals 1 if the ratio of the strike price to the stock price is greater than 1.025 for put options and lower than 0.975 for call options and 0 otherwise. 27 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "1. Introduction",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 48,
    "chunk_index": 53,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "An, B.J., Ang, A., Bali, T.G. and Cakici, N., 2014. The Joint Cross Section of Stocks and Options. Journal of Finance, 69: 2279-2337. Bali, T.G. and Hovakimian, A., 2009. Volatility Spreads and Expected Stock Returns. Management Science, 55: 1797-1812. Banerji, G., 2021. Individuals Embrace Options Trading, Turbocharging Stock Markets. Retrieved from https://www.wsj.com/articles/individuals-embrace-options-trading-turbocharging-stock- markets-11632661201 Black, F. and Scholes, M., 1973. The Pricing of Options and Corporate Liabilities. Journal of Political Economy, 81: 637-654. Bollen, N.P. and Whaley, R.E., 2004. Does Net Buying Pressure Affect the Shape of Implied Volatility Functions? Journal of Finance, 59: 711-753. Bondarenko, O., 2014. Why Are Put Options So Expensive? The Quarterly Journal of Finance, 4: Boyer, B.H. and Vorkink, K., 2014. Stock Options as Lotteries. Journal of Finance, 69: 1485- 1527. Bryzgalova, S., Pavlova, A. and Sikorskaya, T., 2022. Retail Trading in Options and the Rise of the Big Three Wholesalers. Working paper. Byun, S.J. and Kim, D.H., 2016. Gambling Preference and Individual Equity Option Returns. Journal of Financial Economics, 122: 155-174. Cremers, M. and Weinbaum, D., 2010. Deviations from Put-Call Parity and Stock Return Predictability. Journal of Financial and Quantitative Analysis, 45: 335-367. Dennis, P. and Mayhew, S., 2002. Risk-Neutral Skewness: Evidence from Stock Options. Journal of Financial and Quantitative Analysis, 37: 471-493. de Silva, T., Smith, K. and So, E.C., 2022. Losing is Optional: Retail Option Trading and Earnings Announcement Volatility. Working paper. Eaton, G.W., Green, T.C., Roseman, B. and Wu, Y., 2022. Retail Trader Sophistication and Stock Market Quality: Evidence from Brokerage Outages. Journal of Financial Economics, 146: 502-528. Ernst, T. and Spatt, C.S., 2022. Payment for Order Flow and Asset Choice. Working paper. Eisdorfer, A., Goyal, A., and Zhdanov, A., 2020. Cheap Options are Expensive. Working paper. Ge, L., Lin, T.C. and Pearson, N.D., 2016. Why does the option to stock volume ratio predict stock returns?. Journal of Financial Economics, 120: 601-622. 28 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "References",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 48,
    "chunk_index": 54,
    "word_count": 316,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "and Asset Choice. Working paper. Eisdorfer, A., Goyal, A., and Zhdanov, A., 2020. Cheap Options are Expensive. Working paper. Ge, L., Lin, T.C. and Pearson, N.D., 2016. Why does the option to stock volume ratio predict stock returns?. Journal of Financial Economics, 120: 601-622. 28 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "References",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 48,
    "chunk_index": 55,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "Goncalves-Pinto, L., Grundy, B., Hameed, A., and van der Heijden, T,, and Zhu, Y., 2020. Why Do Option Prices Predict Stock Returns? The Role of Price Pressure in the Stock Market. Management Science, 66: 3903-3926. Goyal, A. and Saretto, A., 2009. Cross-section of Option Returns and Volatility. Journal of Financial Economics, 94: 310-326. Han, B. and Li, G., 2021. Information Content of Aggregate Implied Volatility Spread. Management Science, 67: 1249-1269. Hu, J., 2014. Does option trading convey stock price information? Journal of Financial Economics, 111: 625–645. Johnson, T.L. and So, E.C., 2012. The option to stock volume ratio and future returns. Journal of Financial Economics, 106: 262-286. Jones, C., Reed, A., and Waller, W., 2021. When Brokerages Restrict Retail Investors, Does the Game Stop? Working Paper. Lakonishok, J., Lee, I., Pearson, N., and Poteshman, A., 2007. Option Market Activity. Review of Financial Studies, 20: 813-857. Mixon, S., 2007. The Implied Volatility Term Structure of Stock Index Options. Journal of Empirical Finance, 14: 333-354. Muravyev, D., 2016. Order flow and Expected Option Returns. Journal of Finance, 71: 673-708. Muravyev, D., Pearson, N., and Broussard, J., 2013. Is There Price Discovery in Equity Options? Journal of Financial Economics, 107: 259-283. Ni., S., Pearson, N., Poteshman, and White, J., 2021. Does Option Trading Have a Pervasive Impact on Underlying Stock Prices? Review of Financial Studies, 34: 1952-1986.Pan, J., 2002. The Jump-Risk Premia Implicit in Options: Evidence from an Integrated Time-Series Study. Journal of Financial Economics, 63: 3-50. Pan, J., and Poteshman, A., 2006. The Information in Option Volume for Future Stock Prices. Review of Financial Studies, 19: 871-908. Poteshman, A.M. and Serbin, V., 2003. Clearly Irrational Financial Market Behavior: Evidence from the Early Exercise of Exchange Traded Stock Options. The Journal of Finance, 58: 37- 70. Roll, R., Schwartz, E. and Subrahmanyam, A., 2010. O/S: The Relative Trading Activity in Options and Stock. Journal of Financial Economics, 96: 1-17. Vasquez, A., 2017. Equity Volatility Term Structures and the Cross Section of Option Returns. Journal of Financial and Quantitative Analysis, 52: 2727-2754. Xing, Y., Zhang, X. and Zhao, R., 2010. What Does the Individual Option Volatility Smirk Tell Us about Future Equity Returns? Journal of Financial and Quantitative Analysis, 45: 641-662. 29 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "References",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 48,
    "chunk_index": 56,
    "word_count": 373,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "and the Cross Section of Option Returns. Journal of Financial and Quantitative Analysis, 52: 2727-2754. Xing, Y., Zhang, X. and Zhao, R., 2010. What Does the Individual Option Volatility Smirk Tell Us about Future Equity Returns? Journal of Financial and Quantitative Analysis, 45: 641-662. 29 Electronic copy available at: https://ssrn.com/abstract=4104788 Yan, S., 2011. Jump Risk, Stock Returns, and Slope of Implied Volatility Smile. Journal of Financial Economics, 99: 216-233. 30 Electronic copy available at: https://ssrn.com/abstract=4104788 Figure 1. Monthly Retail Option Trading and Broker Platform Outage Dates. The figure illustrates monthly retail trading and brokerage outages. The blue solid line plots total retail option trading volume in millions (left axis), and the red dashed line plots total retail option trading volume as a percentage of total non-market maker volume (right axis). The trading data is sourced from the Nasdaq Options Market and Nasdaq PHLX, and we use all non-professional customer trades to proxy for retail trading. The gray bars denote days in which a retail broker (Robinhood, Ameritrade, E-trade, or Schwab) experienced an interruption during the regular trading hours of 9:30 to 16:00 EST. Platform outages are defined as having at least 200 outage reports on Downdetector.com. 31 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "References",
    "page_number": 31,
    "page_range": "p.31-33",
    "total_pages": 48,
    "chunk_index": 57,
    "word_count": 202,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.31-33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "for retail trading. The gray bars denote days in which a retail broker (Robinhood, Ameritrade, E-trade, or Schwab) experienced an interruption during the regular trading hours of 9:30 to 16:00 EST. Platform outages are defined as having at least 200 outage reports on Downdetector.com. 31 Electronic copy available at: https://ssrn.com/abstract=4104788 Trade Volume – All Options Trade Volume – Call Options Trade Volume – Put Options Net Trade Volume – All Options Net Trade Volume – Call Options Net Trade Volume – Put Options -5% 0% 5% 10% 15% 20% Figure 2. Retail Option Volume by Expiration and Strike level. The figure plots retail volume share and net retail option volume share for different moneyness and maturity categories. Net Retail Option Volume adds open-buy-call, open-buy-put, close-write-call, and close-write-put and subtracts close-sell-call, close-sell- put, open-write-call, and open-write-put dollar volume, which is then scaled by total retail dollar volume. Values are averaged across option chains, across stocks, and then across days in the Jan. 2019-July-2021 sample period. 32 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "References",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 48,
    "chunk_index": 58,
    "word_count": 170,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "Volume adds open-buy-call, open-buy-put, close-write-call, and close-write-put and subtracts close-sell-call, close-sell- put, open-write-call, and open-write-put dollar volume, which is then scaled by total retail dollar volume. Values are averaged across option chains, across stocks, and then across days in the Jan. 2019-July-2021 sample period. 32 Electronic copy available at: https://ssrn.com/abstract=4104788 Out of the Money At the Money In the Money Short Maturity Mid Maturity Long Maturity Figure 3. Implied Volatility around Retail Brokerage Outages This figure plots standardized implied volatility series surrounding 30-minute outages (represented in grey) for options, aggregated up to the stock level, in the top quintile of retail interest (red solid line) versus those in the other four quintiles (dotted blue line). Appendix A defines the variables. 33 Electronic copy available at: https://ssrn.com/abstract=4104788 Control Period – Low Retail Outage Period – Low Retail Post Outage Period – Low Retail Control Period – High Retail Outage Period – High Retail Post Outage Period – High Retail 0.2 0.4 0.6 0.8 1.0 1.2 Figure 4. Implied Volatility Surface around Retail Brokerage Outages. This figure illustrates implied volatility levels in various maturity-moneyness bins before, during, and after brokerage outages for options, aggregated to the stock level, favored the most by retail investors (High Retail) compared to those less favored by retail investors (Low Retail). 34 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "All Options Call Options Put Options",
    "page_number": 34,
    "page_range": "p.34-36",
    "total_pages": 48,
    "chunk_index": 59,
    "word_count": 220,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "All Options Call Options Put Options (p.34-36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "Retail Brokerage Outages. This figure illustrates implied volatility levels in various maturity-moneyness bins before, during, and after brokerage outages for options, aggregated to the stock level, favored the most by retail investors (High Retail) compared to those less favored by retail investors (Low Retail). 34 Electronic copy available at: https://ssrn.com/abstract=4104788 Table 1. Summary Statistics for Retail Investor Option Trading The table presents descriptive statistics for retail option trades. Panel A presents option-day level summary statistics, with the exception of Total Dollar Retail Trade Volume, which is aggregated across the option chain to the stock-day level. Panel B reports trading descriptive statistics at the stock-day level. The sample spans January 2019 to June 2021. We require stocks in the sample to have a daily retail total contract volume of greater than 50 and to be common stocks (share code 10 or 11). Panel A: Option-Level Characteristics Standard 25th 75th Mean Deviation Percentile Median Percentile Implied Volatility 0.496 0.816 0.317 0.444 0.622 Days to Expiration 34.64 57.35 4 11 37 Call 0.681 0.466 0 1 1 Moneyness -0.164 4.192 -0.128 -0.045 -0.003 Total Dollar Retail Trade Volume 543,589 6,382,760 5,787.50 21,705 94,178 Panel B: Retail Volume Percentage by Position Type Purchasing Calls Writing Calls Open Close Open Close Position Position Position Position Fraction of Retail Volume 0.3033 0.2136 0.1612 0.0735 Purchasing Puts Writing Puts Open Close Open Close Position Position Position Position Fraction of Retail Volume 0.0736 0.0486 0.0866 0.0396 35 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "All Options Call Options Put Options",
    "page_number": 36,
    "page_range": "p.36-37",
    "total_pages": 48,
    "chunk_index": 60,
    "word_count": 244,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "All Options Call Options Put Options (p.36-37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "Percentage by Position Type Purchasing Calls Writing Calls Open Close Open Close Position Position Position Position Fraction of Retail Volume 0.3033 0.2136 0.1612 0.0735 Purchasing Puts Writing Puts Open Close Open Close Position Position Position Position Fraction of Retail Volume 0.0736 0.0486 0.0866 0.0396 35 Electronic copy available at: https://ssrn.com/abstract=4104788 Table 2. The Informativeness of Retail Option Trading. The table reports the estimates of coefficients from univariate Fama-Macbeth regressions of future stock returns on quintile indicators of retail option trading, measured with option-to-stock (O/S) ratios. Future stock returns are measured during the 5-day period following the observation of the retail option trading measure. The sample consists of common stocks with options traded on the Nasdaq from January 2019 to June 2021. For each firm, we sum daily option volumes within each moneyness and maturity bin and then divide by the daily stock volumes from CRSP to compute the signed O/S measures. O/S quintiles are formed cross-sectionally each day. Short maturity, mid maturity, and long maturity is defined as whether the maturity of the option is less than 7 days, 7 days to 20 days, or greater than 20 days, respectively. For put (call) options, out-of-money (OTM), at-the-money (ATM), and in-the-money (ITM) is defined as whether the ratio of the strike price to the stock price is lower than 0.975 (greater than 1.025), between 0.975 and 1.025, and greater than 1.025 (lower than 0.975), respectively. Each panel shows the results for bullish positions (net call purchases in Panel A), non-bullish positions (net call writing in Panel B), bearish positions (net put purchases in Panel C), and non-bearish positions (net put writing in Panel D). The t-statistics based on Newey and West (1987) adjusted standard errors with lags equal to twice the horizon of the dependent variable are shown in parentheses below the mean coefficient estimates. ∗∗∗, ∗∗, and ∗ indicate statistical significance at the 1%, 5%, and 10% levels, respectively. Appendix A provides further details on data definitions. Moneyness Level Out of the Money At the Money In the Money Panel A: Retail Call Purchases Short Maturity 0.0065 0.0243 -0.0344 (0.15) (0.53) (-0.54) Mid Maturity 0.0546 0.0007 -0.0250 (1.31) (0.01) (-0.34) Long Maturity 0.0799** -0.0081 0.0924* (2.18) (-0.19) (1.71) Panel B: Retail Call Writing Short Maturity -0.0183 0.0123 -0.0456 (-0.44) (0.38) (-0.68) Mid Maturity 0.0054 -0.0842 -0.1210 (0.17) (-1.14) (-0.99) Long Maturity -0.0680* -0.0865** -0.0822 (-1.95) (-2.12) (-1.40) Panel C: Retail Put Purchases Short Maturity 0.0285 0.0593 -0.0227 (0.55) (1.19) (-0.30) Mid Maturity -0.0812 0.0128 0.1230 (-1.35) (0.22) (0.89) Long Maturity -0.0729 -0.0863 -0.0591 (-1.22) (-1.50) (-0.55) Panel D: Retail Put Writing Short Maturity -0.0052 0.0133 -0.0031 (-0.10) (0.32) (-0.03) Mid Maturity 0.0395 -0.0571 0.0905 (0.77) (-1.09) (0.63) Long Maturity -0.0154 -0.0483 0.0933 (-0.35) (-0.93) (0.89) 36 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "All Options Call Options Put Options",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 48,
    "chunk_index": 61,
    "word_count": 461,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "All Options Call Options Put Options (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "Maturity -0.0812 0.0128 0.1230 (-1.35) (0.22) (0.89) Long Maturity -0.0729 -0.0863 -0.0591 (-1.22) (-1.50) (-0.55) Panel D: Retail Put Writing Short Maturity -0.0052 0.0133 -0.0031 (-0.10) (0.32) (-0.03) Mid Maturity 0.0395 -0.0571 0.0905 (0.77) (-1.09) (0.63) Long Maturity -0.0154 -0.0483 0.0933 (-0.35) (-0.93) (0.89) 36 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "All Options Call Options Put Options",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 48,
    "chunk_index": 62,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "All Options Call Options Put Options (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "Table 3. Retail Broker Outages and Retail Trader Option Dollar Volume. This table reports the results from OLS regressions for total retail option dollar volume. Column labels denote different option samples. Panel A presents results for the outage period and Panel B for the post- outage period which begins one hour after the outage. The sample consists of fifteen-minute intervals, t, for options aggregated up to each stock i during the window on day d when the broker experiences an outage, matched with fifteen-minute intervals for the same stock and time for each of the 5 trading days preceding the outage date. Retail represents an indicator variable that is one if the security is in the top i,d-1 quintile of expected retail trading and zero otherwise. Outage is an indicator variable equal to one during t the outage period and zero otherwise. The Dollar Volume dependent variable aggregates across all option trading dollar volume and is logged. Each specification includes firm and day fixed effects. ∗∗∗, ∗∗, and ∗ indicate statistical significance at the 1%, 5%, and 10% levels, respectively, with t-statistics reported in parentheses for standard errors clustered at the firm and day level. Appendix A provides further details on data definitions. Panel A: Outage Period All Options Calls Puts Retail × Outage -0.1023* -0.0953** -0.0416* i,d-1 t (-1.7965) (-2.3640) (-1.9378) Retail -0.0082 -0.0436 0.0413 i,d-1 (-0.1282) (-0.5361) (0.5629) Outage 0.1123 0.1132 0.0938 t (1.4387) (1.4119) (0.7543) Observations 193,083 173,456 152,060 Degrees of Freedom 1921 1917 1903 R-squared 0.0523 0.0389 0.0269 Panel B: Post-Outage Period All Options Calls Puts Retail × Outage 0.0214* 0.0405* -0.0327 i,d-1 t (1.7536) (1.7113) (-0.5590) Retail -0.0562 -0.0547 -0.0114 i,d-1 (-0.703) (-0.6539) (-0.0983) Outage -0.1396 -0.1301 -0.0649 t (-0.6842) (-0.7019) (-0.3793) Observations 142,881 143,968 126,210 Degrees of Freedom 1921 1917 1903 R-squared 0.0253 0.0194 0.0191 37 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "All Options Call Options Put Options",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 48,
    "chunk_index": 63,
    "word_count": 307,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "All Options Call Options Put Options (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "Options Calls Puts Retail × Outage 0.0214* 0.0405* -0.0327 i,d-1 t (1.7536) (1.7113) (-0.5590) Retail -0.0562 -0.0547 -0.0114 i,d-1 (-0.703) (-0.6539) (-0.0983) Outage -0.1396 -0.1301 -0.0649 t (-0.6842) (-0.7019) (-0.3793) Observations 142,881 143,968 126,210 Degrees of Freedom 1921 1917 1903 R-squared 0.0253 0.0194 0.0191 37 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "All Options Call Options Put Options",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 48,
    "chunk_index": 64,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "All Options Call Options Put Options (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "Table 4. Retail Broker Outages and Net Retail Trader Option Dollar Volume. This table reports the results from OLS regressions for retail option net dollar volume. Column labels denote different option samples. Panel A presents results for the outage period and Panel B for the post-outage period which begins one hour after the outage. The sample consists of fifteen-minute intervals, t, for options aggregated up to each stock i during the window on day d when the broker experiences an outage, matched with fifteen-minute intervals for the same stock and time for each of the 5 trading days preceding the outage date. Retail represents an indicator variable that is one if the security is in the top quintile of expected i,d-1 retail trading and zero otherwise. Outage is an indicator variable equal to one during the outage period and zero otherwise. The Net Dollar Volume dependent t variable adds open-buy-call, open-buy-put, close-write-call, and close-write-put and subtracts close-sell-call, close-sell-put, open-write-call, and open-write-put dollar volume. Each specification includes firm and day fixed effects. ∗∗∗, ∗∗, and ∗ indicate statistical significance at the 1%, 5%, and 10% levels, respectively, with t-statistics reported in parentheses for standard errors clustered at the firm and day level. Appendix A provides further details on data definitions. Panel A: Outage Period All Options Calls Puts Short Maturity Mid Maturity Long Maturity OTM ATM ITM Retail × Outage -0.1267*** -0.0695** -0.0348** -0.1242*** -0.0306* 0.0278* -0.1957** -0.0814 -0.0378 i,d-1 t (-2.6803) (-2.3461) (-2.1256) (-2.7481) (-1.8215) (1.7195) (-2.3514) (-1.3158) (-1.5714) Retail -0.1811 -0.1113 -0.0652 -0.1268 -0.0285 -0.0117 -0.0422 -0.1198 0.0042 i,d-1 (-1.0695) (-0.8892) (-1.1227) (-0.6432) (-1.1834) (-0.9523) (1.1103) (-0.1538) (1.2516) Outage -0.0675 -0.0483 -0.0156 -0.0087 -0.035 -0.0173 -0.0217 -0.0241 -0.0051 t (-0.2826) (-0.4258) (-0.0843) (-0.2258) (-1.0473) (-0.7185) (-1.3390) (-0.5078) (-0.3044) Observations 193,083 173,456 152,060 138,492 135,701 172,093 148,209 154,068 83,070 Degrees of Freedom 1921 1917 1903 1870 1850 1920 1885 1896 1766 R-squared 0.0343 0.0633 0.0615 0.123 0.1192 0.0454 0.1152 0.0373 0.1325 Panel B: Post-Outage Period All Options Calls Puts Short Maturity Mid Maturity Long Maturity OTM ATM ITM Retail × Outage 0.0436 0.0415* 0.0217 0.0458** 0.0057 0.0001 0.1013* -0.0043 -0.0012 i,d-1 t (1.5341) (1.7118) (1.0311) (2.3898) (0.7539) (0.0721) (1.8962) (-0.7940) (-0.8294) Retail -0.0292 -0.0937 0.0004 -0.0108 -0.0199 0.0014 -0.0058 -0.0088 0.0028 i,d-1 (-0.5299) (-0.0299) (0.1456) (-0.5358) (-0.4044) (1.3339) (-1.0382) (-1.2791) (1.0723) Outage -0.0042 -0.0025 -0.0035 -0.0114 -0.0152 -0.0023 -0.0062 -0.0113 0.0006 t (-1.2934) (-0.2238) (-0.9134) (-1.4939) (-0.1613) (-0.5972) (-0.6699) (-0.0175) (0.1656) Observations 160,259 143,968 126,210 114,948 112,632 142,837 123,013 127,876 68,948 Degrees of Freedom 1921 1917 1903 1870 1850 1920 1885 1896 1766 R-squared 0.0519 0.0022 0.1325 0.0059 0.0188 0.1249 0.0022 0.1373 0.0512 38 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "All Options Call Options Put Options",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 48,
    "chunk_index": 65,
    "word_count": 439,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "All Options Call Options Put Options (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "-0.0113 0.0006 t (-1.2934) (-0.2238) (-0.9134) (-1.4939) (-0.1613) (-0.5972) (-0.6699) (-0.0175) (0.1656) Observations 160,259 143,968 126,210 114,948 112,632 142,837 123,013 127,876 68,948 Degrees of Freedom 1921 1917 1903 1870 1850 1920 1885 1896 1766 R-squared 0.0519 0.0022 0.1325 0.0059 0.0188 0.1249 0.0022 0.1373 0.0512 38 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "All Options Call Options Put Options",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 48,
    "chunk_index": 66,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "All Options Call Options Put Options (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "Table 5. Retail Broker Outages and Implied Volatility. This table presents estimated slope coefficients and associated t-statistics, in parentheses, from OLS regressions in which the dependent variable is implied volatility and the dependent variables are a high retail interest indicator, an outage indicator, and an interaction between these two. The column labels denote the different option contract samples. Panel A presents results for the actual outage period and Panel B for post-outage period beginning one hour after the actual outage ends. The sample consists of fifteen-minute intervals, t, for options aggregated up to each stock i during the window on day d when the broker experiences an outage, matched with fifteen-minute intervals for the same stock and time for each of the 5 trading days preceding the outage date. The Retail variable represents and indicator variable i,d-1 that takes a value of one if the security is in the top quintile of expected retail trading and zero otherwise. The Outage variable is an indicator variable equal to one during the outage period and zero otherwise. We t also include firm and day fixed effects in the model. ∗∗∗, ∗∗, and ∗ indicate statistical significance at the 1%, 5%, and 10% levels, respectively for t-statistics with standard errors clustered at the firm and day level. Appendix A provides further details on data definitions. Panel A: Outage Period All Options Calls Puts Call - Put Retail × Outage -0.0389*** -0.0523*** -0.0314** -0.0206*** i,d-1 t (-3.1603) (-4.0293) (-2.1136) (-3.6472) Retail 0.0841 0.0646 -0.0183 0.0657 i,d-1 (0.3229) (0.4521) (-0.4123) (0.3862) Outage -0.0511 0.0353 -0.0298 -0.0431 t (-0.1793) (0.1456) (-0.4103) (-0.7139) Observations 193,083 173,456 152,060 148,211 Degrees of Freedom 1921 1917 1903 1876 R-squared 0.2141 0.0882 0.193 0.1752 Panel B: Post-Outage Period All Options Calls Puts Call - Put Retail × Outage 0.0193 0.0317 0.0126 0.0179 i,d-1 t (1.1526) (1.5837) (0.4190) (0.6213) Retail 0.0789 0.0391 -0.0239 0.0403 i,d-1 (0.1538) (1.2463) (-0.1575) (1.1452) Outage 0.0628 0.0801 0.0058 0.0755 t (1.0851) (0.7229) (1.1382) (0.9170) Observations 160,259 143,968 126,210 119,347 Degrees of Freedom 1921 1917 1903 1876 R-squared 0.0918 0.1832 0.1673 0.1426 39 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "All Options Call Options Put Options",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 48,
    "chunk_index": 67,
    "word_count": 350,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "All Options Call Options Put Options (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "0.0179 i,d-1 t (1.1526) (1.5837) (0.4190) (0.6213) Retail 0.0789 0.0391 -0.0239 0.0403 i,d-1 (0.1538) (1.2463) (-0.1575) (1.1452) Outage 0.0628 0.0801 0.0058 0.0755 t (1.0851) (0.7229) (1.1382) (0.9170) Observations 160,259 143,968 126,210 119,347 Degrees of Freedom 1921 1917 1903 1876 R-squared 0.0918 0.1832 0.1673 0.1426 39 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "All Options Call Options Put Options",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 48,
    "chunk_index": 68,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "All Options Call Options Put Options (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "Table 6. Retail Broker Outages and the Implied Volatility Moneyness Curve This table presents estimated slope coefficients and associated t-statistics, in parentheses, from OLS regressions in which the dependent variable is implied volatility and the independent variables are a high retail interest indicator, an outage indicator, and an interaction between these two. The column labels denote the different option samples. Panel A presents results for the actual outage period and Panel B for post-outage period beginning one hour after the actual outage ends. The sample consists of fifteen-minute intervals, t, for options aggregated up to each stock i during the window on day d when the broker experiences an outage, matched with fifteen-minute intervals for the same stock and time for each of the 5 trading days preceding the outage date. The Retail variable represents and indicator variable that takes a value of one if the security is i,d-1 in the top quintile of expected retail trading and zero otherwise. The Outage variable is an indicator variable t equal to one during the outage period and zero otherwise. We also include firm and day fixed effects in the model. ∗∗∗, ∗∗, and ∗ indicate statistical significance at the 1%, 5%, and 10% levels, respectively for t- statistics with standard errors clustered at the firm and day level. Appendix A provides further details on data definitions. Panel A: Outage Period Out of the Money At the Money In the Money OTM-ITM Retail × Outage -0.0644*** -0.0189*** -0.0128 -0.0483** i,d-1 t (-3.6174) (-2.7380) (-1.1046) (-2.2487) Retail -0.0006 -0.0437 0.0423 -0.0487 i,d-1 (-0.1452) (1.2309) (-0.1762) (-0.2188) Outage -0.0257 0.0805 -0.0925 -0.0089 t (0.7690) (1.4516) (-0.3937) (-1.0630) Observations 148,209 154,068 83,070 81,413 Degrees of Freedom 1885 1896 1766 1751 R-squared 0.1823 0.1754 0.1735 0.1004 Panel B: Post-Outage Period Out of the Money At the Money In the Money OTM-ITM Retail × Outage 0.0316*** 0.0192 -0.0028 0.0290* i,d-1 t (3.0746) (1.1329) (-0.2161) (1.8712) Retail -0.0532 -0.0188 0.0861 -0.0923 i,d-1 (-0.1715) (-0.3972) (0.9836) (-1.0950) Outage -0.0398 0.0329 -0.0198 -0.0293 t (-1.2668) (1.0754) (-0.1529) (0.4707) Observations 123,013 127,876 68,948 65,803 Degrees of Freedom 1885 1896 1766 1751 R-squared 0.1541 0.2013 0.1465 0.1792 40 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "All Options Call Options Put Options",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 48,
    "chunk_index": 69,
    "word_count": 361,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "All Options Call Options Put Options (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "0.0290* i,d-1 t (3.0746) (1.1329) (-0.2161) (1.8712) Retail -0.0532 -0.0188 0.0861 -0.0923 i,d-1 (-0.1715) (-0.3972) (0.9836) (-1.0950) Outage -0.0398 0.0329 -0.0198 -0.0293 t (-1.2668) (1.0754) (-0.1529) (0.4707) Observations 123,013 127,876 68,948 65,803 Degrees of Freedom 1885 1896 1766 1751 R-squared 0.1541 0.2013 0.1465 0.1792 40 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "All Options Call Options Put Options",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 48,
    "chunk_index": 70,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "All Options Call Options Put Options (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "Table 7. Retail Broker Outages and Implied Volatility Term Structure. This table presents estimated slope coefficients and associated t-statistics, in parentheses, from OLS regressions in which the dependent variable is implied volatility and the independent variables are a high retail interest indicator, an outage indicator, and an interaction between these two. The column labels denote the different option samples. Panel A presents results for the actual outage period and Panel B for post-outage period beginning one hour after the actual outage ends. The sample consists of fifteen-minute intervals, t, for options aggregated up to each stock i during the window on day d when the broker experiences an outage, matched with fifteen-minute intervals for the same stock and time for each of the 5 trading days preceding the outage date. The Retail variable represents and indicator variable that takes a value of one if the security is i,d-1 in the top quintile of expected retail trading and zero otherwise. The Outage variable is an indicator variable t equal to one during the outage period and zero otherwise. We also include firm and day fixed effects in the model. ∗∗∗, ∗∗, and ∗ indicate statistical significance at the 1%, 5%, and 10% levels, respectively, for t- statistics with standard errors clustered at the firm and day level. Appendix A provides further details on data definitions. Panel A: Outage Period Short Maturity Mid Maturity Long Maturity Long – Short Retail × Outage -0.0913*** -0.0413* 0.0213** 0.1087*** i,d-1 t (-3.2165) (-1.8812) (2.4090) (3.6481) Retail -0.0794 0.0143 0.0186 0.0653 i,d-1 (-0.5659) (0.2247) (0.4832) (-1.4027) Outage -0.0076 -0.0082 -0.0184 0.0202 t (-0.2003) (-0.2814) (-0.7539) (0.0477) Observations 138,492 135,701 172,093 131,964 Degrees of Freedom 1870 1850 1920 1834 R-squared 0.1336 0.1669 0.2137 0.1238 Panel B: Post-Outage Period Short Maturity Mid Maturity Long Maturity Long – Short Retail × Outage 0.0428** 0.0179 -0.0159 -0.0392* i,d-1 t (2.3185) (1.4235) (-1.0317) (-1.8401) Retail -0.0132 0.0035 0.0159 0.0263 i,d-1 (-1.1517) (0.6998) (0.0993) (0.0128) Outage -0.0058 -0.0149 0.0125 0.0213 t (-0.2635) (-0.0576) (0.6970) (0.8275) Observations 114,948 112,632 142,837 103,472 Degrees of Freedom 1870 1850 1920 1834 R-squared 0.1132 0.1617 0.1581 0.2044 41 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "All Options Call Options Put Options",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 48,
    "chunk_index": 71,
    "word_count": 356,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "All Options Call Options Put Options (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "-0.0392* i,d-1 t (2.3185) (1.4235) (-1.0317) (-1.8401) Retail -0.0132 0.0035 0.0159 0.0263 i,d-1 (-1.1517) (0.6998) (0.0993) (0.0128) Outage -0.0058 -0.0149 0.0125 0.0213 t (-0.2635) (-0.0576) (0.6970) (0.8275) Observations 114,948 112,632 142,837 103,472 Degrees of Freedom 1870 1850 1920 1834 R-squared 0.1132 0.1617 0.1581 0.2044 41 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "All Options Call Options Put Options",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 48,
    "chunk_index": 72,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "All Options Call Options Put Options (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "Table 8. Robustness Analysis. The table reports robustness checks. For brevity, each panel reports only estimates on the interaction term in Equations (1) and (2), which captures the effects of outages on net retail dollar volume or implied volatility for options with high expected retail trading. Panel A omits the top 30 stocks by option volume prior to each outage, Panel B omits morning outages (outages that begin before 9:45amET), Panels C and D split the analysis into sub-sample periods, and Panels E and F present outage results for Robinhood and non-Robinhood brokers (E-Trade, Fidelity, TD Ameritrade, and Schwab), respectively. Each analysis consists of fifteen-minute intervals, t, for options aggregated up to each stock i during the window on day d when the broker experiences an outage, matched with fifteen-minute intervals for the same stock and time for each of the 5 trading days preceding the outage date. The Retail variable represents and indicator variable that takes a value of one if the security is in i,d-1 the top quintile of expected retail trading and zero otherwise. The Outage variable is an indicator variable equal to one during t the outage period and zero otherwise. We also include firm and day fixed effects in the model. ∗∗∗, ∗∗, and ∗ indicate statistical significance at the 1%, 5%, and 10% levels, respectively for t-statistics with standard errors clustered at the firm and day levels. Appendix A provides further details on data definitions. Implied Volatility Net Volume All Options All Options Call-Put OTM-ITM Long-Short Panel A: Omit Top 30 Stocks by Option Volume Retail × Outage -0.0974** -0.0312*** -0.0186** -0.0133** 0.0911** i,d-1 t (-2.4437) (-2.6767) (-2.4772) (-2.3162) (2.2084) Panel B: Omit Morning Outages Retail × Outage -0.1149*** -0.0439*** -0.0364** -0.0565** 0.0815* i,d-1 t (-2.9189) (-3.3524) (-2.3590) (-2.4547) (1.8534) Panel C: Sample Period of Jan. 2019 – Feb. 2020 Retail × Outage -0.0514** -0.0322*** -0.0187* -0.0314 0.0862** i,d-1 t (-2.1074) (-3.7314) (-1.7123) (-1.5538) (2.0673) Panel D: Sample Period of Mar. 2020 – Jun. 2021 Retail × Outage -0.1379*** -0.0429*** -0.0233* -0.0826** 0.1403*** i,d-1 t (-3.3765) (-4.0724) (-1.7296) (-2.0979) (3.0645) Panel E: Robinhood Outages (27 Total) Retail × Outage -0.1204*** -0.0505** -0.0360*** -0.1046 0.1461** i,d-1 t (-2.6098) (-2.1956) (-2.5954) (-0.4938) (2.4571) Panel F: Other Brokers’ Outages (53 Total) Retail × Outage -0.1136** -0.0391** 0.0086** -0.0358* 0.0976** i,d-1 t (-2.3676) (-2.3999) (2.0349) (-1.7665) (2.1292) 42 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "All Options Call Options Put Options",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 48,
    "chunk_index": 73,
    "word_count": 395,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "All Options Call Options Put Options (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "(3.0645) Panel E: Robinhood Outages (27 Total) Retail × Outage -0.1204*** -0.0505** -0.0360*** -0.1046 0.1461** i,d-1 t (-2.6098) (-2.1956) (-2.5954) (-0.4938) (2.4571) Panel F: Other Brokers’ Outages (53 Total) Retail × Outage -0.1136** -0.0391** 0.0086** -0.0358* 0.0976** i,d-1 t (-2.3676) (-2.3999) (2.0349) (-1.7665) (2.1292) 42 Electronic copy available at: https://ssrn.com/abstract=4104788 55% Put IV Call IV 50% y tilita lo V d e ilp m I45% 40% 1 2 3 4 5 Retail Option Trading Quintile Figure IA1. Retail Trading and Implied Volatility: Calls and Puts. The figure plots implied volatility separately for calls and puts for different levels of retail investor interest. For each stock-day, options are separated into calls and puts (for stocks with both calls and puts traded that day) and quintiles based on the level of retail investor trading. Implied volatility is then averaged across the group and then across stock-days. IA. 1 Electronic copy available at: https://ssrn.com/abstract=4104788 Figure IA2. Implied Volatility and Retail Option Trading: Maturity. The figure plots implied volatility for options with different maturities and retail investor interest. For each stock-day, options are grouped by maturity (in days) and quintile based on the level of retail investor trading. Implied volatility is then averaged across the group and then across stock-days. IA. 2 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "All Options Call Options Put Options",
    "page_number": 44,
    "page_range": "p.44-46",
    "total_pages": 48,
    "chunk_index": 74,
    "word_count": 213,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "All Options Call Options Put Options (p.44-46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "implied volatility for options with different maturities and retail investor interest. For each stock-day, options are grouped by maturity (in days) and quintile based on the level of retail investor trading. Implied volatility is then averaged across the group and then across stock-days. IA. 2 Electronic copy available at: https://ssrn.com/abstract=4104788 Table IA1. Determinants of Retail Option Trading The table presents the results of regressions of retail option trading volume on contract and firm characteristics. In Specification (1), the dependent variable is stock-day aggregate dollar volume across the option chain. In Specifications (2) through (5), dollar volume is considered separately for open positions by option transaction type. The sample consists of common stocks with options traded on the Nasdaq from January 2019 to June 2021. Short Maturity is an indicator variable that equals one if the maturity of the option is less than 7 days. Middle Maturity is an indicator variable that equals one if the maturity of the option is from 7 days to 20 days. Call is an indicator variable if the option is call and 0 otherwise. For put (call) options, out-of-the-money (OTM) is defined as a dummy variable equal to one if the ratio of the strike price to the stock price is lower than 0.975 (greater than 1.025). At-the-money (ATM) is defined as a dummy variable if the ratio is between 0.975 and 1.025. Volatility is daily volatility calculated using the last 22 days’ stock return from CRSP. Idiosyncratic Skewness is defined as the skewness of daily residuals from a regression of the stock return on excess market return and square of excess market return, following Harvey and Siddique (2000). Other controls include stock returns from the past week, stock returns from t-20 to t-6, stock level bid-ask spread, size, and book-to-market. We also include day fixed effects in the model. ∗∗∗, ∗∗, and ∗ indicate statistical significance at the 1%, 5%, and 10% levels, respectively for t-statistics with standard errors clustered at the firm and day levels. Aggregate Purchase Purchase Underwrite Underwrite Volume Calls Puts Calls Puts (1) (2) (3) (4) (5) Short Maturity 0.197*** 0.239*** 0.388*** 0.540*** 0.132** (14.42) (5.78) (6.89) (9.86) (2.09) Middle Maturity 0.069*** 0.087*** 0.095** 0.098** -0.119*** (8.99) (3.62) (2.46) (2.24) (-3.29) Call 0.069*** (18.12) Out of the Money 0.091*** 0.329*** 0.0307 0.694*** 0.371*** (16.28) (16.43) (0.83) (13.70) (11.94) At the Money 0.118*** 0.444*** 0.265*** 0.300*** 0.098*** (12.88) (10.27) (4.39) (8.23) (3.05) Volatility 1.933*** 3.033*** 3.209*** 0.305 -0.977 (10.06) (5.11) (4.07) (0.49) (-1.64) Idiosyncratic Skewness 0.005*** 0.027*** 0.027*** 0.007 0.006 (2.70) (3.92) (3.37) (0.98) (0.82) Return 0.053*** 0.118*** 0.299*** -0.0436 -0.105* -1to-5 (4.86) (2.92) (4.25) (-1.29) (-1.81) Return -0.033*** -0.109*** -0.0206 -0.0507* -0.117*** -20 to-6 (-3.87) (-3.77) (-0.40) (-1.83) (-2.97) Bid Ask Spread 0.192*** 0.710*** 0.455** 0.992*** 0.859*** (4.80) (4.06) (2.03) (4.47) (3.28) Size 0.041*** 0.070*** 0.055** 0.045* 0.016 (11.04) (4.03) (2.50) (1.96) (0.68) Book to Market -0.006 0.0250 0.007 0.223*** 0.149*** (-0.50) (0.58) (0.16) (3.90) (3.05) Day Fixed Effects Yes Yes Yes Yes Yes Observations 3,725,250 2,185,054 918,427 1,752,829 946,822 R-Squared 0.082 0.029 0.037 0.066 0.035 IA. 3 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "All Options Call Options Put Options",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 48,
    "chunk_index": 75,
    "word_count": 513,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "All Options Call Options Put Options (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "0.041*** 0.070*** 0.055** 0.045* 0.016 (11.04) (4.03) (2.50) (1.96) (0.68) Book to Market -0.006 0.0250 0.007 0.223*** 0.149*** (-0.50) (0.58) (0.16) (3.90) (3.05) Day Fixed Effects Yes Yes Yes Yes Yes Observations 3,725,250 2,185,054 918,427 1,752,829 946,822 R-Squared 0.082 0.029 0.037 0.066 0.035 IA. 3 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "All Options Call Options Put Options",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 48,
    "chunk_index": 76,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "All Options Call Options Put Options (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "Table IA2. Retail Broker Outages and Non Retail, Non-Market Maker Option Dollar Volume. This table reports the results from OLS regressions for total non-retail, non-market maker option dollar volume. Column labels denote different option samples. Panel A presents results for the outage period and Panel B for the post-outage period which begins one hour after the outage. The sample consists of fifteen- minute intervals, t, for options aggregated up to each stock i during the window on day d when the broker experiences an outage, matched with fifteen-minute intervals for the same stock and time for each of the 5 trading days preceding the outage date. Retail represents an indicator variable that is one if the security i,d-1 is in the top quintile of expected retail trading and zero otherwise. Outage is an indicator variable equal t to one during the outage period and zero otherwise. The Dollar Volume dependent variable aggregates across all option trading dollar volume. Each specification includes firm and day fixed effects. ∗∗∗, ∗∗, and ∗ indicate statistical significance at the 1%, 5%, and 10% levels, respectively, with t-statistics reported in parentheses for standard errors clustered at the firm and day level. Appendix A provides further details on data definitions. Panel A: Outage Period All Options Calls Puts Retail × Outage -0.0361 -0.0480 -0.012 i,d-1 t (-1.3046) (-1.4736) (-1.3320) Retail 0.0025 0.0336 0.0335 i,d-1 (0.0966) (0.6054) (1.2538) Outage 0.0037 0.0196 -0.0272 t (0.0187) (0.3851) (-0.2865) Observations 193,083 173,456 152,060 Degrees of Freedom 1921 1917 1903 R-squared 0.0284 0.0469 0.0355 Panel B: Post-Outage Period All Options Calls Puts Retail × Outage -0.0031 -0.0058 0.0060 i,d-1 t (-1.0767) (-1.2878) (1.1428) Retail 0.0598 0.0633 0.0049 i,d-1 (1.3548) (1.4148) (1.1471) Outage 0.0170 0.0218 0.0053 t (1.0068) (0.5608) (0.7150) Observations 142,881 143,968 126,210 Degrees of Freedom 1921 1917 1903 R-squared 0.0803 0.0467 0.0473 IA. 4 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "All Options Call Options Put Options",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 48,
    "chunk_index": 77,
    "word_count": 309,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "All Options Call Options Put Options (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  },
  {
    "text": "Calls Puts Retail × Outage -0.0031 -0.0058 0.0060 i,d-1 t (-1.0767) (-1.2878) (1.1428) Retail 0.0598 0.0633 0.0049 i,d-1 (1.3548) (1.4148) (1.1471) Outage 0.0170 0.0218 0.0053 t (1.0068) (0.5608) (0.7150) Observations 142,881 143,968 126,210 Degrees of Freedom 1921 1917 1903 R-squared 0.0803 0.0467 0.0473 IA. 4 Electronic copy available at: https://ssrn.com/abstract=4104788 Table IA3. Retail Broker Outages and Option Prices. The table repeats the analysis in Tables 5-7 using option price as the dependent variable instead of option implied volatility. Option Type Moneyness Maturity All Options Calls Puts OTM ATM ITM Short Mid Long (1) (2) (3) (4) (5) (6) (7) (8) (9) Retail i,d-1 ×Outage t -0.099*** -0.120*** -0.107** -0.297*** -0.114** -0.009 -0.314*** -0.140** 0.043** (-2.71) (-4.029) (-2.089) (-4.683) (-2.395) (-1.116) (-3.43) (-2.069) (2.287) Retail i,d-1 0.119 0.069 -0.020 -0.001 -0.060 0.042 -0.081 0.019 0.024 (0.316) (0.610) (-0.612) (-0.519) (-1.403) (0.623) (-1.029) (0.055) (0.590) Outage t -0.052 0.034 -0.039 -0.034 0.076 -0.089 -0.010 -0.011 -0.021 (-1.141) (0.205) (-0.449) (-1.100) (1.568) (-0.200) (-0.084) (-0.889) (-0.128) Observations 193,083 173,456 152,060 148,209 154,068 83,070 138,492 135,701 172,093 Deg. of Freedom 1,921 1,917 1,903 1,885 1,896 1,766 1,870 1,850 1,920 R-Squared 0.054 0.097 0.074 0.021 0.094 0.114 0.032 0.082 0.079 IA. 5 Electronic copy available at: https://ssrn.com/abstract=4104788",
    "title": "Retail Option Traders and the Implied Volatility Surface",
    "source_type": "pdf",
    "document_id": "1a4caa7d5f9c",
    "source_file": "Retail Option Traders and the Implied Volatility Surface.pdf",
    "section": "All Options Call Options Put Options",
    "page_number": 48,
    "page_range": "p.48",
    "total_pages": 48,
    "chunk_index": 78,
    "word_count": 202,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "All Options Call Options Put Options (p.48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220907154631-05'00'",
    "duration": null
  }
]