[
  {
    "text": "Retail Investors and ESG News Qianqian Lia, Edward M. Wattsb, and Christina Zhuc aGraduate School of Business, Stanford University bYale School of Management cThe Wharton School, University of Pennsylvania Current Draft: September 26, 2023 Abstract An important debate exists around the extent to which retail investors make sustain- able investments and why they do. We provide evidence relevant to this debate by investigating the aggregate trading patterns of retail investors around a comprehensive sampleofkeyEnvironmental,Social,andGovernance(ESG)newseventsforU.S.firms. We show that ESG news events appear to be an important and growing component of retail investors’ portfolio allocation decisions. Yet, inconsistent with non-pecuniary preferences, our evidence shows that retail investors mainly trade on this information when they deem it financially material to a company’s stock performance. We also find their net trading demand predicts future abnormal returns in the subsample of financially material events, consistent with retail traders benefiting from incorporating ESG-related information in their decision-making when it is relevant to firm value. Overall, we conclude that the average U.S. retail investor cares about firms’ ESG- related activities, but primarily to the extent they are financially material for company performance. JEL classification: G12, G14, G20, M14, G24, J32 Keywords: Retail investors; Individual investors; Environmental, social and governance (ESG); Socially responsible investing (SRI) Corresponding authors: Qianqian Li (qqli@stanford.edu); Edward Watts (edward.watts@yale.edu); Christina Zhu (chrzhu@wharton.upenn.edu). We thank Brad Barber (discussant), Mary Barth, Thomas Bourveau (discussant), Ed deHaan, Dave Larcker, Christian Leuz, Charlie McClure, Jeremy Michels, Olivia Mitchell, Austin Moss (discussant), Trung Nguyen (discussant), Kevin Smith, Eric So, Frank Zhou, and seminar participants at the University of Chicago, Singapore Management University, Stanford, Temple, Wharton, the 2023 NBER Summer Institute (Big Data and High-Performance Computing for Financial Economics), the 2023 Recent Developments in Corporate Governance Research Conference, the 2023 Four- School Accounting Research Conference, and the 2023 Colorado Summer Accounting Research Conference forhelpfulcommentsandsuggestions. WealsothankAllanNgoandCongXiaofortheirresearchassistance and Greg Bala, Jim Hawley, and Dinah Koehler at TruValue Labs (a Factset company) for helping us understand the data and providing helpful feedback. We gratefully acknowledge support from the Jacobs Levy Equity Management Center at Wharton, the Stanford Graduate School of Business, the Yale School of Management, and the Wharton School. Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 59,
    "chunk_index": 0,
    "word_count": 362,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "Koehler at TruValue Labs (a Factset company) for helping us understand the data and providing helpful feedback. We gratefully acknowledge support from the Jacobs Levy Equity Management Center at Wharton, the Stanford Graduate School of Business, the Yale School of Management, and the Wharton School. Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 59,
    "chunk_index": 1,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "Despite the substantial growth of global assets tracking Environmental, Social, and Governance-focused (ESG-focused) strategies in recent years, the extent to which the av- erage U.S. investor values ESG-related factors and the reasons they do remain the subject of ongoing debate. Recently, attention to these questions has expanded beyond academic re- searchtotheforefrontofmanypoliticalandregulatorydebatesintheU.S.Forexample, such questions are critical to the debates around considering ESG factors in retirement accounts and the SEC’s new proposed climate disclosure rules. We provide novel evidence informing academic and regulatory debates by studying how retail investors transact in their personal portfolios around one of their primary sources of information about companies’ ESG-related activities—the news. Webeginbyexploringthedynamicsofretailinvestor tradingactivity, identifiedfollowing Boehmer, Jones, Zhang, and Zhang (2021), around 54,199 distinct ESG-related news events from December 2015 through August 2022.1 We find that, relative to non-event days, retail investortradingactivityincreasesbyapproximately5.7%onESGnewsdaysinthefullperiod and by 8.1% in the most recent (post-2020) period. This finding demonstrates that ESG- related activities are an important determinant of U.S. retail investors’ investment decisions. To provide context, we compare these events to different types of traditional financial news eventsandfindthattheretailinvestorreactionstoESGnewseventsaregreaterinmagnitude than those to analyst forecasts and dividend announcements, but are smaller than those to earnings announcements and management guidance. In the cross-section, we show that all categories of ESG news events generate significant trade by retail investors, with news related to “Leadership and Governance” impacting trade 1Our dataset comes from Factset TruValue Labs’ Spotlight data solutions, which sources news from various sources outside the organization, such as media outlets and government regulators. An inherent advantage of using the dataset is that it clearly defines what is considered to be ESG-related. Specifically, to be included in the dataset, news events must map into at least one topic in the ESG framework defined by the Sustainability Accounting Standards Board (SASB). Our definition of “ESG-related activities” or “ESG-related factors” is any event that maps into these topics, which is distinct from our use of the term “ESG performance” to refer to a firm’s performance in an ESG category. 1 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "1. Introduction",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 59,
    "chunk_index": 2,
    "word_count": 337,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "by the Sustainability Accounting Standards Board (SASB). Our definition of “ESG-related activities” or “ESG-related factors” is any event that maps into these topics, which is distinct from our use of the term “ESG performance” to refer to a firm’s performance in an ESG category. 1 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "1. Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 59,
    "chunk_index": 3,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "the most. This finding is consistent with survey evidence that governance—among all ESG factors—is the most important for investors’ decision-making given its link to firm perfor- mance (CFA Institute, 2020). We also find substantial heterogeneity in the time-series of investors’ reactions, with significant growth in their reactions over time. This finding high- lights the increased importance of ESG-related factors in retail investors’ portfolio decisions over time, as attention to these issues by shareholders and other stakeholders has increased. Wefurtherexploretheroleofinvestorattentioninretailinvestortradingbehavioraround ESG-related news events, given prior findings that investor attention can affect perceptions and incorporation of information (e.g., Hirshleifer and Teoh, 2003; Blankespoor, deHaan, and Marinovic, 2020). Consistent with investors’ heightened attention to companies during ESG news events, we find significant increases in investor attention (measured by Google search and Bloomberg terminal activity) during ESG event periods. We also show that retail investors’ reactions to ESG news events are particularly pronounced for high-attention events. Specifically, we find that events with more extensive media coverage and more pronounced increases in investor attention generate significantly more retail trade. These findings mirror those of prior studies in related settings and highlight the critical role of investors’ attention constraints in their incorporation of ESG-related information in the portfoliodecision-makingprocess(e.g.,HartzmarkandSussman,2019;Choi,Gao,andJiang, 2020; Painter, 2020). The significant increase in trading activity by retail investors around high-attention ESG eventsallowsustorejectthehypothesisthattheyareindifferenttoESG-relatedinformation. Nevertheless, it does not allow us to conclude why retail investors care about these issues. That is, a question remains as to whether retail investors value ESG-related factors for pecuniary(e.g., Lys, Naughton, andWang,2015;Christensen, Floyd, Liu, andMaffett,2017) versus non-pecuniary reasons (e.g., Martin and Moser, 2016; Friedman and Heinle, 2016). Such non-pecuniary preferences are possible because, unlike most institutional investors, retail investors are not constrained by fiduciary duty, so their response may differ from the 2 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "1. Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 59,
    "chunk_index": 4,
    "word_count": 297,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "pecuniary(e.g., Lys, Naughton, andWang,2015;Christensen, Floyd, Liu, andMaffett,2017) versus non-pecuniary reasons (e.g., Martin and Moser, 2016; Friedman and Heinle, 2016). Such non-pecuniary preferences are possible because, unlike most institutional investors, retail investors are not constrained by fiduciary duty, so their response may differ from the 2 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "1. Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 59,
    "chunk_index": 5,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "overall market response. In addition, the incentives and strategies for individuals to engage in social responsibility may differ from those for institutional investors (Benabou and Tirole, 2010). To shed light on why retail investors transact on ESG news, we leverage the fact that investors’ perceptions of a news event’s ESG performance implications (i.e., positive or negative changes in a firm’s ESG performance) can be uncorrelated or even negatively correlated with investors’ beliefs about its implications for firm value (e.g., Kru¨ger, 2015; Manchiraju and Rajgopal, 2017; Chen, Hung, and Wang, 2018). Our evidence indicates that the average retail investor does not have non-pecuniary preferences. Instead, the pecuniary implications of ESG news (i.e., impacts on returns) lead retail investors to transact. We find that retail investors’ trading activity around ESG news events appears to correspond directly to the impact on realized returns and is largely independent of the changes in expectations about a company’s ESG performance. When focusing on retail investors’ aggregate net demand of securities around ESG news events, our evidence shows that investors purchase (sell) securities when the implications for portfolio performance are positive (negative), regardless of the ESG performance implications. A matched-pair analysis finds that changes in retail investor net demand at ESG events are statistically indistinguishable from those for earnings announcements with similar return reactions, strengthening our inferences. Further highlighting the pecuniary motives for retail investor trading, we find that they profit by transacting on ESG-related news. Specifically, aggregate retail investor net demand ateachESGeventpredictsfutureabnormalreturnsinthepost-newseventperiod. Moreover, weshowthatthisreturnpredictabilityisonlypresentinthesubsampleoffinanciallymaterial events. Collectively, these findings imply that retail investors appear to profit from their processing of the implications of these ESG news events for portfolio performance. We perform several additional analyses to assess the robustness of our primary findings and to provide a more complete picture of retail investors’ trading around ESG news events. First, we continue to find a lack of support for non-pecuniary preferences in events for firms 3 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "1. Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 59,
    "chunk_index": 6,
    "word_count": 323,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "We perform several additional analyses to assess the robustness of our primary findings and to provide a more complete picture of retail investors’ trading around ESG news events. First, we continue to find a lack of support for non-pecuniary preferences in events for firms 3 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 59,
    "chunk_index": 7,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "headquartered in blue states and states with higher state-level ESG scores, and we find some evidence that retail investors’ responses to the financial performance implications are even stronger in states with higher ESG scores. Second, we find similar results when using an alternative assignment of trades as buys or sells based on the Lee-Ready algorithm (Lee and Ready, 1991), as suggested by Barber, Huang, Jorion, Odean, and Schwarz (2023). Third, we show that our inferences hold in an examination of the trading behavior of investors potentiallymostlikelytohavenon-pecuniarypreferences, thoseusingtheRobinhoodtrading platform. The younger traders that favor this platform (e.g., Welch, 2022) represent a class of retail investors traditionally thought to be more likely than the overall investor population to invest in companies targeting social or environmental goals (e.g., Morgan Stanley, 2017; Haber, Kepler, Larcker, Seru, and Tayan, 2022). Finally, we address concerns that non-pecuniary incentives in other segments of the mar- ket confound our return-based measures of pecuniary motivations. In extreme events where ESG performance disagrees directionally with financial performance, we find that retail in- vestors trade in the direction of financial performance. Furthermore, we use additional, non-return-based measures to bolster inferences about whether pecuniary incentives are the main explanation for retail investors’ responses. Specifically, we show that retail investor reactions are significantly greater when events are identified as financially material, per the SASB and equity analysts. Along with our primary findings, these results reinforce our conclusion that retail investors value ESG-related information for pecuniary reasons. Wecontributetoagrowingliteraturethatexploreswhetherandwhyretailinvestorsvalue ESG-related factors in their investment decisions. As we discuss in Section 2, the evidence to date is largely mixed regarding these questions. Our approach complements prior research in this area by focusing on how U.S. investors transact around nearly all noteworthy ESG- related events—the primary channel through which most retail investors learn about firms’ ESG-related activities. OurstudyalsoprovidesnewinsightsrelevanttoongoingpolicydebatesintheU.S.around 4 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 59,
    "chunk_index": 8,
    "word_count": 307,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "evidence to date is largely mixed regarding these questions. Our approach complements prior research in this area by focusing on how U.S. investors transact around nearly all noteworthy ESG- related events—the primary channel through which most retail investors learn about firms’ ESG-related activities. OurstudyalsoprovidesnewinsightsrelevanttoongoingpolicydebatesintheU.S.around 4 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 59,
    "chunk_index": 9,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "ESG investments and disclosure rules. There is currently considerable pushback regarding the consideration of ESG factors in retail investors’ retirement accounts (e.g., Department of Labor, 2020, 2022; Ackerman and Wise, 2023). Similar debates are ongoing regarding the newproposedSECclimatedisclosurerules, which—inaccordancewiththeSEC’smandateto “level the playing field” between retail and institutional investors—are being considered, in part, to increase transparency for unsophisticated investors (e.g., Fisch, 2022; SEC, 2022). Much of this debate centers around the premises of whether ESG factors are financially material to retail investors’ investment portfolios and whether considering non-financially material factors should be permitted.2 Our broad, generalizable empirical evidence on U.S. retail investors should inform the underlying premises of the debate. By focusing on whether and why retail investors react to ESG-related information, our paper also adds to a large literature on retail investor decision-making in various settings (e.g., see Barber and Odean, 2013 for a review). Much of the prior literature on retail investors focuses on how they react to financial signals, such as earnings news, and how they differ from other market participants (e.g., Lee, 1992; Hirshleifer, Myers, Myers, and Teoh, 2008; Kaniel, Liu, Saar, and Titman, 2012). Our findings highlight the growing importance of ESG-related information for retail investors’ portfolio decision-making. Importantly, we also show retail investors appear to incorporate ESG news into their trading decisions like they do financial signals. Specifically, they trade on ESG news events’ implications for stock return performance and exhibit attention constraints (e.g., Lawrence, Ryans, Sun, and Laptev, 2018; Blankespoor, deHaan, and Zhu, 2018; Blankespoor, deHaan, Wertz, and Zhu, 2019). Overall, consistent with the view that ESG information is “extremely important and nothing special” (Edmans, 2023), we show that retail investors view ESG-related factors 2Although U.S. regulation is largely predicated on financial materiality, the European Union (E.U.) regulation has taken a different approach by focusing on double materiality. This latter concept considers ESGfactorstobematerialiftheyaffecttheworldatlarge. TheE.U.hasincorporatedthisdoublemateriality concept into their regulation of ESG disclosures (e.g., Norton Rose Fulbright, 2023) as well as their pension regulation,whichincludessustainabilityconsiderationsaspartoftheirfiduciaryobligations(e.g.,Azizuddin, 2023). VariousadvocacygroupsandmarketconstituentshavecalledforsimilarrulesintheU.S.,whichwould allow the consideration of ESG factors that are potentially unrelated to financial objectives (e.g., Engler, 2022). 5 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 59,
    "chunk_index": 10,
    "word_count": 352,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "double materiality. This latter concept considers ESGfactorstobematerialiftheyaffecttheworldatlarge. TheE.U.hasincorporatedthisdoublemateriality concept into their regulation of ESG disclosures (e.g., Norton Rose Fulbright, 2023) as well as their pension regulation,whichincludessustainabilityconsiderationsaspartoftheirfiduciaryobligations(e.g.,Azizuddin, 2023). VariousadvocacygroupsandmarketconstituentshavecalledforsimilarrulesintheU.S.,whichwould allow the consideration of ESG factors that are potentially unrelated to financial objectives (e.g., Engler, 2022). 5 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "1. Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 59,
    "chunk_index": 11,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "as important for their investment decisions, but in a similar manner to how they view any financial signal affecting firm value. The remainder of the paper is organized as follows. The next section provides a review of the prior literature and institutional details on regulatory debates related to our study. Section 3 describes the data used in the study and presents descriptive statistics. We discuss the paper’s empirical strategy and main results in Section 4. Section 5 presents additional analyses and robustness tests. Finally, Section 6 provides an interpretation of the results and concluding remarks. 2. Motivation and Related Literature 2.1. Related Literature OurstudyempiricallyinvestigateswhetherandwhytheaverageretailinvestorintheU.S. reactstoESGnewsevents. Thisfocusisdistinctfrom, yetcomplements, agrowingliterature that investigates these questions using different methods in other settings. Currently, signif- icant disagreement exists in this academic literature. Moreover, many of the prior settings are narrow or subject to measurement concerns. This section provides an overview of the disagreement across studies and explains how our broad empirical examination complements and helps to reconcile the mixed findings. A growing number of published experimental and survey studies find that retail investors value ESG-related factors and do so at the expense of their wealth (e.g., Martin and Moser, 2016; Riedl and Smeets, 2017; Bauer, Ruof, and Smeets, 2021; Heeb, Kolbel, Paetzold, and Zeisberger, 2023). Collectively, these studies suggest that investors view ESG-related factors as important factors for portfolio decision-making.3 Experimental participants’ willingness to sacrifice wealth also supports a growing theoretical literature that models the asset pric- 3Recentstudiesalsoexplorewhetherindividualconsumersrespondtofirm-levelESGinformation(Chris- tensen, De George, Joffre, and Macciocchi, 2023; Meier, Servaes, Wei, and Chong Xiao, 2023; Houston, Lin, Shan, and Shen, 2023; Jin, Merkley, Sharma, and Ton, 2023). 6 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "1. Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 59,
    "chunk_index": 12,
    "word_count": 275,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "Experimental participants’ willingness to sacrifice wealth also supports a growing theoretical literature that models the asset pric- 3Recentstudiesalsoexplorewhetherindividualconsumersrespondtofirm-levelESGinformation(Chris- tensen, De George, Joffre, and Macciocchi, 2023; Meier, Servaes, Wei, and Chong Xiao, 2023; Houston, Lin, Shan, and Shen, 2023; Jin, Merkley, Sharma, and Ton, 2023). 6 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "1. Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 59,
    "chunk_index": 13,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "ing implications of assuming some investors have prosocial preferences (e.g., Friedman and Heinle, 2016; Pedersen, Fitzgibbons, and Pomorski, 2021; Pastor, Stambaugh, and Taylor, 2022). In contrast, the empirical evidence is significantly less clear-cut. There is mixed evidence on whether retail investors view ESG-related information as an important investment signal. For instance, Hartzmark and Sussman (2019) provide evidence that non-institutional invest- ment funds gain assets after a salience shock to their Morningstar sustainability ratings, but recent evidence questions this response, showing fund flows no longer respond to changes in sustainability ratings a year after Morningstar’s introduction of the ratings (Gantchev, Giannetti, and Li, 2023). In addition, Moss, Naughton, and Wang (2023) find that Robin- hood investors do not appear to respond to ESG-related disclosures. Although some of the disagreement in results may be attributable to differences across the channels of ESG-related information studied, prior studies find conflicting evidence about how retail investors react to ESG information even in similar settings. For example, Choi et al. (2020) find that retail investors respond to abnormally warm temperatures by selling stocks of high emissions firms, yet Pastor, Stambaugh, and Taylor (2023) find retail investors’ portfolio holdings are tilted toward polluting firms. Existing empirical evidence is also mixed as to whether the average U.S. retail investor is willing to forgo returns for non-pecuniary objectives. Prior studies, consistent with theory modeling how investor taste for green or prosocial investments affect discount rates (e.g., Friedman and Heinle, 2016; Pastor, Stambaugh, and Taylor, 2021), typically consider how socially responsible investment (SRI) fund returns (e.g., Geczy, Stambaugh, and Levin, 2005; Barber, Morse, and Yasuda, 2021; Baker, Egan, and Sarkar, 2022b) or sustainable issuer returns (e.g., Hong and Kacperczyk, 2009; Pastor et al., 2022) behave ex-post relative to those of non-sustainable investments. Yet, such inferences are subject to selection concerns because asset risk and reward profiles often differ across these securities, and empirical evidence questions whether retail investors or those serving retail clients are actually willing 7 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "1. Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 59,
    "chunk_index": 14,
    "word_count": 332,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "al., 2022) behave ex-post relative to those of non-sustainable investments. Yet, such inferences are subject to selection concerns because asset risk and reward profiles often differ across these securities, and empirical evidence questions whether retail investors or those serving retail clients are actually willing 7 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "1. Introduction",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 59,
    "chunk_index": 15,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "to sacrifice wealth for non-financial objectives (e.g., Larcker and Watts, 2020; Barber et al., 2021). In short, while survey and experimental evidence indicate a significant willingness by retail investors to sacrifice financial wealth for prosocial investing, empirical evidence is much less clear.4 Our study complements and helps to reconcile some of these mixed findings by focusing on how investors transact around nearly all noteworthy ESG-related events in the news— the primary channel through which most retail investors learn about firms’ ESG-related activities. This setting provides several advantages over those used in prior studies. First, our study speaks to the preferences of the average retail investor in the U.S., and thus it adds generalizable evidence on how U.S. investors value ESG-related information. Extant literature commonly explores these issues in the narrow context of sustainable investments, such as green bonds (e.g., Larcker and Watts, 2020; Flammer, 2021; Baker, Bergstresser, Serafeim, and Wurgler, 2022c) or socially responsible funds (e.g., Geczy et al., 2005; Barber et al., 2021; Baker et al., 2022b). As noted elsewhere, sustainable assets and investments make up just a small percentage—in the low single-digits—of U.S. assets under management (e.g., Hartzmark and Sussman, 2019; Pastor et al., 2021, 2023). This narrow focus limits inferences to those investors selecting this subset of products, who need not be representative of U.S. retail investors (e.g., Hartzmark and Sussman, 2019). Much of the literature that studies these issues also focuses specifically on retail investors in the E.U., not the U.S. (e.g., Riedl and Smeets, 2017; Bauer et al., 2021; Heeb et al., 2023). As prior studies highlight the importance of country-level cultural norms regarding these issues (e.g., Liang and Renneboog, 2017; Dyck, Lins, Roth, and Wagner, 2019), it is therefore problematic to generalize these findings to U.S. investors. In support of this concern, the 4Giglio, Maggiori, Stroebel, Tan, Utkus, and Xu (2023) provide new evidence that potentially explains the disconnect between survey and empirical evidence. Using retail investors’ holdings and surveys of their beliefs, they show that many investors report investing in ESG for non-pecuniary reasons. However, only those that expect ESG investments to outperform the market have significant holdings in ESG investments. Ineffect,surveyevidencemaysignificantlyoverstatereality. Heebetal.(2023)alsoquestionhowmethodical mostretailinvestorsarewhenallocatingtheirfundstoESG-relatedinvestmentsbyshowingthattheamount of wealth investors are willing to forgo in the experiment is largely insensitive to the actual impact it may ultimately have for society or the environment. 8 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "1. Introduction",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 59,
    "chunk_index": 16,
    "word_count": 393,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "those that expect ESG investments to outperform the market have significant holdings in ESG investments. Ineffect,surveyevidencemaysignificantlyoverstatereality. Heebetal.(2023)alsoquestionhowmethodical mostretailinvestorsarewhenallocatingtheirfundstoESG-relatedinvestmentsbyshowingthattheamount of wealth investors are willing to forgo in the experiment is largely insensitive to the actual impact it may ultimately have for society or the environment. 8 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "1. Introduction",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 59,
    "chunk_index": 17,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "acceptance and proliferation of sustainable investing among individuals in European markets are magnitudes larger than in the U.S. (Starks, 2023). Second,thissettingallowsustoovercomethemeasurementchallengeinherentinstudying how investors value ESG factors. Specifically, investors face significant frictions in becoming aware of and subsequently understanding companies’ underlying ESG performance based on ESG ratings or corporate social responsibility (CSR) reports.5 These challenges are particularly relevant when studying retail investors, a group with limited sophistication. At the extreme, retail investors are reportedly not even entirely sure what ESG investments are. For instance, a recent FINRA survey finds that only a quarter of individuals can define an ESG investment, while a fifth incorrectly believe ESG stands for “earnings, stock, growth” (Mottola, Valdes, Ganem, Fontes, and Lush, 2022). Focusing our analysis on windows around the release of high-attention, publicly observable news, precisely when investors are updating their beliefs about companies’ ESG performance, allows us to circumvent many of these measurement issues (e.g., Kru¨ger, 2015). 2.2. Regulatory Debates Our research questions are relevant to ongoing regulatory debates around ESG invest- ments and disclosures. Significant disagreement exists regarding the consideration of ESG factors in investments in retail investors’ retirement accounts at the federal level (e.g., De- partment of Labor, 2020, 2022; Ackerman and Wise, 2023), and several states have already adopted or are proposing regulations that ban ESG-related investment considerations in pension portfolio decisions. These regulations range from bans on asset management strate- gies that “discriminate” against specific industries, such as fossil fuels, to restricting how 5A growing body of evidence highlights the significant uncertainty around firms’ true ESG performance. Not only is there considerable disagreement across ESG rating providers (e.g., Berg, Koelbel, Pavlova, and Rigobon, 2021; Berg, K¨olbel, and Rigobon, 2022; Larcker, Pomorski, Tayan, and Watts, 2022) and a lack of understanding of ESG ratings (e.g., Rze´znik, Hanley, and Pelizzon, 2022), but there are also concerns about “greenwashing” and “social washing” (e.g., Baker, Larcker, McClure, Saraph, and Watts, 2022a; Raghunandan and Rajgopal, 2022; Bailey, Glaeser, Omartian, and Raghunandan, 2022; Kim and Yoon, 2023). The severity of these issues has prompted the SEC and other regulatory bodies worldwide to bring increased enforcement actions against firms and investment advisors (Norton Rose Fulbright, 2022). 9 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "1. Introduction",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 59,
    "chunk_index": 18,
    "word_count": 365,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "Watts, 2022a; Raghunandan and Rajgopal, 2022; Bailey, Glaeser, Omartian, and Raghunandan, 2022; Kim and Yoon, 2023). The severity of these issues has prompted the SEC and other regulatory bodies worldwide to bring increased enforcement actions against firms and investment advisors (Norton Rose Fulbright, 2022). 9 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "1. Introduction",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 59,
    "chunk_index": 19,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "ESG factors are used in portfolio investment (e.g., Goldberg, Dial, and Mann, 2022). A related debate exists around the SEC climate disclosure proposal, including whether some of these new disclosure requirements are necessary or within the scope of the SEC’s mandate to enhance the functioning of capital markets (e.g., Karpoff, Litan, Schrand, and Weil, 2022; Posner, 2022; Vallette and Gray, 2022). Understanding how retail investors use ESG-related information is critical in informing the premise of these debates, as they pertain to retail investor (i.e., pension plan participant) wealth or to additional transparency on ESG-related information to aid retail investors in their investment decision-making. Those against considering ESG-related information in investing or mandatory disclosures question whether ESG factors are financially material.6 Some go further and contend that considering such factors may be detrimental to investors’ wealth.7 Advocates of considering ESG-related information in investing or mandatory dis- closures suggest that ignoring ESG information, critical to a firm’s risks and performance, would hurt portfolio performance. Our findings show that retail investors consider ESG-related factors to be important in their investment decision-making process and that such considerations are not detrimental to their wealth. Therefore, banning ESG considerations in retirement portfolios may be misguided, and doing so may violate fiduciary obligations, as argued by some.8 Addition- ally, given that retail investors do consider and benefit from considering ESG information in their trading decisions, mandating some form of climate disclosures could help them and is therefore within the SEC’s rule-making authority. Our findings also suggest that retail 6For instance, in the context of the SEC climate disclosure rule, several state attorney generals question whether the proposed non-financial measures are material to firm value. Specifically, they suggest the proposed disclosures may be “merely helpful for investors interested in companies with corporate practices consistentwithfederallyencouragedsocialviews”. Commentletterhere: https://www.sec.gov/comments/ climate-disclosure/cll12-8915606-244835.pdf. 7For example, several New York City pension funds are currently being sued for their actions to address climatechangeandaccusedofadvancing“environmentalgoalsunrelatedtothefinancialhealthoftheplans” (Wayne Wong v. NYCERS and BERS, 2023). The plaintiffs contend that the recently adopted divestment policies have breached fiduciary obligations and are seeking monetary damages. 8Some estimates suggest that the costs associated with the recent anti-ESG bills in Texas, Indiana, and Kansas are $6.0, $6.7, and $3.6 billion, respectively (Gibson and Sawyer, 2023). 10 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "1. Introduction",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 59,
    "chunk_index": 20,
    "word_count": 376,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "contend that the recently adopted divestment policies have breached fiduciary obligations and are seeking monetary damages. 8Some estimates suggest that the costs associated with the recent anti-ESG bills in Texas, Indiana, and Kansas are $6.0, $6.7, and $3.6 billion, respectively (Gibson and Sawyer, 2023). 10 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "1. Introduction",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 59,
    "chunk_index": 21,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "investors value ESG-related information primarily for pecuniary reasons. Therefore, citing retail investors’ non-pecuniary objectives when advocating for investment strategies that sacrifice financial performance may be inadvisable. Consistent with the guidance outlined in Karpoff et al. (2022), our results support the idea that disclosures about financially relevant ESG factors can help investors. But disclosure mandates aimed at achieving purely environ- mental or social objectives are inconsistent with why the average retail investor considers ESG information valuable. 3. Data 3.1. Sample We obtain a comprehensive sample of ESG news events for publicly traded firms from Factset TruValue Labs’ Spotlight Data solutions.9 TruValue Labs tracks ESG news events for hundreds of thousands of companies worldwide. From these data, we focus on all publicly traded firms in the U.S. covered by TruValue Labs from December 2015 to August 2022. Companies in our sample have an average of 16.5 ESG events during the sample period (i.e., ≈ 2.5 events per year). For a news event to make it into the Spotlight data, it must meet two conditions. First, it must be about an ESG-related topic. Using artificial intelligence and machine learning on unstructured data across a broad range of independent sources outside the organization, TruValue Labs identifies firm-specific articles mapping into one or more of the 26 categories defined by the SASB materiality framework—even if the topic is not financially material for the firm’s industry but for a different industry. Thus, each ESG news article need not be 9TruValue Labs’ Spotlight Data is significantly more comprehensive than data used in prior research on ESG-related news. For instance, RepRisk, a popular alternative ESG news data provider used by a growing number of studies (e.g., Darendeli, Fiechter, Hitz, and Lehmann, 2022; Dai, Liang, and Ng, 2021), only focuses on events with negative ESG risk implications. In effect, RepRisk ignores all positive ESG events, whicharecriticaltoincludeinourstudy. TruValueLabs’dataisalsosignificantlymorecomprehensivethan that used by Kru¨ger (2015), who hand-collects ESG news events from MSCI KLD newsletters. 11 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "1. Introduction",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 59,
    "chunk_index": 22,
    "word_count": 328,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "Darendeli, Fiechter, Hitz, and Lehmann, 2022; Dai, Liang, and Ng, 2021), only focuses on events with negative ESG risk implications. In effect, RepRisk ignores all positive ESG events, whicharecriticaltoincludeinourstudy. TruValueLabs’dataisalsosignificantlymorecomprehensivethan that used by Kru¨ger (2015), who hand-collects ESG news events from MSCI KLD newsletters. 11 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "1. Introduction",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 59,
    "chunk_index": 23,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "financially material (per the SASB’s definition). Second, the event must lead to a spike in media attention relative to general media coverage of the firm. TruValue Labs identifies peaks in the volume of related ESG articles foragivenfirm,andthesepeaksformthe“spotlight”eventsinthedataprovidedtous. Thus, their event selection threshold is based only on media article volume, not on the sentiment of the articles or any financial measures such as returns. Their threshold for media attention is relatively low, as evidenced by our sample distribution (i.e., the median event has three articles). Critical to our study, the TruValue Labs dataset contains the precise date the news first became public, the ESG category of the event, and the volume of media attention. We obtain data from several additional sources. Equity returns information comes from CRSP, and retail investor trading activity data are from WRDS Intraday Indicators based on TAQ data. We obtain measures of attention from Google Trends and Bloomberg, and analyst forecast revision data from IBES. For part of our sample, we also obtain data from Robintrack to construct an alternative measure of retail investor trade based on changes in the number of unique Robinhood users holding the stock (e.g., Barber, Huang, Odean, and Schwarz, 2022; Welch, 2022; Campbell, Drake, Thornock, and Twedt, 2023; Michels, 2022). A small percentage of the ESG news events coincide with firms’ earnings announcements, so we remove events in the 3-day window around earnings announcements to avoid this confound. Our event-study design uses retail trading data in the [−20,+20] trading-day window around each ESG news event. Thus, our primary sample includes 2,220,704 Firm- EventDate-Date observations around 54,199 unique events for 3,292 unique publicly-traded firms. 3.2. ESG Performance Measure An advantage of the TruValue Labs dataset is that it allows us to proxy for changes in a firm’s ESG performance specifically associated with an ESG event. TruValue Labs uses natural language processing (NLP) to calculate the article sentiment regarding how a firm 12 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "1. Introduction",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 59,
    "chunk_index": 24,
    "word_count": 324,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "Measure An advantage of the TruValue Labs dataset is that it allows us to proxy for changes in a firm’s ESG performance specifically associated with an ESG event. TruValue Labs uses natural language processing (NLP) to calculate the article sentiment regarding how a firm 12 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "1. Introduction",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 59,
    "chunk_index": 25,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "performs along each ESG category. This sentiment ranges from 0 to 100, with 50 denoting a neutral article. TruValue Labs then computes Pulse, defined as the weighted average of ESG category sentiment scores for each firm, measured daily. Pulse weights the sentiment of more recent articles more heavily and has a half-life of less than a month, making it relatively unaffected by previous ESG news events. Thus, we interpret Pulse as the short-term real-time per- formance of the firm in one or more of the 26 SASB categories. The dataset contains the Pulse both before and after incorporating the information revealed by the event. We use this information to compute the change in ESG performance in the short window around the event, PulseChange, which is a powerful proxy for how the public perceives the change in a firm’s ESG performance revealed by the event.10 For example, a positive PulseChange for an event related to the SASB “Environment” category suggests that the event reveals a positive change in expectations about the firm’s environmental performance.11 Figure A-1 in Appendix A presents several examples of ESG news events in our sample. Our sample covers a broad range of positive and negative events. For instance, Panel (a) presents Hasbro’s change in branding to promote gender equality and inclusivity, and Panel (b) presents Occidental Petroleum’s signing of clean energy contracts. Although both are pro-ESG events, in that a positive PulseChange accompanies them, they differ in their im- plications for the firm’s financial performance. We use market returns to identify the former as a positive development for the firm’s financial performance (positive returns) and the latter as a negative event for financial performance (negative returns). These examples illus- trate the significant heterogeneity across events, which allows us to disentangle the reasons for investor trade. 10Discussions with the TruValue Labs data team confirm this interpretation. Specifically, taking the difference of the pre-event and post-event Pulse score proxies for both the direction and magnitude of the event’s ESG implications. This change in performance is based on how the performance is described in the articlesandthereforeisnotconstrainedtobeonlyaboutpastperformanceoronlyaboutfutureperformance. However, given the nature of the events, it is new information to the market. 11For events spanning multiple SASB categories, PulseChange represents the average change in ESG performance expectations across all categories. 13 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "1. Introduction",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 59,
    "chunk_index": 26,
    "word_count": 384,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "performance is based on how the performance is described in the articlesandthereforeisnotconstrainedtobeonlyaboutpastperformanceoronlyaboutfutureperformance. However, given the nature of the events, it is new information to the market. 11For events spanning multiple SASB categories, PulseChange represents the average change in ESG performance expectations across all categories. 13 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "1. Introduction",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 59,
    "chunk_index": 27,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "WemeasureretailtradingactivityinTAQusingthemethodologyintroducedbyBoehmer et al. (2021). This methodology is based on the logic that marketable retail investor orders receive small amounts of price improvement over the National Best Bid or Offer and are typically filled internally or sold to wholesalers (e.g., this approach is used in Blankespoor et al., 2018, 2019; Bushee, Cedergren, and Michels, 2020; Barber et al., 2022; Campbell et al., 2023). This retail trading volume makes up a small percent (≈ 7%) of total volume during our sample period. This methodology only identifies market orders or marketable limit orders filled internally or by wholesalers. Nevertheless, despite not identifying all retail trades, trades identified as retail trades are likely correctly identified, and our inferences should generalize to all retail investors. Useful for our tests investigating retail investors’ motivations for trade, the methodology also assigns retail trades as buys or sells. Thus, we test how the direction of retail trade in the short window around an ESG news event, as proxied by buy-sell imbalance measures, corresponds to the event’s implications for ESG performance and financial performance. In robustness tests, we use an alternative buy-sell imbalance measure based on the assignment of buys and sells using the Lee-Ready algorithm Lee and Ready (1991), as suggested by Barber et al. (2023). We also use a specific sample of retail investors, those using the Robinhood trading plat- form. This sample does not rely on the approach developed in Boehmer et al. (2021).12 Robinhood investors are more likely to be young investors, a class of retail investors tradi- tionally thought to be more likely than the overall investor population to invest in companies targetingsocialorenvironmentalgoals. Therefore, wecomplementourmainanalysisbytest- ing whether non-pecuniary preferences are present in this sample where they are most likely 12AdisadvantageisthatthedataonRobinhoodinvestorsrevealthechangeinthenumberofusersholding the stock, but not the change in shares or trades that we could investigate in our main analyses using the approachintroducedbyBoehmeretal.(2021). Moreover,thesampleendsinAugust2020duetoRobinhood data availability. 14 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 59,
    "chunk_index": 28,
    "word_count": 316,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "in companies targetingsocialorenvironmentalgoals. Therefore, wecomplementourmainanalysisbytest- ing whether non-pecuniary preferences are present in this sample where they are most likely 12AdisadvantageisthatthedataonRobinhoodinvestorsrevealthechangeinthenumberofusersholding the stock, but not the change in shares or trades that we could investigate in our main analyses using the approachintroducedbyBoehmeretal.(2021). Moreover,thesampleendsinAugust2020duetoRobinhood data availability. 14 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 59,
    "chunk_index": 29,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "to be present. 3.4. Descriptive Statistics Table 1 Panel A presents summary statistics for the main variables used in our analysis. ThefirstsectionofPanelAcoversvariablesmeasuredattheFirm-EventDate-Datelevel. For example, wemeasureunsignedretailtradingactivityusingretailtradingvolume(RetailVol) and the number of retail trades (RetailNum). The average daily retail trading volume is 0.581 million shares and the average daily number of retail trades is 3,409. We compute two measures of buy-sell imbalance, RetailBSIVol and RetailBSINum. The second section of Panel A covers variables measured at the Firm-EventDate level. Events in our sample are covered by an average of more than 7 media articles, with sub- stantial heterogeneity in the extent of media coverage across events. The sample of events encompasses a diverse array of news categories, including the Environment (23.4%), So- cial Capital (33.2%), Human Capital (18.8%), Business Model and Innovation (24.4%), and Leadership and Governance (19.8%).13 The summary statistics also reveal that the ESG news events exhibit a large amount of variationintherevealedchangeinESGperformance(PulseChange)andtherevealedchange in financial performance (EventRet). The abnormal return in the 3-day window around the event, EventRet, is a concise measure of the direction and magnitude of the change in expectations regarding firm value revealed at the time of the event. The descriptive statistics for Analyst Revision and SASB Materiality indicate that around half of the events contain financially material information in that they elicit an analyst forecast revision or are financially material according to the SASB’s Materiality Map. Table 1 Panel B presents correlations between notable Firm-EventDate level signed vari- ables. The correlation between PulseChange and EventRet is significantly positive, yet small in magnitude (≈ 2%), which highlights the fact that financial performance can be 13These percentages sum to more than 100%, as some ESG news events span multiple categories. 15 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 59,
    "chunk_index": 30,
    "word_count": 285,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "Firm-EventDate level signed vari- ables. The correlation between PulseChange and EventRet is significantly positive, yet small in magnitude (≈ 2%), which highlights the fact that financial performance can be 13These percentages sum to more than 100%, as some ESG news events span multiple categories. 15 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 59,
    "chunk_index": 31,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "largely orthogonal to ESG performance. This fact is consistent with prior research (e.g., Kru¨ger, 2015; Manchiraju and Rajgopal, 2017; Chen et al., 2018).14 4. Main Results 4.1. Retail Investor Trading Activity and ESG News We begin by investigating whether retail investors consider ESG news events in their portfolio allocation decisions. Specifically, we test for changes in retail investor trading activity around ESG news events, using non-event days as a benchmark. To the extent that retail investors value ESG-related information conveyed during news events, we expect to find significant increases in trading activity by retail investors around ESG news, as retail investors purchase or sell assets based on their interpretations of the news signal.15 As a first step, Figure 1 plots the average daily retail investor trading activity in event- time in the window immediately surrounding ESG news events. Panel A presents a plot of retail investor trading volume, and Panel B presents a plot of the number of retail trades. Consistent with ESG news events being an important component of retail investors’ portfolio allocation decisions, we find significant spikes in daily retail investor trading activity around the news release date. To further investigate these issues, we estimate the following regression using the sample of Firm-EventDate-Date observations in the 20 trading-day window before and after (i.e., trading days −20 through +20) each Firm-EventDate: RetTrade = β EventDay[−1,+1] +Σβ Firm-EventDate +ϵ , (1) i,e,t 1 i,e,t i,e i,e i,e,t 14As an example of disagreement between signed ESG performance and financial performance, Panel (b) inFigureA-1showsaneventforOccidentalPetroleumwithhighESGperformancebutloweventreturns. In addition,manyofoureventsarenotconsideredfinanciallymaterial,furtherunderscoringthelowcorrelation between ESG and financial performance around news events. 15Using standard event study design, we use non-event days as the appropriate benchmark for this first analysis because we are interested in whether the event causes retail investors to transact. In subsequent analyses, we use alternative benchmarks to address additional questions. 16 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 59,
    "chunk_index": 32,
    "word_count": 309,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "around news events. 15Using standard event study design, we use non-event days as the appropriate benchmark for this first analysis because we are interested in whether the event causes retail investors to transact. In subsequent analyses, we use alternative benchmarks to address additional questions. 16 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 59,
    "chunk_index": 33,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "where RetTrade is one of several measures of retail investor trading activity for firm i i,e,t on a particular date t around EventDate e. EventDay[−1,+1] is an indicator variable i,e,t equal to one if the date is within trading days [−1,+1] of the Firm-EventDate. A positive β suggests that retail investors react to ESG news events. Given the event-study design 1 allows us to hold constant other factors that should not vary in the short window around the event, thus mitigating omitted variable bias and reverse causality concerns, time-varying controls are omitted. Moreover, our primary and most stringent specification includes Firm- EventDate fixed effects, which subsume any variation constant for each firm-event window. For completeness, we present versions of regressions with and without EventDate, Firm, and Firm-EventDate fixed effects. We use cluster-robust standard errors clustered by Firm and EventDate. Table 2 presents a first set of regression results for multiple variations of Equation (1). Across all specifications, we find that retail investor trading activity significantly increases around ESG news events. The results in Table 2 Panel A imply that—relative to the [−20,−2] and [+2,+20] windows before and after these events—retail investors increase their trading volume in the three days centered around the event. The coefficient on EventDay[−1,+1] is 0.033 across all four columns of Table 2 Panel A, which indicates that average retail investor trading volume increases by approximately 5.7% in the 3-day period around the release of ESG news. The results in Table 2 Panel B indicate that retail investors increase their number of trades by approximately 3.7% on average at the release of ESG news.16 To provide context to interpret these magnitudes, we also compare the retail investor reaction to ESG news events to their reaction to “traditional” financial news events. As retail investors likely become aware of these events through the media, we use Ravenpack to identifynewsarticlesonfinancialevents: earningsannouncements, analystforecastrevisions, 16The5.7%increaseforPanelAiscalculatedbasedontheaveragenon-eventperiodretailinvestortrading volumeof0.579(0.033/0.579=0.057). The3.7%increaseforPanelBiscalculatedbasedontheaveragenon- event number of retail trades of 3.399 (0.125/3.399=0.037). 17 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 59,
    "chunk_index": 34,
    "word_count": 329,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "investor reaction to ESG news events to their reaction to “traditional” financial news events. As retail investors likely become aware of these events through the media, we use Ravenpack to identifynewsarticlesonfinancialevents: earningsannouncements, analystforecastrevisions, 16The5.7%increaseforPanelAiscalculatedbasedontheaveragenon-eventperiodretailinvestortrading volumeof0.579(0.033/0.579=0.057). The3.7%increaseforPanelBiscalculatedbasedontheaveragenon- event number of retail trades of 3.399 (0.125/3.399=0.037). 17 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 59,
    "chunk_index": 35,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "dividend announcements, management guidance, and M&A announcements. We estimate Equation (1) using the 20 trading-day window before and after (i.e., trading days −20 through +20) each Firm-EventDate in the sample of financial news events. Table 3 presents results. For all types of events except earnings announcements, we remove the eventsinthe[−1,+1]trading-daywindowaroundearningsannouncements. PanelApresents results for the dependent variable RetailVol, and Panel B presents results for the dependent variable RetailNum. For ease of comparison, column 1 of each panel presents the retail investor reaction to news events from the previous table. Column 2 of each panel presents retail investors’ reactions to all financial news articles. In Panel A, the column 2 coefficient on EventDay[−1,+1] is 0.041, and a Z-test across columns 1 and 2 finds that the retail investor reaction to ESG news events of 5.7% is marginally significantly lower than the reaction to the full sample of all financial news events. It appears that retail investors react to ESG news events 1.4% less than they do to the aver- age financial news event. Columns 3 to 7 present the results for each type of financial event (comprising column 2). The column 3 coefficient on EventDay[−1,+1] is 0.089 and signif- icantly different from the column 1 coefficient, implying that the retail investor reaction to ESG news events is 9.5% lower than the reaction to earnings announcements.17 The column 6 and column 7 coefficients are also significantly larger than the ESG news reaction coeffi- cient, implying that the retail investor reaction to ESG news is significantly lower than the reactions to guidance and M&A announcements by 9.5% and 30.6%, respectively. However, the reaction to ESG news events is significantly larger than the reaction to analyst forecasts and dividend announcements by 4.5% and 4.7%, respectively. 4.2. Cross-sectional and Time-series Variation We also explore cross-sectional variation in the extent to which retail investors react to events on different ESG topics. To this end, we estimate Equation (1) in the subsamples of 17Consistentwiththisresult,coefficientsinTable2areslightlylargerinmagnitudeifweretainESGnews events around earnings announcements. 18 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 59,
    "chunk_index": 36,
    "word_count": 336,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "4.5% and 4.7%, respectively. 4.2. Cross-sectional and Time-series Variation We also explore cross-sectional variation in the extent to which retail investors react to events on different ESG topics. To this end, we estimate Equation (1) in the subsamples of 17Consistentwiththisresult,coefficientsinTable2areslightlylargerinmagnitudeifweretainESGnews events around earnings announcements. 18 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 59,
    "chunk_index": 37,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "events tagged to each of the SASB categories: Environment, Social Capital, Human Capital, Business Model and Innovation, and Leadership and Governance. Table 4 Panel A presents results using the dependent variable RetailVol and Table 4 Panel B presents results us- ing the dependent variable RetailNum. We find a positive and significant coefficient on EventDay[−1,+1] across all columns in each panel, which implies that events in all cate- gories elicit retail investor trading volume. There is substantial variation in the magnitude of the coefficient across the columns. Our results suggest that Leadership and Governance events, followedbyBusinessModelandInnovationandSocialCapitalevents, elicitthegreat- est increases in event-related retail investor trading activity. Events in the Environment and Human Capital categories elicit smaller increases in event-related retail investor trading ac- tivity. Thisrelativerankingisconsistentwithsurveyevidencehighlightinggovernanceasthe most important factor, among all ESG factors, in investors’ decision-making (CFA Institute, 2020).18 Figure 2 presents the evolution of ESG event-related changes in retail investor trading volume and the number of retail trades over time, respectively. The event-related increase in retail investor trading volume has grown since the beginning of our sample period in December 2015. While events in the earliest part of our sample period (December 2015 to March 2018) garner a 3.8% increase in retail investor trading volume, this statistic more than doubles (e.g., rises to 8.1%) for the period from May 2020 to August 2022. 4.3. Retail Investor Attention Akeyfeatureofoursettingisthatitfocusesonhigh-attentionESGnewsevents, ofwhich retail investors are likely to be aware. Next, we validate that measures of investor attention change around ESG news events. We focus on two commonly used measures of investor 18As differences in media attention to different categories of events could explain these findings, in unt- abulated analyses, we find that controlling for media coverage does not change the relative ranking of the importance of each ESG category. We explore attention in more detail in Section 4.3. Furthermore, untab- ulated analyses find that news events revealing positive ESG performance and those revealing negative ESG performance both elicit significant increases in retail trading activity. 19 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 59,
    "chunk_index": 38,
    "word_count": 335,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "relative ranking of the importance of each ESG category. We explore attention in more detail in Section 4.3. Furthermore, untab- ulated analyses find that news events revealing positive ESG performance and those revealing negative ESG performance both elicit significant increases in retail trading activity. 19 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 59,
    "chunk_index": 39,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "attention from prior studies: (1) abnormal Google search volume used in Da, Engelberg, and Gao (2011) and Drake, Roulstone, and Thornock (2012) (GoogleSearch Daily) and abnormal Bloomberg institutional investor attention used in Ben-Rephael, Da, and Israelsen (2017) (BloombergAIA Daily).19 We begin by plotting average daily attention in event-time around ESG news events in Figure 3. Panel A presents results for Google search volume, and Panel B presents results for Bloomberg terminal activity. Consistent with increases in investor attention around these events, we find large spikes in investors’ Google searches and Bloomberg terminal activity around each event. These findings highlight substantial increases in investor attention to companies around ESG news events in our sample, mirroring those related to retail investors’ trading activity shown in Figure 1. We next estimate a version of Equation (1) that replaces the dependent variable with one of the two attention proxies. Table 5 Panel A shows that Google search volume increases around the event. The coefficient on EventDay[−1,+1] is significantly positive and around 0.309 across all four columns of Panel A, indicating that abnormal Google search volume increases by approximately 1.5% on average in the three-day period centered around the releaseofESGnews. PanelBshowsthatBloombergterminalattentionsignificantlyincreases by approximately 14% around the event.20 Taken together, these results imply that ESG news events garner substantial attention from investors and highlight that retail investors are likely aware of these events. In addition, this evidence highlights retail investors could be searching for additional information to aid their interpretation of ESG news events. We next highlight the importance of investor attention in retail investors’ reactions to ESG news events. Specifically, we explore in the cross-section how retail investors’ trading 19Although the attention to news on Bloomberg terminals reflects institutional investor attention, many institutional clients are an important source of news dissemination to retail investors. For instance, prior studies highlight the important role that analysts play in retail investor portfolio decision-making (e.g., MalmendierandShanthikumar,2007;Lawrence,Ryans,andSun,2017). Consistentwiththisnotion,Section 5.4 documents greater increases in retail investor trading activity for ESG events eliciting analyst revisions. 20In untabulated analyses, we find qualitatively similar results in Tables 5 and 6 if we use an indicator for high Bloomberg terminal attention, defined as attention taking a value of 3 or 4 (Ben-Rephael et al., 2017). 20 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 59,
    "chunk_index": 40,
    "word_count": 376,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "activity for ESG events eliciting analyst revisions. 20In untabulated analyses, we find qualitatively similar results in Tables 5 and 6 if we use an indicator for high Bloomberg terminal attention, defined as attention taking a value of 3 or 4 (Ben-Rephael et al., 2017). 20 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 59,
    "chunk_index": 41,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "activity varies with the amount of attention paid to the ESG news event. To do so, we estimate a version of Equation (1) that interacts EventDay[−1,+1] with several attention proxies commonly used in prior literature: (1) the number of news articles associated with the event,21 (2) Google search volume, and (3) Bloomberg terminal activity. To facilitate the interpretation of the coefficients, we standardize each event-level attention proxy so that it has a mean of zero and a standard deviation of one. Table 6 Panel A (Panel B) presents results for the dependent variable retail investor volume (number of retail trades). For all specifications, our estimates indicate that retail in- vestor trading activity is significantly higher in cases where attention is higher. For instance, in Panel A, our estimates indicate a one-standard-deviation increase in the event’s media coverage, Google search, and Bloomberg activity, increases the change in retail investor trad- ing volume by approximately two-thirds, two-thirds, and four times, respectively.22 In Panel B, our findings related to the number of retail trades mirror these findings. 4.4. Motivations for Retail Investor Trade Having documented that retail investors incorporate ESG news events into their trading decisions, we next explore why they trade. Around each news event, investors should update their beliefs about firm performance along both financial and ESG dimensions. We lever- age the significant heterogeneity across events to disentangle non-pecuniary vs. pecuniary reasons for retail investor transactions. Toexploretheseissues, weaugmentEquation(1)toexaminetherelationshipbetweenthe signed reactions of retail investors and measures of stock performance and ESG performance. 21Priorliteraturefindsstrongevidenceinsupportofthemedia’sdisseminationroleinmitigatinginvestors’ attentionconstraintsandinformationprocessingfrictionsmorebroadly(e.g.,Peress,2014;Blankespooretal., 2018). 22ThepositiveandsignificantcoefficientonEventDay[−1,+1]highlightsthatretailtradealsoincreasesfor events with an average level of attention. This finding mitigates concerns that our results can be attributed to a small subsample of events garnering extremely high attention. 21 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 59,
    "chunk_index": 42,
    "word_count": 287,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "signed reactions of retail investors and measures of stock performance and ESG performance. 21Priorliteraturefindsstrongevidenceinsupportofthemedia’sdisseminationroleinmitigatinginvestors’ attentionconstraintsandinformationprocessingfrictionsmorebroadly(e.g.,Peress,2014;Blankespooretal., 2018). 22ThepositiveandsignificantcoefficientonEventDay[−1,+1]highlightsthatretailtradealsoincreasesfor events with an average level of attention. This finding mitigates concerns that our results can be attributed to a small subsample of events garnering extremely high attention. 21 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 59,
    "chunk_index": 43,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "Specifically, we estimate: RetailBSI = β EventDay[−1,+1] + i,e,t 1 i,e,t β EventDay[−1,+1] ×PulseChange + 2 i,e,t i,e β EventDay[−1,+1] ×EventRet + 3 i,e,t i,e Σβ Firm-EventDate +ϵ , (2) i,e i,e i,e,t where RetailBSI is one of two measures of retail investor buy-sell imbalance for firm i on a particular date t around EventDate e and EventDay[−1,+1] is as previously defined. The interaction term variables PulseChange and EventRet represent the change in ESG i,e i,e expectations for the firm (based on event-related changes in the TruValue Pulse score) and the event period return for firm i around EventDate e, respectively. In effect, these measures proxy for the changes in investors’ expectations for a company’s ESG and stock return performance around an event. A positive β suggests that retail investors increase their net 2 demand when the event reveals more positive implications for the firm’s ESG performance after controlling for its impact on stock performance. A positive β suggests that retail 3 investors increase their net demand when the event reveals more positive implications for the firm’s stock performance after controlling for its impact on ESG performance. Table 7 Panel A presents results of estimating several versions of Equation (2). Using the dependent variable RetailBSIVol, column 1 shows an insignificant coefficient on the interaction EventDay[−1,+1] × PulseChange. After including an additional interaction between the event-window indicator and signed event returns, the coefficient on the inter- action EventDay[−1,+1]×PulseChange remains insignificant in column 2. We infer that ESG performance does not affect retail investor net demand.23 In sharp contrast to the 23Including PulseChange and financial performance together in a single regression facilitates the in- terpretation of the coefficient on EventDay[−1,+1]×EventRet based on the portion of EventRet that is orthogonal to changes in ESG performance. Therefore, our analyses account for the possibility that non-pecuniary preferences in the market could affect returns. Section 5.4 includes further discussion and additional robustness tests. 22 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 59,
    "chunk_index": 44,
    "word_count": 323,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "of the coefficient on EventDay[−1,+1]×EventRet based on the portion of EventRet that is orthogonal to changes in ESG performance. Therefore, our analyses account for the possibility that non-pecuniary preferences in the market could affect returns. Section 5.4 includes further discussion and additional robustness tests. 22 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 59,
    "chunk_index": 45,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "coefficient on EventDay[−1,+1] × PulseChange, the coefficient on the interaction with EventRet is significantly positive. Thus, consistent with pecuniary motivations for trade, retail investors increase their net demand at the event to a greater extent when the event reveals positive information about financial performance. Columns 3 and 4 indicate similar results using the dependent variable RetailBSINum.24 Next, we compare the retail investor buy-sell imbalance reaction to ESG news events to theirreactiontoasetofmatchedearningsannouncements,whicharefinancialeventswithout non-pecuniary implications (i.e., they only have financial implications). This matched-pair analysis assesses whether retail investors have a different demand for the exact same re- turn profile simply because there is a green/social preference, which would suggest retail investors have non-pecuniary preferences (e.g., Friedman and Heinle, 2016; Pastor et al., 2021). To conduct this matched-pair analysis, we match each ESG news event to an earn- ings announcement within the same calendar year-quarter that has a similar abnormal event return and market capitalization. We use abnormal event returns to proxy for the firm value implications of each event, and we use total market capitalization as a proxy for other firm characteristics likely to affect retail investor trading behavior (e.g., attention, media coverage, etc.). For each ESG news event, we use a nearest-neighbor matching algorithm to find the earnings announcement that is the most similar along the matching variables, and we match without replacement. Thus, each ESG news event is similar to its matched financial news event in terms of financial implications. We then compare the abnormal retail investor buy-sell imbalances in the ESG event period and the matched earnings announcement event 24We also conduct additional robustness tests to address potential measurement error in PulseChange as a proxy for retail investors’ perception of changes in ESG performance. Measurement error is less likely to impact our inferences when an event reveals extreme changes in ESG performance. Therefore, we assess event-related changes in retail investors’ aggregate net demand around events revealing extreme changes in ESG performance. In untabulated analyses, we continue to find that retail investor net demand does not vary with ESG performance but does vary with financial performance in the subsample of events with PulseChangeinthetoporbottomquartile(alsoseeFigure4). Inaddition,wecontinuetofindnovariation with ESG performance using alternative measures and in multiple subsamples: a scaled percentage change in Pulse, quartile ranks, E&S events only, positive events, negative events, and events for firms with high or low pre-event Pulse (untabulated). 23 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 59,
    "chunk_index": 46,
    "word_count": 396,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "in the subsample of events with PulseChangeinthetoporbottomquartile(alsoseeFigure4). Inaddition,wecontinuetofindnovariation with ESG performance using alternative measures and in multiple subsamples: a scaled percentage change in Pulse, quartile ranks, E&S events only, positive events, negative events, and events for firms with high or low pre-event Pulse (untabulated). 23 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 59,
    "chunk_index": 47,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "period. A significant difference in the buy-sell imbalance would suggest that retail investors have a differential net demand for ESG news events compared to “traditional” financial news events and could therefore have non-pecuniary motivations for trade. Table 7 Panels B and C report the results of the matched-pair analysis for retail buy- sell imbalances based on volume and the number of trades, respectively. Column 1 reports the abnormal retail buy-sell imbalance differences for the full sample of ESG news events, column 2 uses only positive ESG news events, and column 3 uses only negative ESG news events. Across all columns of Table 7 Panel B and C, we find insignificant differences in the abnormal retail buy-sell imbalance between ESG news events and their matched earnings announcements. Importantly, the matched-pair analysis holds constant the financial impli- cations of and the attention to each of the two types of events when making the comparison. Our inference is that retail investors respond to ESG news events in the same way they respond to earnings announcements, after accounting for the events’ financial implications.25 Collectively, our evidence presented in Table 7 highlights that there exists little rela- tion between retail investor net demand for securities and companies’ ESG performance, after accounting for the event’s impact on stock return performance. We further illustrate this insight by plotting aggregate net demand (measured by buy-sell imbalances) around extreme events. Figure 4 illustrates that event-period retail investor buy-sell volume im- balance is positive for events revealing extremely positive changes in financial performance (e.g., based on day-0 returns), regardless of whether the event reveals extremely positive or negative ESG performance information. In contrast, the event-period retail investor buy-sell volume imbalance is negative for events revealing extremely negative changes in financial performance, regardless of whether the event reveals extremely positive or negative ESG performance information. In line with our main analyses, this figure highlights that retail investor aggregate net demand at extreme ESG news events reflects pecuniary, rather than 25In untabulated analyses, we perform the matched-pair analysis for subsamples of ESG events, by cate- gory,andcontinuetofindstatisticallyinsignificantdifferencesinabnormalretailbuy-sellimbalanceforthese subsamples. 24 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 59,
    "chunk_index": 48,
    "word_count": 351,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "ESG performance information. In line with our main analyses, this figure highlights that retail investor aggregate net demand at extreme ESG news events reflects pecuniary, rather than 25In untabulated analyses, we perform the matched-pair analysis for subsamples of ESG events, by cate- gory,andcontinuetofindstatisticallyinsignificantdifferencesinabnormalretailbuy-sellimbalanceforthese subsamples. 24 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 59,
    "chunk_index": 49,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "non-pecuniary, motives for trade. 5. Additional Analyses 5.1. Return Predictability Our main results show that retail investors react to ESG news events, but primarily due to pecuniary motivations. To provide further insight into the extent to which retail investors profit or suffer losses from trading based on pecuniary implications of ESG news events, we assess whether net demand predicts future stock prices (e.g., Chordia and Subrahmanyam, 2004;BusheeandGoodman,2007;KelleyandTetlock,2013). Priorresearchinothersettings finds mixed evidence of the profitability of retail investors’ trades, with some studies finding that their trades predict returns (e.g., Kaniel et al., 2012; Boehmer et al., 2021) and others finding that their trades lose money (e.g., Barber and Odean, 2000, 2008). Specifically, we test whether the future buy-and-hold returns over the window [+2,+60] trading days after the event are associated with aggregate retail investor net demand in the [−1,+1]trading-daywindowaroundeachevent. Thatis, weestimatethefollowingregression using the sample of unique Firm-EventDate observations: BHAR[+2,+60] = β SignedRetailTrade[−1,+1] +Σβ Firm + i,e 1 i,e i i Σβ YearQtr +ϵ , (3) q q i,e where SignedRetailTrade[−1,+1] is the retail investor buy-sell imbalance for firm i in i,e the [−1,+1] trading-day window around EventDate e. A positive β indicates that retail 1 investor net demand predicts future abnormal returns; retail investor net selling predicts negative returns and retail net buying predicts positive returns. Therefore, a positive β 1 suggests that retail investors make profitable trades around ESG news events. Table 8 Panel A reports results of estimating Equation (3). Column 1 includes all events 25 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 59,
    "chunk_index": 50,
    "word_count": 252,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "investor net selling predicts negative returns and retail net buying predicts positive returns. Therefore, a positive β 1 suggests that retail investors make profitable trades around ESG news events. Table 8 Panel A reports results of estimating Equation (3). Column 1 includes all events 25 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 59,
    "chunk_index": 51,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "in our sample with available data used to compute BHAR[+2,+60]. The coefficient on RetailBSIVol[−1,+1] is positive and significant, indicating that retail investors appear to profit when trading during these events. As not all ESG events reveal information rele- vant to financial performance, we isolate the events with substantial financial performance information, defined based on SASB materiality mappings or extreme event returns. Column 2 of Table 8 Panel A reveals a positive and significant coefficient in the sample of events containing financially material information, measured using the SASB Materiality Map. Column 3 shows a positive and significant coefficient in the sample of events with extreme event returns, defined as abnormal event returns in the top or bottom quintiles of the sample. Panel B repeats the same analyses with RetailBSINum[−1,+1] as the independent variable, and it indicates similar results overall. As a falsification test, we also investigate whether retail investor aggregate net demand predicts returns in the remaining eventsnotpresentedincolumns2and3ofeachpanel, thosethatarenotfinanciallymaterial, and we find insignificant results (untabulated). Collectively, these findings imply that retail investors’ net demand related to ESG events predicts future returns, but only in the subsample of events revealing financially material information about firms. Our inference is that retail investors profit when processing the financial performance implications of ESG events, and our results are suggestive of retail investors using event returns as a proxy for the implications (e.g., Blankespoor et al., 2019). Incontrast, theinsignificantreturnpredictabilityfornon-financiallymaterialeventssuggests they do not profit when there are no financial performance implications to process and miti- gates alternative explanations for these results (e.g., measurement error in the identification of retail investor buys and sells). 5.2. Cross-sectional Variation in Motivations for Retail Investor Trade To assess the robustness of our findings regarding retail investors’ motivations for trade, we investigate how our results vary with retail investors’ views on ESG investing. We use 26 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 59,
    "chunk_index": 52,
    "word_count": 309,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "identification of retail investor buys and sells). 5.2. Cross-sectional Variation in Motivations for Retail Investor Trade To assess the robustness of our findings regarding retail investors’ motivations for trade, we investigate how our results vary with retail investors’ views on ESG investing. We use 26 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 59,
    "chunk_index": 53,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "proxies for the prosocial nature and the political leanings of local investors, as prior studies highlight that they affect market participants’ attitudes towards sustainable investments (e.g., Di Giuli and Kostovetsky, 2014; Larcker and Watts, 2020). Given our aggregate- level retail investor data does not identify each investor’s location, we follow prior studies’ findings of a local tilt in investors’ portfolios (e.g., Ivkovic and Weisbenner, 2005; Chi and Shanthikumar, 2017; Branikas, Hong, and Xu, 2020) and use variation in the location of the firm’s headquarters. Our proxy for investors’ prosocial nature is the state-level average HIP Investor ESG rating for local governments (by census-designated places).26 We divide states into high and low prosocial attitudes based on splits around the sample median of the constructed measure. Our proxy for political leanings is an indicator variable for whether the state predominantly voted Democratic in the 2020 presidential election. We estimate Equation (2) in the subsamples of events for firms headquartered in each of these subsamples. These regressions test whether our results hold in subsamples of investors potentially more likely to have non-pecuniary preferences. In addition, we explore whether pecuniary motivations for trade are stronger or weaker in states with investors that view sustainable investments in a more positive light (e.g., related to believing in climate change risk in Baldauf, Garlappi, and Yannelis, 2020). Table9presentsresults. PanelApresentsresultsfromestimatesusingthedependentvari- ableRetailBSIVol,andPanelBshowsresultsusingthedependentvariableRetailBSINum. In each panel, columns 1 and 3 find that our results continue to hold in high ESG rating states and blue states, respectively. Even in these states, retail investors’ non-pecuniary preferences toward social or environmental factors appear limited. Columns 2 and 4 also find no evidence that retail investor net demand varies with changes in ESG performance expectations at the event in low ESG rating and red states, respectively. 26The rationale for this measure is that local governments likely reflect the beliefs of their constituents, so itservesasaproxyforinvestors’attitudestowardsprosocialinvestmentinthesestates. Consistentwiththis rationale, Larcker and Watts (2020) provides evidence that environmental indices correlate with state-level green securities issuance. 27 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 59,
    "chunk_index": 54,
    "word_count": 333,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "event in low ESG rating and red states, respectively. 26The rationale for this measure is that local governments likely reflect the beliefs of their constituents, so itservesasaproxyforinvestors’attitudestowardsprosocialinvestmentinthesestates. Consistentwiththis rationale, Larcker and Watts (2020) provides evidence that environmental indices correlate with state-level green securities issuance. 27 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 59,
    "chunk_index": 55,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "Interestingly, the variation with event returns is also insignificant in the low ESG and red state subsamples, and a test of the difference in coefficients between columns 1 and 2 finds that the association between event-related changes in retail investor net demand and event returns is marginally significantly higher in high ESG rating states. Thus, we find some evidence that retail investors react even more strongly to ESG events’ implications for stock return performance in states with higher ESG scores. 5.3. Alternative Measures of Retail Trade We assess the robustness of our inferences to alternative measures of retail buy-sell im- balance. First, we use an alternative buy-sell imbalance measure based on the assignment of buys and sells using the Lee-Ready algorithm (Lee and Ready, 1991), as suggested by Barber et al., 2023. Table 10 Panel A presents results using this alternative buy-sell im- balance measure for the tests described in Section 4.4. We present results of estimating Equation (2). Consistent with our main results, aggregate net retail demand does not vary with ESG performance; instead, it varies with information about stock return performance. Second, we use an alternative, specific sample of retail investors, namely those using the Robinhood trading platform. These analyses assess whether our inferences are robust to alternative samples of retail investor trading data, which do not rely on the approach developed in Boehmer et al. (2021). Moreover, the Robinhood sample provides a potentially more powerful setting to test for non-pecuniary preferences for ESG-related activities among retail investors, as Robinhood investors tend to be younger. Table 10 Panel B presents results using Robinhood data for the tests described in Section 4.4.27 We present results of estimating Equation (2). Aggregate net Robinhood demand does not vary with ESG performance, but instead, it varies with information about stock return performance.28 Overall, our findings across our primary and alternative measures of retail trade pro- 27In untabulated analyses, we also re-estimate the other analyses reported in the paper with Robinhood data and find that our inferences are qualitatively unchanged. 28AstheRobinhooddatameasurethechangeinthenumberofusersholdingthestock,thisresultsuggests that new Robinhood users become owners of the stock. 28 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 59,
    "chunk_index": 56,
    "word_count": 353,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "across our primary and alternative measures of retail trade pro- 27In untabulated analyses, we also re-estimate the other analyses reported in the paper with Robinhood data and find that our inferences are qualitatively unchanged. 28AstheRobinhooddatameasurethechangeinthenumberofusersholdingthestock,thisresultsuggests that new Robinhood users become owners of the stock. 28 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 59,
    "chunk_index": 57,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "vide consistent evidence that retail investors care about ESG-related factors, but only for pecuniary reasons. The consistency of results across different retail buy-sell classifications and different samples of retail investors (e.g., Robinhood) mitigates concerns about potential measurement error in identifying retail investor trade. 5.4. Non-Market-Based Measures of Financial Materiality Our primary analyses described in Section 4.4 use equity returns to infer changes in the level and variance of future cash flows associated with the event. Nevertheless, we acknowledge that market-based measures could be affected by non-pecuniary motivations for trade from any market segment. For example, socially responsible institutional investors could apply upward pressure to prices around events revealing positive ESG performance.29 In this case, these market-based measures might partially proxy for ESG performance rather than solely reflect risk-adjusted financial performance. To address this possibility, we first point to our evidence in Figure 4 that retail investors trade in the direction of event returns when event returns disagree in direction with changes in the expectation of ESG performance (e.g., high returns and low ESG, low returns and high ESG). We provide further evidence on investors’ trading activities using additional, non-market-based measures of financial materiality. To this end, we estimate versions of Equation (1) that interact EventDay[−1,+1] with indicators suggesting that the event re- veals more financially material information about the firm. Here, one alternative financial materiality proxy we use is whether the category of ESG news is material for the firm’s industry, based on the SASB’s Materiality Map.30 The advantage of this proxy is that it is based on the ex-ante map between the event category and the company’s industry rather 29We expect that the impact of such incentives should be small, as the number of assets strictly tracking ESG, outside of its effect on performance, remains small despite its growth in recent years. For instance, survey evidence suggests that despite its recent growth, only 18% of North American funds consider ESG a primarymotivationintheirinvestmentapproach,andamongthese,mostuse“ESGintegration”approaches which seek to maximize portfolio performance (Capital Group, 2022). In the U.S., most fund managers are under strict fiduciary obligations to adhere to these principles. 30The SASB Materiality Map is based on feedback from practitioners about which ESG issues are finan- cially material for each industry. 29 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 59,
    "chunk_index": 58,
    "word_count": 375,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "to maximize portfolio performance (Capital Group, 2022). In the U.S., most fund managers are under strict fiduciary obligations to adhere to these principles. 30The SASB Materiality Map is based on feedback from practitioners about which ESG issues are finan- cially material for each industry. 29 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 59,
    "chunk_index": 59,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "than on ex-post returns, but it still relates to stock performance. For instance, prior studies find return reactions are most significant for financially material events (e.g., Serafeim and Yoon, 2022a,b). A second alternative financial materiality proxy is whether any equity an- alysts revise their quarterly EPS forecasts on the day of or shortly after the event. These measures, while crude, do not incorporate contemporaneous market prices and should only vary by the amount of financially material information revealed about the firm around the ESG news. Table 11 Panel A reports results for regressions using the dependent variable RetailVol. Columns 1 and 2 reveal that the retail investor response to ESG events is significantly more pronounced, by approximately one-half, when the event’s category is a material category for the industry. Columns 3 and 4 show that the response roughly doubles when an eq- uity analyst revises their EPS forecast for the firm. Panel B uses the dependent variable RetailNum. Columns 1 and 2 show a positive but insignificant coefficient on the interaction between EventDay[−1,+1] and SASB Materiality, which suggests that larger retail investor trades may react more to financially material events than do smaller trades. Columns 3 and 4 show qualitatively similar results to those presented in Panel A; the retail investor response is more pronounced for events revealing financially material information, as proxied by changes in analysts’ expectations. The presence of an analyst revision roughly triples the change in the number of retail investor trades. 6. Conclusion This paper explores how retail investors transact around ESG news events, their pri- mary source of information about firms’ ESG-related activities. We provide novel evidence that retail investors treat ESG-related news as a critical component of their portfolio allo- cation decisions. But, in contrast to the assumptions and findings of extant theoretical and experimental studies, the extent to which a representative U.S. retail investor exhibits non- 30 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 59,
    "chunk_index": 60,
    "word_count": 319,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "provide novel evidence that retail investors treat ESG-related news as a critical component of their portfolio allo- cation decisions. But, in contrast to the assumptions and findings of extant theoretical and experimental studies, the extent to which a representative U.S. retail investor exhibits non- 30 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 59,
    "chunk_index": 61,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "pecuniary preferences toward social or environmental factors appears limited. Our evidence is consistent with ESG information being “extremely important and nothing special” to re- tail investors (Edmans, 2023). We show retail investors view ESG news events as important for their investment-decision making, but in the same light as they do with any financial news signal. Althoughourresearchdesignhasmanyadvantages, oneshouldinterpretourfindingswith several important considerations. First, we draw inferences from how retail traders in the U.S. behave in the aggregate. We recognize that there may be heterogeneity across investors and that some may exhibit non-pecuniary preferences, although our findings indicate that these preferences appear economically limited in the aggregate. Second, we focus on short windows around the release of ESG news, which ignores how retail investors may use other ESG-relatedinformationintheirdecisionsoverlongerperiods(e.g., divestingfromparticular industries). Although we do not expect this possibility to impact our inferences significantly, we acknowledge that it is a potential limitation of our design. The above considerations aside, our study provides generalizable evidence on how retail investors incorporate ESG-related factors into their portfolio decision-making. In doing so, we inform ongoing debates regarding considering ESG factors in retirement plans and mandated disclosures along several dimensions. We leave open how financially relevant ESG factors should be incorporated into retirement portfolio investments and how regulators should require ESG-related information to be disclosed.31 Our findings highlight that these questions may be meaningful avenues for future research, given the importance of ESG- related information to retail investor decision-making. 31Relevant to future studies on how ESG-related information should be disclosed to help retail investors processthem,ourresultsaresuggestiveofeventreturnsasonewayinwhichretailinvestorsinferthefinancial implications of ESG news, consistent with the findings in Blankespoor et al. (2019), but not necessarily the exclusive way. 31 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 59,
    "chunk_index": 62,
    "word_count": 280,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "importance of ESG- related information to retail investor decision-making. 31Relevant to future studies on how ESG-related information should be disclosed to help retail investors processthem,ourresultsaresuggestiveofeventreturnsasonewayinwhichretailinvestorsinferthefinancial implications of ESG news, consistent with the findings in Blankespoor et al. (2019), but not necessarily the exclusive way. 31 Electronic copy available at: https://ssrn.com/abstract=4384675 Appendix A. ESG News Event Examples (a) Hasbro – Gender Neutral Potato Head Branding EventRet 4.4%, PulseChange 14.22 (b) Occidental Petroleum – Clean Energy Investment EventRet −3.6%, PulseChange 13.41 (c) Boeing – 737 MAX Conspiracy EventRet −3.9%, PulseChange −17.78 Fig. A-1 Select ESG Events in the Sample. 32 Electronic copy available at: https://ssrn.com/abstract=4384675 (d) Home Depot – Black Lives Matter Controversies EventRet −3.1%, PulseChange −19.68 (e) Fortress – Oil and Gas Development Investment EventRet 6.5%, PulseChange −17.07 Fig. A-1 Select ESG Events in the Sample (continued). This figure presents news clippings from several ESG events in our sample. Panel (a) presents an example of a high-ESG/high-financial performance event for Hasbro on 02/25/21, the adoption of more gender-inclusive branding. Panel (b) presents an example of a high-ESG/low-financial performance event for Occidental Petroleum on 01/28/20, the announcement of broaderinvestmentintocleanenergy. Panel(c)presentsanexampleofalow-ESG/low-financialperformance event for Boeing on 01/07/21, a large settlement with the Justice Department over the Boeing 737 MAX fraud. Panel (d) presents an example of a low-ESG/low-financial performance event for Home Depot on 08/16/21, an accusation of penalizing employees for their support of Black Lives Matter. Panel (e) presents an example of a low-ESG/high-financial performance event for Fortress on 11/11/16, an investment in developing oil and gas assets in Oklahoma. 33 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 33,
    "page_range": "p.33-34",
    "total_pages": 59,
    "chunk_index": 63,
    "word_count": 263,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.33-34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "low-ESG/low-financial performance event for Home Depot on 08/16/21, an accusation of penalizing employees for their support of Black Lives Matter. Panel (e) presents an example of a low-ESG/high-financial performance event for Fortress on 11/11/16, an investment in developing oil and gas assets in Oklahoma. 33 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 59,
    "chunk_index": 64,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "Appendix B. Variable Definitions and Sources This table contains definitions of the primary variables used throughout the paper. Variables include mea- sures of retail investor trading activity, ESG performance, attention, financial performance, and headquar- ters variables. Sources include: Bloomberg terminal activity data (Bloomberg), the Center for Research in Security Prices (CRSP), Factset TruValue Labs Spotlight data (Factset), Google search volume data (Google), HIP Investor, MIT Election Lab, Thomson Reuters I/B/E/S (IBES), Robinhood investor infor- mation (Robintrack), and Intraday Indicators by WRDS (WRDS). All continuous variables, except return data, are winsorized at 1% and 99%. Variable Definition Event window variables EventDate The first trading date on or after the date of the ESG news event. (Factset) EventDay[−1,+1] Indicator variable equal to one if the firm-day is in the [−1,+1] trading-day window of the ESG news event. (Factset) YearQtr The calendar year-quarter of the EventDate. (Factset) Trading activity variables Abn. RetailBSINum Abnormal buy-sell imbalance in the number of retail trades, calculated as the average daily RetailBSINum across trading days [−1,+1] of the news event less the average across trading days [−20,−2] of the news event. (WRDS) Abn. RetailBSIVol Abnormal buy-sell retail investor trading volume imbalance, calculated as the average daily RetailBSIVol across trading days [−1,+1] of the news event less the average across trading days [−20,−2] of the news event. (WRDS) RetailBSINum Daily buy-sell imbalance in the number of retail trades, calculated as the differ- ence between retail buys and retail sells, scaled by the sum of retail buys and retail sells. Retail buys and sells are based on TAQ data using the approach in Boehmer et al. (2021). (WRDS) RetailBSINum LR Daily buy-sell imbalance in the number of retail trades, calculated as the differ- ence between retail buys and retail sells, scaled by the sum of retail buys and retail sells. Retail buys and sells are based on TAQ data using the approach in Boehmer et al. (2021) to identify retail trades and the approach suggested by Barberetal.(2023)toclassifybuysandsellsbasedontheLee-Readyalgorithm (Lee and Ready, 1991). (WRDS) RetailBSINum[−1,+1] Firm-event level sum of daily RetailBSINum across trading days [−1,+1] of the ESG news event. (WRDS) RetailBSIVol Daily buy-sell retail investor trading volume imbalance, calculated as the dif- ference between retail buy volume and retail sell volume, scaled by the sum of retail buy volume and retail sell volume. Retail buy and sell volume are based on TAQ data using the approach in Boehmer et al. (2021). (WRDS) RetailBSIVol LR Daily buy-sell retail investor trading volume imbalance, calculated as the differ- encebetweenretailbuyvolumeandretailsellvolume,scaledbythesumofretail buyvolumeandretailsellvolume. RetailbuyandsellvolumearebasedonTAQ data using the approach in Boehmer et al. (2021) to identify retail trades and the approach suggested by Barber et al. (2023) to classify buys and sells based on the Lee-Ready algorithm (Lee and Ready, 1991). (WRDS) RetailBSIVol[−1,+1] Firm-event level sum of daily RetailBSIVol across trading days [−1,+1] of the ESG news event. (WRDS) 34 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 59,
    "chunk_index": 65,
    "word_count": 477,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "identify retail trades and the approach suggested by Barber et al. (2023) to classify buys and sells based on the Lee-Ready algorithm (Lee and Ready, 1991). (WRDS) RetailBSIVol[−1,+1] Firm-event level sum of daily RetailBSIVol across trading days [−1,+1] of the ESG news event. (WRDS) 34 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 59,
    "chunk_index": 66,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "RetailNum Dailynumberofretailtrades,basedonTAQdatausingtheapproachinBoehmer et al. (2021) and measured in thousands of trades. (WRDS) RetailVol Daily retail investor trading volume, based on TAQ data using the approach in Boehmer et al. (2021) and measured in millions of shares. (WRDS) RHUsers Change Daily change in the number of Robinhood users holding the stock, based on Robinhood users in the last hour available on days t and t−1 and measured in thousands. (Robintrack) Attention variables Bloomberg AIA Firm-event level average of BloombergAIA Daily across trading days [−1,+1] of the ESG news event. (Bloomberg) BloombergAIA Daily Daily Abnormal Institutional Investor Attention based on Bloomberg terminal activity, normalized for each firm and ranging from 0 to 4. (Bloomberg) Google Search Firm-event level average of GoogleSearch Daily across trading days [−1,+1] of the ESG news event. (Google) GoogleSearch Daily Daily Abnormal Google search volume index based on Google searches for the firm’s ticker, normalized for each firm and ranging from 0 to 100. (Google) Media Coverage Firm-event level total number of media articles in the spotlight. (Factset) ESG variables Bus.Mod. ESG news event category Business Model and Innovation, which covers Prod- uct Design & Lifecycle Management, Business Model Resilience, Supply Chain Management, Materials Sourcing & Efficiency, and Physical Impacts of Climate Change. (Factset) Env. ESGnewseventcategoryEnvironment,whichcoversGHGEmissions,AirQual- ity, Energy Management, Water & Wastewater Management, Waste & Haz- ardous Materials Management, and Ecological Impacts. (Factset) Hum.Cap. ESG news event category Human Capital, which covers Labor Practices, Em- ployeeHealth&Safety,andEmployeeEngagement,Diversity&Inclusion. (Fact- set) Ldr.Gov. ESG news event category Leadership and Governance, which covers Business Ethics, Competitive Behavior, Management of the Legal & Regulatory Envi- ronment, Critical Incident Risk Management, and Systemic Risk Management. (Factset) PulseChange Change in the firm’s Pulse score associated with the ESG news event, measured as the mean Pulse during the event period less the Pulse at end-of-day on the daybeforethefirstarticledate. Pulsemeasuresthefirm’sreal-timeperformance in the ESG category and ranges from 0 to 100. (Factset) Soc.Cap. ESGnewseventcategorySocialCapital,whichcoversHumanRights&Commu- nityRelations,CustomerPrivacy,DataSecurity,Access&Affordability,Product Quality & Safety, Customer Welfare, and Selling Practices & Product Labeling. (Factset) Financial variables Analyst Revision Indicator variable equal to one if a securities analyst makes a quarterly EPS forecast revision in the 5-trading-day period beginning on the ESG news event date. (IBES) 35 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 59,
    "chunk_index": 67,
    "word_count": 365,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "nityRelations,CustomerPrivacy,DataSecurity,Access&Affordability,Product Quality & Safety, Customer Welfare, and Selling Practices & Product Labeling. (Factset) Financial variables Analyst Revision Indicator variable equal to one if a securities analyst makes a quarterly EPS forecast revision in the 5-trading-day period beginning on the ESG news event date. (IBES) 35 Electronic copy available at: https://ssrn.com/abstract=4384675 BHAR[+2,+60] Buy-and-hold abnormal returns after the ESG news event, measured as firm’s buy-and-hold return in the [+2,+60] trading-day window less the buy-and-hold value-weighted market return over the same window. (CRSP) EventRet CumulativeabnormalreturnsaroundtheESGnewsevent,measuredasthesum across the [−1,+1] trading-day window of the daily return less the daily value- weighted market return. (CRSP) SASB Materiality Indicator variable equal to one if the ESG news event category is financially material for the firm, based on the SASB’s Materiality Map. (Factset) Headquarters state variables Blue State Indicatorvariableequaltooneifthefirm’sheadquartersareinastatethatvoted predominantlyDemocraticinthe2020presidentialelection. (MITElectionLab) High ESG State Indicator variable equal to one if the ESG rating for the local government agen- cies in the firm’s headquarters state is above the sample median. This rating aggregates the government’s performance in health, wealth, equality, earth, and trust. (HIP Investor) Low ESG State Indicator variable equal to one if the ESG rating for the local government agen- cies in the firm’s headquarters state is below the sample median. This rating aggregates the government’s performance in health, wealth, equality, earth, and trust. (HIP Investor) Red State Indicatorvariableequaltooneifthefirm’sheadquartersareinastatethatvoted predominantlyRepublicaninthe2020presidentialelection. (MITElectionLab) 36 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "3.3. Retail Trade Measures",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 59,
    "chunk_index": 68,
    "word_count": 230,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.3. Retail Trade Measures (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "variable equal to one if the ESG rating for the local government agen- cies in the firm’s headquarters state is below the sample median. This rating aggregates the government’s performance in health, wealth, equality, earth, and trust. (HIP Investor) Red State Indicatorvariableequaltooneifthefirm’sheadquartersareinastatethatvoted predominantlyRepublicaninthe2020presidentialelection. (MITElectionLab) 36 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 59,
    "chunk_index": 69,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "Ackerman, A., Wise, L., 2023. Senate Votes 50-46 to Reverse ESG Rule for Retirement Funds. Wall Street Journal. Azizuddin, K., 2023.EUregulatoraddsdoublematerialitytopensionfundrules.Responsible Investor. Bailey, M., Glaeser, S., Omartian, J.D., Raghunandan, A., 2022.MisreportingofMandatory ESG Disclosures: Evidence from Gender Pay Gap Information. University of Michigan, University of North Carolina at Chapel Hill, and London School of Economics. Baker, A. C., Larcker, D. F., McClure, C., Saraph, D., Watts, E. M., 2022a. Diversity Wash- ing. Unpublished working paper. Berkeley Law School, Stanford University, University of Chicago, Jump Trading, and Yale School of Management. Baker, M., Egan, M., Sarkar, S. K., 2022b. How Do Investors Value ESG? Unpublished working paper. Harvard University. Baker, M. P., Bergstresser, D. B., Serafeim, G., Wurgler, J. A., 2022c. The Pricing and Ownership of U.S. Green Bonds. Annual Review of Financial Economics 14, 415–437. Baldauf, M., Garlappi, L., Yannelis, C., 2020. Does climate change affect real estate prices? only if you believe in it. Review of Financial Studies 33, 1256–1295. Barber, B. M., Huang, X., Jorion, P., Odean, T., Schwarz, C., 2023. A (Sub)penny For Your Thoughts: Tracking Retail Investor Activity in TAQ. Unpublished working paper. UC Irvine, UC Davis,Washington University in St. Louis, and UC Berkeley. Barber, B. M., Huang, X., Odean, T., Schwarz, C., 2022. Attention-Induced Trading and Returns: Evidence from Robinhood Users. The Journal of Finance 77, 3141–3190. Barber, B. M., Morse, A., Yasuda, A., 2021. Impact Investing. Journal of Financial Eco- nomics 139, 162–185. Barber, B. M., Odean, T., 2000. Trading Is Hazardous to Your Wealth: The Common Stock Investment Performance of Individual Investors. The Journal of Finance 55, 773–806. Barber, B. M., Odean, T., 2008. All That Glitters: The Effect of Attention and News on the Buying Behavior of Individual and Institutional Investors. Review of Financial Studies 21, 785–818. Barber, B. M., Odean, T., 2013. The Behavior of Individual Investors. Handbook of the Economics of Finance 2, 1533–1570. Bauer, R., Ruof, T., Smeets, P., 2021. Get Real! Individuals Prefer More Sustainable In- vestments. Review of Financial Studies 34, 3976–4043. 37 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 59,
    "chunk_index": 70,
    "word_count": 340,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "Financial Studies 21, 785–818. Barber, B. M., Odean, T., 2013. The Behavior of Individual Investors. Handbook of the Economics of Finance 2, 1533–1570. Bauer, R., Ruof, T., Smeets, P., 2021. Get Real! Individuals Prefer More Sustainable In- vestments. Review of Financial Studies 34, 3976–4043. 37 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 59,
    "chunk_index": 71,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "Ben-Rephael, A., Da, Z., Israelsen, R. D., 2017. It Depends on Where You Search: Insti- tutional Investor Attention and Underreaction to News. The Review of Financial Studies 30, 3009–3047. Benabou, R., Tirole, J., 2010. Individual and corporate social responsibility. Economica 77, 1–19. Berg, F., Koelbel, J. F., Pavlova, A., Rigobon, R., 2021. ESG Confusion and Stock Re- turns: Tackling the Problem of Noise. Unpublished working paper. MIT Sloan School of Management, University of Zurich, and London Business School. Berg, F., K¨olbel, J. F., Rigobon, R., 2022. Aggregate Confusion: The Divergence of ESG Ratings. Review of Finance 26, 1315–1344. Blankespoor, E., deHaan, E., Marinovic, I., 2020. Disclosure processing costs, investors’ information choice, and equity market outcomes: A review. Journal of Accounting and Economics 70. Blankespoor, E., deHaan, E., Wertz, J., Zhu, C., 2019. Why Do Individual Investors Dis- regard Accounting Information? The Roles of Information Awareness and Acquisition Costs. Journal of Accounting Research 57, 53–84. Blankespoor, E., deHaan, E., Zhu, C., 2018. Capital Market Effects of Media Synthesis and Dissemination: Evidence from Robo-journalism. Review of Accounting Studies 23, 1–36. Boehmer, E., Jones, C. M., Zhang, X., Zhang, X., 2021. Tracking Retail Investor Activity. Journal of Finance 76, 2249–2305. Branikas, I., Hong, H., Xu, J., 2020. Location choice, portfolio choice. Journal of Financial Economics 138, 74–94. Bushee, B., Cedergren, M., Michels, J., 2020. Does the media help or hurt retail investors during the IPO quiet period? Journal of Accounting and Economics 69, 101261. Bushee, B. J., Goodman, T. H., 2007. Which institutional investors trade based on private information about earnings and returns? Journal of Accounting Research 45, 289–321. Campbell, B., Drake, M., Thornock, J., Twedt, B., 2023. Earnings Virality. Journal of Accounting and Economics 75. Capital Group, 2022. ESG Global Study 2022. CFA Institute, 2020. Future of Sustainability in Investment Management. CFA Institute pp. 1–60. Chen, Y. C., Hung, M., Wang, Y., 2018. The effect of mandatory CSR disclosure on firm profitability and social externalities: Evidence from China. Journal of Accounting and Economics 65, 169–190. 38 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 59,
    "chunk_index": 72,
    "word_count": 339,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "2022. CFA Institute, 2020. Future of Sustainability in Investment Management. CFA Institute pp. 1–60. Chen, Y. C., Hung, M., Wang, Y., 2018. The effect of mandatory CSR disclosure on firm profitability and social externalities: Evidence from China. Journal of Accounting and Economics 65, 169–190. 38 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 59,
    "chunk_index": 73,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "Chi, S. S., Shanthikumar, D. M., 2017. Local bias in google search and the market response around earnings announcements. Accounting Review 92, 115–143. Choi, D., Gao, Z., Jiang, W., 2020. Attention to Global Warming. Review of Financial Studies 33, 1112–1145. Chordia, T., Subrahmanyam, A., 2004. Order Imbalance and Individual Stock Returns: Theory and Evidence. Journal of Financial Economics 72, 485–518. Christensen, H., De George, E. T., Joffre, A. R., Macciocchi, D., 2023. Consumer Responses To Corporate Social Responsibility. Unpublished working paper. University of Chicago and University of Miami. Christensen, H. B., Floyd, E., Liu, L. Y., Maffett, M., 2017. The real effects of mandated informationonsocialresponsibilityinfinancialreports: Evidencefrommine-safetyrecords. Journal of Accounting and Economics 64, 284–304. Da, Z., Engelberg, J., Gao, P., 2011. In Search of Attention. Journal of Finance 66, 1461– 1499. Dai, R., Liang, H., Ng, L., 2021. Socially responsible corporate customers. Journal of Finan- cial Economics 142, 598–626. Darendeli, A., Fiechter, P., Hitz, J. M., Lehmann, N., 2022. The role of corporate social re- sponsibility (CSR) information in supply-chain contracting: Evidence from the expansion of CSR rating coverage. Journal of Accounting and Economics 74, 101525. DepartmentofLabor,2020.FinancialFactorsinSelectingPlanInvestments.FederalRegister 85. Department of Labor, 2022. Prudence and Loyalty in Selecting Plan Investments and Exer- cising Shareholder Rights. Federal Register 87. Di Giuli, A., Kostovetsky, L., 2014. Are red or blue companies more likely to go green? Politics and corporate social responsibility. Journal of Financial Economics 111, 158–180. Drake, M. S., Roulstone, D. T., Thornock, J. R., 2012. Investor Information Demand: Ev- idence from Google Searches Around Earnings Announcements. Journal of Accounting Research 50, 1001–1040. Dyck, A., Lins, K. V., Roth, L., Wagner, H. F., 2019. Do institutional investors drive corporate social responsibility? International evidence. Journal of Financial Economics 131, 693–714. Edmans, A., 2023. The end of ESG. Financial Management 52, 3–17. Engler, H., 2022.“Doublemateriality”: NewlegalconceptlikelytoplayindebateoverSEC’s climate plan. Thomas Reuters. 39 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 59,
    "chunk_index": 74,
    "word_count": 311,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "A., Lins, K. V., Roth, L., Wagner, H. F., 2019. Do institutional investors drive corporate social responsibility? International evidence. Journal of Financial Economics 131, 693–714. Edmans, A., 2023. The end of ESG. Financial Management 52, 3–17. Engler, H., 2022.“Doublemateriality”: NewlegalconceptlikelytoplayindebateoverSEC’s climate plan. Thomas Reuters. 39 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 59,
    "chunk_index": 75,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "Fisch, J., 2022. The SEC’s Authority to Pursue Climate-Related Disclosure. Harvard Law School Forum on Corporate Governance. Flammer, C., 2021. Corporate Green Bonds. Journal of Financial Economics 142, 499–516. Friedman, H. L., Heinle, M. S., 2016. Taste, information, and asset prices: implications for the valuation of CSR. Review of Accounting Studies 21, 740–767. Gantchev, N., Giannetti, M., Li, Q., 2023. Sustainability or Performance? Ratings and Fund Managers’ Incentives. Unpublished working paper. University of Warwick,Stockholm School of Economics, and University of Alabama. Geczy, C., Stambaugh, R. F., Levin, D., 2005. Investing in Socially Responsible Mutual Funds. Unpublished working paper. University of Pennsylvania. Gibson, C., Sawyer, F., 2023. 2023 Statehouse Report: Right-Wing Attacks on the Freedom to Invest Responsibly Falter in Legislatures. Pleiades Strategy. Giglio,S.,Maggiori,M.,Stroebel,J.,Tan,Z.,Utkus,S.,Xu,X.,2023.FourFactsAboutESG Beliefs and Investor Portfolios. Unpublished working paper. Yale School of Management, Stanford Graduate School of Business, New York University, University of Pennsylvania, and Vanguard. Goldberg, E. S., Dial, L. C., Mann, R., 2022. The State of Anti-ESG State Legislation. Morgan Lewis. Haber, S. H., Kepler, J. D., Larcker, D. F., Seru, A., Tayan, B., 2022. ESG Investing: What Shareholders do Fund Managers Represent? Stanford Closer Look Series pp. 1–14. Hartzmark, S. M., Sussman, A. B., 2019. Do Investors Value Sustainability? A Natural Experiment Examining Ranking and Fund Flows. Journal of Finance 74, 2789–2837. Heeb, F., Kolbel, J., Paetzold, F., Zeisberger, S., 2023. Do Investors Care About Impact? Review of Financial Studies 36, 1737–1787. Hirshleifer, D., Teoh, S. H., 2003. Limited attention, information disclosure, and financial reporting. Journal of Accounting and Economics 36, 337–386. Hirshleifer, D. A., Myers, J. N., Myers, L. A., Teoh, S. H., 2008. Do Individual Investors Cause Post-earnings Announcement Drift? Direct Evidence from Personal Trades. The Accounting Review 83, 1521–1550. Hong, H., Kacperczyk, M., 2009. The Price of Sin: The Effects of Social Norms on Markets. Journal of Financial Economics 93, 15–36. Houston, J. F., Lin, C., Shan, H., Shen, M., 2023. How Does ESG Shape Consumption? Unpublished working paper. University of Florida, University of Hong Kong, Fordham University, and Auburn University. 40 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 59,
    "chunk_index": 76,
    "word_count": 344,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "Sin: The Effects of Social Norms on Markets. Journal of Financial Economics 93, 15–36. Houston, J. F., Lin, C., Shan, H., Shen, M., 2023. How Does ESG Shape Consumption? Unpublished working paper. University of Florida, University of Hong Kong, Fordham University, and Auburn University. 40 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 59,
    "chunk_index": 77,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "Ivkovic,Z.,Weisbenner,S.,2005.Localdoesaslocalis: Informationcontentofthegeography of individual investors’ common stock investments. Journal of Finance 60, 267–306. Jin, H., Merkley, K., Sharma, A., Ton, K., 2023. Customers’ Response to Firms’ Disclosure of Social Stances: Evidence from Voting Reform Laws. Unpublished working paper. Texas A&M, Indiana University, and Villanova University. Kaniel, R., Liu, S., Saar, G., Titman, S., 2012. Individual Investor Trading and Return Patterns around Earnings Announcements. Journal of Finance 67, 639–680. Karpoff, J. M., Litan, R., Schrand, C., Weil, R. L., 2022. What ESG-Related Disclosures Should the SEC Mandate? Financial Analysts Journal 78, 9–18. Kelley, E. K., Tetlock, P. C., 2013. How Wise Are Crowds? Insights from Retail Orders and Stock Returns. Journal of Finance 68, 1229–1265. Kim, S., Yoon, A., 2023. Analyzing Active Managers’ Commitment to ESG: Evidence from United Nations Principles for Responsible Investment. Management Science 69, 741–758. Kru¨ger, P., 2015. Corporate Goodness and Shareholder Wealth. Journal of Financial Eco- nomics 115, 304–329. Larcker, D. F., Pomorski, L., Tayan, B., Watts, E. M., 2022. ESG Ratings: A Compass without Direction (Stanford Business) pp. 1–16. Larcker, D. F., Watts, E. M., 2020. Where’s the Greenium? Journal of Accounting and Economics 69. Lawrence, A., Ryans, J., Sun, E., Laptev, N., 2018. Earnings announcement promotions: A Yahoo Finance field experiment. Journal of Accounting and Economics 66, 399–414. Lawrence, A., Ryans, J. P., Sun, E. Y., 2017. Investor demand for sell-side research. The Accounting Review 92, 123–149. Lee, C. M., 1992. Earnings News and Small Traders. An Intraday Analysis. Journal of Accounting and Economics 15, 265–302. Lee, C.M.C., Ready, M.J., 1991.InferringTradeDirectionfromIntradayData.TheJournal of Finance 46, 733–746. Liang, H., Renneboog, L., 2017. On the Foundations of Corporate Social Responsibility. Journal of Finance 72, 853–910. Lys, T., Naughton, J. P., Wang, C., 2015. Signaling through corporate accountability re- porting. Journal of Accounting and Economics 60, 56–72. Malmendier, U., Shanthikumar, D., 2007. Are Small Investors Naive about Incentives? Jour- nal of Financial Economics 85, 457–489. 41 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 59,
    "chunk_index": 78,
    "word_count": 322,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "Journal of Finance 72, 853–910. Lys, T., Naughton, J. P., Wang, C., 2015. Signaling through corporate accountability re- porting. Journal of Accounting and Economics 60, 56–72. Malmendier, U., Shanthikumar, D., 2007. Are Small Investors Naive about Incentives? Jour- nal of Financial Economics 85, 457–489. 41 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 59,
    "chunk_index": 79,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "Manchiraju, H., Rajgopal, S., 2017. Does Corporate Social Responsibility (CSR) Create Shareholder Value? Evidence from the Indian Companies Act 2013. Journal of Accounting Research 55, 1257–1300. Martin, P. R., Moser, D. V., 2016. Managers’ Green Investment Disclosures and Investors’ Reaction. Journal of Accounting and Economics 61, 239–254. Meier, J.-M., Servaes, H., Wei, J., Chong Xiao, S., 2023. Do Consumers Care About ESG? Evidence from Barcode-Level Sales Data. Unpublished working paper. UT Dallas, London Business School, Southwestern University of Finance and Economics. Michels, J., 2022. Retail Investor Trade and the Pricing of Earnings. University of Pennsyl- vania. Morgan Stanley, 2017. Sustainable Signals. Morgan Stanley Institute for Sustainable Invest- ing. Moss, A., Naughton, J. P., Wang, C., 2023. The Irrelevance of ESG Disclosure to Retail Investors: Evidence from Robinhood. Management Science In Press. Mottola, G., Valdes, O., Ganem, R., Fontes, A., Lush, M., 2022. Investors Say They Can Change the World, If They Only Knew How: Six Things to Know about ESG and Retail Investors. FINRA Investor Education Foundation pp. 1–13. Norton Rose Fulbright, 2022. Greenwashing Disputes on the Rise. Norton Rose Fulbright, 2023. “Double materiality”: What does it mean for non-financial reporting? Painter, M., 2020. An Inconvenient Cost: The Effects of Climate Change on Municipal Bonds. Journal of Financial Economics 135, 468–482. Pastor, L., Stambaugh, R. F., Taylor, L. A., 2021. Sustainable investing in equilibrium. Journal of Financial Economics 142, 550–571. Pastor, L., Stambaugh, R. F., Taylor, L. A., 2022. Dissecting Green Returns. Journal of Financial Economics 146, 403–424. Pastor, L., Stambaugh, R. F., Taylor, L. A., 2023. Green Tilts. Unpublished working paper. University of Chicago and University of Pennsylvania. Pedersen, L. H., Fitzgibbons, S., Pomorski, L., 2021. Responsible Investing: The ESG- efficient Frontier. Journal of Financial Economics 142, 572–597. Peress, J., 2014. The Media and the Diffusion of Information in Financial Markets: Evidence from Newspaper Strikes. Journal of Finance 69, 2007–2043. Posner, C., 2022. The Ongoing Debate at the SEC on Climate Disclosure Rules. Harvard Law School Forum on Corporate Governance. 42 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 59,
    "chunk_index": 80,
    "word_count": 337,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "142, 572–597. Peress, J., 2014. The Media and the Diffusion of Information in Financial Markets: Evidence from Newspaper Strikes. Journal of Finance 69, 2007–2043. Posner, C., 2022. The Ongoing Debate at the SEC on Climate Disclosure Rules. Harvard Law School Forum on Corporate Governance. 42 Electronic copy available at: https://ssrn.com/abstract=4384675 Raghunandan, A., Rajgopal, S., 2022. Do ESG Funds Make Stakeholder-friendly Invest- ments? Review of Accounting Studies 27, 822–863. Riedl, A., Smeets, P., 2017. Why Do Investors Hold Socially Responsible Mutual Funds? Journal of Finance 72, 2505–2550. Rze´znik, A., Hanley, K. W., Pelizzon, L., 2022. Investor Reliance on ESG Ratings and Stock Price Performance. Unpublished working paper. York University, Lehigh University, and Goethe University Frankfurt. SEC, 2022. The Enhancement and Standardization of Climate-Related Disclosures for In- vestors. Serafeim, G., Yoon, A., 2022a. Stock price reactions to ESG news: the role of ESG ratings and disagreement. Review of Accounting Studies. In Press. Serafeim, G., Yoon, A., 2022b. Which Corporate ESG News Does the Market React To? Financial Analysts Journal 78, 59–78. Starks, L.T., 2023.PresidentialAddress: SustainableFinanceandESGIssues—Valueversus Values. Journal of Finance In Press. Vallette, J. M., Gray, K. M., 2022. SEC’s Climate Risk Disclosure Proposal Likely to Face Legal Challenges. Harvard Law School Forum on Corporate Governance. Wayne Wong v. NYCERS, T., BERS, 2023. Wayne Wong v. NYCERS, TRS and BERS. New York Supreme Court 652297/202. Welch, I., 2022. The Wisdom of the Robinhood Crowd. Journal of Finance 77, 1489–1527. 43 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 44,
    "page_range": "p.44-45",
    "total_pages": 59,
    "chunk_index": 81,
    "word_count": 242,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.44-45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "to Face Legal Challenges. Harvard Law School Forum on Corporate Governance. Wayne Wong v. NYCERS, T., BERS, 2023. Wayne Wong v. NYCERS, TRS and BERS. New York Supreme Court 652297/202. Welch, I., 2022. The Wisdom of the Robinhood Crowd. Journal of Finance 77, 1489–1527. 43 Electronic copy available at: https://ssrn.com/abstract=4384675 0.64 0.62 0.60 0.58 −20 −10 0 10 20 Event Day loVliateR (a) RetailVol 3.6 3.5 3.4 −20 −10 0 10 20 Event Day muNliateR (b) RetailNum Fig. 1 Retail Trading Activity in Event-Time. This figure presents daily average retail investor trading activity in the [−20,+20] window around our sample of ESG news events. Panel (a) presents results for RetailVol. Panel (b) presents results for RetailNum. 44 Electronic copy available at: https://ssrn.com/abstract=4384675 0.06 0.04 0.02 Early Mid Late Period .tnI .fnoC %59 dna etamitsE (a) RetailVol 0.25 0.20 0.15 0.10 0.05 0.00 Early Mid Late Period .tnI .fnoC %59 dna etamitsE (b) RetailNum Fig.2CoefficientPlotsforEventsintheEarly,Mid,andLatePeriodsoftheSample. Thisfigurepresentsthe coefficient on EventDay[−1,+1] in estimations of Equation (1) over different sample periods. The sample is divided into three equal time periods. The Early period includes events occurring between 12/16/15 and 03/02/18, the Mid period includes events occurring between 03/03/18 and 05/18/20, and the Late period includes events occurring between 05/19/20 and 08/05/2022. Panel (a) presents the coefficients for regressions using the dependent variable RetailVol. Panel (b) presents the coefficients for regressions using thedependentvariableRetailNum. Theverticalerrorbarsaroundthecoefficientsreflectthe95%confidence intervals. 45 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 45,
    "page_range": "p.45-47",
    "total_pages": 59,
    "chunk_index": 82,
    "word_count": 236,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.45-47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "the Mid period includes events occurring between 03/03/18 and 05/18/20, and the Late period includes events occurring between 05/19/20 and 08/05/2022. Panel (a) presents the coefficients for regressions using the dependent variable RetailVol. Panel (b) presents the coefficients for regressions using thedependentvariableRetailNum. Theverticalerrorbarsaroundthecoefficientsreflectthe95%confidence intervals. 45 Electronic copy available at: https://ssrn.com/abstract=4384675 20.8 20.6 20.4 −20 −10 0 10 20 Event Day yliaD_hcraeSelgooG (a) Google Search 1.3 1.2 1.1 1.0 −20 −10 0 10 20 Event Day yliaD_AIAgrebmoolB (b) Bloomberg AIA Fig. 3 Attention in Event-Time. This figure presents daily average attention in the [−20,+20] window around our sample of ESG news events. Panel (a) presents results for GoogleSearch Daily. Panel (b) presents results for BloombergAIA Daily. 46 Electronic copy available at: https://ssrn.com/abstract=4384675 0.06 0.04 0.035 0.02 0.00 )emuloV liateR( ISB 0.06 0.054 0.04 0.02 0.00 (a) Low ESG, High Returns events )emuloV liateR( ISB (b) High ESG, High Returns events 0.00 −0.02 −0.04 −0.043 −0.06 )emuloV liateR( ISB 0.00 −0.02 −0.04 −0.047 −0.06 (c) Low ESG, Low Returns events )emuloV liateR( ISB (d) High ESG, Low Returns events Fig.4RetailBuy-SellImbalanceforEventsRevealingExtremeESGandFinancialPerformance. Thisfigure presents the average of daily RetailBSIVol over the [−1,+1] window in four subsamples of events, in 2×2 panels. Each panel presents the average, in a bar chart, for the subsample of events reflecting both extreme changes in ESG performance and extreme changes in financial performance. Shaded bars reflect that the averageisapositivenumber. Panel(a)presentseventswithLowESGandHighReturns, panel(b)presents events with High ESG and High Returns, panel (c) presents events with Low ESG and Low Returns, and panel (d) presents events with High ESG and Low Returns. High (Low) ESG events are defined as events withextremelyhigh(low)PulseChange,definedasPulseChangeandinthetop(bottom)quintileofevents withpositive(negative)PulseChange. High(Low)Returnseventsaredefinedaseventswithextremelyhigh (low) returns, defined as day-0 returns in the top (bottom) quintile of events with positive (negative) day-0 returns. 47 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 47,
    "page_range": "p.47-48",
    "total_pages": 59,
    "chunk_index": 83,
    "word_count": 295,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.47-48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "ESG and Low Returns, and panel (d) presents events with High ESG and Low Returns. High (Low) ESG events are defined as events withextremelyhigh(low)PulseChange,definedasPulseChangeandinthetop(bottom)quintileofevents withpositive(negative)PulseChange. High(Low)Returnseventsaredefinedaseventswithextremelyhigh (low) returns, defined as day-0 returns in the top (bottom) quintile of events with positive (negative) day-0 returns. 47 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 49,
    "page_range": "p.49",
    "total_pages": 59,
    "chunk_index": 84,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "Table 1 Descriptive Statistics Panel A: Summary Statistics Mean StDev p25% p50% p75% Obs. Firm-EventDate-Date variables BloombergAIA Daily 0.978 1.455 0.000 0.000 2.000 1,543,422 GoogleSearch Daily 20.521 25.141 0.000 7.310 39.330 1,866,309 RetailBSINum 0.021 0.152 -0.053 0.023 0.099 2,220,704 RetailBSINum LR 0.040 0.185 -0.061 0.048 0.152 2,194,418 RetailBSIVol -0.011 0.208 -0.106 -0.005 0.087 2,220,704 RetailBSIVol LR -0.016 0.241 -0.129 -0.004 0.102 2,194,418 RetailNum 3.409 9.259 0.204 0.640 2.127 2,220,704 RetailVol 0.581 1.602 0.022 0.077 0.324 2,220,704 RHUsers Change 0.092 0.497 -0.005 0.000 0.013 796,730 Firm-EventDate variables Analyst Revision 0.432 0.495 0.000 0.000 1.000 54,199 BHAR[+2,+60] 0.006 0.280 -0.112 -0.011 0.091 54,132 Bloomberg AIA 1.105 1.180 0.000 0.667 2.000 39,443 Bus.Mod. 0.244 0.430 0.000 0.000 0.000 54,199 EventRet 0.004 0.095 -0.020 -0.000 0.020 54,199 Env. 0.234 0.423 0.000 0.000 0.000 54,199 Google Search 20.838 24.375 0.000 9.800 39.010 45,558 Hum.Cap. 0.188 0.391 0.000 0.000 0.000 54,199 Ldr.Gov. 0.198 0.399 0.000 0.000 0.000 54,199 Media Coverage 7.407 12.193 2.000 3.000 7.000 54,199 PulseChange 1.222 16.531 -5.390 0.180 7.137 54,199 RetailBSINum[-1,+1] 0.068 0.321 -0.100 0.067 0.237 54,199 RetailBSIVol[-1,+1] -0.032 0.363 -0.211 -0.017 0.156 54,199 Soc.Cap. 0.332 0.471 0.000 0.000 1.000 54,199 SASB Materiality 0.629 0.483 0.000 1.000 1.000 54,199 Panel B: Correlation Table for ESG and Financial Performance Measures [1] [2] [1] EventRet 0.021∗∗∗ [2] PulseChange 0.015∗∗∗ This table presents descriptive statistics for our sample. Panel A presents summary statistics of variables measured at the Firm-EventDate-Date level and variables measured at the Firm-EventDate level. Panel B presents Pearson (Spearman) correlations for signed ESG performance and financial performance measures below (above) the diagonal. All variables are defined in Appendix B. All continuous variables, except re- turns, are winsorized at the 1% and 99% levels to limit the influence of outliers. In Panel B, levels of signif- icance are presented as follows: ∗p<0.1; ∗∗p<0.05; ∗∗∗p<0.01. 48 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 49,
    "page_range": "p.49",
    "total_pages": 59,
    "chunk_index": 85,
    "word_count": 306,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "(above) the diagonal. All variables are defined in Appendix B. All continuous variables, except re- turns, are winsorized at the 1% and 99% levels to limit the influence of outliers. In Panel B, levels of signif- icance are presented as follows: ∗p<0.1; ∗∗p<0.05; ∗∗∗p<0.01. 48 Electronic copy available at: https://ssrn.com/abstract=4384675 Table 2 Retail Investor Response to ESG News Panel A: Volume RetailVol (1) (2) (3) (4) EventDay[-1,+1] 0.033∗∗∗ 0.033∗∗∗ 0.033∗∗∗ 0.033∗∗∗ (8.248) (8.250) (8.259) (8.259) EventDate fixed effects No Yes No No Firm fixed effects No No Yes No Firm-EventDate fixed effects No No No Yes R2 0.000 0.033 0.612 0.838 Observations 2,220,704 2,220,704 2,220,704 2,220,704 Panel B: Number of Trades RetailNum (1) (2) (3) (4) EventDay[-1,+1] 0.125∗∗∗ 0.125∗∗∗ 0.125∗∗∗ 0.125∗∗∗ (5.932) (5.929) (5.943) (5.943) EventDate fixed effects No Yes No No Firm fixed effects No No Yes No Firm-EventDate fixed effects No No No Yes R2 0.000 0.044 0.667 0.888 Observations 2,220,704 2,220,704 2,220,704 2,220,704 This table presents an analysis of retail investors’ trading response to ESG news events. We estimate mul- tiple versions of Equation (1) using unique Firm-EventDate-Date observations on days −20 to +20 around each Firm-EventDate. Panel A uses the dependent variable RetailVol and Panel B uses the dependent variable RetailNum. All variables are defined in Appendix B. All continuous variables, except returns, are winsorized at the 1% and 99% levels to limit the influence of outliers. t-statistics based on standard errors clusteredbyFirmandEventDateareinparentheses. Levelsofsignificancearepresentedasfollows: ∗p<0.1; ∗∗p<0.05; ∗∗∗p<0.01. 49 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 50,
    "page_range": "p.50-51",
    "total_pages": 59,
    "chunk_index": 86,
    "word_count": 247,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.50-51)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "and Panel B uses the dependent variable RetailNum. All variables are defined in Appendix B. All continuous variables, except returns, are winsorized at the 1% and 99% levels to limit the influence of outliers. t-statistics based on standard errors clusteredbyFirmandEventDateareinparentheses. Levelsofsignificancearepresentedasfollows: ∗p<0.1; ∗∗p<0.05; ∗∗∗p<0.01. 49 Electronic copy available at: https://ssrn.com/abstract=4384675 Table 3 Retail Investor Reactions to ESG News and Financial News Panel A: Volume RetailVol ESG All Earnings Analyst Dividends Guidance M&A (1) (2) (3) (4) (5) (6) (7) EventDay[-1,+1] 0.033∗∗∗ 0.041∗∗∗ 0.089∗∗∗ 0.008∗∗∗ 0.006∗∗∗ 0.088∗∗∗ 0.210∗∗∗ (8.259) (22.990) (25.105) (6.541) (4.023) (12.963) (10.002) Coef. Diff. (ESG - Financial) -0.008∗ -0.055∗∗∗ 0.026∗∗∗ 0.027∗∗∗ -0.055∗∗∗ -0.177∗∗∗ Firm-EventDate fixed effects Yes Yes Yes Yes Yes Yes Yes R2 0.838 0.859 0.793 0.859 0.913 0.876 0.798 Observations 2,220,704 7,995,762 2,657,435 3,629,598 939,624 992,252 104,617 Panel B: Number of Trades RetailNum ESG All Earnings Analyst Dividends Guidance M&A (1) (2) (3) (4) (5) (6) (7) EventDay[-1,+1] 0.125∗∗∗ 0.148∗∗∗ 0.317∗∗∗ 0.033∗∗∗ 0.032∗∗∗ 0.343∗∗∗ 0.588∗∗∗ (5.943) (23.386) (26.096) (6.889) (3.303) (12.162) (9.949) Coef. Diff. (ESG - Financial) -0.023 -0.192∗∗∗ 0.092∗∗∗ 0.093∗∗∗ -0.218∗∗∗ -0.463∗∗∗ Firm-EventDate fixed effects Yes Yes Yes Yes Yes Yes Yes R2 0.888 0.896 0.842 0.893 0.923 0.900 0.848 Observations 2,220,704 7,995,762 2,657,435 3,629,598 939,624 992,252 104,617 This table presents an analysis of retail investors’ trading response to ESG news events and several types of financial news events, earnings announcements, analyst forecasts, dividend announcements, management guidance, and M&A announcements. For all types of events except earnings announcements, we remove the events in the [−1,+1] window around earnings announcements. We estimate multiple versions of Equa- tion (1) using unique Firm-EventDate-Date observations on days −20 to +20 around each Firm-EventDate for ESG news events and financial news events. The table also presents the differences in coefficients be- tween ESG news events and financial news events (i.e., compares column 1 to each of the other columns) andindicatesthesignificanceofthedifferenceusingZ-tests. PanelAusesthedependentvariableRetailVol and Panel B uses the dependent variable RetailNum. All variables are defined in Appendix B. All contin- uous variables, except returns, are winsorized at the 1% and 99% levels to limit the influence of outliers. t-statistics based on standard errors clustered by Firm and EventDate are in parentheses. Levels of signifi- cance are presented as follows: ∗p<0.1; ∗∗p<0.05; ∗∗∗p<0.01. 50 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 51,
    "page_range": "p.51",
    "total_pages": 59,
    "chunk_index": 87,
    "word_count": 376,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.51)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "All contin- uous variables, except returns, are winsorized at the 1% and 99% levels to limit the influence of outliers. t-statistics based on standard errors clustered by Firm and EventDate are in parentheses. Levels of signifi- cance are presented as follows: ∗p<0.1; ∗∗p<0.05; ∗∗∗p<0.01. 50 Electronic copy available at: https://ssrn.com/abstract=4384675 Table 4 Retail Investor Response to ESG News (by Category) Panel A: Volume RetailVol Env. Soc.Cap. Hum.Cap. Bus.Mod. Ldr.Gov. (1) (2) (3) (4) (5) EventDay[-1,+1] 0.018∗∗∗ 0.048∗∗∗ 0.013∗∗ 0.031∗∗∗ 0.055∗∗∗ (3.514) (6.202) (2.461) (5.120) (8.475) Firm-EventDate fixed effects Yes Yes Yes Yes Yes R2 0.843 0.808 0.864 0.882 0.853 Observations 519,337 737,383 418,582 542,417 440,461 Panel B: Number of Trades RetailNum Env. Soc.Cap. Hum.Cap. Bus.Mod. Ldr.Gov. (1) (2) (3) (4) (5) EventDay[-1,+1] 0.071∗∗∗ 0.176∗∗∗ 0.065∗∗ 0.125∗∗∗ 0.218∗∗∗ (2.687) (4.958) (2.178) (4.056) (5.983) Firm-EventDate fixed effects Yes Yes Yes Yes Yes R2 0.905 0.870 0.895 0.918 0.913 Observations 519,337 737,383 418,582 542,417 440,461 This table presents an analysis of retail investors’ response to ESG news events, by category of ESG news. UsinguniqueFirm-EventDate-Dateobservationsondays−20to+20aroundeachFirm-EventDate, weesti- mateEquation(1)insubsamplesofeventsindifferentSASBcategories: Environment(Env.),SocialCapital (Soc.Cap.), Human Capital (Hum.Cap.), Business Model and Innovation (Bus.Mod.), and Leadership and Governance (Ldr.Gov.). Panel A uses the dependent variable RetailVol and Panel B uses the dependent variable RetailNum. All variables are defined in Appendix B. All continuous variables, except returns, are winsorized at the 1% and 99% levels to limit the influence of outliers. t-statistics based on standard errors clusteredbyFirmandEventDateareinparentheses. Levelsofsignificancearepresentedasfollows: ∗p<0.1; ∗∗p<0.05; ∗∗∗p<0.01. 51 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 52,
    "page_range": "p.52-53",
    "total_pages": 59,
    "chunk_index": 88,
    "word_count": 245,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.52-53)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "and Panel B uses the dependent variable RetailNum. All variables are defined in Appendix B. All continuous variables, except returns, are winsorized at the 1% and 99% levels to limit the influence of outliers. t-statistics based on standard errors clusteredbyFirmandEventDateareinparentheses. Levelsofsignificancearepresentedasfollows: ∗p<0.1; ∗∗p<0.05; ∗∗∗p<0.01. 51 Electronic copy available at: https://ssrn.com/abstract=4384675 Table 5 Changes in Investor Attention around ESG News Panel A: Google Search GoogleSearch Daily (1) (2) (3) (4) EventDay[-1,+1] 0.309∗∗∗ 0.306∗∗∗ 0.308∗∗∗ 0.307∗∗∗ (3.715) (3.679) (3.702) (3.690) EventDate fixed effects No Yes No No Firm fixed effects No No Yes No Firm-EventDate fixed effects No No No Yes R2 0.000 0.036 0.764 0.835 Observations 1,866,309 1,866,309 1,866,309 1,866,257 Panel B: Bloomberg AIA BloombergAIA Daily (1) (2) (3) (4) EventDay[-1,+1] 0.136∗∗∗ 0.137∗∗∗ 0.137∗∗∗ 0.136∗∗∗ (15.119) (15.269) (15.193) (15.213) EventDate fixed effects No Yes No No Firm fixed effects No No Yes No Firm-EventDate fixed effects No No No Yes R2 0.001 0.022 0.212 0.274 Observations 1,543,422 1,543,422 1,543,417 1,543,317 This table presents an analysis of changes in investor attention around ESG news events. Using unique Firm-EventDate-Date observations on days −20 to +20 around each Firm-EventDate, we estimate versions of Equation (1) that replace the dependent variable with a daily proxy for firm-specific investor atten- tion. Panel A uses the dependent variable GoogleSearch Daily and Panel B uses the dependent variable BloombergAIA Daily. All variables are defined in Appendix B. All continuous variables, except returns, are winsorized at the 1% and 99% levels to limit the influence of outliers. t-statistics based on standard errors clustered by Firm and EventDate are in parentheses. Levels of significance are presented as follows: ∗p<0.1; ∗∗p<0.05; ∗∗∗p<0.01. 52 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 53,
    "page_range": "p.53",
    "total_pages": 59,
    "chunk_index": 89,
    "word_count": 277,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.53)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "Appendix B. All continuous variables, except returns, are winsorized at the 1% and 99% levels to limit the influence of outliers. t-statistics based on standard errors clustered by Firm and EventDate are in parentheses. Levels of significance are presented as follows: ∗p<0.1; ∗∗p<0.05; ∗∗∗p<0.01. 52 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 54,
    "page_range": "p.54",
    "total_pages": 59,
    "chunk_index": 90,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.54)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "Table 6 Retail Trading Activity and the Role of Attention Panel A: Volume RetailVol Media Coverage Google Search Bloomberg AIA (1) (2) (3) (4) (5) (6) EventDay[-1,+1] × Attention 0.020∗∗∗ 0.020∗∗∗ 0.021∗∗∗ 0.021∗∗∗ 0.110∗∗∗ 0.110∗∗∗ (3.845) (3.845) (4.242) (4.240) (11.641) (11.639) EventDay[-1,+1] 0.033∗∗∗ 0.033∗∗∗ 0.035∗∗∗ 0.035∗∗∗ 0.026∗∗∗ 0.026∗∗∗ (7.779) (7.786) (7.866) (7.872) (3.966) (3.961) Attention 0.500∗∗∗ 0.158∗∗ 0.543∗∗∗ (4.510) (2.044) (4.655) Firm-EventDate fixed effects No Yes No Yes No Yes R2 0.098 0.838 0.010 0.829 0.096 0.850 Observations 2,220,704 2,220,704 1,866,548 1,866,548 1,617,135 1,617,135 Panel B: Number of Trades RetailNum Media Coverage Google Search Bloomberg AIA (1) (2) (3) (4) (5) (6) EventDay[-1,+1] × Attention 0.120∗∗∗ 0.120∗∗∗ 0.114∗∗∗ 0.114∗∗∗ 0.554∗∗∗ 0.554∗∗∗ (3.871) (3.870) (4.123) (4.120) (11.396) (11.394) EventDay[-1,+1] 0.125∗∗∗ 0.125∗∗∗ 0.133∗∗∗ 0.133∗∗∗ 0.114∗∗∗ 0.114∗∗∗ (5.653) (5.662) (5.737) (5.744) (3.371) (3.367) Attention 3.782∗∗∗ 0.552 3.720∗∗∗ (4.728) (1.517) (4.356) Firm-EventDate fixed effects No Yes No Yes No Yes R2 0.168 0.888 0.004 0.872 0.129 0.893 Observations 2,220,704 2,220,704 1,866,548 1,866,548 1,617,135 1,617,135 This table presents an analysis of the role of investor attention in affecting retail investors’ response to ESG news events. Using unique Firm-EventDate-Date observations on days −20 to +20 around each Firm- EventDate, we estimate versions of Equation (1) that interact EventDay[−1,+1] with event-level attention proxies. PanelAusesthedependentvariableRetailVolandPanelBusesthedependentvariableRetailNum. In both panels, columns 1 and 2 interact EventDay[−1,+1] with an event-level attention proxy based on media coverage. Columns 3 and 4 interact EventDay[−1,+1] with an event-level attention proxy based on abnormal Google search volume. Columns 5 and 6 interact EventDay[−1,+1] with an event-level atten- tion proxy based on Bloomberg institutional investor attention. In columns 2, 4, and 6, the main effects on the event-level attention proxy are subsumed by Firm-EventDate fixed effects. All variables are defined in Appendix B. All continuous variables, except returns, are winsorized at the 1% and 99% levels to limit the influenceofoutliers. Tofacilitateinterpretation, theevent-levelattentionproxiesarestandardizedtohavea mean (standard deviation) of 0 (1). t-statistics based on standard errors clustered by Firm and EventDate are in parentheses. Levels of significance are presented as follows: ∗p<0.1; ∗∗p<0.05; ∗∗∗p<0.01. 53 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 54,
    "page_range": "p.54",
    "total_pages": 59,
    "chunk_index": 91,
    "word_count": 341,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.54)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "returns, are winsorized at the 1% and 99% levels to limit the influenceofoutliers. Tofacilitateinterpretation, theevent-levelattentionproxiesarestandardizedtohavea mean (standard deviation) of 0 (1). t-statistics based on standard errors clustered by Firm and EventDate are in parentheses. Levels of significance are presented as follows: ∗p<0.1; ∗∗p<0.05; ∗∗∗p<0.01. 53 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 55,
    "page_range": "p.55",
    "total_pages": 59,
    "chunk_index": 92,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.55)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "Table 7 Retail Investors’ Motivations for Trade around ESG Events Panel A: Regression Analysis RetailBSIVol RetailBSINum (1) (2) (3) (4) EventDay[-1,+1] × PulseChange 0.000 0.000 0.000 0.000 (0.577) (0.525) (0.714) (0.673) EventDay[-1,+1] × EventRet 0.002∗∗∗ 0.001∗∗ (3.600) (2.040) EventDay[-1,+1] 0.000 0.000 0.001∗∗ 0.001∗∗ (0.573) (0.574) (2.327) (2.330) Firm-EventDate fixed effects Yes Yes Yes Yes R2 0.054 0.054 0.177 0.177 Observations 2,220,704 2,220,704 2,220,704 2,220,704 Panel B: Matched-Pair Analysis (Abn. RetailBSIVol) Full Sample Pos. ESG Event Neg. ESG Event Mean Mean Mean ESG Event 0.013 0.070 -0.053 Non-ESG Event -0.030 0.021 -0.050 Difference 0.043 0.048 -0.002 t-statistic 0.603 0.477 -0.022 (p-value) (0.546) (0.634) (0.982) Observations 54,196 27,978 25,822 Panel C: Matched-Pair Analysis (Abn. RetailBSINum) Full Sample Pos. ESG Event Neg. ESG Event Mean Mean Mean ESG Event 0.172 0.215 0.119 Non-ESG Event 0.100 0.204 0.143 Difference 0.072 0.011 -0.024 t-statistic 1.246 0.143 -0.295 (p-value) (0.213) (0.887) (0.768) Observations 54,196 27,978 25,822 This table presents an analysis of retail investors’ motivations for trade around ESG news events, based on ESGperformanceandfinancialperformanceinformationintheevents. PanelApresentsaregressionanalysis andusesthedependentvariablesRetailBSIVol andRetailBSINumtoassesshowretailinvestors’buy-sell imbalance varies based on directional event-level information. Using unique Firm-EventDate-Date observa- tions on days −20 to +20 around each Firm-EventDate, we estimate versions of Equation (2) that interact EventDay[−1,+1] with event-level information on ESG performance and returns. The main effects on the event-level measures are subsumed by Firm-EventDate fixed effects. Panels B and C present matched-pair analysesofabnormalretailbuy-sellimbalance,usingAbn.RetailBSIVol andAbn.RetailBSINum,forESG events compared to non-ESG events. We match each ESG event to an earnings announcement in the same calendar year-quarter with the closest abnormal event return and market capitalization. All variables are defined in Appendix B. All continuous variables, except returns, are winsorized at the 1% and 99% levels to limittheinfluenceofoutliers. Tofacilitateinterpretation,theevent-levelinformationvariablesarestandard- izedtohaveamean(standarddeviation)of0(1). t-statisticsbasedonstandarderrorsclusteredbyFirmand EventDate are in parentheses. Levels of significance are presented as follows: ∗p<0.1; ∗∗p<0.05; ∗∗∗p<0.01. 54 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 55,
    "page_range": "p.55",
    "total_pages": 59,
    "chunk_index": 93,
    "word_count": 302,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.55)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "event return and market capitalization. All variables are defined in Appendix B. All continuous variables, except returns, are winsorized at the 1% and 99% levels to limittheinfluenceofoutliers. Tofacilitateinterpretation,theevent-levelinformationvariablesarestandard- izedtohaveamean(standarddeviation)of0(1). t-statisticsbasedonstandarderrorsclusteredbyFirmand EventDate are in parentheses. Levels of significance are presented as follows: ∗p<0.1; ∗∗p<0.05; ∗∗∗p<0.01. 54 Electronic copy available at: https://ssrn.com/abstract=4384675 Table 8 Retail Net Demand and Return Predictability Panel A: Volume BHAR[+2,+60] All Events SASB Material Extreme Returns (1) (2) (3) RetailBSIVol[-1,+1] 0.008∗∗ 0.013∗∗∗ 0.015∗ (2.138) (2.610) (1.803) Firm fixed effects Yes Yes Yes YearQtr fixed effects Yes Yes Yes R2 0.163 0.169 0.201 Observations 53,589 33,451 20,926 Panel B: Number of Trades BHAR[+2,+60] All Events SASB Material Extreme Returns (1) (2) (3) RetailBSINum[-1,+1] 0.016∗∗ 0.018∗∗ 0.027∗∗ (2.278) (2.076) (2.224) Firm fixed effects Yes Yes Yes YearQtr fixed effects Yes Yes Yes R2 0.163 0.170 0.201 Observations 53,589 33,451 20,926 This table presents an analysis of the return predictability of retail investors’ aggregate net demand at ESG news events. Aggregating retail net demand over days −1 to +1 around each Firm-EventDate, we estimate Equation (3) on the sample of unique Firm-EventDate observations. The dependent variable in both panels isbuy-and-holdabnormalreturnsovertheperiod[+2,+60]daysaftereachevent. PanelAusestheindepen- dentvariableRetailBSIVol[−1,+1]forallevents(column1)orsubsamplesofeventsthatrevealfinancially material information (columns 2 and 3). Panel B uses the dependent variable RetailBSINum[−1,+1]. All variables are defined in Appendix B. All continuous variables, except returns, are winsorized at the 1% and 99% levels to limit the influence of outliers. t-statistics based on standard errors clustered by Firm and EventDate are in parentheses. Levels of significance are presented as follows: ∗p<0.1; ∗∗p<0.05; ∗∗∗p<0.01. 55 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 56,
    "page_range": "p.56",
    "total_pages": 59,
    "chunk_index": 94,
    "word_count": 259,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.56)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "Appendix B. All continuous variables, except returns, are winsorized at the 1% and 99% levels to limit the influence of outliers. t-statistics based on standard errors clustered by Firm and EventDate are in parentheses. Levels of significance are presented as follows: ∗p<0.1; ∗∗p<0.05; ∗∗∗p<0.01. 55 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 57,
    "page_range": "p.57",
    "total_pages": 59,
    "chunk_index": 95,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.57)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "Table 9 Cross-sectional Variation in Motivations for Trade: Headquarters State Panel A: Volume RetailBSIVol High ESG State Low ESG State Blue State Red State (1) (2) (3) (4) EventDay[-1,+1] × PulseChange 0.000 0.001 0.000 0.000 (0.112) (0.650) (0.514) (0.252) EventDay[-1,+1] × EventRet 0.003∗∗∗ 0.001 0.002∗∗∗ 0.002 (3.825) (0.800) (3.415) (1.396) EventDay[-1,+1] 0.001 0.000 0.001 -0.000 (0.864) (0.027) (0.844) (-0.218) EventDay[-1,+1] × EventRet Coef. Diff. 0.002∗ 0.001 Firm-EventDate fixed effects Yes Yes Yes Yes R2 0.056 0.053 0.055 0.054 Observations 1,146,232 1,067,344 1,634,325 578,759 Panel B: Number of Trades RetailBSINum High ESG State Low ESG State Blue State Red State (1) (2) (3) (4) EventDay[-1,+1] × PulseChange -0.000 0.001 0.000 0.001 (-0.649) (1.583) (0.084) (1.108) EventDay[-1,+1] × EventRet 0.002∗∗∗ -0.000 0.001∗∗ 0.001 (2.882) (-0.238) (2.076) (0.464) EventDay[-1,+1] 0.001∗∗ 0.001 0.001∗∗ 0.001 (2.109) (1.599) (2.069) (1.499) EventDay[-1,+1] × EventRet Coef. Diff. 0.002∗ 0.001 Firm-EventDate fixed effects Yes Yes Yes Yes R2 0.186 0.166 0.183 0.159 Observations 1,146,232 1,067,344 1,634,325 578,759 This table presents an analysis of cross-sectional variation in retail investors’ motivations for trade around ESG news events, based on firms’ headquarters locations. Panel A uses the dependent variables RetailBSIVol and Panel B uses the dependent variable RetailBSINum. Using unique Firm-EventDate- Date observations on days −20 to +20 around each Firm-EventDate, we estimate versions of Equation (2) that interact EventDay[−1,+1] with event-level information on ESG performance and returns. Columns 1 and2usethesubsamplesofeventsforfirmsheadquarteredinhighESGandlowESGstates,definedasthose with state-level ESG scores above and below the median, respectively. Columns 3 and 4 use the subsamples of events for firms headquartered in blue and red states, defined as those predominantly voting Democratic andRepublicaninthe2020presidentialelection,respectively. Thetablealsopresentsthedifferencesincoef- ficientsbetweenhighESGandlowESGstates,aswellasbetweenblueandredstates(i.e.,comparescolumn 1 to column 2 and column 3 to column 4) and indicates the significance of the difference using Z-tests. The main effects on the event-level measures are subsumed by Firm-EventDate fixed effects. All variables are defined in Appendix B. All continuous variables, except returns, are winsorized at the 1% and 99% levels to limittheinfluenceofoutliers. Tofacilitateinterpretation,theevent-levelinformationvariablesarestandard- izedtohaveamean(standarddeviation)of0(1). t-statisticsbasedonstandarderrorsclusteredbyFirmand EventDate are in parentheses. Levels of significance are presented as follows: ∗p<0.1; ∗∗p<0.05; ∗∗∗p<0.01. 56 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 57,
    "page_range": "p.57",
    "total_pages": 59,
    "chunk_index": 96,
    "word_count": 342,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.57)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "subsumed by Firm-EventDate fixed effects. All variables are defined in Appendix B. All continuous variables, except returns, are winsorized at the 1% and 99% levels to limittheinfluenceofoutliers. Tofacilitateinterpretation,theevent-levelinformationvariablesarestandard- izedtohaveamean(standarddeviation)of0(1). t-statisticsbasedonstandarderrorsclusteredbyFirmand EventDate are in parentheses. Levels of significance are presented as follows: ∗p<0.1; ∗∗p<0.05; ∗∗∗p<0.01. 56 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 58,
    "page_range": "p.58",
    "total_pages": 59,
    "chunk_index": 97,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.58)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "Table 10 Alternative Measures of Retail Net Demand Panel A: Aggregate Net Demand Using Lee-Ready algorithm RetailBSIVol LR RetailBSINum LR (1) (2) (3) (4) EventDay[-1,+1] × PulseChange 0.001 0.001 0.001 0.001 (1.109) (1.044) (1.140) (1.130) EventDay[-1,+1] × EventRet 0.003∗∗∗ 0.000 (4.736) (0.375) EventDay[-1,+1] 0.000 0.000 0.001∗ 0.001∗ (0.426) (0.431) (1.954) (1.955) Firm-EventDate fixed effects Yes Yes Yes Yes R2 0.084 0.084 0.228 0.228 Observations 2,194,371 2,194,371 2,194,371 2,194,371 Panel B: Signed Change in the Number of Robinhood Users RHUsers Change (1) (2) EventDay[-1,+1] × PulseChange 0.001 0.000 (1.132) (0.386) EventDay[-1,+1] × EventRet 0.044∗∗∗ (5.891) EventDay[-1,+1] 0.009∗∗∗ 0.010∗∗∗ (3.021) (3.042) Firm-EventDate fixed effects Yes Yes R2 0.519 0.520 Observations 796,684 796,684 This table presents an analysis of retail investors’ motivations for trade around ESG news events, using alternative measures of retail investors’ buy-sell imbalance. Using unique Firm-EventDate-Date observa- tions on days −20 to +20 around each Firm-EventDate, we estimate versions of Equation (2) that interact EventDay[−1,+1] with event-level information on ESG performance and returns. Panel A uses the depen- dentvariablesRetailBSIVol LRandRetailBSINum LR,whichassignbuysandsellsusingtheLee-Ready algorithmtoretailtradesidentifiedusingthemethodologyintroducedbyBoehmeretal.(2021),assuggested by Barber et al. (2023). Panel B uses the dependent variable RHUsers Change, which is the change in the numberofRobinhoodusersholdingthestock. Columns1and3ofPanelAandcolumn1ofPanelBinteract EventDay[−1,+1] with an event-level proxy of ESG performance information. Columns 2 and 4 of Panel A and column 2 of Panel B interact EventDay[−1,+1] with event-level proxies of ESG performance and return information. The main effects on the event-level measures are subsumed by Firm-EventDate fixed effects. All variables are defined in Appendix B. All continuous variables, except returns, are winsorized at the 1% and 99% levels to limit the influence of outliers. To facilitate interpretation, the event-level informa- tion variables are standardized to have a mean (standard deviation) of 0 (1). t-statistics based on standard errors clustered by Firm and EventDate are in parentheses. Levels of significance are presented as follows: ∗p<0.1; ∗∗p<0.05; ∗∗∗p<0.01. 57 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 58,
    "page_range": "p.58",
    "total_pages": 59,
    "chunk_index": 98,
    "word_count": 313,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.58)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "of outliers. To facilitate interpretation, the event-level informa- tion variables are standardized to have a mean (standard deviation) of 0 (1). t-statistics based on standard errors clustered by Firm and EventDate are in parentheses. Levels of significance are presented as follows: ∗p<0.1; ∗∗p<0.05; ∗∗∗p<0.01. 57 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 59,
    "page_range": "p.59",
    "total_pages": 59,
    "chunk_index": 99,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.59)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "Table 11 Retail Trading Activity and Non-Market-Based Measures of Financial Materiality Panel A: Volume RetailVol SASB Materiality Analyst Revision (1) (2) (3) (4) EventDay[-1,+1] × FinMaterial 0.012∗∗ 0.012∗∗ 0.023∗∗∗ 0.023∗∗∗ (2.001) (1.989) (3.557) (3.551) EventDay[-1,+1] 0.026∗∗∗ 0.026∗∗∗ 0.024∗∗∗ 0.024∗∗∗ (4.935) (4.952) (5.187) (5.200) FinMaterial 0.006 0.265∗∗∗ (0.112) (4.756) Firm-EventDate fixed effects No Yes No Yes R2 0.000 0.838 0.007 0.838 Observations 2,220,704 2,220,704 2,220,704 2,220,704 Panel B: Number of Trades RetailNum SASB Materiality Analyst Revision (1) (2) (3) (4) EventDay[-1,+1] × FinMaterial 0.041 0.041 0.164∗∗∗ 0.163∗∗∗ (1.621) (1.598) (4.339) (4.333) EventDay[-1,+1] 0.099∗∗∗ 0.100∗∗∗ 0.054∗∗ 0.055∗∗ (3.580) (3.599) (2.272) (2.288) FinMaterial -0.233 1.398∗∗∗ (-0.707) (4.707) Firm-EventDate fixed effects No Yes No Yes R2 0.000 0.888 0.006 0.888 Observations 2,220,704 2,220,704 2,220,704 2,220,704 This table presents an analysis of the role of financial materiality in affecting retail investors’ response to ESG news events. Using unique Firm-EventDate-Date observations on days −20 to +20 around each Firm- EventDate,weestimateversionsofEquation(1)thatinteractEventDay[−1,+1]withevent-levelindicators for the financial materiality of the event. Panel A uses the dependent variable RetailVol and Panel B uses the dependent variable RetailNum. In both panels, columns 1 and 2 interact EventDay[−1,+1] with an event-levelfinancialmaterialityindicatorbasedontheSASB’sFinancialMaterialityMap. Columns3and4 interact EventDay[−1,+1] with an event-level financial materiality indicator based on whether an analyst makes an EPS forecast revision following the event. In columns 2 and 4, the main effects on the event-level financial materiality indicator are subsumed by Firm-EventDate fixed effects. All variables are defined in Appendix B. All continuous variables, except returns, are winsorized at the 1% and 99% levels to limit the influence of outliers. t-statistics based on standard errors clustered by Firm and EventDate are in parenthe- ses. Levels of significance are presented as follows: ∗p<0.1; ∗∗p<0.05; ∗∗∗p<0.01. 58 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 59,
    "page_range": "p.59",
    "total_pages": 59,
    "chunk_index": 100,
    "word_count": 286,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.59)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  },
  {
    "text": "B. All continuous variables, except returns, are winsorized at the 1% and 99% levels to limit the influence of outliers. t-statistics based on standard errors clustered by Firm and EventDate are in parenthe- ses. Levels of significance are presented as follows: ∗p<0.1; ∗∗p<0.05; ∗∗∗p<0.01. 58 Electronic copy available at: https://ssrn.com/abstract=4384675",
    "title": "Retail Investors and ESG News",
    "source_type": "pdf",
    "document_id": "b53bf08ccf15",
    "source_file": "Retail Investors and ESG News.pdf",
    "section": "References",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 59,
    "chunk_index": 101,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230926162039-04'00'",
    "duration": null
  }
]