[
  {
    "text": "d e Retail investors’ trading activity and the predictability of stock w return correlations∗ e Daniele Ballinari† University of Basel i v This version: August 27, 2021 e First version: October 10, 2020 r Abstractr Considerable theoretical and empirical evidenece links price comovements with the behavior of retail investors. Nevertheless, when predicting stock return correlations, research has focused on the leverage effect. We propose a new model of realized covariances that allows exogenouspredictorstoinfluencethecorerelationdynamicswhileensuringthepredictedma- trices’ positive definiteness. Using this model, we provide evidence for the predictive power of sentiment and attention measures obtained from social media and web-search query data p forthecorrelationsof35DowJonesstocks. Attheone-dayforecastinghorizon,thisfindings are confirmed by value-at-risk forecasts. t Keywords: realized correlation; realized covariance; retail investors; investor sentiment; in- o vestor attention JEL: C22, C51, C5n3, G17, G40 t n i r p e r ∗For helpful comments and suggestions, I thank Francesco Audrino, Simon Behrendt, Zhi Da, Juan-Pablo POrtega, Cédric Müller, Gabriel Okasa, Andrin Pelican, Fabio Sigrist, and the participants 14th International Conference on Computational and Financial Econometrics (2020). The research project is funded by the Swiss NationalScienceFoundation(Grant100018-172685). IwouldliketothankFrancescoAudrinoandFabioSigrist for providing access to the data. †Corresponding author: University of Basel, Faculty of Business and Economics, University of Basel, Peter Merian-Weg 6, 4002 Basel, Switzerland; daniele.ballinari@unibas.ch This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 44,
    "chunk_index": 0,
    "word_count": 219,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "The research project is funded by the Swiss NationalScienceFoundation(Grant100018-172685). IwouldliketothankFrancescoAudrinoandFabioSigrist for providing access to the data. †Corresponding author: University of Basel, Faculty of Business and Economics, University of Basel, Peter Merian-Weg 6, 4002 Basel, Switzerland; daniele.ballinari@unibas.ch This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775 d 1 Introduction e In predicting stock return comovements, research has focused on the leverage effect, being the w empirical evidence that stock prices correlate more during market downturns than upturns (Ang &Chen,2002). Inadditiontotheseasymmetries,theacademicliteraturehasdocumentedseveral e other stylized facts about the correlation between stock returns. Two broad theories regarding return comovements have been analyzed (Barberis, Shleifer, & Wurgiler, 2005). The traditional v theory assumes that the market is frictionless and states that stock price correlations reflect the e correlations in fundamental values. In contrast, sentiment-based theories assumes that market frictionsexistandthatstockpricecomovementsareattributedtoinvestors’behaviorratherthan r to the comovement in fundamental values. Investors have been found, for instance, to simplify investment decisions by grouping stocks into categorries (Barberis & Shleifer, 2003). Changes in e their aggregated sentiment induce comovements in the return of stocks belonging to the same category (Kumar & Lee, 2006). Drake, Jennings, Roulstone, and Thornock (2017) and Huang, e Huang, and Lin (2019) attribute non-fundamental comovement in stock prices to changes in p investors’ attention. Their findings show that when investors pay more attention to market-level information rather than firm-specifi c news, stock returns correlate more. t While there is considerable empirical evidence on the factors influencing stock price comove- o ments, their (out-of-sample) predictive power for return covariances, excluding the leverage effect, has received littlne attention. Although the predictive content of retail investors’ trading behavior has been documented for stock return volatility (see, e.g., Audrino, Sigrist, & Balli- nari, 2020), its forecasting power for correlations has not yet been analyzed. Numerous studies t have proposednextensions of classical multivariate volatility models to account for asymmetries in volatilities and correlations (see, among others, Bollerslev, Patton, & Quaedvlieg, 2020; Cap- i piello,Enrgle,&Sheppard,2006;deGoeij&Marquering,2004;Francq&Zakoïan,2012;McAleer, p Hoti, & Chan, 2009). However, only a few models have been developed that allow exogenous variables to influence the prediction of the returns’ covariance matrix (e.g. Audrino & Corsi, e 2010; Audrino & Trojani, 2011; Bauer & Vorkink, 2011). There are two potential reasons for the r lack of studies that analyze the predictive power of sentiment-based theories of price comove- P ment: (i) these stylized facts do not have out-of-sample predictive power for the comovement of stock returns, or (ii) the literature lacks a suitable model to analyze their forecasting ability. 1 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 44,
    "chunk_index": 1,
    "word_count": 435,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "theories of price comove- P ment: (i) these stylized facts do not have out-of-sample predictive power for the comovement of stock returns, or (ii) the literature lacks a suitable model to analyze their forecasting ability. 1 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 44,
    "chunk_index": 2,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d This paper focuses on the correlation between stock returns. First, we introduce a new e model of realized correlations, allowing exogenous predictors to have a non-linear influence on the model’s forecasts. Building on the model of Audrino and Trojani (2011)w, we propose a tree- structured version of the realized covariance HAR-DRD model of Oh and Patton (2016). Their model defines different dynamics for the realized volatilities and correlaetion matrix. Through a binary tree, we determine a partition of the predictor space and fit local versions of the HAR- i DRD model’s correlation dynamics over each partition cell. Thvis approach allows exogenous predictors to directly influence the model’s parameters by ensuring the predicted covariance e matrix’s positive definiteness. Second, we use the new model to analyze the predictive power of r retail investors’ sentiment and attention. We measure sentiment through the opinions shared by investors on the social media platform StockTwits. Attention measures are instead constructed r using Google web-search queries. The findings indicate that for 35 U.S. stocks that are or have e been part of the Dow Jones Industrial Average Index from January 2010 to December 2020, e measures of retail investors’ sentiment and attention have forecasting power for the realized cor- relationmatrix. Inparticular, duringpperiodswhereretailinvestorsaretradingmoreintensively, sentiment and attention measures have predictive power even after controlling for the classical leverage effect. At the one-day forecasting horizon, this findings are confirmed by value-at-risk t forecasts. However, predictoors capturing the leverage effect (return of the Dow Jones Index and the VIX Index) produce the overall most accurate value-at-risk predictions. n Thecontributionofthispaperistwofold. First,anewpredictivemodelforrealizedcovariance matrices that allows the inclusion of exogenous predictors is introduced. Our model is most t closely related to the tree-structured multivariate DCC-GARCH model introduced by Audrino n and Trojani (2011) and the tree-structure HAR model used by Audrino and Corsi (2010) to i forecast the realized correlation between the S&P 500 futures and the 30-year Treasury Bond r futures. However,thelattermodelislimitedinthenumberofstocksbecauseitsforecastsarenot p guaranteed to provide positive definite correlation matrices for more than two assets. Second, e to the best of our knowledge, this is the first paper that analyzes the out-of-sample predictive power of sentiment-based theories of return comovements. It is the first study that considers r Pwhether retail investors’ sentiment and attention can improve the forecasting accuracy of the realized correlation matrix in statistical and economic terms. 2 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 44,
    "chunk_index": 3,
    "word_count": 403,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "of sentiment-based theories of return comovements. It is the first study that considers r Pwhether retail investors’ sentiment and attention can improve the forecasting accuracy of the realized correlation matrix in statistical and economic terms. 2 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 44,
    "chunk_index": 4,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d 2 A realized covariance model with exogenous predictors e 2.1 Model specification w Let p ∈ RN be a vector of log-prices. We assume that p follows a continuous time diffusion t t process defined as follows: e (cid:90) 1 (cid:90) 1 i p = p + µµµ du+ ΩΩΩ dW (1) t t−1 t−1+u t−1+u t−1+u v 0 0 whereµµµ is multivariate drift component,ΩΩΩ is the instantan e eous multivariate volatility compo- t t nent, and W is the standard multivariate Brownian motion. Andersen, Bollerslev, Diebold, and t r Labys (2003) show that the daily returns are distributed as follows: r (cid:12) (cid:18)(cid:90) 1 (cid:90) 1 (cid:19) p −p (cid:12)σ{µµµ ,ΩΩΩ } ∼ Neµµµ du, ΩΩΩ ΩΩΩ(cid:48) du (2) t t−1(cid:12) t−1+u t−1+u u∈[0,1] t−1+u t−1+u t−1+u 0 0 e where σ{µµµ ,ΩΩΩ } denotes the σ-field generated by (µµµ ,ΩΩΩ ) , and t−1+u t−1+u u∈[0,1] t−1+u t−1+u u∈[0,1] (cid:82) 0 1 ΩΩΩ t−1+u ΩΩΩ(cid:48) t−1+u duistheintegratedcpovariancematrix. InthemultivariateGARCHframework, the latent covariance matrix of the daily log returns is specified parametrically. In this paper, we follow the more recent approach proposed by, among others, Barndorff-Nielsen and Shephard t (2004) and estimate the inteograted covariance non-parametrically with the realized covariance matrix: n m (cid:88) RCov = r r(cid:48) , (3) t t−1+s·∆ t−1+s·∆ s=1 where r ∈ RtN is a vector of high-frequency (log) returns computed at the frequency ∆ t−1+s·∆ n and m is the number of intra-day observations. Inspired by the dynamic correlation multivariate GARCH model (Engle, 2002), Oh and i r Patton (2016) suggest to model the realized variances and correlations separately. Let RVar = t p diag(RCov ) where diag(·) is the operator that sets the off-diagonal elements of a matrix to zero. t eThe realized correlation matrix is defined as (see, e.g., Barndorff-Nielsen & Shephard, 2004): r −1/2 −1/2 RCorr = RVar RCov RVar . (4) t t t t P Oh and Patton (2016) model the N (log) realized variances, being the diagonal elements of 3 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 44,
    "chunk_index": 5,
    "word_count": 347,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "e.g., Barndorff-Nielsen & Shephard, 2004): r −1/2 −1/2 RCorr = RVar RCov RVar . (4) t t t t P Oh and Patton (2016) model the N (log) realized variances, being the diagonal elements of 3 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 44,
    "chunk_index": 6,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d RVar , as univariate heterogeneous autoregressive (HAR) models (Corsi, 2009): t e (d) logRVar = α +β ·logRVar j,t+1 j j j,t w 4 (w) 1 (cid:88) +β · logRVar j 5 j,t−s s=0 e 21 (m) 1 (cid:88) +β · logRVar +u , (5) j 22 j,t−s j,t+1 i s=0 v where RVar denotes the j-th diagonal element of RVar , log is the natural logarithm, and the j,t t (cid:16) (cid:17) e parameter vector θ(cid:48) = α ,β (d) ,β (w) ,β (m) is estimated by ordinary least squares (OLS) for j j j j j each variance process. The dynamics of the realized correrlations are defined as: r vech(RCorr ) =vech(RCorr)(1−a−b−c) t+1 e +a·vech(RCorr ) t e1 (cid:88) 4 +b· vech(RCorr ) t−s 5 s=0 p 21 1 (cid:88) +c· vech(RCorr )+(cid:15) , (6) t−s t+1 22 s=0 t where RCorr = T−1(cid:80)T RCorr , vech(·) represents the half-vectorization operator,1 and a, b, t=1 ot and c are scalars estimated with OLS. For a,b,c > 0 and a+b+c < 1, Theorem 2 in Oh and n Patton (2016) ensures that the forecasts obtained from the model in Equation (6) are positive definite correlation matrices. For the remainder of this paper, the above model is referred to as HAR-DRD. t n The motivation for the restrictive parametrization of the correlation dynamics is twofold. First, imposiing the parameters a, b, and c as scalars allows us to overcome the curse of dimen- r sionality. OhandPatton(2016)arguethatamoreflexibleversionoftheirmodel, whichreplaces p the scalar parameters with matrices, is not feasible in higher dimensions.2 Related models, such eas the DCC-GARCH, use a similar approach to overcome the curse of dimensionality (see, e.g., r 1Thevectorizationofamatrixisobtainedbystackingitscolumns,andthehalf-vectorizationofasymmetric Pmatrix is obtained by vectorizing only the lower triangular part of the matrix. 2We conduct a robustness check where we consider a small subset of the stocks in our sample (see Table C1 in Appendix C). Imposing the same parameter for a smaller number of stocks is less restrictive. However, our results are qualitatively unaffected by fitting the model on a subset of stocks. We therefore leave an extension of the HAR-DRD model along the lines of that proposed by Bauwens, Grigoryeva, and Ortega (2016) for the DCC-GARCH model for future research. 4 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 44,
    "chunk_index": 7,
    "word_count": 387,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "the model on a subset of stocks. We therefore leave an extension of the HAR-DRD model along the lines of that proposed by Bauwens, Grigoryeva, and Ortega (2016) for the DCC-GARCH model for future research. 4 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 44,
    "chunk_index": 8,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d Engle,2002;Tse&Tsui,2002). Second,whileformallynotbelongingtotheclassoflong-memory e models, the HAR-structure used in Equations (5) and (6) allows the slowly decaying autocorre- lation of volatilities and correlations to be captured in a parsimonious way (wsee, e.g., Andersen, Bollerslev, Diebold, & Ebens, 2001; Corsi, 2009). The 1-day ahead predictions based on the models defined in Eqeuations (5) and (6), as (cid:91) (cid:92) well as the estimated parameters, are denoted as RVar for j = 1,...,N and RCorr , j,t+1|t t+1|t i respectively. We reverse the log-transformation of the realized vvariances by assuming that the residuals of Equation (5) are normally distributed and define: e (cid:32) (cid:33) σ2 R (cid:91) Var = exp lo (cid:92) gRVar r+ (cid:98)u,j (7) j,t+1|t j,t+1|t 2 r where σ2 is the sample variance of the residuals of Equation (5) (see Granger & Newbold, (cid:98)u,j e 1976).3 Volatility and correlation predictions for horizons longer than one day are obtained by direct forecasts.4 The h-day ahead predicteion for the entire realized covariance matrix is then: p1 1 (cid:92) (cid:91) (cid:92) (cid:91) RCov = RVar2 RCorr RVar2 , (8) t+h|t t+h|t t+h|t t+h|t where: t (cid:32) (cid:33) (cid:91)o(cid:91) (cid:91) RVar = diag RVar ,...,RVar . (9) t+h|t 1,t+h|t N,t+h|t n Due to the non-linear nature of the aggregation of variance and correlation predictions, the realized covariance m atrix forecasts are biased as long as realized variances and correlations t are dependent. However, other approaches to ensure positive definiteness, such as the matrix n logarithm or the Cholesky decomposition, face similar issues. We assess the severity of the bias induced by tihe transformation outlined in Equation (8) in Appendix A. For the dataset at hand, r the (empirical) bias of Oh and Patton’s (2016) model is small and of a similar magnitude to the p one caused by the Cholesky decomposition (see Chiriac & Voev, 2011). Moreover, an empirical ecorrection of the bias does not improve the forecasting results.5 In this study, the bias induced r 3IntheoriginalHAR-DRDmodel,OhandPatton(2016)reversethelog-transformationbytakingtheexpo- Pnential of the log volatility forecasts. Unreported robustness checks show that our findings are qualitatively the same when using their approach. 4We obtain direct forecasts for longer prediction horizons by replacing the 1-day ahead realized variance in Equation (5) and the 1-day ahead realized correlation matrix in Equation (6) by their respective measures over the relevant horizon of interest. The models’ parameters are estimated separately for each prediction horizon. 5See the results in Panel B of Table A1 in Appendix A. 5 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 44,
    "chunk_index": 9,
    "word_count": 419,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "in Equation (6) by their respective measures over the relevant horizon of interest. The models’ parameters are estimated separately for each prediction horizon. 5See the results in Panel B of Table A1 in Appendix A. 5 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 44,
    "chunk_index": 10,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d by the non-linearity of Equation (8) is not corrected and the derivation of an analytical bias e correction remains a topic for future research. While the model defined in Equations (5) and (6) is more flexible cowmpared to realized covariance models suggested in other studies, it does not allow exogenous variables to influence the correlation forecasts. Focusing on the dynamics of the realized correelations, we introduce an extension of the above model that allows exogenous predictors to have a non-linear influence on i the predicted realized correlation matrices while still ensuring itsvpositive definiteness. Building on the modeling framework introduced by Audrino and Bühlmann (2001), Audrino and Corsi e (2010), and Audrino and Trojani (2006, 2011), we propose to model the realized correlations by r local versions of the model defined in Equation (6). In other words, while the structure of the model introduced by Oh and Patton (2016) is preserved locally, the parameters of the model r are allowed to change over time. The changes in the parameters are controlled by exogenous e predictors. More precisely, the realized correlation matrix is modeled as: e vech(RCorr ) = E[vech(RCorr )|F ]+σ ·z , (10) t+1 pt+1 t t+1 t+1 where F denotes the information s et at time t, and {z } is a sequence of i.i.d. innovation t t t≥1 t vectors with expected value 0 and covariance I (i.e., the identity matrix). The dynamics N(N−1) o 2 of the conditional expected realized correlations are given by: n k (cid:88)(cid:110) E[vech(RCorr )|F ] = vech(RCorr )(1−a −b −c ) tt+1 t i i i i i=1 n +a ·vech(RCorr ) i t i 4 1 (cid:88) r +b i · vech(RCorr t−s ) 5 s=0 p 21 1 (cid:88) (cid:111) +c · vech(RCorr ) 1 , (11) i 22 t−s [Xt∈Ri] e s=0 and the dynamics of {σ2} are: r t t≥1 P k (cid:88) σ2 = σ21 , with σ2 > 0, i = 1,...,k, (12) t+1 i [Xt∈Ri] i i=1 6 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 44,
    "chunk_index": 11,
    "word_count": 348,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "i 22 t−s [Xt∈Ri] e s=0 and the dynamics of {σ2} are: r t t≥1 P k (cid:88) σ2 = σ21 , with σ2 > 0, i = 1,...,k, (12) t+1 i [Xt∈Ri] i i=1 6 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 44,
    "chunk_index": 12,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d where the parameters {a ,b ,c ,σ2}k define the local dynamics of the model, X ∈ Rp is i i i i i=1 t e a vector of exogenous predictors known at time t, RCorr = T−1(cid:80)T RCorr ·1 with i i t=1 t [Xt∈Ri] T i = (cid:80)T t=1 1 [Xt∈Ri] , and 1 [·] being an indicator function. Following Audrinwo and Corsi (2010), the local models are characterized by the partition P = {R ,...,R } of the predictor space, 1 k defined as: e k (cid:91) R = Rp, with R ∩R = ∅ ∀ i (cid:54)= j. (13) i i j i i=1 v Note that the model introduced by Oh and Patton (2016) is nested in this model, meaning e that for k = 1 the model defined in Equations (10) to (12) is simply the HAR-DRD model. For k > 1, the model becomes more flexible and allows for changes in the average level and r persistence of the correlations. For example, two par tition cells R 1 and R 2 could represent r market downturns and upturns. The model allows the on average higher correlation observed e during market downturns, known as the leverage effect, to be captured through the separate estimation of RCorr 1 and RCorr 2 . e The following theorem extends Theorem 2 in Oh and Patton (2016) and provides conditions p under which the predicted correlation matrix obtained from the model defined in Equation (11) ispositivedefinite. Letr beavecto rof(log)returnsandmthenumberofintradayobservations t t used for the estimation of the realized covariance matrix. o Theorem 1 Assume that (i) P[w(cid:48)r = 0] = 0 for any nonzero vector w ∈ RN, (ii) a ,b ,c ≥ 0 t i i i n for i = 1,...,k, (iii) a +b +c < 1 for i = 1,...,k, (iv) T ·m > N for i = 1,...,k, and (v) i i i i R ∩R = ∅ for i (cid:54)= j . Then, E[RCorr |F ] is a positive definite correlation matrix. i j t+1 t t For a specnific partition cell R , under assumptions (i) to (iv), the proof of Theorem 1 is i analogous to that of Theorem 2 in Oh and Patton (2016). Assumption (v) ensures that the i predictionris a positive definite correlation matrix over the entire predictor space. p 2.2 Model estimation e Oh and Patton (2016) estimate the HAR-DRD model with OLS.6 For a given partition of the r predictorspace,themodeldefinedinEquations(10)to(12)canalsobeestimatedusingOLS.To P definethepartitionP ofthepredictorspace,wefollowAudrinoandBühlmann(2001)andimpose 6Forthedataandsampleperiodconsideredinthisstudy,theestimatesoftheHAR-DRDmodelalwaysfulfill the assumptions of Theorem 2 in Oh and Patton (2016), without the need to impose any additional restrictions in the estimation procedure. 7 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 44,
    "chunk_index": 13,
    "word_count": 455,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "OLS.6 For a given partition of the r predictorspace,themodeldefinedinEquations(10)to(12)canalsobeestimatedusingOLS.To P definethepartitionP ofthepredictorspace,wefollowAudrinoandBühlmann(2001)andimpose 6Forthedataandsampleperiodconsideredinthisstudy,theestimatesoftheHAR-DRDmodelalwaysfulfill the assumptions of Theorem 2 in Oh and Patton (2016), without the need to impose any additional restrictions in the estimation procedure. 7 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 44,
    "chunk_index": 14,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d thepartitioncellstoberectangular, meaningthattheedgesofapartitioncellaredeterminedby e thresholds on the predictor variables. In the spirit of the standard classification and regression tree (CART) procedure (Breiman, Friedman, Stone, & Olshen, 1984), thewconstruction of the partitionisbasedonabinarytree. ForagivenpartitioncellR ,wecomparethefitofastandard i HAR-DRD model to two local HAR-DRD models estimated over diffeerent binary partitions of thepartitioncellR . Thefitofthemodelsisevaluatedintermsofthesumofsquaredresiduals.7 i i The data-driven construction of the partition is summarized by tvhe following algorithm: Step 1: Set P(0) = Rp and q = 0. e r Step 2: While q < q : max Step 2.1: Set q = q + 1. r e Step 2.2: Find the optimal binary partition of all partition cells in P(q−1). In other words, let R i be the i-thepartition cell of P(q−1). Determine the index ι i and thresholdvalued suchthatthesumofsquaredresidualsofthemodeldefined ιi p in Equations (10) to (12) estimated over the partition tR = R ∪R i i,left i,right o with R = {x ∈ Rp | x ≤ d } and R = {x ∈ Rp | x > d } is ni,left t ιi ιi i,right t ιi ιi minimized. Step 2.3: Let i∗ be the index of the partition cell whose binary partition leads to the t nsmallestsumofsquaredresidualsamongallotherpartitioncells. DefineP(q) = (cid:16) (cid:17) (cid:83) R ∪(R ∪R ),wherethei∗-thpartitioncellisreplacedwith i(cid:54)=i∗ i i∗,left i∗,right i rits optimal binary split. p The total number of partition cells corresponds to q +1. To find the optimal binary split max e in Step 2.2, we follow Audrino and Bühlmann (2001) and use a grid search. For each predictor variable, we construct a binary split of the partition cell for a grid of threshold values, where the r gridisdefinedasempiricalα-quantilesofthepredictorvariablewithα = v/V forv = 1,...,V − P 7Sinceweconsiderthehalf-vectorizedcorrelationmatrixintheestimationprocedure,minimizingthesumof squared residuals is equivalent to using the Euclidean distance as an optimization criterion, which is often used as a loss function for multivariate volatility models (see Section 3.3). 8 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 44,
    "chunk_index": 15,
    "word_count": 322,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "v/V forv = 1,...,V − P 7Sinceweconsiderthehalf-vectorizedcorrelationmatrixintheestimationprocedure,minimizingthesumof squared residuals is equivalent to using the Euclidean distance as an optimization criterion, which is often used as a loss function for multivariate volatility models (see Section 3.3). 8 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 44,
    "chunk_index": 16,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d 1. Following Audrino and Bühlmann (2001), for the empirical analysis we set q = 7 and max e V = 8. Moreover, for the practical implementation of the estimation procedure, each partition cell is required to consists of at least 10 observations of each stock-pairwand the estimated parameters must satisfy the assumptions of Theorem 1.8 In the remainder of this paper we will refer to this model as the T-HAR-DRD model, short for tree-structureed HAR-DRD model. For the purpose of out-of-sample forecasting, the constructed partition P(qmax) could be i too fine, resulting in the model overfitting the data. Exploitingvthe fact that the constructed partition is a binary tree, we adopt classical tree-pruning approaches and search for the best e sub-tree in terms of a cost complexity criterion. A similar approach is also used in other related r studies (see, e.g., Audrino & Bühlmann, 2001; Audrino & Corsi, 2010; Audrino & Trojani, 2006, 2011). WefollowtheCARTliteratureanddefinethecostcomplexityoftheT-HAR-DRDmodel r as (see Hastie, Tibsshirani, & Friedman, 2009, p. 308): e T−h C(λ) = λ·|P|·3+ e(cid:88) vech(e )(cid:48) vech(e ) (14) t+h|t t+h|t t=1 p where |P| is the cardinality of the partition and |P| · 3 corresponds to the total number of (cid:92) estimated parameters, and e = RCorr −RCorr is the matrix of in-sample forecasting t+h|t t+h t+h|t t errors. The sum of the squared forecasting errors corresponds to the Euclidean loss function o used in the analysis of Section 4 to evaluate the accuracy of the models. Intuitively, Equation n (14) compares the accuracy of the model (sum of squared forecasting errors) with its complexity (number of estimated parameters). For a given value of λ, we select the model with the lowest cost complexity crtiterion. The hyperparameter λ controls the relative importance of the two n components. We consider a grid of candidate values of the hyperparameter and determine its optimal valuie by means of ten-fold cross-validation.9 To cope with the time dependency in r financial data we follow, among others, Racine (2000) and Bergmeir and Benítez (2012) and p use a blocked cross-validation approach. We divide the sample into ten non-overlapping and econnected intervals, choose one block as the test set, and for a given value of λ estimate and prune the T-HAR-DRD model using the remaining data. We remove at the boundaries of the r test set h observations, where h is the forecasting horizon. This procedure is repeated for all ten P 8In practice, if a candidate index-threshold pair (ι ,d ) defines a partition cell over which the parameter i ιi estimates do not satisfy the assumptions of Theorem 1, the respective sum of squared residuals is set to +∞. 9We consider 100 candidate value of λ that range from 0 (highest complexity) to the value of the hyperpa- rameter that reduces the T-HAR-DRD model to the nested HAR-DRD model. 9 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 44,
    "chunk_index": 17,
    "word_count": 487,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "residuals is set to +∞. 9We consider 100 candidate value of λ that range from 0 (highest complexity) to the value of the hyperpa- rameter that reduces the T-HAR-DRD model to the nested HAR-DRD model. 9 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 44,
    "chunk_index": 18,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d blocks and we choose the value of λ for which we obtain the smallest sum of squared forecasting e errors over the test sets. An alternative approach to pruning is the idea of “bagging” and randomwpredictor selection to reduce the variance of the model’s forecasts (see, e.g., Breiman, 2001). We implement this approach as follows. First, we generate B random samples of the daeta. We account for the time dependency in financial data by using a block-bootstrapping approach. The cross-sectional i dimension of the data is not sampled, that is each bootstrappevd sample consists of the same N assets. Second, we estimate a T-HAR-DRD model over each bootstrapped sample (without e pruning). Third, we generate forecasts over the prediction horizon h with each of the B models. r The final forecast is then defined as the average of all these predictions: B r (cid:92) 1 (cid:88) (cid:92)(b) RCorr = RCorr (15) t+h|t Bet+h|t b=1 (cid:92)(b) e where RCorr is the forecast produced by the T-HAR-DRD model estimated over the b-th t+h|t bootstrapped sample. Theorem 1 enpsures that the prediction of each of the B models is a positive definite correlation matrix. Since the average of positive definite correlation matrices is as well a positive definite correlation matrix, predictions obtained from this “bagging” approach t are also positive definite cororelation matrices. The idea of this technique is to average many potentially overfitted but approximately un- n biased models, and therefore reduce the variance of the forecasts (Hastie et al., 2009, p. 587). The less dependent th e B models are, the lower is the variance of the above average. To further t reduce the dependence between the T-HAR-DRD models, we implement a random predictor se- n lection procedure. In the data-driven construction of the partition described above, we consider i at each iteration of Step 2 only a random subsample of predictors. We refer to this model as r the RF-HAR-DRD model, short for random forest HAR-DRD model.10 For the practical imple- p mentationoftheRF-HAR-DRDmodel, theresearcherhastodefinethenumberofbootstrapped e samples B, the block length for the block-bootstrap procedure, and the size of the random pre- rdictor subsample. For the empirical analysis of this paper, we use a block-bootstrap procedure Pwith block length 22, set B = 200, and consider a random subsample of two predictors. 10TheR-implementationoftheT-HAR-DRDandtheRF-HAR-DRDareavailablefromtheauthor’sGitHub repository (https://github.com/dballinari/Tree-HAR-DRD). 10 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 44,
    "chunk_index": 19,
    "word_count": 400,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "random pre- rdictor subsample. For the empirical analysis of this paper, we use a block-bootstrap procedure Pwith block length 22, set B = 200, and consider a random subsample of two predictors. 10TheR-implementationoftheT-HAR-DRDandtheRF-HAR-DRDareavailablefromtheauthor’sGitHub repository (https://github.com/dballinari/Tree-HAR-DRD). 10 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 44,
    "chunk_index": 20,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d We obtain multi-period predictions from the T-HAR-DRD and the RF-HAR-DRD models e bydirectforecasts. RealizedvarianceforecastsareobtainedasinOhandPatton(2016)byusing the model defined in Equation (5).11 Multi-period forecasts of the realizedwcovariance matrix are computed analogously to Equation (8). e 3 Empirical framework and data i v 3.1 Motivation e Motivated by the empirical finding that price comovements are not only fundamentally driven, r but also a behavioral phenomenon (see, e.g., Barberis et al., 2005), our empirical analysis aims to study the predictive power of investors’ sentiment and attention for the correlation in stock r returns. Kumar and Lee (2006) find that retail investors buy and sell stocks in concert, and e that their buying behavior impacts the comovement of stock returns. In line with noise trader e models, Kumar and Lee (2006) attribute the comovement in retail investors trades to sentiment, that is the false believe to have special information about future stock prices (De Long, Shleifer, p Summers,&Waldmann,1990). Severalotherstudiesconfirmedthisfinding(e.g.Barber,Odean, & Zhu, 2009; Frijns, Verschoor, & Zwinkels, 2017; Green & Hwang, 2009; Kumar, Page, & t Spalt, 2012, 2016). Green oand Hwang (2009), for instance, find that similarly priced stocks correlatedandthatafterastock-splitthereturncorrelationwithlow-priced(high-priced)stocks n increases (decreases). These changes in comovement cannot be explained by fundamentals and are more pronounced during periods of high investor sentiment. Analyzing the trading records t of households, Barber et al. (2009) find that retail investors’ trades are correlated and not n primarily driven by fundamental news. More recently, Frijns et al. (2017) decompose the return of internatioinal stock market indices in fundamental and non-fundamental components and find r that comovement in sentiment is an important driver of return covariances. p Anotherstrandofliteratureattributesthenon-fundamentalcomovementofpricestochanges e in investors’ attention to stocks and the overall market. Attention is a limited resources and investors have therefore to decide how to allocate it across all assets (Hirshleifer & Teoh, 2003). r PDrake et al. (2017) find that when attention to individual stocks correlates with attention to the 11In practice, more sophisticated realized variance models could be used (see, e.g., Bollerslev, Hood, Huss, & Pedersen, 2018; Ghysels, Santa-Clara, & Valkanov, 2006). Since the focus of this study is on the prediction of realized correlations, we mirror the approach of Oh and Patton (2016) and use the HAR model of Corsi (2009). 11 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 44,
    "chunk_index": 21,
    "word_count": 386,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "Ghysels, Santa-Clara, & Valkanov, 2006). Since the focus of this study is on the prediction of realized correlations, we mirror the approach of Oh and Patton (2016) and use the HAR model of Corsi (2009). 11 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 44,
    "chunk_index": 22,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d market,stockreturnscorrelatemore. Huangetal.(2019)findthatexogenousshocksthatreduce e investorsattentiontofirm-specificnews,increasetheattentiontomarket-levelinformationwhich in turn increases the correlation between stock returns. w In summary, non-fundamental correlation between assets is attributed to comovements in investor sentiment and attention to market-level news rather than firme-specific information. In the following, we construct measures that aim to capture these facets of investors’ sentiment i and attention. v e 3.2 Data r The dataset consists of 35 U.S. stocks that are or have been part of the Dow Jones Industrial Average Index (DJIA) from January 2010 to December 2020, with a total of 2,768 daily observa- r tions.12 High-frequency returns are computed using transaction data from 9:30 AM to 4:00 PM e EasternTime. TheyareobtainedfromtheNYSETradeandQuotedatabase(TAQ)andcleaned e following the guidance of Barndorff-Nielsen, Hansen, Lunde, and Shephard (2009). We follow, among others, Bollerslev, Patton, andpQuaedvlieg (2018) along with Oh and Patton (2016) and use a 5-minute sampling frequency for the construction of intra-day returns. We compute daily realizedcovariancematricesasdefinedinEquation(3). PanelAinTable1reportsthesummary t statistics of the annualized roealized volatilities and realized correlations across the 35 stocks in the sample. n We measure retail investors’ sentiment through social media messages shared by investors. Following Cookson an d Niessner (2020), we collect messages share on the social network Stock- t Twits.13 Users of this platform can share short messages of 1,000 characters.14 In contrast n to Twitter, StockTwits is specifically designed for sharing investment ideas and strategies. For i example, users can use cashtags, i.e. metadata tags for stock market tickers prefaced by “$”, r to identify the asset they are writing about. Moreover, users can label their messages as be- p 12ThestocksinourdatasetareAmericanExpressCo. (AXP),AppleInc. (AAPL),VerizonCommunications e Inc. (VZ), Boeing Co. (BA), Caterpillar Inc. (CAT), JPMorgan Chase & Co. (JPM), Chevron Corp. (CVX), Coca-Cola Co. (KO), Walt Disney Co. (DIS), DuPont de Nemours Inc. (DD), Exxon Mobil Corp. (XOM), General Electric Co. (GE), Hewlett-Packard Inc. (HPQ), Home Depot Inc. (HD), Intel Corp. (INTC), IBM r Corp. (IBM),Johnson&Johnson(JNJ),McDonald’sCorp. (MCD),Merck&Co. Inc. (MRK),3MCo. (MMM), PBank of America Corp. (BAC), Nike Inc. (NKE), Pfizer Inc. (PFE), Procter & Gamble Co. (PG), AT&T Inc. (T), UnitedHealth Group Inc. (UNH), Walmart Inc. (WMT), Walgreens Boots Alliance Inc. (WBA), Microsoft Corpor. (MSFT), Cisco Systems Inc. (CSCO), Travelers Companies Inc. (TRV), Goldman Sachs Group Inc. (GS), Mondelez International Inc. (MDLZ), Visa Inc. (V), and Raytheon Technologies Corp. (RTX). 13We thank Francesco Audrino and Fabio Sigrist for providing access to the data. 14StockTwits increased the character-limit from 140 to 1,000 in May 2019. 12 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 44,
    "chunk_index": 23,
    "word_count": 417,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "International Inc. (MDLZ), Visa Inc. (V), and Raytheon Technologies Corp. (RTX). 13We thank Francesco Audrino and Fabio Sigrist for providing access to the data. 14StockTwits increased the character-limit from 140 to 1,000 in May 2019. 12 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 44,
    "chunk_index": 24,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d ing either “bullish” or “bearish.” We make use of both features and collect social media posts e about the Dow Jones Industrial Average Index by selecting all messages that mention a releated cashtag: “$DJIA”, “$DJI”, and “$DIA” (the ticker of the largest DJIA ETF).wIn total, we collect 278,496messagesoverthetimeperiodfrom2010to2020. WefollowAntweilerandFrank(2004) and define a daily sentiment measure by comparing the share of bulliseh messages with that of bearish messages: i NBull−NBear S = t t v (16) t N t where NBull, NBear, and N are respectively the total num e ber of bullish, bearish, and overall t t t messages shared on day t about the DJIA. We align the sentiment index with other financial r data by counting the number of bullish and bearish messages published on day t from 4:00 p.m. of day t−1 to 4:00 p.m. of day t (Eastern Time). Wrhen the stock market closes early, e.g. the e day after Thanksgiving, we replace 4:00 p.m with 1:00 p.m. Moreover, we define the sentiment index only for days where the stock market is open. Since only roughly 31.6% of the messages in e our dataset are labeled, we predict the sentiment (bullish or bearish) of the unlabeled messages p with a penalized logistic regression. Details about the classification of the StockTwits messages are relegated to Appendix B. To en sure that the forecasting results presented in Section 4 are t true ex-ante out-of-sample predictions, we train the classifier using only data up to the end of o 2014. We follow the appronach of Da, Engelberg, and Gao (2011) and construct measures of retail investors’ attention using the volume of web-search queries obtained from Google Trends.15 Da etal.(2011)arguethatweb-searchqueriesarearevealedattentionmeasuresincewhensearching t online for a stonck, investors are certainly paying attention to it. For all 35 stocks in our dataset, wecollectthedailyrelativevolumeofweb-searchqueriesfortheirticker. Wemanuallyverifythe i web-searcrhes for each ticker and ensure that the search results provided by Google are related to p the respective company’s stock. Some tickers have generic meaning or are ambiguous, such as “CAT.” For these noisy tickers, we search for their ticker together with the the word “stock.”16 e r P 15Google Trends data can be obtained from https://trends.google.com/. For collecting daily data over longhorizonsweuseascraperavailablefromtheauthor’sGitHubrepository(https://github.com/dballinari/ GoogleTrends-Scraper). 16The tickers for which we add the word “stock” are “CAT”, “HD”, “IBM”, “WAG”, “V”, and “RTX.” 13 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 44,
    "chunk_index": 25,
    "word_count": 400,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "e r P 15Google Trends data can be obtained from https://trends.google.com/. For collecting daily data over longhorizonsweuseascraperavailablefromtheauthor’sGitHubrepository(https://github.com/dballinari/ GoogleTrends-Scraper). 16The tickers for which we add the word “stock” are “CAT”, “HD”, “IBM”, “WAG”, “V”, and “RTX.” 13 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 44,
    "chunk_index": 26,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d We follow Da et al. (2011) and define for each company a measure of abnormal attention as: e (cid:18) (cid:19) V j,t A = log , (17) j,t med({V }252) w j,t−s s=1 whereV relativeweb-searchqueryvolumeforthetickerofstockj, log isthenaturallogarithm, j,t e and med(·) represents the median operator. We aggregate the stock-specific attention measure i by taking daily cross-sectional averages: v N AStock = 1 (cid:88) A . e (18) t N j,t j=1 r Similarly, weconstructameasureofattentiontothemarket. FollowingDimpflandJank(2016), we define the abnormal attention to the DJIA as: r e (cid:18) VIndex (cid:19) AIndex = log t , (19) t emed({VIndex}252) t−s s=1 whereVIndex istherelativevolumeofwpeb-searchqueriesforthekeyword“DOW.” Intuitively,when t AStock is high, investors pay attention to the constituents of the DJIA, and when AIndex is high, t t investors pay attention at the market-level. Consequently, we expect AStock to be negatively, t t and AIndex to be positively roelated with future realized correlations. t Finally, we include in our dataset well known predictors of stock return comovement. Asym- n metries in the correlation dynamics are captured by the daily DJIA return, denoted as rDJ. To t capture the overall m arket expectations about risk, we include the log VIX Index. The open-to- t close daily stock returns used for the value-at-risk analysis presented in Section 4.2 are obtained n from the Center for Research in Security Prices (CRSP). i Summary statistics of the predictors can be found in Panel B of Table 1. The table reports r mean, standard deviation, and the three quartiles of the five predictors over the entire sample. p Interestingly, sentiment for the DJIA is on average negative. In fact, in contrast to the overall e proportion of bullish and bearish messages (roughly 75% of all messages on StockTwits are rlabelled as “bullish”), messages about the Dow Jones are labelled more often as bearish rather Pthan bullish. Both attention measures have a positive mean. The relatively large standard deviations of the sentiment and attention measures indicate that none of the series are on average significantly different from zero. 14 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 44,
    "chunk_index": 27,
    "word_count": 352,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "bearish rather Pthan bullish. Both attention measures have a positive mean. The relatively large standard deviations of the sentiment and attention measures indicate that none of the series are on average significantly different from zero. 14 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 44,
    "chunk_index": 28,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d Table 1: Summary statistics of the data e Panel A: Summary statistics of the realized volatilities and correlations Mean Std. Q Median Q 25% 75% w Volatility 0.169 0.103 0.112 0.145 0.194 Correlation 0.301 0.222 0.147 0.302 0.459 Panel B: Summary statistics of the predictors e Mean Std. Q Median Q 25% 75% Return DJIA (in %) 0.045 1.096 −0.353 i0.065 0.513 Log VIX 2.827 0.336 2.582 2.767 3.015 v Sentiment DJIA −0.095 0.240 −0.238 −0.099 0.053 Attention stocks 0.083 0.250 −0.069 0.085 0.235 Attention DJIA 0.258 0.976 −0e.343 0.127 0.682 Note: ThetabledepictsthesummarystatisticsforthevariablesinthedatasetfromJanuary2010toDecember 2020. PanelAreportsthesummarystatisticsfortherealizedvolatilrity(annualized)andtherealizedcorrelations across all 35 stocks. Panel B summarizes the five predictors, being the daily return of the DJIA, the log VIX Index, investors’ sentiment for the DJIA, attention to the DJIA stocks, and attention to the DJIA. r Table 2 reports the correlation coefficientsebetween the five predictors. As expected, in- vestors’ sentiment for the DJIA is positively correlated with the daily return of the DJIA and e negativelywiththelogVIXIndex. Thetwoattentionmeasures,whilebeingpositivelycorrelated (0.42), exhibit important differences. Bpoth are positively correlated with the log VIX Index, but the correlation between the VIX Index and the DJIA attention measure (0.35) is almost twice as large as that with the stock atttention measure (0.18). Moreover, the correlation between the o DJIA return and the DJIA attention is -0.08, whereas the correlation between the DJIA return and the stock attention measure is small and positive. The correlation coefficients suggest that n during market downturns, investors concentrate their attention towards the market rather than single stocks. t Table 2: Correlation of the predictors n (1) (2) (3) (4) (5) Return DJIAi(1) 1.00 -0.13 0.18 0.03 -0.08 Log VIXr(2) 1.00 -0.17 0.18 0.35 Sentiment DJIA (3) 1.00 0.01 -0.09 p Attention stocks (4) 1.00 0.42 Attention DJIA (5) 1.00 eNote: ThetablereportsthePearsoncorrelationcoefficientsforthefivepredictors. ThedatagoesfromJanuary 2010 to December 2020. r Beforeturningourattentiontothemainempiricalresults,weinvestigatetherelationbetween P the realized correlation in t+1 and the five predictors in a simple panel regression framework. The regression includes stock-pair fixed effects, and we control for the realized correlation in 15 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 44,
    "chunk_index": 29,
    "word_count": 349,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "to December 2020. r Beforeturningourattentiontothemainempiricalresults,weinvestigatetherelationbetween P the realized correlation in t+1 and the five predictors in a simple panel regression framework. The regression includes stock-pair fixed effects, and we control for the realized correlation in 15 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 44,
    "chunk_index": 30,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d t, and its averages over the previous week and month. The estimates are reported in the first e column of Table 3, the second column shows block-bootstrapped standard errors, and the last column the respective t-statistics. The bootstrapping approach is appliedwon the time series dimension of the panel data, and we compute 10,000 replications with a block-length of 22 days. The right-hand side variables are standardized to have zero mean and eunit standard deviation. Table 3: Linear relation between the realized correlations and the predictors i Dependent variablve: RCorr t+1 Estimate Standard error t-statistic e RCorr 0.030 0.002 12.222 t RCorrw 0.074 0.003 21.445 t RCorrm 0.036 0.004 9.057 t r Return DJIA (in %) -0.015 0.004 -3.458 Log VIX 0.034 0.004 7.885 Sentiment DJIA -0.008 0.002 -4.175 r Attention stocks -0.006 0.003 -2.045 Attention index 0.014 e0.003 4.290 Observations 1,646,960 Within R2 32.53%e Note: The table reports the estimates of a panel regression where the dependent variable is the realized corre- lationint+1. Theregressionincludesstock-pairsfixedeffectsandallright-handsidevariablesarestandardized p to have zero mean and unit standard deviation. The first column depicts the estimates, the second column re- portsstandarderrors,andthelastcolumnthet-statistics. Standarderrorsarecomputedwithablock-bootstrap approach with 10,000 replications and block-length 22 days (bootstrapping is applied to the time dimension of the panel). t o The coefficient of AStock is significant at the 5% level, and all other estimates are significant t at the 1% level. Consistent with the classical leverage effect, the coefficient of the DJIA return n is negative and that of the log VIX Index positive. The coefficient of investors’ sentiment is negative but small in magnitude. When investors collectively feel more bearish about the DJIA, t thestockreturnnsaremorecorrelated. Asexpected, higherattentiontothestocksinoursample, that is higher values of AStock, predict lower correlations. In contrast, higher attention to the t i index prerdicts higher realized correlations. In summary, the estimates provide some empirical justipficationofoursentimentandattentionmeasures. However, wecannotusethissimplemodel to forecast the realized correlation matrix, since the panel regression does not guarantee that e the predicted matrix is positive definite. r P3.3 Forecasting procedure and model alternatives Weassessthepredictivepowerofretailinvestors’sentimentandattentionbyincludingS ,AStock, t t and AIndex in the T-HAR-DRD model. Aggregated, rather than firm-specific measures, are used t 16 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 44,
    "chunk_index": 31,
    "word_count": 367,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "not guarantee that e the predicted matrix is positive definite. r P3.3 Forecasting procedure and model alternatives Weassessthepredictivepowerofretailinvestors’sentimentandattentionbyincludingS ,AStock, t t and AIndex in the T-HAR-DRD model. Aggregated, rather than firm-specific measures, are used t 16 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 44,
    "chunk_index": 32,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d for two reasons. First, exogenous predictors included in the model presented in Section 2 affect e theentirecorrelationmatrixequally. Assuch, itismorenaturaltoincludeaggregatedmeasures. Second, the behavioral models and empirical findings presented in other swtudies suggest that stock price comovements are influenced by aggregated rather than firm-specific sentiment and attention(see, e.g.,Barberisetal.,2005;Drakeetal.,2017;Kumar&Leee,2006). Thepredictive power of the new model introduced in Section 2 is analyzed for three specifications of the i exogenous predictors: (i) the daily DJIA return and the VIX Invdex (T-HAR-DRD Leverage); (ii) the sentiment and attention measures (T-HAR-DRD Sentiment-Attention); and (iii) all e predictors simultaneously (T-HAR-DRD All). For computationally reasons, we estimate the r RF-HAR-DRD model only for the entire set of predictors. The limited number of exogenous predictors considered in this study is motivated by the empirical findings documented in the r literature. While retail investors’ trading activity has many facets, we focus on their sentiment e and attention as these measures have been shown to influence the comovement of stock prices. e The analysis of other retail investors’ trading activity measures, such as investors’ disagreement (Cookson & Niessner, 2020), remain aptopic for future research. The baseline model is the HAR-DRD model introduced by Oh and Patton (2016). In line withtheliterature,weincludethevectorHARmodelofrealizedcovariancessuggestedbyChiriac t and Voev (2011), which hasobeen found to have good out-of-sample predictive power (Symitsi, Symeonidis, Kourtis, & Markellos, 2018).17 All models are estimated every 22 observations n (every month) over a rolling five-year window. The results are robust with respect to this choice, as shown in A ppendix C.18 The cross-validation approach employed to determine the t hyperparameter of the cost complexity criterion in Equation (14) uses only data from the rolling n estimation window. Each partition cell is required to have at least 10 observations for each i stock-pair. Themodelsarecomparedatthe1-day,5-day,10-day,and22-daypredictionhorizons, r where the h-period covariance matrix is defined as the sum of h daily covariance matrices. As p e r17Formally, the model is defined as vech(Z ) = φ + φ · vech(Z ) + φ · 1(cid:80)4 vech(Z ) + φ · t+1 0 1 t 2 5 s=0 t−s 3 1 (cid:80)21 vech(Z ),whereZ istheCholeskydecompositionofRCov . TheparametersareestimatedwithOLS. P22 s=0 t−s t t The 1-day ahead forecast for the realized covariance matrix is obtained by applying the reverse of the Cholesky decompositiontoZ(cid:98)t+1|t (seeChiriac&Voev,2011). The1-dayaheadforecastfortherealizedcorrelationmatrix is then R (cid:92) Corr =diag(R (cid:92) Cov )−1/2 R (cid:92) Cov diag(R (cid:92) Cov )−1/2. t+1|t t+1|t t+1|t t+1|t 18In Appendix C, we report the results for a rolling window of four and a half years and five and a half years (see Tables C2 and C3). The results are qualitatively unaffected by these changes. 17 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 44,
    "chunk_index": 33,
    "word_count": 446,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "Appendix C, we report the results for a rolling window of four and a half years and five and a half years (see Tables C2 and C3). The results are qualitatively unaffected by these changes. 17 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 44,
    "chunk_index": 34,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d described in Section 2, multi-step ahead predictions are obtained from direct forecasts.19 e We evaluate the predictive performance of the models in terms of the (squared) Euclidean distance (see Laurent, Rombouts, & Violante, 2013). The loss function is thwen defined as: LE = vech(e )(cid:48) vech(e ), (20) t+h|t t+h|t t+h|t e (cid:92)i wheretheforecastingerrormatrixiseithere = RCorr −RCorr ore = RCov − t+h|t t+h t+h|t t+h|t t+h v (cid:92) RCov , and vech(·) is the half-vectorization operator. The economic value of the correlation t+h|t e predictions is assessed by comparing their accuracy in terms of value-at-risk forecasts, where the value-at-risk is defined as P(cid:0) r ≤ VaRγ (cid:1) = γ. Following Fengler and Okhrin (2016), t+h t+h r we forecast the 1%, 5%, and 10% value-at-risks of an e qually weighted portfolio containing the r 35 stocks in our sample. The portfolio is held from 9:30 AM to 4:00 PM, meaning that at the e end of each trading day all positions are closed. The forecasts of the portfolio’s variance are determined as: e σ2 = 1 1(cid:48) R (cid:92) Cov 1, (21) (cid:98)t+h|t N2 t+h|t p (cid:92) where 1 is a vector of ones, N denotes the number of stocks, and RCov is the h-period t+h|t covariance matrix forecast of one of the six considered models. Value-at-risk forecasts are then t obtained using filtered histoorical simulations with 10,000 replications (see Barone-Adesi, Bour- goin, & Giannopoulos, 1998). The accuracy of the value-at-risk forecasts is evaluated with the n quantile loss function (see González-Rivera, Lee, & Mishra, 2004): t LV t+h|t (γ) = (cid:16) γ −f t γ +h|t (cid:17)(cid:16) r t+h −V(cid:100)aR γ t+h|t (cid:17) (22) n for γ = 1%,i5%,10%, where fγ = 1 γ . To formally evaluate whether the losses t+h|t [r t+h <V(cid:100)aR t+h|t ] r differ significantly across the six analyzed models, we apply the model confidence set (MCS) of p Hansen, Lunde, and Nason (2011). For each loss function, the MCS approach determines a set eof models consisting of the best forecasting models with a given confidence. More precisely, we r P 19TableC4inAppendixCreportstheresultsformulti-stepaheadpredictionsobtainedrecursivelyfrom1-day ahead predictions. The results are qualitatively unaffected by the choice of a multi-period prediction approach. However,toobtainrecursiveforecastsfromthetree-structuredmodels,wehavetoassumethatthemodel“stays” in the same partition cell for all prediction horizons. 18 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 44,
    "chunk_index": 35,
    "word_count": 389,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "with a given confidence. More precisely, we r P 19TableC4inAppendixCreportstheresultsformulti-stepaheadpredictionsobtainedrecursivelyfrom1-day ahead predictions. The results are qualitatively unaffected by the choice of a multi-period prediction approach. However,toobtainrecursiveforecastsfromthetree-structuredmodels,wehavetoassumethatthemodel“stays” in the same partition cell for all prediction horizons. 18 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 44,
    "chunk_index": 36,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d determine the 90% and the 70% model confidence sets.20 e 4 Empirical results w 4.1 In-sample estimation results e Before analyzing the forecasting accuracy of the models, we summarize the estimation results i over the first five-year rolling window for the 1-day horizon, iv.e. using data from January 2010 to December 2014. Panel A of Table 4 reports the summary statistics of the estimated e parametersofthevariancemodeldefinedinEquation(5)acrossthe35stocksinoursample. The r first four columns report the mean, standard deviation, median, and 25%- and 75%-quantiles of the estimated parameters. The last column reports the number of observations. Panel B r of Table 4 summarizes the estimates of the correlation models. The first column shows the e empirical mean, and the standard deviation in parentheses, of the average correlation across all e stock-pairs.21 Columns two through four in Panel B report the parameter estimates, as well as block-bootstrapped standard errors in parentheses (10,000 replications with a block-length of p 22). The number of observations are shown in the last column. For the T-HAR-DRD models, Panel B in Table 4 reports the estimates and the number of observations for each partition cell t separately. o The estimated coefficients of the variance HAR models reported in Panel A are very similar n across all 35 stocks. The interquartile ranges for all four parameters are quite narrow. This findingisinlinewitht hestudyofBollerslev,Hood,etal.(2018)whodocumentstrongsimilarities t in the realized volatility pattern within asset classes. The first row in Panel B presents the n estimation results of Oh and Patton’s (2016) model. The average across all stock-pairs long-run expected reailized correlation amounts to 0.354, i.e. the constituents of the DJIA are positively r correlated. The estimation results of the T-HAR-DRD Sentiment-Attention model showcase p how the tree-structured extension of the baseline model can capture different market situations. e Sentiment and attention variable define four partition cells. The first partition cell denoted R 1 is characterized by periods with low attention to the DJIA (AIndex is below its 75%-quantile). r t P 20ThemodelconfidencesetsreportedinthispaperarebasedontheT teststatistic,forwhichthedistribu- max tionisestimatedwith10,000replicationsofamoving-blockbootstrap. Formoredetailsabouttheimplementation of the model confidence set approach, refer to Hansen et al. (2011). 21ForT →∞,RCorrconvergestothelong-runexpectedrealizedcorrelationE[RCorr ]. InTable4wereport t theempiricalaverageandthestandarddeviationcomputeacrossallbelow-diagonalentriesofthematrixRCorr. 19 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 44,
    "chunk_index": 37,
    "word_count": 366,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "attention to the DJIA (AIndex is below its 75%-quantile). r t P 20ThemodelconfidencesetsreportedinthispaperarebasedontheT teststatistic,forwhichthedistribu- max tionisestimatedwith10,000replicationsofamoving-blockbootstrap. Formoredetailsabouttheimplementation of the model confidence set approach, refer to Hansen et al. (2011). 21ForT →∞,RCorrconvergestothelong-runexpectedrealizedcorrelationE[RCorr ]. InTable4wereport t theempiricalaverageandthestandarddeviationcomputeacrossallbelow-diagonalentriesofthematrixRCorr. 19 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 44,
    "chunk_index": 38,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d e Table 4: Estimation results of the variance and correlation models for the first fivwe-year rolling window Panel A: Summary statistics of the parameter estimates of the variance HAR models α β(d) β(w) eβ(m) Num. obs. j j j j Mean −1.103 0.360 0.337 0.185 1’258 Standard deviation 0.382 0.048 0.074 0.056 i 25%-quantile −1.368 0.334 0.295 0.137 v Median −1.067 0.356 0.355 0.183 75%-quantile −0.806 0.384 0.395 0.230 e Panel B: Estimation results of the HAR-DRD model and its extensions RCorr a b c Num. obs. i i ri i HAR-DRD 0.354 0.138 0.333 0.333 1’258 (0.168) (0.0r16) (0.041) (0.048) T-HAR-DRD Sentiment-Attention e R : AIndex <0.46 0.332 0.104 0.277 0.347 944 1 t (0.173) (0.014) (0.040) (0.047) e R : AIndex ≥0.46 0.446 0.279 0.341 0.209 168 2 t and S <−0.13 (0.147) (0.039) (0.092) (0.092) t p R : 0.88>AIndex ≥0.46 0.382 0.070 0.531 0.261 82 3 t and S ≥−0.13 (0.162) (0.045) (0.125) (0.150) t R : AIndex ≥0.88 0.399 0.302 0.164 0.523 64 4 t and S ≥−0.13 (0.157) (0.065) (0.139) (0.157) t t T-HAR-DRD All o R : VIX <2.65 0.267 0.099 0.113 0.090 314 1 t (0.187) (0.020) (0.048) (0.078) n R : 2.91>VIX ≥2.65 0.341 0.105 0.285 0.170 225 2 t and rDJ <0.06% (0.173) (0.023) (0.062) (0.062) t R : 2.91>VIX ≥2.65 0.301 0.065 0.316 0.247 247 3 t and rDJ ≥0.06% (0.180) (0.026) (0.078) (0.078) t t R : 3.24>VIX ≥2.91 0.437 0.142 0.299 0.008 110 4 nt and rDJ <−0.36% (0.152) (0.047) (0.103) (0.096) t R : 3.24>VIX ≥2.91 0.375 0.097 0.205 0.258 204 5 t anid rDJ ≥−0.36% (0.167) (0.036) (0.060) (0.082) t r R : VIX ≥3.24 0.545 0.193 0.324 0.035 158 6 t (0.130) (0.044) (0.074) (0.090) p Note: The table reports the estimation results of the variance and correlation models over the first rolling efive-yearwindow. PanelAshowsthesummarystatisticsoftheestimatedparametersfortheHARmodelsoflog realizedvarianceacrossthe35stocks. PanelBreportsinthefirstcolumntheempiricalmean,andthestandard deviation in parentheses, of the average correlation across all stock-pairs. Columns two through four in Panel B rreporttheparameterestimates,aswellasblock-bootstrappedstandarderrorsinparentheses(10,000replications withablock-lengthof22). Thenumberofobservationsinthetimeseriesdimension(i.e. days)areshowninthe P last column of Panel B. 20 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 44,
    "chunk_index": 39,
    "word_count": 356,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "over the first rolling efive-yearwindow. PanelAshowsthesummarystatisticsoftheestimatedparametersfortheHARmodelsoflog realizedvarianceacrossthe35stocks. PanelBreportsinthefirstcolumntheempiricalmean,andthestandard deviation in parentheses, of the average correlation across all stock-pairs. Columns two through four in Panel B rreporttheparameterestimates,aswellasblock-bootstrappedstandarderrorsinparentheses(10,000replications withablock-lengthof22). Thenumberofobservationsinthetimeseriesdimension(i.e. days)areshowninthe P last column of Panel B. 20 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 44,
    "chunk_index": 40,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d Consistent with the findings of related studies (e.g. Drake et al., 2017; Huang et al., 2019), e over this partition cell the average expected correlation is slightly lower and the process less persistent compared to the estimates of the HAR-DRD model.22 The remaiwning three partition cells capture instead periods where the stock returns correlate more. In particular, when AIndex t is above its 75%-quantile and S below its historical median (partitioen cell R ), the average t 2 expected correlation amounts to 0.446 and the persistency of the realized correlation process i increases, as shown by the estimates of a , b , and c . v i i i The last part of Table 4 reports the estimation results for the T-HAR-DRD All model. e In other words, we add to the predictor space also the daily return of the DJIA and the log r VIX Index. In this setting, none of the sentiment and attention variables are selected by our estimation procedure. Determining the partition cells with rDJ and VIX leads to a larger rt t reduction in the (in-sample) loss function of the T-HAR-DRD model than when using sentiment e and attention measures. The DJIA return and the VIX Index define six partition cells that e reflect the classical asymmetries in stock return correlations documented in the literature (e.g. Ang & Chen, 2002). For example, wphen the VIX t is below its 25%-quantile (calm and low- volatility period), the average correlation is below its full sample average and the persistency in the realized correlation process is lower than that estimated by Oh and Patton’s (2016) model. t Incontrast,whentheVIXInodexisaboveitshistorical88%-quantile,thestocksinoursampleare highlycorrelated: onaveragethecorrelationamountsto0.545. Similarly, whentheVIXIndexis n between its 63%- and 88%-quantile and the daily DJIA return is below −0.36% (corresponding to its 25%-quantile), the empirical average of the mean realized correlation amounts to 0.437. t The results presented in the last two paragraphs are not meant to provide evidence in favor n or against the predictive power of investors’ sentiment and attention. Table 4 simply show- i cases how the T-HAR-DRD model expends upon the baseline model of Oh and Patton (2016) r by incorporating well-known empirical findings, such as the leverage effect. In particular, Ta- p ble 4 only reports the estimation results for the first five-year rolling estimation window and e the relevance of the predictors might change over time. To answer our research question, we will therefore present in the reminder of this paper the out-of-sample forecasting results of the r Pdifferent models. 22ForT →∞,whereT isthenumberofobservationsinpartitioncellR ,RCorr convergestoE[RCorr |X ∈ i i i i t t R ]. i 21 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 44,
    "chunk_index": 41,
    "word_count": 448,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "we will therefore present in the reminder of this paper the out-of-sample forecasting results of the r Pdifferent models. 22ForT →∞,whereT isthenumberofobservationsinpartitioncellR ,RCorr convergestoE[RCorr |X ∈ i i i i t t R ]. i 21 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 44,
    "chunk_index": 42,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d 4.2 Out-of-sample prediction results e Turning our attention to the out-of-sample results, Table 5 summarizes the forecasting accuracy w of the six models. The table reports the average loss of each model relative to that of the HAR-DRD model. For each forecast horizon and loss function, the lowest loss is highlighted in e boldface. Moreover, models belonging to the 90% and 70% model confidence sets are marked with superscripts a and b, respectively. i v The HAR model suggested by Chiriac and Voev (2011) is not able to outperform the HAR- DRD model of Oh and Patton (2016). The T-HAR-DRD Seentiment-Attention model outper- forms the baseline model in terms of both realized correlation and covariance forecasts up to r the 5-day horizon. Its value-at-risk forecasts are instead only more accurate than those of the HAR-DRD model at the 1-day horizon. Except for trhe 22-day horizon, the T-HAR-DRD Lever- age model outperforms the baseline model in teerms of realized correlation, realized covariance, and value-at-risks forecasts. Adding to this model sentiment and attention measures does not e improve particularly its forecasting accuracy. p In terms of the Euclidean distance loss function, the overall best predictive accuracy for the realized correlation and covariance matrices is achieved by the RF-HAR-DRD model. At the 5-day horizon, for instance, the tmodel improves the accuracy of realized correlation forecasts o of Oh and Patton’s (2016) model by 7.3%. Moreover, the RF-HAR-DRD model outperforms the baseline model also at longer forecasting horizons. The reason for this good predictive n performance might be attributed to the higher complexity of the model. While for the T-HAR- DRD models we overcome issues related to overfitting by pruning the tree structure and defacto t reducetheirconmplexity, fortheRF-HAR-DRDmodelsweusea“bagging” andrandompredictor selection approach. i The Tr-HAR-DRD Leverage model achieves the overall most accurate value-at-risk forecasts. Sincepwe consider only the value-at-risks for long portfolio positions, to obtain good predictions of VaRγ it is particularly important to accurately forecast the realized covariance matrix during t e days with extreme negative returns. The predictors of the T-HAR-DRD Leverage model are r specificallychosentocapturetheincreasedcorrelationinstockreturnsduringmarketdownturns, P and it is therefore not surprising that this model performs particularly well in forecasting value- at-risks. The model confidence set results confirm these findings. At the 1-day horizon, the T-HAR- 22 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 44,
    "chunk_index": 43,
    "word_count": 390,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "model are r specificallychosentocapturetheincreasedcorrelationinstockreturnsduringmarketdownturns, P and it is therefore not surprising that this model performs particularly well in forecasting value- at-risks. The model confidence set results confirm these findings. At the 1-day horizon, the T-HAR- 22 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 44,
    "chunk_index": 44,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d Table 5: Realized correlations, covariance, and value-at-risk forecasting results e HAR HAR-DRD T-HAR- T-HAR- T-HAR- RF-HAR- DRD DRD DRD DRD Leverage Sent.-Att. All w 1-day ahead prediction RCorr 1.120 1.000 0.966a 0.977 0.967a 0.956a,b RCov 1.265 1.000a 0.976a,b 0.973a,b 0e.975a,b 0.978a,b VaR 1.201 1.000 0.945a,b 0.976 0.953a,b 0.955a,b 1% VaR 1.062 1.000 0.983a,b 0.993a 0.987a,b 0.988a,b 5% VaR 1.030 1.000 0.991a,b 0.994a,b i0.991a,b 0.993a,b 10% v 5-day ahead prediction RCorr 1.059 1.000 0.971a,b 0.983a,b 0.968a,b 0.927a,b e RCov 1.185a 1.000a,b 0.969a,b 0.972a,b 0.984a,b 0.975a,b VaR 1.050 1.000a 0.986a,b 1.001a,b 0.985a,b 0.985a,b 1% VaR 5% 1.016a,b 1.000a,b 0.995a,b 1r.000a,b 0.999a,b 0.996a,b VaR 1.011a,b 1.000a,b 0.998a,b 1.001a,b 1.002a,b 0.998a,b 10% 10-day ahead prediction r RCorr 1.054 1.000a,b 0.990a,b 1.006a,b 0.988a,b 0.948a,b RCov 1.119a 1.000a,b 0.999ea,b 1.000a 0.981a,b 0.978a,b VaR 1.059a 1.000a,b 0.996a,b 1.003a,b 0.996a,b 0.987a,b 1% VaR 1.013a,b 1.000a,b 0.995a,b 1.004a,b 1.000a,b 0.999a,b 5% e VaR 1.005a,b 1.000a,b 0.997a,b 1.002a,b 1.000a,b 0.999a,b 10% 22-day ahead prediction p RCorr 1.042a,b 1.000a,b 1.006a,b 1.023a,b 1.007a,b 0.973a,b RCov 1.075a 1.000a 0.998a,b 1.002a 0.984a,b 0.988a,b VaR 1% 1.067a 1.000a ,b 1.003a,b 1.016a,b 0.998a,b 1.009a,b VaR 1.010a,b 1.000a,b 1.000a,b 1.005a,b 1.002a,b 1.004a,b 5% t VaR 1.002a,b 1.000a,b 0.998a,b 1.002a,b 1.000a,b 1.001a,b 10% o Note: Thetablereportsthe1-day,5-day,10-day,and22-dayaheadforecastingresultsoftherealizedcovariance matrix, realized correlation matrix, and the value-at-risk of an equally weighted portfolio. The models are n estimatedevery22observationsoverarollingwindowoffiveyearsandaminimumof10observationsperstock- pairisrequiredin eachpartitioncell. Multi-periodforecastsareobtainedbydirectpredictions. Forecastsofthe correlationandcovariancematrixareevaluatedintermsoftheEuclideandistancelossfunction. Value-at-risksare computed using filtered historical simulations (10,000 replications) and assessed with the quantile loss function. All results are reportetd relative to the average loss of the HAR-DRD model, and the lowest loss is highlighted in boldface. Models belonging to the 90% and 70% model confidence sets are marked with superscripts a and b, n respectively. i DRD Leverage, T-HAR-DRD All, and RF-HAR-DRD model are almost always included in the r 90% MCS. The size of the model confidence set increases with the prediction horizon. Forecasts p over longer horizons have a larger variance and it becomes increasingly difficult to identify e statistically significant differences between the models. Nevertheless, the general pattern in the rMCS results confirms our findings also at horizons larger than one day. In particular, for all Pevaluation approaches and prediction horizons, the RF-HAR-DRD model is included in the 90% and 70% MCS. Besides for the 1-day ahead predictions of the realized correlation matrix, the T- HAR-DRD Leverage and T-HAR-DRD All are also always included in the 90% and 70% model 23 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 44,
    "chunk_index": 45,
    "word_count": 409,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "included in the 90% and 70% MCS. Besides for the 1-day ahead predictions of the realized correlation matrix, the T- HAR-DRD Leverage and T-HAR-DRD All are also always included in the 90% and 70% model 23 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 44,
    "chunk_index": 46,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d confidence set. The model least often included in the 90% MCS is the simple HAR model. e The results clearly show that the tree-structured extension of the HAR-DRD model has predictivepowerandcanoutperformthebaselinemodelofOhandPatton(2w016). Inparticular, we find that the daily DJIA return and the VIX Index improve the predictive performance for value-at-risk forecasts. Thanks to its higher complexity (i.e. a finer peartition of the predictor space),theRF-HAR-DRDmodelproducesthemostaccurateforecastsoftherealizedcorrelation i matrix. v e 4.3 Importance of the predictors r In order to quantify the contribution of the predictors to the forecasting power of the T-HAR- DRD models, we introduce the concept of predictor importance. Building upon the concept of r variable importance from the CART literature (see e.g. Hastie et al., 2009, pp. 593-594), we e define the importance of a predictor by summing up the reductions in the loss function achieved e when defining a new partition based on this predictor in the estimation procedure. Note that we are considering only the reductionpin the Euclidean distance loss for the realized correlation matrix. For the RF-HAR-DRD model, we average the importance of each predictor across all bootstrapped samples. The predictor importances computed over each rolling estimation t window are summed up. o Table 6: Importance of tnhe predictors Panel A: predictor importance in the T-HAR-DRD All model rDJ VIX S AStock AIndex t t t t t t 1-day ahead prediction 16.23 73.80 2.03 0.00 7.95 5-day ahead pnrediction 20.20 65.47 2.00 0.58 11.76 10-day ahead prediction 21.40 55.12 2.26 1.19 20.03 22-day ahead prediction 4.50 52.26 5.50 1.52 36.22 i Panel B:rpredictor importance in the RF-HAR-DRD model p r t DJ VIX t S t AS t tock AI t ndex 1-day ahead prediction 23.02 49.79 8.50 3.23 15.45 5-day ahead prediction 24.89 44.46 9.98 3.61 17.07 e 10-day ahead prediction 24.52 35.28 10.89 6.08 23.24 22-day ahead prediction 15.83 30.15 14.07 10.17 29.78 rNote: The table reports the predictor importance for the T-HAR-DRD All (Panel A) and the RF-HAR-DRD (Panel B) models. The importance of a predictor is defined as the sum of reductions in squared residuals P achieved by defining a partition cell with that predictor. For the RF-HAR-DRD model, we accumulate the importance of each predictor across all bootstrapped samples. The predictor importances computed over each rolling estimation window are summed up. For better readability, the table reports for each prediction horizon the predictor importance relative to the total predictor importance (in %). 24 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 44,
    "chunk_index": 47,
    "word_count": 417,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "bootstrapped samples. The predictor importances computed over each rolling estimation window are summed up. For better readability, the table reports for each prediction horizon the predictor importance relative to the total predictor importance (in %). 24 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 44,
    "chunk_index": 48,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d Table6summarizestheimportanceofthefiveexogenouspredictorsfortheT-HAR-DRDAll e (Panel A) and the RF-HAR-DRD (Panel B) models. For better readability, the table reports for each prediction horizon values relative to the total predictor importancew(in %). The table shows several interesting results. First, most of the predictive power stems from the daily DJIA return and the log VIX Index. For example, at the 1-day prediction horeizon 16.23% and 73.80% of the reduction in the loss function achieved by the T-HAR-DRD All model compared to the i baselinemodelcanbeattributedtorDJ andVIX ,respectively. Svecond,sentimentandattention t t variables contribute to the overall predictive power, in particular at longer prediction horizons. e While the T-HAR-DRD Sentiment-Attention has predictive power only at short forecasting r horizons, in combination with rDJ and VIX , the sentiment and attention measures improve the t t predictions also at longer horizons. Third, our measure of attention to the Dow Jones Index has r more predictive power than the aggregated attention to the 35 stocks. e 4.4 Retail investors’ trading activeity Since 2018, the number of retail invpestors in the U.S. market increased considerably. The largest U.S. online brokers, such as Robinhood, TD Ameritrade, E-Trade, and Schwab, saw a considerable increase in clients. Figure 1 depicts as dots the dollar volume of trades initiated t by retail investors relative too the total dollar trading volume in the 35 stocks in our sample. The solid line represents a 22-day moving average of the daily data points. We identify trades n initiatedbyretailinvestorsusingintra-daytransactionsfromtheTAQdatabaseandbyapplying the approach of Boeh mer, Jones, Zhang, and Zhang (2020).23 The figure shows that the trading t activity of retail investors has considerably increased over the second half of our out-of-sample n period. Duringthisperiod, itislikelythatpricecomovementsaredrivenevenmorebyinvestors’ i behavior, and that retail traders’ sentiment and attention measures have more predictive power r for stock return correlations. p This hypothesis is investigated by focusing on the prediction results for the period from e January 2018 to December 2020. Table 7 reports the forecasting results evaluated over this rtime period. Overall, the best performing models are again the T-HAR-DRD Leverage, the P 23All high-frequency transactions obtained from the TAQ database with exchange code “D” and a price just above (below) a rounded penny are identified as retail initiated buy (sell) transactions. Note that this approach most likely does not capture all transactions initiated by retail investors. Nevertheless, the increase in the proportion of retail trades over time is still a clear indication that the trading activity of retail investors has increased in recent years. 25 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 44,
    "chunk_index": 49,
    "word_count": 426,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "capture all transactions initiated by retail investors. Nevertheless, the increase in the proportion of retail trades over time is still a clear indication that the trading activity of retail investors has increased in recent years. 25 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 44,
    "chunk_index": 50,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "Out−of−sample: LOW Out−of−sample: HIGH 20 retail investor trading volume retail investor trading volume 15 10 5 2010 2015 2020 )% ni( emulov gnidart 'srotsevni liater fo erahS d e w e i v e r r e Figure 1: Dollar volume of retail trades relative to the total dollar volume for the stock in the sample Note: Thefiguredepictsthedailydollarvolumeoftradesinitiatedbyretailinvestorsrelativetothetotaldollar tradingvolumeofthe35stocksinoursample(doets). Forbetterreadability,weplota22-daymovingaverageof the daily data points (solid line). Trades initiated by retail investors are identified using the approach Boehmer et al. (2020). p T-HAR-DRD All, and the RF-HAR-DRD. At the 1-day and 5-day horizon, the outperformance of these models compared to thetbaseline model are even larger than those reported in Table 5. o More interesting is the comparison between the T-HAR-DRD Leverage and the T-HAR-DRD All model. Except for the 5-day ahead realized covariance matrix, when we add sentiment and n attentionmeasurestothepredictorspacetheaccuracyforcorrelationandcovariancepredictions always increases. For the 10-day and 22-day ahead predictions of the realized covariance matrix, t for instance, including the predictors S , AStock, and AIndex on top of the daily DJIA return and n t t t the VIX Index further increases the accuracy by roughly 2% and 1.5%, respectively. i To quantify this finding, consider the 1-day ahead realized covariance forecasts over the r entirpe out-of-sample period. We then regress the daily percentage reduction in the loss function achieved by the T-HAR-DRD Sentiment-Attention model compared to the Leverage model on e the share of daily retail investors’ trading volume. The estimated coefficients are reported in the rfirst column of Table 8. The right-hand side variable is standardized and Newey-West (1987) P standard errors are reported in the second column of the table. On average, over the entire out-of-sample, the daily loss of the T-HAR-DRD Sentiment-Attention model is on average 1.9% larger than that of the Leverage model. However, when the share of retail trading volume is 26 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 44,
    "chunk_index": 51,
    "word_count": 322,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "table. On average, over the entire out-of-sample, the daily loss of the T-HAR-DRD Sentiment-Attention model is on average 1.9% larger than that of the Leverage model. However, when the share of retail trading volume is 26 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 44,
    "chunk_index": 52,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d e w Table 7: Realized correlations, covariance, and value-at-risk forecasting reseults from January 2018 to December 2020 HAR HAR-DRD T-HAR- T-HAR- iT-HAR- RF-HAR- DRD DRD vDRD DRD Leverage Sent.-Att. All 1-day ahead prediction e RCorr 1.141 1.000 0.957a,b 0.965a,b 0.951a,b 0.947a,b RCov 1.296a 1.000a 0.975a,b 0.969a,b 0.973a,b 0.977a,b r VaR 1.199 1.000 0.923a,b 0.974 0.930a,b 0.944 1% VaR 5% 1.065 1.000 0.975a,b 0.992 0.980a 0.984 VaR 1.031 1.000 0.986a,b 0.992a 0.987a,b 0.991a 10% r 5-day ahead prediction e RCorr 1.089 1.000a 0.956a,b 0.973a,b 0.955a,b 0.910a,b RCov 1.192a 1.000a,b 0.968a,b 0.971a,b 0.984a,b 0.975a,b VaR 1.067 1.000a e0.976a,b 1.003a 0.977a,b 0.978a,b 1% VaR 1.020a,b 1.000a,b 0.989a,b 1.001a,b 0.995a,b 0.993a,b 5% VaR 1.014a,b 1.000a,b 0.994a,b 1.001a,b 0.998a,b 0.995a,b 10% p 10-day ahead prediction RCorr 1.087 1.000a,b 1.011a,b 1.009a,b 0.991a,b 0.951a,b RCov 1.121a 1.000a,b 0.999a 1.000a 0.980a,b 0.978a,b VaR 1.084 1.00t0a,b 0.989a,b 1.006a 0.987a,b 0.983a,b 1% VaR 5% 1.022a,b o1.000a,b 0.993a,b 1.005a,b 1.001a,b 0.999a,b VaR 1.012a,b 1.000a,b 0.997a,b 1.002a,b 1.002a,b 1.000a,b 10% 22-day ahead prediction n RCorr 1.074a,b 1.000a,b 1.023a,b 1.019a,b 1.006a,b 0.994a,b RCov 1.076a 1.000a 0.998a,b 1.002a 0.984a,b 0.988a,b VaR 1.088 1.000a,b 1.003a,b 1.018a,b 0.994a,b 1.009a,b 1% VaR 1.02t1a,b 1.000a,b 1.002a,b 1.006a,b 1.002a,b 1.006a,b 5% VaR 1.011a,b 1.000a,b 1.000a,b 1.002a,b 1.001a,b 1.002a,b 10% n Note: Thetablereportsthe1-day,5-day,10-day,and22-dayaheadforecastingresultsoftherealizedcovariance matrix, realizeid correlation matrix, and the value-at-risk of an equally weighted portfolio from January 2010 to December r2020. The models are estimated every 22 observations over a rolling window of five years and a minimumof10observationsperstock-pairisrequiredineachpartitioncell. Multi-periodforecastsareobtained bydirpectpredictions. ForecastsofthecorrelationandcovariancematrixareevaluatedintermsoftheEuclidean distancelossfunction. Value-at-risksarecomputedusingfilteredhistoricalsimulations(10,000replications)and assessed with the quantile loss function. All results are reported relative to the average loss of the HAR-DRD emodel, and the lowest loss is highlighted in boldface. Models belonging to the 90% and 70% model confidence sets are marked with superscripts a and b, respectively. r P 27 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 44,
    "chunk_index": 53,
    "word_count": 306,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "the average loss of the HAR-DRD emodel, and the lowest loss is highlighted in boldface. Models belonging to the 90% and 70% model confidence sets are marked with superscripts a and b, respectively. r P 27 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 44,
    "chunk_index": 54,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d two standard deviations above its mean, the daily loss of the T-HAR-DRD Sentiment-Attention e is 2.6% smaller than that of the T-HAR-DRD Leverage model. In other words, accounting for sentiment and attention during periods of high trading activity of retail invwestors improves the forecasts for RCorr and RCov . However, the T-HAR-DRD Leverage model still produces the t t overallmostaccuratevalue-at-riskforecastsforthe1-day, 5-day, and10e-daypredictionhorizons. Table 8: Relationbetweenretailinvestors’tradingactivityandthelossreductionachievedbysentiment i and attention variables v Dependent variable: Loss reduction (in %) Estimate Standeard error t-statistic Intercept -1.925 0.475 -4.055 Share retail trading volume 2.256 0.523 4.310 r Observations 1,509 Adjusted R2 1.95% r Note: The table reports in the first column the estimates for the regression of the loss reduction (in %) on the share of retail investors’ trading volume (standardiezed). The loss reduction is measured as the percentage reduction in daily Euclidean distance loss achieved by the T-HAR-DRD Sentiment-Attention model compared to the Leverage model when forecasting the realized covariance matrix. The right-hand side variable is defined e as the ratio between the dollar volume of trades initiated by retail investors and the total daily dollar trading volume. WeidentifyallsuchtradesusingtheapproachintroducedbyBoehmeretal.(2020). Newey-West(1987) standard errors and the respective t-statistics are reported in the second and third column. p 5 Conclusion t o This study analyzes whether the sentiment-based theories of price comovements have out-of- n samplepredictivepowerforrealizedcorrelationsandcovariances. First, weproposeanextension of the realized covaria nce model introduced by Oh and Patton (2016) to allow exogenous predic- t tors to have a non-linear influence on the model’s predictions while still ensuring the forecasted n matrices’ positive definiteness. Second, we construct sentiment and attention measures using social mediaiand web-search query data. Together with the daily DJIA return and the VIX r Index, we analyze the predictive out-of-sample power of these measures for 35 stocks that are p or have been part of the Dow Jones Industrial Average Index. e The findings show that (i) our model significantly outperforms other realized covariance and correlation models, (ii) more complex models perform especially well for forecasts at longer r horizons, (iii) the predictive power of investors’ sentiment and attention measures for realized P correlationsandcovariancesovertheentiresampleissmall, but, (iv)withgrowingretailinvestor trading activity, their forecasting power has increased over recent years. 28 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 44,
    "chunk_index": 55,
    "word_count": 378,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "perform especially well for forecasts at longer r horizons, (iii) the predictive power of investors’ sentiment and attention measures for realized P correlationsandcovariancesovertheentiresampleissmall, but, (iv)withgrowingretailinvestor trading activity, their forecasting power has increased over recent years. 28 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775 d Our results have several implications for both the academic literature and practitioners. e It is crucial for practitioners to accurately forecast stock price comovements for managing a portfolio’s risk, even more so during volatile times. The increasing numbewr of retail investors in the market underlines the importance of accounting for their behavior when predicting stock return correlations. The model introduced in this study may serve as aebuilding block for future work, allowing researchers to further investigate the role of retail investors, or to analyze the i predictive power of other exogenous variables for realized correlavtions and variances. e r r e e p t o n t n i r p e r P 29 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 30,
    "page_range": "p.30-31",
    "total_pages": 44,
    "chunk_index": 56,
    "word_count": 180,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.30-31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "retail investors, or to analyze the i predictive power of other exogenous variables for realized correlavtions and variances. e r r e e p t o n t n i r p e r P 29 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775 d References e Andersen, T. G., Bollerslev, T., Diebold, F. X., & Ebens, H. (2001). The distribution of realized w stock return volatility. Journal of Financial Economics, 61(1), 43–76. Andersen, T. G., Bollerslev, T., Diebold, F. X., & Labys, P. (2003). Modeling and Forecasting e Realized Volatility. Econometrica, 71(2), 579–625. Ang, A., & Chen, J. (2002). Asymmetric correlations of equity portfoilios. Journal of Financial v Economics, 63(3), 443–494. e Antweiler, W., & Frank, M. Z. (2004). Is all that talk just noise? The information content of Internet stock message boards. Journal of Finance, 59(3), 1259–1294. r Audrino, F., & Bühlmann, P. (2001). Tree-structured generalized autoregressive conditional heteroscedastic models. Journal of the Royarl Statistical Society: Series B (Statistical e Methodology), 63(4), 727–744. Audrino, F., & Corsi, F. (2010). Modeling tick-by-tick realized correlations. Computational e Statistics & Data Analysis, 54(11), 2372–2382. p Audrino, F., Sigrist, F.,&Ballinari, D. (2020). Theimpactofsentimentandattentionmeasures on stock market volatility. Int ernational Journal of Forecasting, 36(2), 334–357. t Audrino, F., & Trojani, F. (2006). Estimating and predicting multivariate volatility thresholds o in global stock markets. Journal of Applied Econometrics, 21(3), 345–369. Audrino, F., & Trojanin, F. (2011). A General Multivariate Threshold GARCH Model With Dynamic Conditional Correlations. Journal of Business & Economic Statistics, 29(1), 138–149. t Barber, B. M.n, Odean, T., & Zhu, N. (2009). Systematic noise. Journal of Financial Markets, 12(4), 547–569. i Barberis,rN., & Shleifer, A. (2003). Style investing. Journal of Financial Economics, 68(2), p 161–199. Barberis, N., Shleifer, A., & Wurgler, J. (2005). Comovement. Journal of Financial Economics, e 75(2), 283–317. r Barndorff-Nielsen, O. E., Hansen, P. R., Lunde, A., & Shephard, N. (2009). Realized kernels in P practice: trades and quotes. The Econometrics Journal, 12(3), C1–C32. Barndorff-Nielsen, O. E., & Shephard, N. (2004). Econometric analysis of realized covaria- 30 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 44,
    "chunk_index": 57,
    "word_count": 358,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "E., Hansen, P. R., Lunde, A., & Shephard, N. (2009). Realized kernels in P practice: trades and quotes. The Econometrics Journal, 12(3), C1–C32. Barndorff-Nielsen, O. E., & Shephard, N. (2004). Econometric analysis of realized covaria- 30 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 44,
    "chunk_index": 58,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d tion: High frequency based covariance, regression, and correlation in financial economics. e Econometrica, 72(3), 885–925. Barone-Adesi, G., Bourgoin, F., & Giannopoulos, K. (1998). Don’t loowk back. Risk, 11, 100–103. Bauer, G. H., & Vorkink, K. (2011). Forecasting multivariate realizedestock market volatility. Journal of Econometrics, 160(1), 93–101. i Bauwens, L., Grigoryeva, L., & Ortega, J. P. (2016). Estimativon and empirical performance of non-scalar dynamic conditional correlation models. Computational Statistics and Data e Analysis, 100, 17–36. r Bergmeir, C., & Benítez, J. M. (2012). On the use of cross-validation for time series predictor evaluation. Information Sciences, 191, 192 - 213. (Data Mining for Software Trustworthi- r ness) e Boehmer, E., Jones, C. M., Zhang, X., & Zhang, X. (2020). Tracking retail investor activity. e Journal of Finance, Forthcoming. Bollerslev, T., Hood, B., Huss, J., &pPedersen, L. H. (2018). Risk Everywhere: Modeling and Managing Volatility. The Review of Financial Studies, 31(7), 2729–2773. Bollerslev, T., Patton, A. J., & Quaedvlieg, R. (2018). Modeling and forecasting (un)reliable t realized covariances foromore reliable financial decisions. Journal of Econometrics, 207(1), 71–91. n Bollerslev, T., Patton, A. J., & Quaedvlieg, R. (2020). Multivariate leverage effects and realized semicovariance GARCH models. Journal of Econometrics, 217(2), 411–430. t Breiman, L. (2001). Random Forests. Machine Learning, 45, 5–32. n Breiman, L., Friedman, J., Stone, C., & Olshen, R. (1984). Classification and regression trees. i Taylor & Francis. r Cappiello,L.,Engle,R.F.,&Sheppard,K.(2006,09).AsymmetricDynamicsintheCorrelations p of Global Equity and Bond Returns. Journal of Financial Econometrics, 4(4), 537–572. e Chiriac, R., & Voev, V. (2011). Modelling and forecasting multivariate realized volatility. Journal of Applied Econometrics, 26(6), 922–947. r PCookson, J. A., & Niessner, M. (2020). Why Don’t We Agree? Evidence from a Social Network of Investors. Journal of Finance, 75(1), 173–228. Corsi, F. (2009). A Simple Approximate Long-Memory Model of Realized Volatility. Journal 31 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 44,
    "chunk_index": 59,
    "word_count": 312,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "PCookson, J. A., & Niessner, M. (2020). Why Don’t We Agree? Evidence from a Social Network of Investors. Journal of Finance, 75(1), 173–228. Corsi, F. (2009). A Simple Approximate Long-Memory Model of Realized Volatility. Journal 31 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 44,
    "chunk_index": 60,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d of Financial Econometrics, 7(2), 174–196. e Da, Z., Engelberg, J., & Gao, P. (2011). In Search of Attention. Journal of Finance, 66(5), 1461–1499. w De Long, J. B., Shleifer, A., Summers, L. H., & Waldmann, R. J. (1990). Noise Trader Risk in Financial Markets. Journal of Political Economy, 98(4), 703–738e. deGoeij,P.,&Marquering,W. (2004). ModelingtheConditionalCovarianceBetweenStockand i Bond Returns: A Multivariate GARCH Approach. Journval of Financial Econometrics, 2(4), 531–564. e Dimpfl, T., & Jank, S. (2016). Can Internet Search Queries Help to Predict Stock Market r Volatility? European Financial Management, 22(2), 171–192. Drake, M. S., Jennings, J., Roulstone, D. T., & Thornock, J. R. (2017). The Comovement of r Investor Attention. Management Science, 63(9), 2847–2867. e Engle, R. (2002). Dynamic conditional correlation. Journal of Business & Economic Statistics, e 20(3), 339–350. Fengler, M. R., & Okhrin, O. (2016).pManaging risk with a realized copula parameter. Compu- tational Statistics & Data Analysis, 100, 131–152. Francq, C., & Zakoïan, J.-M. (2012). QML estimation of a class of multivariate asymmetric t GARCH models. Econoometric Theory, 28(1), 179–206. Frijns, B., Verschoor, W. F. C., & Zwinkels, R. C. J. (2017). Journal of International Financial n Markets , Institutions & Money Excess stock return comovements and the role of investor sentiment. Jour nal of International Financial Markets, Institutions & Money, 49, 74–87. t Ghysels, E., Santa-Clara, P., & Valkanov, R. (2006). Predicting volatility: getting the most out n of return data sampled at different frequencies. Journal of Econometrics, 131(1), 59–95. i González-Rivera, G., Lee, T.-H., & Mishra, S. (2004). Forecasting volatility: A reality check r based on option pricing, utility function, value-at-risk, and predictive likelihood. Interna- p tional Journal of Forecasting, 20(4), 629–645. e Granger, C. W. J., & Newbold, P. (1976). Forecasting Transformed Series Author. Journal of the Royal Statistical Society. Series B (Methodological), 38(2), 189–203. r PGreen, T. C., & Hwang, B.-H. (2009). Price-based return comovement. Journal of Financial Economics, 93(1), 37–50. Hansen, P. R., Lunde, A., & Nason, J. M. (2011). The Model Confidence Set. Econometrica, 32 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 44,
    "chunk_index": 61,
    "word_count": 346,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "(Methodological), 38(2), 189–203. r PGreen, T. C., & Hwang, B.-H. (2009). Price-based return comovement. Journal of Financial Economics, 93(1), 37–50. Hansen, P. R., Lunde, A., & Nason, J. M. (2011). The Model Confidence Set. Econometrica, 32 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 44,
    "chunk_index": 62,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d 79(2), 453–497. e Hastie, T., Tibsshirani, R., & Friedman, J. (2009). The Elemnts os Statistical Learning (Second ed.). New York: Springer Science. w Hirshleifer, D., & Teoh, S. H. (2003). Limited attention, information disclosure, and financial reporting. Journal of Accounting and Economics, 36(1), 337-386e. Holm, S. (1979). A Simple Sequentially Rejective Multiple Test Procedure. Scandinavian i Journal of Statistics, 6(2), 65–70. v Huang, S., Huang, Y., & Lin, T.-C. (2019). Attention allocation and return co-movement: e Evidence from repeated natural experiments. Journal of Financial Economics, 132(2), r 369–383. Kumar, A., & Lee, C. M. (2006). Retail Investor Sentiment and Return Comovements. The r Journal of Finance, 61(5), 2451–2486. e Kumar,A.,Page,J.K.,&Spalt,O.G. (2012,04). InvestorSentimentandReturnComovements: e Evidence from Stock Splits and Headquarters Changes. Review of Finance, 17(3), 921– 953. p Kumar,A.,Page,J.K.,&Spalt,O.G. (2016). GamblingandComovement. JournalofFinancial and Quantitative Analysis, 51(1), 85-–111. t Laurent, S., Rombouts, J. Vo., & Violante, F. (2013). On loss functions and ranking forecasting performances of multivariate volatility models. Journal of Econometrics, 173(1), 1–10. n McAleer, M., Hoti, S., & Chan, F. (2009). Structure and Asymptotic Theory for Multivariate Asymmetric Co nditional Volatility. Econometric Reviews, 28(5), 422–440. t Newey, W. K., & West, K. D. (1987). A simple, positive semi-definite, heteroskedasticity and n autocorrelation consistent covariance matrix. Econometrica, 55(3), 703–708. i Oh, D. H., & Patton, A. J. (2016). High-dimensional copula-based distributions with mixed r frequency data. Journal of Econometrics, 193(2), 349–366. (The Econometric Analysis of p Mixed Frequency Data Sampling) e Racine, J. (2000). Consistent cross-validatory model-selection for dependent data: hv-block cross-validation. Journal of Econometrics, 99(1), 39 - 61. r PRenault, T. (2017). Intraday online investor sentiment and return patterns in the U.S. stock market. Journal of Banking & Finance, 84, 25-40. Renault, T. (2019). Sentiment analysis and machine learning in finance: a comparison of 33 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 44,
    "chunk_index": 63,
    "word_count": 310,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "PRenault, T. (2017). Intraday online investor sentiment and return patterns in the U.S. stock market. Journal of Banking & Finance, 84, 25-40. Renault, T. (2019). Sentiment analysis and machine learning in finance: a comparison of 33 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775 d methods and models on one million messages. Digital Finance, 1–13. e Symitsi, E., Symeonidis, L., Kourtis, A., & Markellos, R. (2018). Covariance forecasting in equity markets. Journal of Banking & Finance, 96, 153–168. w Tse,Y.K.,&Tsui,A.K.C. (2002). AMultivariateGeneralizedAutoregressiveConditionalHet- eroscedasticity Model With Time-Varying Correlations. Journal eof Business & Economic Statistics, 20(3), 351–362. i v e r r e e p t o n t n i r p e r P 34 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 35,
    "page_range": "p.35-36",
    "total_pages": 44,
    "chunk_index": 64,
    "word_count": 135,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.35-36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "Tse,Y.K.,&Tsui,A.K.C. (2002). AMultivariateGeneralizedAutoregressiveConditionalHet- eroscedasticity Model With Time-Varying Correlations. Journal eof Business & Economic Statistics, 20(3), 351–362. i v e r r e e p t o n t n i r p e r P 34 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775 d A Bias correction e Oh and Patton’s (2016) model separately defines the dynamics of realized variances and corre- w lations. Forecasts for the entire realized covariance matrix are obtained through the transfor- mation outlined in Equation (8). Due to the non-linear nature of the aggregation of volatility e and correlation predictions, as long as realized variances and correlations are dependent the realized covariance matrix forecasts are biased. We propose an empiirical bias correction to as- v sess the severity of the bias for the out-of-sample realized covariance predictions. Chiriac and e Voev (2011), as well as Bauer and Vorkink (2011), proposed empirical corrections for the bias induced by the Cholesky factorization and the matrix logarithm. They estimate an empirical r bias correction factor from the ratio between the true and fitted realized volatility. We extend this idea to the entire covariance matrix and definerthe empirical bias correction factor as: e (cid:16) (cid:17) RCov bc = med {ν }T(cid:101)−1 with ν = ji,t+1|t (A1) ji ji,t+1|t t=T(cid:101)−eW ji,t+1|t R (cid:92) Cov ji,t+1|t p for j = 1,...,N and i = 1,...,N, where T(cid:101) is the last observation of the rolling estimation win- dowoflengthW. ThebiascorrectionfactorsareestimatedfortheHAR-DRDmodelanditstree- (cid:92)bc (cid:92) structured extensions. Bias-corretcted forecasts are obtained as RCov = bc RCov . ji,t+1|t ji ji,t+1|t o Panel A in Table A1 reports the summary statistics of the estimated bias correction factors. The results indicate that the non-linear transformation outlined in Equation (8) induces a bias. n The bias correction factors are of a similar magnitude as those reported by Chiriac and Voev (2011) for the Cholesky decomposition. In Panel B of Table A1, the accuracy of the bias- t corrected forecnasts for 1-day ahead realized covariance predictions are presented. We evaluate the predictive accuracy in terms of the Euclidean distance. The reported losses are relative to i the corresrponding loss obtained without applying the empirical bias correction, where a value largepr than one indicates that the bias correction reduces the model’s predictive accuracy. The forecasting results clearly show that the empirical bias correction does not improve the accuracy e thereof. On the contrary, for all model specifications, the uncorrected versions outperform the rbias-corrected forecasts and we can reject the null hypothesis of equal predictive accuracy at the P 10% level with Bonferroni-Holm corrected p-values (Holm, 1979). Thebiasappearstobesmallinmagnitudeandasimpleempiricalcorrectiondoesnotimprove the forecasting results of the HAR-DRD model or its tree-structured extensions. Therefore, this 35 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 44,
    "chunk_index": 65,
    "word_count": 461,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "we can reject the null hypothesis of equal predictive accuracy at the P 10% level with Bonferroni-Holm corrected p-values (Holm, 1979). Thebiasappearstobesmallinmagnitudeandasimpleempiricalcorrectiondoesnotimprove the forecasting results of the HAR-DRD model or its tree-structured extensions. Therefore, this 35 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 44,
    "chunk_index": 66,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d study does not correct the bias induced by the non-linearity of Equation (8) and leaves the e derivation of an analytical bias correction for future research. Table A1: Summary of the results with empirical bias correction w Panel A: Summary statistics of the empirical bias correction factor HAR-DRD T-HAR- T-HAR- T-HAR- RF-HAR- e DRD DRD DRD DRD Leverage Sent.-Att. All i Mean 0.887 0.893 0.894 0.891 0.887 Standard deviation 0.025 0.021 0.021 v0.022 0.024 25%-quantile 0.872 0.880 0.881 0.877 0.872 Median 0.889 0.894 0.895 0.891 0.889 e 75%-quantile 0.904 0.907 0.908 0.906 0.904 Panel B: Realized covariance forecast results with bias correction r HAR-DRD T-HAR- T-HAR- T-HAR- RF-HAR- DRD DRD DRD DRD Leverage rSent.-Att. All Euclidean RCov 1.109∗ 1.10e2∗ 1.116∗ 1.106∗ 1.108∗ Note: The table summarizes the results of the empirical bias correction of the HAR-DRD model of Oh and Patton (2016) and its tree-structured extensions. More precisely, Panel A reports summary statistics of the e empirical bias correction factors estimated over a rolling window of five years. The empirical bias correction factor is defined as the median of the ratio between the true and the fitted one-day ahead realized covariance. Panel B reports the loss, in terms of the Eculidean distance, of 1-day ahead bias-corrected realized covariance p predictions. The reported losses are relative to the corresponding loss obtained without applying the empirical biascorrection,i.e.,avaluelargerthan1indicatesthatthebiascorrectionreducesthemodel’spredictiveaccuracy. ResultsforwhichDiebold-Marianotwo-si dedtestsrejectthehypothesisofequalforecastingaccuracyatthe1%, 5%, and 10% level, after applying the Bonferroni-Holm correction (Holm, 1979), are marked respectively with ∗∗∗, ∗∗, and ∗. t o n t n i r p e r P 36 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 44,
    "chunk_index": 67,
    "word_count": 273,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "the empirical biascorrection,i.e.,avaluelargerthan1indicatesthatthebiascorrectionreducesthemodel’spredictiveaccuracy. ResultsforwhichDiebold-Marianotwo-si dedtestsrejectthehypothesisofequalforecastingaccuracyatthe1%, 5%, and 10% level, after applying the Bonferroni-Holm correction (Holm, 1979), are marked respectively with ∗∗∗, ∗∗, and ∗. t o n t n i r p e r P 36 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 44,
    "chunk_index": 68,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d B Classification of StockTwits messages e We estimate an L1-penalized logistic regression to classify the bullish-bearish labels of Stock- w Twits messages. We use all labelled messages published by StockTwits users up to December 2014. Since the out-of-sample analysis of Section 4 starts in January 2015, we ensure that e the predictions are true ex-ante out-of-sample forecasts. Roughly three quarters of the labelled tweets are marked as bullish, and we therefore apply an under-sampiling approach to obtain a v balanced training sample. The final dataset used to estimate the logistic regression consists of e 1,229,252 observations. We then proceed as follows. First, we clean the raw textual data of the messages. Second, we determine by means of five-fold cross-validation the hyperparameters of r the classification model. Finally, we estimate the penalized logistic regression and evaluate its performance over an out-of-sample dataset. r e We clean the raw textual data as follows. We lower case all alphabetic characters, remove URLs, cashtags, unescapeHTMLescapecodes, decodeACSIIcharacters, replaceallnumbersby e the tag number_tag, and replace emoticons by tags based on the Unicode Common Locale Data p Repository24 (e.g. the emoticon showing a smiling face is replaced by simile_face_tag). We then remove all punctuations, remo ve words consisting of single letters, and shorten characters t that are repeated more than twice (e.g. “niceeee” becomes “nicee”). Finally, we remove the o stop-words “an”, “the”, “and”, “or”, “of”, “at”, “for”, “as”, “to”, “on”. The list of stop-words is rather short since in finance mnany common stop-words such as “up” or “down” have predictive power for the sentiment classification of micro-blogging messages (Renault, 2017, 2019). Similarly, we abstain from lemmatizing or stemming the words in our dataset. In finance, words such as t “shorties” andn“shorting”, for instance, share the same root (“short”) but do not have the same meaning. i Next,rweusethebag-of-wordstechniquetocreateafeaturematrix. Inmoredetail, wecreate p a document-term matrix where each column represents a token and each row corresponds to a socialmediamessage. Tokensaregroupsofoneormorewords25 andthematrixisfilledwiththe e frequencywithwhichsuchatokenappearsinasocialmediamessage. Tocreateadocument-term r matrix we have to define several hyper-parameters. For example, we can specify the maximal P frequencyatokencanoccuracrossallmessages. Wordsorcombinationofwordsthatappeartoo 24See http://www.unicode.org/emoji/charts/full-emoji-list.html. 25A token consisting of n words is referred to as n-gram. 37 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 44,
    "chunk_index": 69,
    "word_count": 372,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "andthematrixisfilledwiththe e frequencywithwhichsuchatokenappearsinasocialmediamessage. Tocreateadocument-term r matrix we have to define several hyper-parameters. For example, we can specify the maximal P frequencyatokencanoccuracrossallmessages. Wordsorcombinationofwordsthatappeartoo 24See http://www.unicode.org/emoji/charts/full-emoji-list.html. 25A token consisting of n words is referred to as n-gram. 37 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 44,
    "chunk_index": 70,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d frequently might carry little predictive power and can be discarded. Similarly, instead of simply e populating the document-term matrix with the frequency a term occurs in a message, we can downweight common words by multiplying their frequency with the so-callewd inverse document frequency.26 For the bag-of-words approach and the penalized logistic regression we determine the following hyperparameters by means of five-fold cross-validation: e(i) the number of words in a token (from only uni-grams up to three-grams), (ii) the maximal number of features in the i document-term matrix (from 25,000 up to 40,000 in steps of 5,00v0), (iii) the maximal frequency a token can appear across all messages (from 70% up to 100% in 10%-steps), (iv) the minimal e frequency a token has to appear across all messages (10−4%, 10−3%, 10−2%, or 10−1%), (v) r whetherthevaluespopulatingthedocument-termmatrixaresimpleterm-frequenciesorrescaled by the document frequency, and lastly (vi) the value multiplying the L1 penalty of the logistic r regression (5·10−7, 10−6, 10−5, or 10−4). e Based on the cross-validation classification accuracy, we construct a document-term matrix e using uni-, bi-, and tri-grams that appear at most in 90% and at least in 10−4% of all messages, set the maximal number of features tpo 35,000, and populate the matrix with term frequencies multiplied by the respective inverse document frequency. The hyperparameter of the penalized logistic regression in set to 10−6. t Weevaluatetheperformaonceofthetrainedclassificationmodelonarandombalancedsample of2,900,109labelledmessagespublishedbetween2015and2020onStockTwits. TableB1reports n the confusion matrix, the accuracy, and Matthews correlation coefficient. The confusion matrix depicts the number o f messages predicted to be bullish or bearish sorted by their actual label. t The overall accuracy is the share of correctly classified messages and Matthews correlation n coefficient (MCC) is defined as: i r TP/N −S ·P MCC = (cid:112) p P ·S ·(1−S)·(1−P) ewhereTP,FP,TN andFN aretruepositives,falsepositives,truenegativesandfalsenegatives, respectively, S = (TP +FN)/N, P = (TP +FP)/N, and N is the total number of classified r messages. MCC ranges between −1 and +1, where a value of 0 indicates that the classifier P 26The term frequency is defined as the number of times a token appears in a message divided by the total number of tokens in that message. The inverse document frequency is defined as log N where N is the total nw number of messages in the sample and n is the number of messages mentioning the token w. w 38 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 44,
    "chunk_index": 71,
    "word_count": 402,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "that message. The inverse document frequency is defined as log N where N is the total nw number of messages in the sample and n is the number of messages mentioning the token w. w 38 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775 d is no better than randomly picking labels and values close to +1 indicate good classification e performance. The performance of the classifier is in line with that reported in related studies (e.g. Cookson & Niessner, 2020; Renault, 2019). w Table B1: Performance of the sentiment classifier Predicted e Bullish Bearish Actual Bullish 1,108,323 i406,079 Bearish 334,133 v1,051,574 Accuracy: 76.37% Matthews correlation coefficient: 47.64% e Note: Thetablesummarisestheperformanceofthepenalizedlogisticregressiontrainedtoclassifythebullish- bearishlabelsofmessagessharedonthesocialmediaplatformStockrTwits. Theclassifieristrainedonabalanced dataset of messages published between 2010 and 2014, and its performance is evaluated on a balanced random dataset of 2,900,109 messages posted between 2015 and 2020. Th e upper part of the table reports the confusion matrix and the lower part the overall accuracy and Matthews correlation coefficient. The accuracy is defined as r (cid:112) A=(TP+TN)/N andMatthewscorrelationcoefficientasMCC =(TP/N−S·P)/( P ·S·(1−S)·(1−P)) where TP, FP, TN and FN are true positives, false peositives, true negatives and false negatives, respectively, S = (TP +FN)/N, P = (TP +FP)/N, and N is the total number of classified messages. We define as true positives the correctly classified bullish messages. e p t o n t n i r p e r P 39 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 44,
    "chunk_index": 72,
    "word_count": 251,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "= (TP +FP)/N, and N is the total number of classified messages. We define as true positives the correctly classified bullish messages. e p t o n t n i r p e r P 39 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 44,
    "chunk_index": 73,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d C Robustness e Table C1: Realized correlation, covariance, and value-at-risk forecasting results for a random sub- sample of five stocks w HAR HAR-DRD T-HAR- T-HAR- T-HAR- RF-HAR- DRD DRD DRD DRD Leverage Sent.-Att. eAll 1-day ahead prediction RCorr 1.030 1.000 0.967 0.986 i0.968 0.952a,b RCov 1.080a 1.000a 0.989a,b 0.986a,bv0.984a,b 0.987a,b VaR 1.068 1.000 0.968a,b 0.997 0.970a,b 0.975a 1% VaR 1.013 1.000 0.988a,b 0.999 0.988a,b 0.991 5% e VaR 1.008 1.000 0.995a,b 1.000 0.995a,b 0.996a,b 10% 5-day ahead prediction r RCorr 1.004 1.000a 0.971a,b 0.983a,b 0.967a,b 0.926a,b RCov 1.088a 1.000a,b 0.992a,b 0.992a,b 0.991a,b 0.989a,b VaR 1.021a 1.000a,b 0.999a,b 0.998a,b 1.000a,b 0.994a,b 1% r VaR 1.001a,b 1.000a,b 0.997a,b 1.000a,b 0.997a,b 0.997a,b 5% VaR 1.000a,b 1.000a,b 1.000ea,b 1.000a,b 1.001a,b 0.999a,b 10% 10-day ahead prediction RCorr 1.002a,b 1.000a,b e1.022a,b 0.999a,b 1.004a,b 0.948a,b RCov 1.054a,b 1.000a,b 0.994a,b 0.999a,b 0.989a,b 0.990a,b VaR 1.023a 1.000a,b 0.999a,b 0.995a,b 0.999a,b 0.994a,b 1% p VaR 1.003a,b 1.000a,b 1.007 0.999a,b 1.003a,b 1.002a,b 5% VaR 1.001a,b 1.000a,b 1.006 1.000a,b 1.001a,b 1.001a,b 10% 22-day ahead prediction RCorr 1.002a,b 1.00 t 0a,b 1.040a 1.022a,b 1.049 0.980a,b RCov 1.038a,b o1.000a,b 1.000a,b 1.001a,b 1.002a,b 0.995a,b VaR 1.029a 1.000a,b 1.010a 1.004a 1.015a 1.008a 1% VaR 1.001a,b 1.000a,b 1.005a,b 1.003a,b 1.008a 1.004a,b 5% VaR 1.001a,bn 1.000a,b 1.002a,b 1.001a,b 1.004 1.002a,b 10% Note: Thetablereports the1-day,5-day,10-day,and22-dayaheadforecastingresultsoftherealizedcorrelation matrix and the value-at-risk of an equally weighted portfolio. The models are estimated every 22 observations t overarollingwindowoffiveyearsandaminimumof10observationsperstock-pairisrequiredineachpartition cell. We estimatne the model and compute forecasts for a random subset of five stocks in our sample (Verizon Communications Inc., DuPont de Nemours Inc., Home Depot Inc., Intel Corp., Cisco Systems Inc.). Multi- period forecasts are obtained by direct predictions. Forecasts of the correlation matrix are evaluated in terms of the Euclideain distance loss function. Value-at-risks are computed using filtered historical simulations (10,000 replicationsr) and assessed with the quantile loss function. All results are reported relative to the average loss of the HAR-DRD model, and the lowest loss is highlighted in boldface. Models belonging to the 90% and 70% modepl confidence sets are marked with superscripts a and b, respectively. e r P 40 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 44,
    "chunk_index": 74,
    "word_count": 354,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "average loss of the HAR-DRD model, and the lowest loss is highlighted in boldface. Models belonging to the 90% and 70% modepl confidence sets are marked with superscripts a and b, respectively. e r P 40 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 44,
    "chunk_index": 75,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d e w Table C2: Realized correlations, covariance, and value-at-risk forecasting reesults for models estimated over a rolling window of four and a half years HAR HAR-DRD T-HAR- T-HAR- iT-HAR- RF-HAR- DRD DRD vDRD DRD Leverage Sent.-Att. All 1-day ahead prediction e RCorr 1.119 1.000 0.963 0.984 0.966 0.954a,b RCov 1.290 1.000a 0.990a,b 0.972a,b 0.969a,b 0.975a,b r VaR 1.228 1.000 0.950a,b 0.979 0.949a,b 0.956a,b 1% VaR 5% 1.073 1.000 0.985a,b 0.993a 0.985a,b 0.987a,b VaR 1.034 1.000 0.992a,b 0.995a,b 0.993a,b 0.993a,b 10% r 5-day ahead prediction e RCorr 1.060 1.000a 0.966a 0.989a 0.983a 0.929a,b RCov 1.238a 1.000a,b 0.968a,b 0.974a,b 0.968a,b 0.970a,b VaR 1.069 1.000a e0.984a,b 1.004a 0.985a,b 0.985a,b 1% VaR 1.020a 1.000a,b 0.997a,b 0.999a,b 0.997a,b 0.996a,b 5% VaR 1.011a,b 1.000a,b 0.999a,b 1.001a,b 1.000a,b 0.998a,b 10% p 10-day ahead prediction RCorr 1.055 1.000a 0.990a 1.015a 1.003a 0.948a,b RCov 1.137a 1.000a,b 0.979a,b 0.980a,b 0.981a,b 0.976a,b VaR 1.064 1.00t0a,b 0.990a,b 1.002a,b 1.001a,b 0.987a,b 1% VaR 5% 1.019a,b o1.000a,b 1.000a,b 1.002a,b 1.004a,b 0.999a,b VaR 1.009a,b 1.000a,b 0.999a,b 1.001a,b 1.002a,b 0.999a,b 10% 22-day ahead prediction n RCorr 1.042a,b 1.000a,b 1.035a,b 1.018a,b 1.025a,b 0.981a,b RCov 1.080a 1.000a,b 1.000a,b 0.989a,b 0.997a,b 0.987a,b VaR 1.072 1.000a,b 1.001a,b 1.011a,b 1.007a,b 1.005a,b 1% VaR 1.01t5a,b 1.000a,b 1.001a,b 1.003a,b 1.004a,b 1.002a,b 5% VaR 1.005a,b 1.000a,b 1.001a,b 1.002a,b 1.003a,b 1.000a,b 10% n Note: The table reports the 1-day, 5-day, 10-day, and 22-day ahead forecasting results of the realized covari- ance matrix, riealized correlation matrix, and the value-at-risk of an equally weighted portfolio. The models are estimated ervery 22 observations over a rolling window of four and a half years and a minimum of 10 observa- tions per stock-pair is required in each partition cell. Multi-period forecasts are obtained by direct predictions. ForecpastsofthecorrelationandcovariancematrixareevaluatedintermsoftheEuclideandistancelossfunction. Value-at-risksarecomputedusingfilteredhistoricalsimulations(10,000replications)andassessedwiththequan- tile loss function. All results are reported relative to the average loss of the HAR-DRD model, and the lowest eloss is highlighted in boldface. Models belonging to the 90% and 70% model confidence sets are marked with superscripts a and b, respectively. r P 41 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 44,
    "chunk_index": 76,
    "word_count": 339,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "the average loss of the HAR-DRD model, and the lowest eloss is highlighted in boldface. Models belonging to the 90% and 70% model confidence sets are marked with superscripts a and b, respectively. r P 41 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 44,
    "chunk_index": 77,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d e w Table C3: Realized correlations, covariance, and value-at-risk forecasting reesults for models estimated over a rolling window of five and a half years HAR HAR-DRD T-HAR- T-HAR- iT-HAR- RF-HAR- DRD DRD vDRD DRD Leverage Sent.-Att. All 1-day ahead prediction e RCorr 1.122 1.000 0.961a,b 0.987 0.962a,b 0.956a,b RCov 1.227 1.000a 0.972a,b 0.983a 0.964a,b 0.980a r VaR 1.199 1.000 0.937a,b 0.999 0.938a,b 0.954 1% VaR 5% 1.064 1.000 0.980a,b 0.999 0.983a,b 0.988 VaR 1.027 1.000 0.990a,b 0.998 0.991a,b 0.994 10% r 5-day ahead prediction e RCorr 1.063 1.000 0.960a,b 0.971a,b 0.959a,b 0.926a,b RCov 1.179a 1.000a,b 0.973a,b 0.973a,b 0.974a,b 0.976a,b VaR 1.062 1.000a e0.981a,b 1.002a 0.980a,b 0.984a,b 1% VaR 1.015a,b 1.000a,b 0.997a,b 1.002a,b 0.998a,b 0.995a,b 5% VaR 1.009a,b 1.000a,b 0.997a,b 1.002a,b 0.999a,b 0.997a,b 10% p 10-day ahead prediction RCorr 1.058 1.000a,b 1.009a,b 0.998a,b 1.014a 0.951a,b RCov 1.123a 1.000a,b 0.988a,b 0.986a,b 0.990a,b 0.980a,b VaR 1.058 1.00t0a,b 0.990a,b 0.998a,b 0.992a,b 0.986a,b 1% VaR 5% 1.015a,b o1.000a,b 0.999a,b 1.002a,b 1.002a,b 0.999a,b VaR 1.004a,b 1.000a,b 1.001a,b 1.000a,b 1.002a,b 0.999a,b 10% 22-day ahead prediction n RCorr 1.046a,b 1.000a,b 1.005a,b 1.023a,b 1.030a,b 0.977a,b RCov 1.067a 1.000a 0.998a 1.000a 1.000a 0.989a,b VaR 1.081a 1.000a,b 1.007a,b 1.023a,b 1.023a,b 1.010a,b 1% VaR 1.01t5a,b 1.000a,b 1.001a,b 1.007a,b 1.005a,b 1.003a,b 5% VaR 1.003a,b 1.000a,b 1.000a,b 1.004a,b 1.003a,b 1.002a,b 10% n Note: Thetablereportsthe1-day,5-day,10-day,and22-dayaheadforecastingresultsoftherealizedcovariance matrix, realizeid correlation matrix, and the value-at-risk of an equally weighted portfolio. The models are estimatedervery22observationsoverarollingwindowoffiveandahalfyearsandaminimumof10observationsper stock-pair is required in each partition cell. Multi-period forecasts are obtained by direct predictions. Forecasts of thepcorrelation and covariance matrix are evaluated in terms of the Euclidean distance loss function. Value- at-risks are computed using filtered historical simulations (10,000 replications) and assessed with the quantile lossfunction. AllresultsarereportedrelativetotheaveragelossoftheHAR-DRDmodel,andthelowestlossis ehighlightedinboldface. Modelsbelongingtothe90%and70%modelconfidencesetsaremarkedwithsuperscripts a and b, respectively. r P 42 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 44,
    "chunk_index": 78,
    "word_count": 297,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "are evaluated in terms of the Euclidean distance loss function. Value- at-risks are computed using filtered historical simulations (10,000 replications) and assessed with the quantile lossfunction. AllresultsarereportedrelativetotheaveragelossoftheHAR-DRDmodel,andthelowestlossis ehighlightedinboldface. Modelsbelongingtothe90%and70%modelconfidencesetsaremarkedwithsuperscripts a and b, respectively. r P 42 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 44,
    "chunk_index": 79,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "d e w e Table C4: Realizedcorrelation,covariance,andvalue-at-riskforecastingresultsobtainedfromiterative predictions i HAR HAR-DRD T-HAR- T-HAR- T-HAR- RF-HAR- v DRD DRD DRD DRD Leverage Sent.-Att. All e 1-day ahead prediction RCorr 1.120 1.000 0.966a 0.977 0.967a 0.956a,b RCov 1.265 1.000a 0.976a,b 0r.973a,b 0.975a,b 0.978a,b VaR 1.201 1.000 0.945a,b 0.977 0.953a,b 0.955a,b 1% VaR 1.064 1.000 0.983a,b 0.993a 0.987a,b 0.988a,b 5% VaR 1.030 1.000 0.991a,b r0.994a,b 0.991a,b 0.993a,b 10% 5-day ahead prediction e RCorr 1.275 1.000a 0.949a,b 0.963a,b 0.954a,b 0.922a,b RCov 1.168 1.000a,b 0.974a,b 0.964a,b 0.972a,b 0.974a,b e VaR 1.108 1.000a 0.976a,b 1.000a 0.981a,b 0.981a,b 1% VaR 1.049 1.000a,b 0.990a,b 1.000a,b 0.994a,b 0.990a,b 5% VaR 10% 1.034 1.000a,b p0.995a,b 0.999a,b 0.997a,b 0.996a,b 10-day ahead prediction RCorr 1.338 1.000a ,b 0.973a,b 0.981a,b 0.986a,b 0.938a,b RCov 1.131a 1.000a,b 0.976a,b 0.969a,b 0.976a,b 0.977a,b t VaR 1.102 1.000a 0.965a,b 0.994a 0.958a,b 0.967a,b 1% VaR 1.049 o 1.000a,b 0.995a,b 1.000a,b 0.996a,b 0.994a,b 5% VaR 1.034 1.000a,b 0.998a,b 0.999a,b 1.000a,b 0.997a,b 10% 22-day ahead predictionn RCorr 1.413 1.000a,b 1.036a,b 1.033a,b 1.053a 0.983a,b RCov 1.182a,b 1.000a,b 0.979a,b 0.978a,b 0.980a,b 0.981a,b VaR 1.123a 1.000a,b 0.977a,b 1.023a,b 0.993a,b 0.986a,b 1% t VaR 1.054a 1.000a,b 0.982a,b 1.010a 0.989a,b 0.990a,b 5% VaR n1.031 1.000a 0.987a,b 1.002a 0.991a,b 0.993a 10% Note: Thetablereportsthe1-day,5-day,10-day,and22-dayaheadforecastingresultsoftherealizedcorrelation i matrixandthevalue-at-riskofanequallyweightedportfolio. Themodelsareestimatedevery22observationsover r a rolling window of five years. Multi-period forecasts are obtained by iterating forward 1-day ahead predictions. Forecasts of the correlation matrix are evaluated in terms of the Euclidean distance loss function. Value-at- p risks are computed using filtered historical simulations (10,000 replications) and assessed with the quantile loss function. All results are reported relative to the average loss of the HAR-DRD model, and the lowest loss is highlightedinboldface. Modelsbelongingtothe90%and70%modelconfidencesetsaremarkedwithsuperscripts e a and b, respectively. r P 43 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 44,
    "chunk_index": 80,
    "word_count": 291,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  },
  {
    "text": "replications) and assessed with the quantile loss function. All results are reported relative to the average loss of the HAR-DRD model, and the lowest loss is highlightedinboldface. Modelsbelongingtothe90%and70%modelconfidencesetsaremarkedwithsuperscripts e a and b, respectively. r P 43 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=3709775",
    "title": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations",
    "source_type": "pdf",
    "document_id": "573ffd9e30ab",
    "source_file": "Retail Investors Trading Activity and the Predictability of Stock Return Correlations.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 44,
    "chunk_index": 81,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210827113017+02'00'",
    "duration": null
  }
]