[
  {
    "text": "Retail Trader Sophistication and Stock Market Quality: Evidence from Brokerage Outages Gregory W. Eaton, T. Clifton Green, Brian S. Roseman, and Yanbin Wu* June 2022 Abstract We study brokerage platform outages to examine the impact of retail investors on financial markets. We contrast outages at Robinhood, which caters to inexperienced investors, with outages at traditional retail brokers. For stocks with high retail interest, we find that negative shocks to Robinhood investor participation are associated with reduced market order imbalances, increased market liquidity, and lower return volatility, whereas the opposite relations hold following outages at traditional retail brokerages. The findings suggest that herding by inexperienced investors can create inventory risks that harm liquidity in stocks with high retail interest, while other retail trading improves market quality. JEL: G11, G12, G14 Keywords: Retail Investors, High Frequency Trading, Market Quality, WallStreetBets * Eaton and Roseman are from the Spears School of Business, Oklahoma State University (gregory.eaton@okstate.edu; brian.roseman@okstate.edu). Green is from Goizueta Business School, Emory University (clifton.green@emory.edu). Wu is from Warrington College of Business, University of Florida (yanbin.wu@warrington.ufl.edu). A previous draft circulated under the title “Zero-Commission Individual Investors, High Frequency Traders, and Stock Market Quality.” We thank Russell Jame for valuable early stage suggestions and Jeff Bacidore (Bacidore Group) and Andrew Smith (Virtu Financial) for helpful discussions of institutional details. We also thank Robert Battalio, Jonathan Brogaard, Ryan Davies (discussant), Björn Hagströmer, Xing Huang (discussant), Will Mullins (discussant) Marina Niessner (discussant), Quan Qi (discussant), Mihail Velikov (discussant), Xiaoyan Zhang (discussant), and Dexin Zhou as well as participants at the Chinese University of Hong Kong at Shenzhen, Hong Kong Polytechnic University, IE Business School Nottingham University, Securities and Exchange Commission (SEC), Stockholm Business School (Future of Financial Information Webinar), University of Oklahoma, China International Conference in Finance (CICF), Financial Management Association Conference, Conference on Asia-Pacific Financial Markets, Microstructure Exchange virtual seminar, Microstructure Online Asia- Pacific seminar, Midwest Finance Association Conference, NYU Stern/Salomon Center Microstructure Conference, Northern Finance Association Conference, and Paris December Finance Meeting for helpful comments.",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 68,
    "chunk_index": 0,
    "word_count": 332,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Information Webinar), University of Oklahoma, China International Conference in Finance (CICF), Financial Management Association Conference, Conference on Asia-Pacific Financial Markets, Microstructure Exchange virtual seminar, Microstructure Online Asia- Pacific seminar, Midwest Finance Association Conference, NYU Stern/Salomon Center Microstructure Conference, Northern Finance Association Conference, and Paris December Finance Meeting for helpful comments.",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 68,
    "chunk_index": 1,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Individual investor stock market participation has grown substantially in recent years. Retail volume now accounts for 20% of stock market activity, roughly double the rate from a decade ago (McCabe, 2021). Robinhood has contributed significantly to this development (Basak, 2020),1 with innovative features such as zero commissions, user-friendly interfaces, and no account minimums, drawing many first-time investors to the stock market.2 Given their lack of experience, many of these new retail traders have lower financial sophistication than other retail investors. In this article, we study the financial market implications of heterogeneity in retail investor sophistication. Aggregate measures of retail order flow have been shown to be contrarian in nature and predictive of future short-term stock returns, which has been attributed in part to market-enhancing liquidity provision (e.g., Kaniel, Saar, and Titman, 2008; Barrot, Kaniel, and Sraer, 2016; Boehmer and Song, 2020). On the other hand, inexperienced investors are prone to return chasing and attention-based trading (Goetzmann and Kumar, 2008; Greenwood and Nagel, 2009; Bianchi, 2018). In particular, Barber, Huang, Odean, and Schwarz (2021) show that Robinhood investors are more likely than other retail investors to herd into certain stocks. While retail noise traders could contribute to market liquidity by diluting the effects of informed traders (e.g., Glosten and Milgrom, 1985; Kyle, 1985), momentum-oriented herding by unsophisticated investors may create volatility and harm liquidity by creating inventory risks for market makers (e.g., Ho and Stoll, 1981; Grossman and Miller, 1988; Hendershott and Menkveld, 2014). 1 For example, Robinhood reported 4.21 million daily average revenue trades (DART) in June of 2020, comprising 33% (and the largest fraction) of the total DART reported among TD Ameritrade, Interactive Brokers, Charles Schwab, and E-Trade. 2 Robinhood’s regulatory filings state that “millions of our customers are using Robinhood to enter the financial markets for the first time.” Robinhood’s mean investor is 31 years old with average account balances between $1000 and $5000 (Venkateswaran, 2019), compared with 50 years old and $47,000 in the heavily studied US retail brokerage sample from the 1990s (e.g. Barber and Odean, 2001). 1",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "1. Introduction",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 68,
    "chunk_index": 2,
    "word_count": 342,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "to enter the financial markets for the first time.” Robinhood’s mean investor is 31 years old with average account balances between $1000 and $5000 (Venkateswaran, 2019), compared with 50 years old and $47,000 in the heavily studied US retail brokerage sample from the 1990s (e.g. Barber and Odean, 2001). 1",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "1. Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 68,
    "chunk_index": 3,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Existing evidence on the effects of retail investors on financial markets is mixed. Foucault, Sraer, and Thesmar (2011) study a French legal reform that discouraged speculative and leveraged retail trading and find that stock market quality improved following the regulation change. In contrast, Peress and Schmidt (2020) find evidence that reduced retail trading is associated with lower stock market liquidity using distracting US news stories to reflect the absence of noise traders. We argue that retail investor heterogeneity may play a role, and we rely on platform outages at different retail brokers to study the impact of individual investors on stock market quality. Specifically, we contrast outages at Robinhood, which caters to inexperienced retail investors, with outages at more traditional retail brokerages (TD Ameritrade, Charles Schwab, and E-Trade). We begin by documenting important differences in the trading of Robinhood investors relative to a broader measure constructed from all retail trades. In particular, we find no evidence that changes in Robinhood ownership are positively associated with future returns, contrasting with existing evidence for broader measures of retail order flow (Kaniel, Saar, and Titman, 2008; Kelley and Tetlock, 2013, Boehmer, Jones, Zhang, and Zhang, 2020). While Robinhood investors are more likely to purchase stocks that were recently discussed on Reddit WallStreetBets, aggregate retail order imbalances in these stocks are negative after controlling for firm characteristics. In general, Robinhood investors tend to be momentum-oriented, whereas aggregate retail order flow is contrarian. Controlling for lagged returns, we observe that aggregate retail order imbalances are negatively related to lagged changes in Robinhood breadth of ownership. Although we cannot definitively conclude that the average Robinhood investor is different than investors at other retail brokers, the trading evidence suggests there is a significant group of herding-oriented, 2",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "1. Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 68,
    "chunk_index": 4,
    "word_count": 290,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "lagged returns, we observe that aggregate retail order imbalances are negatively related to lagged changes in Robinhood breadth of ownership. Although we cannot definitively conclude that the average Robinhood investor is different than investors at other retail brokers, the trading evidence suggests there is a significant group of herding-oriented, 2",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "1. Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 68,
    "chunk_index": 5,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "liquidity-demanding investors at Robinhood, whereas retail investors in general may provide liquidity to markets. Although lengthy brokerage outages are rare, DownDetector.com, a web platform that compiles user complaints, includes over 96 separate outages in which at least 200 users report outages during our January 2019 – June 2021 sample period (37 platform outages at Robinhood and 59 outages at traditional retail brokers).3 The median length of the outages in the sample is 30 minutes. Our approach for capturing the effects of retail investors on financial markets involves comparing market quality during platform outages to similar times of day over the previous week. We contrast the effects of outages on stocks in the top quintile of predicted retail trading relative to stocks in the bottom four quintiles. The difference-in-differences type approach is designed to mitigate concerns that outages are related to market-wide news. We also conduct several robustness tests, including pseudo outage analysis, parallel trend analysis, and analysis that omits stocks with elevated activity on WallStreetBets around the outage. We find that brokerage outages have a meaningful effect on trading activity. Stocks with high expected retail trading experience significantly lower trading intensity and volume during platform outages. For example, Robinhood outages are associated with 3.2% lower volume among stocks with high expected Robinhood trading, after controlling firm and day fixed effects. Analogously, outages at traditional brokers are associated with 2.6% lower volume for stocks with high expected aggregate retail trading. 3 We exclude outages driven by market-related movements such as circuit breakers and limit up/limit down trading pauses, which includes several outages in March 2020 and January 2021. We also omit outages that overlap between Robinhood and other brokers. 3",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "1. Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 68,
    "chunk_index": 6,
    "word_count": 279,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "lower volume for stocks with high expected aggregate retail trading. 3 We exclude outages driven by market-related movements such as circuit breakers and limit up/limit down trading pauses, which includes several outages in March 2020 and January 2021. We also omit outages that overlap between Robinhood and other brokers. 3",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 68,
    "chunk_index": 7,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "If less sophisticated retail investors are more likely to herd by trading on the same side of the market (e.g., Barber, et al., 2021), their presence may contribute to market imbalances. The outage evidence supports this view. Specifically, Robinhood outages are associated with reduced trade imbalances and depth-weighted quote imbalances in stocks with high Robinhood investor interest. In contrast, market imbalances increase during outages at traditional brokers, suggesting that in aggregate retail investors have the effect of reducing market imbalances in retail-oriented stocks. We hypothesize that momentum-oriented herding by unsophisticated investors may have important effects for financial markets. We consider several measures of market quality: quoted spreads, effective spreads, realized spreads, and price impact. For each liquidity measure, we find robust evidence that Robinhood platform outages are associated with improved market quality among stocks favored by Robinhood investors. For example, we find that Robinhood outages are associated with quoted spreads that are 0.72 basis points lower for stocks in the top quintile of retail investor interest relative to a mean of 16.8 basis points. The implication is that imbalanced trading by Robinhood investors can be harmful to market liquidity. In contrast, outages at other retail brokers are associated with reduced liquidity in stocks with high aggregate retail investor interest, with quoted spreads being 0.38 basis points higher during outages for stocks with high retail investor interest.4 Robinhood outages are also associated with lower return volatility, whereas outages at other retail brokers coincide with increased volatility. Specifically, we calculate volatility using transaction price changes during five-minute windows, and we find that volatility is significantly 4 In intraday event-time analysis (Figures 2-3), we observe little evidence that outages affect trading or market conditions for stocks in the bottom four quintiles of expected retail trading, which suggests that the effects of retail investors on market quality are concentrated in stocks with high retail interest. 4",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 68,
    "chunk_index": 8,
    "word_count": 312,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "significantly 4 In intraday event-time analysis (Figures 2-3), we observe little evidence that outages affect trading or market conditions for stocks in the bottom four quintiles of expected retail trading, which suggests that the effects of retail investors on market quality are concentrated in stocks with high retail interest. 4",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 68,
    "chunk_index": 9,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "lower among stocks most favored by Robinhood investors during platform outages. In particular, Robinhood outages are associated with 0.25 basis point lower transaction price volatility in Robinhood-favored stocks, meaningful relative to the mean of 12.5 basis points. Analogously, outages at traditional retail brokers are associated with 2.96% higher volatility for stocks with high expected aggregate retail trading. The outage evidence suggests that Robinhood traders contribute to volatility, in line with noise trading models such as DeLong, Shleifer, Summers, and Waldmann (1990), Campbell and Kyle (1993), and Llorente, Michaely, Saar, and Wang (2002), whereas other retail investors reduce volatility. The evidence that outages are associated with changes in market quality raises the natural question of how off-exchange (dark) trading influences measures of public market (lit) quality. In recent times, high frequency trading (HFT) firms that act as wholesalers by internalizing retail orders off exchange are also among the largest market makers in public markets, which suggests that retail trading likely influences lit market quality through their internal algorithms.5 FINRA regulation 5320 prohibits front-running of customer orders, and HFT firms implement information barriers between trading units so that the market making division does not obtain knowledge of customer orders from the wholesale division. However, the algorithms for both units will be influenced by the firm’s overall position and internal risk tolerance. Supporting inventory risk concerns, we find evidence consistent with greater liquidity provision during Robinhood outages specifically by HFTs with payment for order flow (PFOF) arrangements with Robinhood, and reduced liquidity provision by HFTs with PFOF arrangements with traditional retail brokers during their outages. For example, we examine non-anonymous dealer quotes available on public markets, and we find that for stocks in the top quintile of retail 5 For example, two of the three designated market maker firms on NYSE (Citadel Securities and Virtu Financial) also internalize orders for Robinhood. 5",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 68,
    "chunk_index": 10,
    "word_count": 309,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "during their outages. For example, we examine non-anonymous dealer quotes available on public markets, and we find that for stocks in the top quintile of retail 5 For example, two of the three designated market maker firms on NYSE (Citadel Securities and Virtu Financial) also internalize orders for Robinhood. 5",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "1. Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 68,
    "chunk_index": 11,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "interest, outages are associated with significantly narrower dealer spreads for Robinhood-affiliated HFTs (e.g., Citadel Securities and Virtu Financial), and no significant change for other dealer quotes. Taken together, the findings support the view that unsophisticated retail traders can have negative effects on stock market quality, consistent with behavioral noise trader risk and dealer inventory models. In contrast, more experienced retail investors, who tend to be contrarian and are less likely to herd, have beneficial effects. The evidence that less sophisticated investors can create inventory risks raises the question of why wholesalers would pay Robinhood for order flow. An important feature of PFOF arrangements is that wholesalers commit to providing full service to retail brokers. Wholesalers therefore have incentives to pay for toxic (high inventory risk) order flow in order to maintain access to more profitable order flow. We shed light on this tradeoff by examining SEC 605 disclosure data on realized spreads to gauge profits for Robinhood-affiliated wholesalers. We find evidence that realized spreads can be negative in the most toxic stocks, yet the remainder of non- toxic order flow allows wholesalers to profit overall when trading in Robinhood-oriented stocks. Moreover, we find evidence that stocks are toxic only temporarily, and wholesalers therefore have incentives to accept toxic order flow in the short-run in order to gain access to future profitable order flow in the stock. An important concern in our setting is that extreme market conditions may cause brokerage outages. We repeat the analysis for pseudo outages assumed to occur one hour after the actual event and find no evidence of shocks to trading or liquidity, which mitigates concerns that outages are driven by broad market news. In addition, the results continue to hold if we exclude stocks with a high number of WallStreetBets mentions the day of the outage that may have driven the outage. Moreover, intraday event-time figures indicate that the market effects occur precisely 6",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "1. Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 68,
    "chunk_index": 12,
    "word_count": 319,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "concerns that outages are driven by broad market news. In addition, the results continue to hold if we exclude stocks with a high number of WallStreetBets mentions the day of the outage that may have driven the outage. Moreover, intraday event-time figures indicate that the market effects occur precisely 6",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "1. Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 68,
    "chunk_index": 13,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "during the period of the outage, supporting the view that outages have a direct effect on trading and liquidity.6 However, we do not preclude the possibility that elevated trading activity may cause some brokerage outages, and Robinhood’s platform could potentially be more susceptible to trading shocks than other brokers. In this setting, our findings shed light on how individual investors impact market quality in high retail interest stocks during periods of market stress when liquidity is highly valued. Our study helps reconcile the conflicting existing evidence regarding the effects of retail trading on market quality (Foucault et al., 2011; Peress and Schmidt, 2020; Greene and Smart, 1999). While previous work emphasizes retail investors on average, our findings suggest that the impact of retail investors on financial markets depends on their level of investor sophistication, and in particular on the extent to which investors herd and trade in a momentum or contrarian fashion. We show that even short-lived shocks to retail trading can significantly impact inventory risks in modern markets.7 In addition, our research adds to the literature that examines the effects of social interactions, including social media, on financial markets. Several studies find evidence that social media can provide investment value (Chen, De, Hu, and Hwang, 2014; Jame, Johnston, Markov, and Wolfe, 2016; Farrell, Green, Jame, and Markov, 2020), whereas other work suggests that social media may spread stale news or intensify behavioral biases (Heimer, 2016; Cookson, 6 Another potential concern is that broker institutional differences may play a role. All of the brokers we consider offered zero commissions during the sample period and have payment for order flow arrangements with wholesalers. Moreover, we note that the evidence that Robinhood outages are associated with more balanced trading and quoting activity, whereas the opposite holds for outages at traditional brokers, is more consistent with herding among less sophisticated investors leading to greater inventory costs rather than varying incentives to provide liquidity across brokers. 7 Shkilko and Sokolov (2020) study the market quality effects of weather-induced shocks to microwave networks and find that liquidity providers react very quickly to changes in weather, consistent with liquidity providers reacting quickly to the information shocks associated with brokerage outages. 7",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "1. Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 68,
    "chunk_index": 14,
    "word_count": 365,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "varying incentives to provide liquidity across brokers. 7 Shkilko and Sokolov (2020) study the market quality effects of weather-induced shocks to microwave networks and find that liquidity providers react very quickly to changes in weather, consistent with liquidity providers reacting quickly to the information shocks associated with brokerage outages. 7",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "1. Introduction",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 68,
    "chunk_index": 15,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Engelberg, and Mullins, 2020; Bali, Hirshleifer, Peng, and Yang, 2021; Pedersen, 2021). Bradley, Hanousek, Jame, and Xiao (2021) study a “Due Diligence” subset of Reddit WallStreetBets posts and find that these reports positively predict returns at the beginning of their sample period but reverse more recently. Cookson, Fos, and Niessner (2021) measure retail investor disagreement using StockTwits, and they find that disagreement is associated with greater liquidity that facilitates trading by activist investors. We find that the Reddit WallStreetBets forum, which is often comprised of brief posts, nevertheless strongly predicts future trading by Robinhood investors, which has implications for market quality. Our findings also connect with the literature on off-exchange trading (e.g., Menkveld, Yueshen, and Zhu, 2017; Buti, Rindi, and Werner, 2017) and payment for order flow (e.g., Easley, Kiefer, and O’Hara 1996; Battalio, 1997; Bessembinder and Kaufman, 1997; Comerton-Forde, Malinova, and Park, 2018), which examines how payment for order flow influences adverse selection across trading venues. Our evidence suggests that retail traders can elevate or reduce inventory risk depending on the nature of trading. Some Robinhood retail investors tend to behave as momentum traders and are more likely to herd, and the outage evidence is consistent with herding-oriented Robinhood traders decreasing market quality by contributing to the inventory risk of wholesalers with PFOF arrangements with Robinhood. In contrast, aggregate retail investors tend to behave as contrarian investors and are less likely to herd. As a result, their presence leads to improved market quality and is consistent with these investors having a stabilizing effect on wholesaler inventory risk.8 8 Empirical evidence is mixed regarding whether HFT activity improves market quality (e.g. Hendershott, Jones, and Menkveld, 2011; Brogaard, Hendershott, and Riordan, 2015), or detracts from it (e.g. Kirilenko Kyle, Samadi, and Tuzun, 2011; Shkilko and Sokolov, 2020). For example, van Kervel and Menkveld (2019) find evidence that HFTs increase execution costs for large institutional orders, whereas Korajczyk and Murphy (2019) argue that HFTs lower transaction costs for small, uninformed trades. Our evidence that Robinhood outages are associated with reduced market imbalances, while the opposite holds for traditional brokers, is more consistent with variation in inventory risks rather than HFTs exploiting retail investors. 8",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "1. Introduction",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 68,
    "chunk_index": 16,
    "word_count": 362,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "institutional orders, whereas Korajczyk and Murphy (2019) argue that HFTs lower transaction costs for small, uninformed trades. Our evidence that Robinhood outages are associated with reduced market imbalances, while the opposite holds for traditional brokers, is more consistent with variation in inventory risks rather than HFTs exploiting retail investors. 8",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "1. Introduction",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 68,
    "chunk_index": 17,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Our work is related to contemporaneous studies of Robinhood investors. Welch (2021) notes that Robinhood investors purchased in aggregate during the pandemic downturn, but also added funds aggressively after large upswings, generally consistent with uninformed trading. Illustrating that Robinhood investors can influence market conditions, Barber, et al. (2021) finds that attention-induced herding by Robinhood investors is accompanied by large price movements and subsequent reversals. Van der Beck and Jaunin (2021) estimate a structural model to argue that Robinhood investors have an outsized effect on stock prices due to the inelastic nature of institutional demand. Hu, Jones, Zhang, and Zhang (2021) show Robinhood investors react to Reddit web postings, but do not explore measures of market quality. Glossner, Matos, Ramelli, and Wagner (2021) highlight that Robinhood investors tended to purchase stocks during the pandemic that institutions sold, consistent with liquidity provision.9 Ozik, Sadka, and Shen (2021) also study the effects of Robinhood investors on market liquidity and address causality by relying on investor home bias and using the staggered implementation of stay-at-home advisories during the pandemic. They argue that Robinhood investors alleviate illiquidity, although they acknowledge that the evidence is weaker among high-media-attention stocks that are frequently traded by Robinhood investors. Our approach relies on platform outages to isolate the effect of retail investors over intraday horizons, and we specifically emphasize stocks with high expected trading, which may help explain the differential implications for market quality. 2. Data and Descriptive Statistics This section describes the data and key variables used in the analysis, including retail ownership and trading variables, market quality variables, and measures of social media activity. 9 We note that our findings are robust if we exclude March 2020, which exhibited the steepest market drops of the pandemic. 9",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "1. Introduction",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 68,
    "chunk_index": 18,
    "word_count": 290,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "This section describes the data and key variables used in the analysis, including retail ownership and trading variables, market quality variables, and measures of social media activity. 9 We note that our findings are robust if we exclude March 2020, which exhibited the steepest market drops of the pandemic. 9",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "1. Introduction",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 68,
    "chunk_index": 19,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Robinhood launched in 2015 with innovative features such as no commissions, no account minimums, and a user-friendly app that embedded aspects of gamification (Schifrin and Gara, 2021). In 2020, Robinhood had 13 million accounts, most of them first time investors, giving them about the same or more accounts than some of the other major retail brokers, such as Schwab (12.7 million accounts) or E-Trade (5.5 million). Although Robinhood account sizes are smaller than traditional retail brokerages,10 Robinhood users traded nine times as many shares as E-Trade customers and 40 times as many shares as Charles Schwab customers per dollar in the average customer account in the first quarter of 2020 (Popper, 2020). Academic research also highlights Robinhood’s significant impact. In particular, van der Beck and Jaunin (2021) build on the work of Koijen and Yogo (2019) to argue that Robinhood investors have an outsized effect on stock prices due to the inelastic nature of institutional demand. Robinhood publicly displayed the aggregate number of users (investors) that held each stock on their webpages, updated at approximately one-hour intervals. We gather breadth of ownership data for Robinhood brokerage investors from Robintrack, an independent website that uses the Robinhood API to identify and record Robinhood investor interest for stocks with non- zero positions. Robintrack began gathering data in July of 2018, and the data end in August of 2020.11 The Robintrack data contain hourly stock-level investor position snapshots. We focus on observations reported between 9:00 AM to 4:00 PM EST on valid trading days identified in the 10 Robinhood’s mean account balance is between $1000 and $5000 (Venkateswaran, 2019), compared with $47,000 in the heavily studied US retail brokerage sample from the 1990s (e.g., Barber and Odean, 2001) 11 Robinhood ended the practice of displaying number of users in August 2020 in part due to the actions of Robintrack, voicing concerns that the information might be used to disadvantage Robinhood investors (e.g., Ponczek, 2020). 10",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.1 Robinhood Breadth of Ownership Data",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 68,
    "chunk_index": 20,
    "word_count": 322,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.1 Robinhood Breadth of Ownership Data (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "studied US retail brokerage sample from the 1990s (e.g., Barber and Odean, 2001) 11 Robinhood ended the practice of displaying number of users in August 2020 in part due to the actions of Robintrack, voicing concerns that the information might be used to disadvantage Robinhood investors (e.g., Ponczek, 2020). 10",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.1 Robinhood Breadth of Ownership Data",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 68,
    "chunk_index": 21,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.1 Robinhood Breadth of Ownership Data (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Center for Research in Securities Prices (CRSP) data. We measure holdings changes for horizons longer than an hour by summing hourly holding changes.12 The Robinhood sample is merged by common stock ticker and date with matches found in (CRSP) as well as from the NYSE’s Trade and Quote (TAQ) database. The resulting dataset is comprised of stock-day observations during the January 2019 – June 2021 sample period used to study broker outages.13 We use these data to compute measures of Robinhood ownership to proxy for the level of Robinhood investors’ interest in a stock. We describe these variables, along with all others used in our analysis, in Appendix A. 2.2 Measuring Aggregate Retail Trading In addition to the Robinhood trading variables, we measure aggregate retail investor trading using the methodology of Boehmer, Jones, Zhang, and Zhang (2020) (BJZZ). Their approach exploits two key institutional features of retail trading. First, most equity trades by retail investors take place off-exchange, either filled from the broker’s own inventory or sold by the broker to wholesalers (Battalio, Corwin, and Jennings, 2016). TAQ classifies these types of trades with exchange code “D.” Accordingly, we measure aggregate retail trading by limiting our analysis to trades executed on exchange code “D.” Second, retail traders typically receive a small fraction of a cent price improvement over the National Best Bid or Offer (NBBO) for market orders (ranging from 0.01 to 0.2 cents), while institutional orders tend to be executed at whole or half-cent increments. Thus, we follow BJZZ and identify trades as retail purchases (sales) if the off- exchange trade took place at a price just below (above) a round penny. 12 A stock-day observation with missing data is filled in with the value of the most recent valid observation within three trading days, otherwise it is left as missing. 13 Although the Robintrack data are available July 2018 – August 2020, our sample period begins in 2019 as there are few outages 2018. We are able to extend the outage analysis beyond August of 2020 by using alternative proxies for Robinhood interest which we describe in Section 4.1.2. 11",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.1 Robinhood Breadth of Ownership Data",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 68,
    "chunk_index": 22,
    "word_count": 352,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.1 Robinhood Breadth of Ownership Data (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "13 Although the Robintrack data are available July 2018 – August 2020, our sample period begins in 2019 as there are few outages 2018. We are able to extend the outage analysis beyond August of 2020 by using alternative proxies for Robinhood interest which we describe in Section 4.1.2. 11",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.1 Robinhood Breadth of Ownership Data",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 68,
    "chunk_index": 23,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.1 Robinhood Breadth of Ownership Data (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "We construct several measures of financial market liquidity from high-frequency TAQ data. Quoted Spread is the best bid-ask spread scaled by the midquote. Effective Spread is an estimate of the percentage cost for a round-trip transaction. Specifically, the effective spread of the kth trade is defined as 2×|ln(P ) – ln(M )|, where P is the trade price and M is the prevailing k k midquote. Realized Spread is defined as 2×D (ln(P ) – ln(M )), where M is the midquote k k k+5min k+5min five minutes after the kth trade and D is a buy or sell indicator using the Lee and Ready (1991) k algorithm. Price Impact is defined as the percentage change from the prevailing mid-quote at the time of the transaction to the mid-quote five minutes after the transaction. 2×|ln(M ) – ln(M )|. k+5min k We also construct a return volatility measure based on the intraday standard deviation of stock trade-based returns obtained from TAQ. The measures are constructed in five-minute intervals for each firm, and the liquidity measures represent equal-weighted means for each stock within the five-minute windows. Our analysis also relies on measures of dealer inventory buildup, which we infer from imbalances in liquidity-demanding trades and liquidity-supplying orders. Specifically, we construct trade imbalance as the absolute dollar volume difference between buy trades and sell trades during a 5-minute period, scaled by the total dollar volume traded during the period. Using Nasdaq order-level data, we calculate the depth imbalance, which is defined as |(P – M) – t,DW,O t (M – P )| / M, where P and P reflect the depth-weighted (DW) average limit order t t,DW,B t t,DW,O t,DW,B price at time t of the offer, O, and bid, B, sides of the limit order book, and M represents the quoted t midpoint. Depth imbalance is updated for every order and trade submitted at a nanosecond frequency, time-weighted by the duration of the depth value and reported (in basis points) in 5- minute bins. To reduce the influence of extreme outliers, the depth-weighted limit order prices are 12",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 68,
    "chunk_index": 24,
    "word_count": 347,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "represents the quoted t midpoint. Depth imbalance is updated for every order and trade submitted at a nanosecond frequency, time-weighted by the duration of the depth value and reported (in basis points) in 5- minute bins. To reduce the influence of extreme outliers, the depth-weighted limit order prices are 12",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 68,
    "chunk_index": 25,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "constructed after removing stub quotes beyond 10% of the quoted midpoint, and winsorizing at the 99th percentile of orders according to order size. Additionally, we source market participant identifier (MPID) quote data from ITCH and identify market maker quotes in a manner similar to Hagströmer and Nordén (2013). We tag each MPID affiliation according to whether the market maker has a payment for order flow arrangement with a retail broker, which then allows us to measure the quoted spread and imbalance of each wholesaler that is directly impacted by retail broker outages. Table IA1 in the Internet Appendix lists the set of retail-affiliated MPIDs (i.e., Citadel, Virtu, G1X, and Two Sigma) and the remaining set of Nasdaq and FINRA member market makers.14 2.4 Social Media The role that social media plays in retail investor interest is gauged using the number of times that a stock is mentioned on the Reddit message board WallStreetBets (r/wallstreetbets). We use an automated script to parse the WallStreetBets forum, and we obtain all the posts and comments during the sample period. Using a regular expressions processor, or ‘regex’, we search the text of each post and comment to identify patterns that reveal mentions of individual stocks, while avoiding overlap between stock tickers and acronyms (Appendix B provides details). Our measure of social media interest in a given stock is the daily sum of mentions by unique users on WallStreetBets. 2.5 Sample Description and Summary Statistics We rely on data filters to construct the sample. Since the identification strategy focuses on stocks with the potential for high expected retail trading, we exclude stocks with few retail owners 14 Although market makers may also quote anonymously, FINRA 4613(A) and exchange rulebooks require market makers to have a continuous presence of identifiable quotes. 13",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 68,
    "chunk_index": 26,
    "word_count": 296,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "construct the sample. Since the identification strategy focuses on stocks with the potential for high expected retail trading, we exclude stocks with few retail owners 14 Although market makers may also quote anonymously, FINRA 4613(A) and exchange rulebooks require market makers to have a continuous presence of identifiable quotes. 13",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 68,
    "chunk_index": 27,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "or limited retail trading. Specifically, we require stocks in the sample to have a daily minimum of 50 Robinhood users, a weekly average of 500 Robinhood users in the week prior to platform outages, and a daily minimum of 5,000 shares traded in aggregate retail volume. Additionally, we require that sample stocks have prices above $1 so that microcaps do not distort interpretations of the results. Finally, we require that sample firms have data in the CRSP, COMPUSTAT, TAQ and ITCH databases. The sample includes 1,889 stocks that meet the data filters for the sample period of January 2019 to June 2021, which is the period during which we study brokerage outages. Table 1 presents sample summary statistics. Observations are averaged across stocks each week and then across weeks. We observe that sample stocks are owned by 9,795 Robinhood investors on average, although the distribution is skewed, as the median number of Robinhood owners of a stock is 1,404. Robinhood Trading is also highly skewed. While the mean absolute daily change in users is 83, the standard deviation is 548.15 Our analysis in the next section emphasizes social media posting on WallStreetBets. Table 1 shows that the average stock has 73 unique mentions on WallStreetBets per week, although this is similarly skewed, with a standard deviation of 904 mentions. 3. Retail Investors at Robinhood and Traditional Brokers Robinhood has sought to attract inexperienced investors, for example offering students cash prizes to open an account using their school email address (Rudegeair and McCabe, 2021), and it has fewer investor research and education offerings than other retail brokers.16 In this section, we examine differences in retail investor trading across brokerages. 15 Although the magnitudes of hourly changes in breadth of ownership are small for many stocks, ownership changes provide a proxy for trading by Robinhood investors with existing positions. Supporting this view, Barber et al. (2021) find that retail ownership changes and order flow are highly correlated (0.87) in the Barber and Odean (2000) retail investor sample. 16 https://www.stockbrokers.com/guides/online-stock-brokers 14",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 68,
    "chunk_index": 28,
    "word_count": 338,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "ownership are small for many stocks, ownership changes provide a proxy for trading by Robinhood investors with existing positions. Supporting this view, Barber et al. (2021) find that retail ownership changes and order flow are highly correlated (0.87) in the Barber and Odean (2000) retail investor sample. 16 https://www.stockbrokers.com/guides/online-stock-brokers 14",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 68,
    "chunk_index": 29,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "We begin by offering descriptive evidence on the sophistication of Robinhood investors versus investors at traditional retail brokers by studying patterns in retail broker website traffic. In particular, we obtain web traffic information (for January through June of 2020) from AlexaInternet and SimilarWeb and compare Frequently Asked Questions (FAQs) visits at Robinhood relative to other major retail brokerages. The findings are tabulated in Table IA2 in the Internet Appendix. Consistent with lack of expertise, the three most common FAQs pages visited by Robinhood investors are: “What is the Stock Market,” “What is the DJIA,” and “What is the S&P 500.” In contrast, the most common FAQs at the other major retail brokers are slightly more complex, for example “What are Stock Splits,” “What is an ETF,” and “What are Puts and Calls.” Moreover, the FAQs pages are visited more often at Robinhood than at traditional retail brokers, 6.1 visits per thousand for the top three FAQs topics at Robinhood vs. 1.5 per thousand visits for the top three topics at the other brokers. We acknowledge that brokers may feature FAQs information differently on their websites, and the descriptive evidence presented here is merely suggestive. We next examine the relation between retail trading and future returns to explore whether retail trading can be described as skilled or noisy. 3.1 The Informativeness of Robinhood Investor Trading Over the last decade, a number of researchers have found evidence that retail order flow positively predicts stock returns (Kaniel et al., 2008; Kaniel, et al., 2012; Kelley and Tetlock, 2013, 2017; Barrot et al., 2016; Boehmer et al., 2020; Farrell et al., 2020). We examine whether this evidence holds for our sample period and whether it extends to Robinhood investors. To do so, we estimate cross-sectional regressions in the spirit of Fama and MacBeth (1973), in which we regress future stock returns on retail trading proxies, plus controls. Point estimates of the regression coefficients are the time-series averages of the daily coefficients. Newey-West standard errors are 15",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 68,
    "chunk_index": 30,
    "word_count": 332,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "to Robinhood investors. To do so, we estimate cross-sectional regressions in the spirit of Fama and MacBeth (1973), in which we regress future stock returns on retail trading proxies, plus controls. Point estimates of the regression coefficients are the time-series averages of the daily coefficients. Newey-West standard errors are 15",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 68,
    "chunk_index": 31,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "used to correct for autocorrelation, and we set the number of daily lags equal to two times the horizon of the dependent variable to account for overlapping return observations. Our regression model for predicting holding period returns from day d to day d+ is: 𝐶ℎ𝑎𝑛𝑔𝑒 𝑅𝑒𝑡 = 𝛼+𝛽 𝑅𝐻 +𝛽 𝐴𝑔𝑔𝑅𝑒𝑡𝑎𝑖𝑙𝑂𝐼𝐵 +𝛾′𝑪𝒐𝒏𝒕𝒓𝒐𝒍𝒔 +𝜀 . (1) 𝑖,[𝑑,𝑑+𝜏] 1 𝑖,𝑑−1 2 𝑖,𝑑−1 𝑖,𝑑−1 𝑖,[𝑑,𝑑+𝜏] 𝐶ℎ𝑎𝑛𝑔𝑒 The variable 𝑅𝐻 is the change in Robinhood ownership for stock i measured over the 𝑖,𝑑−1 previous five trading days, standardized cross-sectionally. We also include the aggregate retail order flow variable (𝐴𝑔𝑔𝑅𝑒𝑡𝑎𝑖𝑙𝑂𝐼𝐵 ) proposed by Boehmer et al., (2020), measured over the 𝑖,𝑑−1 previous week, to examine how retail trading in general predicts returns in our sample period. We also include control variables that are known predictors of returns: past returns, as well as firm characteristics such as Market Cap, Book-to-Market, and Skewness. Table 2 reports the results, with Panel A presenting the regression estimates for weekly changes in the number of Robinhood owners, and Panel B using percentage changes in the number of owners. The central result from Table 2 is that changes in Robinhood ownership do not positively predict future stock return at alternative horizons up to 20 days. The estimated coefficients on Robinhood ownership are generally negative, and some of the coefficients are significantly different from zero, providing broader evidence of the herding reversal findings in Barber et al. (2021). Thus, there is no evidence that Robinhood investors on average are informed about future returns. This result is in contrast to the predictability of order flow from a broader set of retail investors. Across all specifications, aggregate retail order imbalances positively and significantly predict future stock returns, consistent with prior findings. Although retail trades in 16",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 68,
    "chunk_index": 32,
    "word_count": 292,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Robinhood investors on average are informed about future returns. This result is in contrast to the predictability of order flow from a broader set of retail investors. Across all specifications, aggregate retail order imbalances positively and significantly predict future stock returns, consistent with prior findings. Although retail trades in 16",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 68,
    "chunk_index": 33,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "general positively predict future returns, Robinhood investors on average appear to behave as noise traders.17 3.2 The Determinants of Retail Investor Trading The return evidence from the previous section suggests that Robinhood investors trade in ways that are not well captured by existing retail trading measures. In this section, we investigate heterogeneity among retail investors by analyzing the determinants of trading activity for both Robinhood investors and aggregate retail investors. Barber et al. (2021) show that Robinhood investors tend to herd into certain stocks, and we conjecture that Robinhood investors are more significantly influenced by financial social media than other retail investors. Moreover, Goetzmann and Kumar (2008), Greenwood and Nagel (2009), and Bianchi (2018) find that less experienced investors are more prone to return chasing, and we anticipate that at least some Robinhood investors may react differently to recent stock returns. We estimate the following daily OLS regressions of retail trading direction on explanatory variables: 𝑌 = 𝛼+∑5 𝛽 𝑊𝑆𝐵 +𝛿′𝑿 +𝜆′𝑿 +𝛾 𝑅𝑒𝑡𝑎𝑖𝑙 +𝛾 𝑅𝐻 +𝜀 (2). 𝑖,𝑡 𝑞=2 𝑞 𝑖,𝑡-1 𝒊,𝒕-𝟏,𝒓𝒆𝒕𝒔. 𝒊,𝒕-𝟏,𝒇𝒊𝒓𝒎 1 𝑖,𝑡-1 2 𝑖,𝑡-1 𝑖,𝑡 where the coefficients of 𝛽 through 𝛽 reflect the influence of social media on retail activity, in 2 5 which we separate WSB mentions into quintiles to capture the non-linearity of stocks with high WSB interest. 𝑿 is a vector of lagged return variables, 𝑿 is a vector of lagged firm- 𝒊,𝒕-𝟏,𝒓𝒆𝒕𝒔. 𝒊,𝒕-𝟏,𝒇𝒊𝒓𝒎 level control variables, and 𝑅𝑒𝑡𝑎𝑖𝑙 and 𝑅𝐻 reflect lagged retail interest. The dependent 𝑖,𝑡-1 𝑖,𝑡-1 variable is one of two measures of directional retail trading. In particular, we construct Robinhood 17 In recent work, Barber, Lin, and Odean (2021) find evidence that the aggregate retail order flow negatively predicts returns for a subset of stocks with high retail volume, consistent with the evidence in Barber et al. (2021) that herding by Robinhood traders negatively predicts returns. The evidence in Table 2 supports the view that Robinhood trading is uninformed in aggregate and some Robinhood traders are different than the average retail trader at other brokers. 17",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 68,
    "chunk_index": 34,
    "word_count": 338,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "high retail volume, consistent with the evidence in Barber et al. (2021) that herding by Robinhood traders negatively predicts returns. The evidence in Table 2 supports the view that Robinhood trading is uninformed in aggregate and some Robinhood traders are different than the average retail trader at other brokers. 17",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 68,
    "chunk_index": 35,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Purchases, defined as the daily change in the number of Robinhood users that own the stock, and Aggregate Retail Order Imbalance, which is signed aggregate retail volume scaled by total retail volume (using the retail classification algorithm in Boehmer et al., 2020). Table 3 presents the regression results. The coefficients on 𝑊𝑎𝑙𝑙𝑆𝑡𝑟𝑒𝑒𝑡𝐵𝑒𝑡𝑠 increase monotonically from quintile 2 to quintile 5 for the Robinhood Purchases specifications, suggesting the Robinhood trade activity is associated with high activity from the Reddit message board. Controlling for stock characteristics such as past returns, skewness, volume, size does not change the inference. On the other hand, the last column in Table 3 shows that the association between WallStreetBets and aggregate retail order imbalances is negative once we include other firm- related characteristics. The evidence suggests that Robinhood investors tend to trade in the same direction as the discussions on social media, whereas other retail investors are more likely to trade in contrarian ways after controlling for firm characteristics. The loadings on the past stock return variables highlight another difference between Robinhood users and aggregate retail investors. For Robinhood purchases, the estimated coefficients on overnight return or returns from the previous day or week are significantly positive, suggesting that Robinhood investors tend to be momentum-oriented. However, under the aggregate retail specification, the negative estimated coefficients on past returns suggest aggregate order flow is contrarian, consistent with liquidity provision. Finally, controlling for lagged returns, we observe that aggregate retail order imbalances are negatively related to lagged changes in Robinhood breadth of ownership, highlighting the differences between Robinhood investors and aggregate retail investors. The analysis in Table 3 compares aggregate liquidity-demanding marketable retail order flow to Robinhood ownership changes, yet retail investors may also differ in their use of liquidity- 18",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 68,
    "chunk_index": 36,
    "word_count": 292,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "imbalances are negatively related to lagged changes in Robinhood breadth of ownership, highlighting the differences between Robinhood investors and aggregate retail investors. The analysis in Table 3 compares aggregate liquidity-demanding marketable retail order flow to Robinhood ownership changes, yet retail investors may also differ in their use of liquidity- 18",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 68,
    "chunk_index": 37,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "providing limit orders. Transaction-level data on retail limit orders is unavailable, yet broker disclosures indicate that Robinhood investors are less likely to utilize limit orders than other retail investors. For example, in January of 2021, non-marketable limit orders in S&P 500 stocks accounted for 11.3% of orders on Robinhood, compared with 31.0%, 32.4%, and 31.4% on Schwab, E-Trade, and Ameritrade, respectively.18 Although we cannot definitively conclude that the average Robinhood investor is different than investors at other retail brokers, the trading evidence suggests there is a significant group of herding-oriented, liquidity-demanding investors at Robinhood, consistent with anecdotal evidence that Robinhood has sought to attract a new class of investors through their gamification and social features. In contrast, trading by retail investors in aggregate is more consistent with liquidity provision. 4. Retail Investors and Financial Markets This section examines how individual investors impact market quality. The evidence in Section 3 is consistent with Robinhood investors behaving as uninformed, momentum traders. If such investors magnify fluctuations in market makers’ inventory, market liquidity could deteriorate (Ho and Stoll, 1981; Grossman and Miller, 1988). Further, noise trading models such as DeLong et al. (1990), Campbell and Kyle (1993), and Llorente et al. (2002) predict that noise traders contribute to market volatility. In contrast, non-Robinhood retail investors exhibit contrarian trading, which could aid liquidity provision through reducing fluctuations in inventory. 4.1 Empirical Approach 18 Reported percentages are very similar for non-S&P 500 stocks and are stable over time. The data is obtained from http://public.s3.com/rule606/hood/, https://public.s3.com/rule606/chas/, https://us.etrade.com/l/quarterly-order- routing-report, and https://www.tdameritrade.com/disclosure/historical-606-disclosure.html. 19",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 68,
    "chunk_index": 38,
    "word_count": 255,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "market volatility. In contrast, non-Robinhood retail investors exhibit contrarian trading, which could aid liquidity provision through reducing fluctuations in inventory. 4.1 Empirical Approach 18 Reported percentages are very similar for non-S&P 500 stocks and are stable over time. The data is obtained from http://public.s3.com/rule606/hood/, https://public.s3.com/rule606/chas/, https://us.etrade.com/l/quarterly-order- routing-report, and https://www.tdameritrade.com/disclosure/historical-606-disclosure.html. 19",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 68,
    "chunk_index": 39,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Identifying the effect of retail investors on stock market liquidity is challenging because trading activity is endogenous and may itself be driven by liquidity (e.g. Foucault et al., 2011; Peress and Schmidt, 2020). Our approach for studying the effects of individual investors on financial markets relies on retail brokerage platform outages.19 A unique and important element of our empirical setting is that financial markets are open for trading, allowing us to observe market quality, but a considerable number of retail investors are unable to participate due to technical difficulties with their brokerage platform. One important concern is that market conditions may cause brokerage outages. We therefore also consider pseudo outages assumed to occur one hour after the actual event to examine whether any changes in market conditions continue after outages end. Another issue is that trading in a few high profile stocks may cause outages, and for robustness we also consider analyses where exclude stocks with significant increases in social media activity (20% increase in WallStreetBets posts). However, it remains possible that outages are not fully random and reflect periods of high interest in retail trading. Under this view, our setting allows us to study the effects of retail investors on financial markets during periods of market stress when investors place a high value on liquidity. 4.1.1 Brokerage Platform Outages Several retail brokers experienced outages during our sample period. We separate Robinhood, which caters to inexperienced investors, from other traditional retail brokerages. In order to make the set of traditional brokers comparable to Robinhood, we require that they offer zero commission trades during the sample period. Further, we focus on brokers that have payment 19 Porter et al., (2008) examine a blackout-induced outage at the Copenhagen Stock Exchange to study the functioning of the cross-border NOREX alliance of exchanges. 20",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 68,
    "chunk_index": 40,
    "word_count": 300,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "brokers comparable to Robinhood, we require that they offer zero commission trades during the sample period. Further, we focus on brokers that have payment 19 Porter et al., (2008) examine a blackout-induced outage at the Copenhagen Stock Exchange to study the functioning of the cross-border NOREX alliance of exchanges. 20",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 68,
    "chunk_index": 41,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "for order flow arrangements with wholesalers to help ensure that differences in institutional features do not influence the findings. The resulting set of traditional brokers includes Charles Schwab, E-Trade, and TD Ameritrade.20 Among the other large zero-commission PFOF brokers, Interactive Brokers and Raymond James are not in the sample because they do not have sufficient outages reported on Downdetector. We also exclude Fidelity as it does not have payment for order flow arrangements with wholesalers, although in unreported analysis we find that the effects of Fidelity outages are very similar to the other traditional brokers. We identify brokerage outages using Downdetector.com, a web platform that compiles user complaints. Outage information is updated at 15-minute time intervals and reflects both external user reports and internal verification checks.21 To ensure that the scale of an outage is material, we require a minimum of at least 200 outage reports during each 15-minute window that markets are open.We restrict the sample to outages unique to a single broker to alleviate concerns that outages may be driven by market-related factors. The outage sample consists of 96 episodes that span approximately 6,585 total trading minutes; 2,465 for Robinhood and 4,120 for the other three traditional brokers combined. These numbers suggest that Robinhood (Traditional Brokers) experienced an outage in some form for approximately 1.01% (1.68%) of the open market time during our sample period. Figure 1, top panel, illustrates the days on which outages occur (in grey bars) for Robinhood alongside Robinhood ownership changes. The lower panel shows outages for traditional retail brokers and 20 All three of the traditional brokers we consider switched to zero commissions in October of 2019, and the majority of the outages in the Traditional Brokers sample occur after the switch to zero commissions (see Figure 1). Nonetheless, we verify in untabulated analysis that the results are similar if we exclude outages prior to the switch to zero commissions. 21 “Downdetector collects status reports from a series of sources… Our system validates and analyzes these reports in real-time, allowing us to automatically detect outages and service disruptions in their very early stages.” https://downdetector.com/about-us/ 21",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 68,
    "chunk_index": 42,
    "word_count": 352,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "the results are similar if we exclude outages prior to the switch to zero commissions. 21 “Downdetector collects status reports from a series of sources… Our system validates and analyzes these reports in real-time, allowing us to automatically detect outages and service disruptions in their very early stages.” https://downdetector.com/about-us/ 21",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 68,
    "chunk_index": 43,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "aggregate retail trading volume. Although the outages in March 2020 generally coincide with a period of high trading, outages appear fairly randomly distributed over time. 4.1.2 Measuring Expected Retail Trading Analyzing the effects of retail brokerage outages on financial markets requires a forecast of which stocks individual investors would have traded in the absence of the outage. To do so, we rely on stock-level projections of retail trading. We use a model similar to the one listed in Eq. (2), except that we define the y-variable differently, as this exercise is designed to analyze the determinants of retail trading volume, not trade direction (which was studied in Table 3). We analyze two alternative dependent variables, Robinhood Trading, defined as the daily sum of absolute hourly changes in Robinhood users that hold the stock, and Aggregate Retail Volume / Volume, which is the daily volume of aggregate retail trading (using Boehmer et al. 2020 to proxy for retail trading) scaled by total volume. We present the regression estimates in Table 4. With these regression estimates in hand, we use the fitted values to predict retail trading during the outages. Specifically, the fitted regressions are estimated using expanding windows, where analysis of each outage uses the total sample of data up to the day prior to the outage. For the Robinhood (Traditional Broker) outages, we use projections from the regression in which Robinhood Trading (Aggregate Retail Volume) is the dependent variable. Since the Robintrack data end in August 2020, we use the fitted values of a modified model which omits Robinhood Trading to predict Robinhood trading after August 2020.22 i,t-1 4.2 Broker Platform Outages and Trading Activity 22 The prediction windows for aggregate retail trading expand throughout the sample, whereas the prediction windows for expected Robinhood trading expand until August 2020 and the coefficients are fixed afterwards. 22",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 68,
    "chunk_index": 44,
    "word_count": 306,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "which omits Robinhood Trading to predict Robinhood trading after August 2020.22 i,t-1 4.2 Broker Platform Outages and Trading Activity 22 The prediction windows for aggregate retail trading expand throughout the sample, whereas the prediction windows for expected Robinhood trading expand until August 2020 and the coefficients are fixed afterwards. 22",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 68,
    "chunk_index": 45,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "We begin by exploring whether brokerage platform outages impact trading activity. Our approach relies on the following model, estimated with OLS regressions: 𝑇𝑟𝑑 = 𝛼 +𝛽 𝑅𝑒𝑡𝑇𝑟𝑑 +𝛽 𝑂𝑢𝑡𝑎𝑔𝑒 +𝛽 𝑅𝑒𝑡𝑇𝑟𝑑 ×𝑂𝑢𝑡𝑎𝑔𝑒 + 𝛾 + 𝛿 +𝜀 . (3) 𝑖,𝑡 1 𝑖,𝑑−1 2 𝑡 3 𝑖,𝑑−1 𝑡 𝑖 𝑑 𝑖,𝑡 The sample consists of 5-minute intervals, t, for each firm i during the window on day d when the broker experiences an outage, matched with 5-minute intervals for the same stock and time for each of the 5 trading days preceding the outage date. The dependent variable, 𝑇𝑟𝑑 , represents 𝑖,𝑡 trading activity, and we consider three alternative measures, trading volume, trading intensity (the number of trades), and aggregate retail volume. The RetTrd variable represent two alternative i,d-1 indicators. One is for stocks in the top quintile of expected Robinhood trading (Robinhood ), i,d-1 and the other is the top quintile of expected aggregate retail volume (Retail ), as described in i,d-1 Section 4.1.2. We also include firm, γ, and day, δ , fixed effects in the model. i d Table 5 presents the estimated slope coefficients and associated t-statistics, which we compute with standard errors that are heteroskedastic robust and clustered by firm and day (Petersen, 2009). Panel A presents results for high expected Robinhood trading, and Panel B for high expected aggregate retail trading. The first three columns present results during the Robinhood outages (Panel A) or traditional brokerage outages (Panel B). The key estimated coefficient is for the interaction between RetTrd and Outage which estimates how the trading i,d-1 t measures are impacted by outages for stocks that either Robinhood investors (Panel A) or all individual investors (Panel B) are most interested in. We observe that trading activity drops significantly during both sets of outages for the high interest stocks. For example, Robinhood outages coincide with 3.2% lower volume for Robinhood stocks, and traditional retail brokerage outages generate 2.6% lower trading volume for the stocks retail investors in general are most interested in. 23",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 68,
    "chunk_index": 46,
    "word_count": 337,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "observe that trading activity drops significantly during both sets of outages for the high interest stocks. For example, Robinhood outages coincide with 3.2% lower volume for Robinhood stocks, and traditional retail brokerage outages generate 2.6% lower trading volume for the stocks retail investors in general are most interested in. 23",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 68,
    "chunk_index": 47,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "To address concerns that the outage effects may be spurious, we repeat the analysis for pseudo-events in the last three columns of Table 5. The empirical approach is identical to specifications presented in the first three columns, except that we assume that the pseudo outage occurs one hour after the actual outage ends. The pseudo-event length is assumed to be 60 minutes or the length of the actual outage, whichever is greater, but it is required to take place on the same trading day as the outage. The estimate coefficients on the interaction between RetTrd and i,d-1 Outage are close to zero and statistically insignificant, regardless of specification, suggesting that t the drop in trading activity we observe for the high interest stocks is unique to the outages. 4.3 Brokerage Platform Outages and Market Liquidity Table 5 confirms that retail broker outages have significant effects on trading. Our motivating premise is that differences in retail investor trading styles could cause contrasting effects on market quality. In particular, the evidence in Table 3 suggests that some Robinhood traders tend to be more momentum-oriented and more likely to trade in the same direction as social media posting. If Robinhood investors frequently herd in certain stocks, it could lead to order imbalances that create inventory risk for market makers (e.g. Ho and Stoll, 1981; Grossman and Miller, 1988). In this section, we explore the effect of outages at Robinhood and other retail brokers on measures of market liquidity. We begin the analysis by examining trade and depth imbalances. In particular, we estimate OLS regressions of the following model: 𝐼𝑚𝑏 = 𝛼+𝛽 𝑅𝑒𝑡𝑇𝑟𝑑 +𝛽 𝑂𝑢𝑡𝑎𝑔𝑒 +𝛽 𝑅𝑒𝑡𝑇𝑟𝑑 ×𝑂𝑢𝑡𝑎𝑔𝑒 + 𝛾 + 𝛿 +𝜀 . (4) 𝑖,𝑡 1 𝑖,𝑑−1 2 𝑡 3 𝑖,𝑑−1 𝑡 𝑖 𝑑 𝑖,𝑡 The dependent variable, 𝐼𝑚𝑏 , represents alternative measures of inventory imbalances. We 𝑖,𝑡 consider trade imbalances as well as depth-weighted imbalances, which captures asymmetry in 24",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 68,
    "chunk_index": 48,
    "word_count": 318,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "𝑅𝑒𝑡𝑇𝑟𝑑 +𝛽 𝑂𝑢𝑡𝑎𝑔𝑒 +𝛽 𝑅𝑒𝑡𝑇𝑟𝑑 ×𝑂𝑢𝑡𝑎𝑔𝑒 + 𝛾 + 𝛿 +𝜀 . (4) 𝑖,𝑡 1 𝑖,𝑑−1 2 𝑡 3 𝑖,𝑑−1 𝑡 𝑖 𝑑 𝑖,𝑡 The dependent variable, 𝐼𝑚𝑏 , represents alternative measures of inventory imbalances. We 𝑖,𝑡 consider trade imbalances as well as depth-weighted imbalances, which captures asymmetry in 24",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 68,
    "chunk_index": 49,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "total depth around the midpoint of the best bid and ask (these variables are defined in more detail in Appendix A). The independent variables are the same as those described for Eq. (3). Table 6 presents the results, where Panel A analyzes Robinhood outages and Panel B focuses on traditional brokerage outages. We observe that Robinhood outages are associated with reduced trade order imbalances and lower market depth-weighted imbalances for the stocks Robinhood investors favor, which is consistent with inventory risk attenuating when Robinhood traders cannot trade. In contrast, the imbalance measures increase during traditional brokerage outages for the stocks retail investors favor, suggesting that inventory risk increases during outages at traditional brokers. For robustness, we find that the key results become insignificant for the pseudo outage period (last two columns of Table 6). We next consider the effects of the outages on various measures of stock liquidity by estimating the following model with OLS regressions: 𝐿𝑖𝑞 = 𝛼+𝛽 𝑅𝑒𝑡𝑇𝑟𝑑 +𝛽 𝑂𝑢𝑡𝑎𝑔𝑒 +𝛽 𝑅𝑒𝑡𝑇𝑟𝑑 ×𝑂𝑢𝑡𝑎𝑔𝑒 + 𝛾 + 𝛿 +𝜀 . (5) 𝑖,𝑡 1 𝑖,𝑑−1 2 𝑡 3 𝑖,𝑑−1 𝑡 𝑖 𝑑 𝑖,𝑡 Specifically, we analyze the effects of brokerage platform outages on Quoted Spread, Effective Spread, Realized Spread, and Price Impact for the stocks with the greatest expected Robinhood or general retail trading. The first four columns in Table 7 present the estimated slope coefficients and t-statistics for the Robinhood outages (Panel A) and traditional retail brokerage outages (Panel B). We find that spreads are significantly lower during the outages for the high Robinhood stocks. For example, effective spreads are 0.98 basis points lower on average compared to a mean of 13.58 basis points, which translates to a drop in effective spreads of about 7.22%. Since these variables measure illiquidity, the results suggest that liquidity improves when Robinhood investors are unable to trade. 25",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 68,
    "chunk_index": 50,
    "word_count": 305,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "stocks. For example, effective spreads are 0.98 basis points lower on average compared to a mean of 13.58 basis points, which translates to a drop in effective spreads of about 7.22%. Since these variables measure illiquidity, the results suggest that liquidity improves when Robinhood investors are unable to trade. 25",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 68,
    "chunk_index": 51,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "O’Hara (2015) highlights that market imbalances caused by classically uninformed traders can have effects similar to informed traders over the short time intervals of interest to market makers. In our setting, herding by Robinhood investors can create price pressure that extends beyond the five-minute horizon of the traditional price impact measure (Barber, et al., 2021). The evidence in Table 7 is consistent with this view, with Robinhood outages leading to significant reductions in measured price impact. In contrast to the evidence on Robinhood investors, outages at traditional retail brokers are associated with reduced market quality. In particular, the spread measures significantly increase for stocks with high expected aggregate retail trading during outages, suggesting that liquidity deteriorates on average when non-Robinhood retail investors are unable to trade. We confirm in the last four columns of Table 7 that the significant liquidity effects disappear if we instead use pseudo-outages that are one hour after the actual outages end.23 As discussed in Section 3.2, Robinhood investors are more likely to use liquidity- demanding orders than investors at other retail brokers, and lower use of liquidity-providing orders may help explain the different effects of outages across brokers. However, lower relative use of limit orders alone does not explain why Robinhood outages have a positive effect on market quality. The findings in Table 3 suggest that less sophisticated investors are more likely to trade in correlated ways than other retail investors, and the evidence in Tables 6 and 7 are consistent with herding by less sophisticated investors causing order imbalances that lead to inventory risk and harm market quality for stocks in the top quintile of Robinhood interest. 23 Each regression in Table 7 includes firm fixed effects that capture the average level of the dependent variable over the full sample period, including potentially both low and high retail interest periods. The significant coefficients on Robinhood and Retail indicate that the characteristics that lead a stock to have high expected retail trading, such as recent returns and volume, coincide with periods of relatively high liquidity for the stock. The lack of significant effects during the pseudo outages, along with the strong parallel trend evidence illustrated in Figures 2 and 3, help alleviate concerns that stock characteristics may be driving the results. 26",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 68,
    "chunk_index": 52,
    "word_count": 377,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "such as recent returns and volume, coincide with periods of relatively high liquidity for the stock. The lack of significant effects during the pseudo outages, along with the strong parallel trend evidence illustrated in Figures 2 and 3, help alleviate concerns that stock characteristics may be driving the results. 26",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "2.3 Measures of Market Quality and Market Maker Quotes",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 68,
    "chunk_index": 53,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.3 Measures of Market Quality and Market Maker Quotes (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "We next examine whether retail trading influences stock return volatility by analyzing brokerage platform outages with the following model, estimated with OLS regressions: 𝑉𝑜𝑙𝑎 = 𝛼 +𝛽 𝑅𝑒𝑡𝑇𝑟𝑑 +𝛽 𝑂𝑢𝑡𝑎𝑔𝑒 +𝛽 𝑅𝑒𝑡𝑇𝑟𝑑 ×𝑂𝑢𝑡𝑎𝑔𝑒 + 𝛾 + 𝛿 +𝜀 (6) 𝑖,𝑡 1 𝑖,𝑑−1 2 𝑡 3 𝑖,𝑑−1 𝑡 𝑖 𝑑 𝑖,𝑡, where Vola is measured from individual transaction prices for firm i during each five minute i,t window t. The independent variables are the same as those in Eqs. (3)-(5). We present the estimates of this model in Table 8. We find that Robinhood platform outages are associated with significantly lower volatility for high Robinhood stocks, suggesting that a reduction in Robinhood traders leads to less volatility. As with the prior evidence, the outages at other retail brokers give the opposite result, as volatility significantly improves for the high-retail-interest stocks when these retail investors cannot trade. The analogous evidence for pseudo outages is economically negligible and statistically insignificant, confirming that the volatility results hold only during actual platform outages. 4.5 Robustness An important potential concern in our setting is that outages may reflect capacity constraints that are reached during episodes of heightened market activity, and therefore outages may be endogenous with market quality.24 Though we acknowledge that it is difficult to conclude that brokerage outages are truly exogenous, we perform a number of robustness analyses to address concerns that the findings may be spurious. We previously document a lack of significant effects for pseudo-events measured one hour after actual outages. Table 9 reports several additional tests, 24 Platform capacity constraint issues may arise due to server capacity, hardware failure, software efficiency, or other issues related to platform overload. 27",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 68,
    "chunk_index": 54,
    "word_count": 278,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "the findings may be spurious. We previously document a lack of significant effects for pseudo-events measured one hour after actual outages. Table 9 reports several additional tests, 24 Platform capacity constraint issues may arise due to server capacity, hardware failure, software efficiency, or other issues related to platform overload. 27",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 68,
    "chunk_index": 55,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "where for brevity we report only the interaction terms that capture the effects of outages on stocks with high expected Robinhood or general retail trading. One concern is that outages may be driven by a relatively small number of firms with attention-grabbing news such as IPOs, firms with bankruptcy news, or stock splits (e.g. Cox, Van Ness, Van Ness, 2022).25 By excluding high-attention stocks from the analysis, we can examine the effects of platform outages on firms that are less likely to related to the cause of the outage but nevertheless impacted by it. In Panel A of Table 9, we exclude stocks that exhibit a 20% or more increase in the number of WallStreetBets mentions on the day of the outage relative to the lagged 5-day average, which translates to 68 stocks for the average outage. The market quality evidence continues to be robust. We next consider the possibility that outages may be particularly susceptible to after-hours market news or volatility during the market opening by excluding outages that begin before 9:45 AM (Panel B of Table 9). Additionally, well-publicized outages occurred on several days in March 2020, when markets experienced high volatility due to the developing Covid-19 pandemic. Although many of these days are already excluded from the analysis due to the sample restriction that omits simultaneous broker outages, we repeat the analysis after excluding all of the outages that occurred in March of 2020 (6 of the 96 outage events, Panel C of Table 9). The key results remain robust, which does not support the view that outage effects are spuriously driven by market news. Our benchmark period is measured using the week prior to the outage. In Panel D of Table 9, we repeat the analysis using a pre-outage benchmark window from day -10 through day -6, 25 It is also possible that trading is restricted in certain stocks following extreme trading due to brokerage collateral constraints that occurred in some listings during the GameStop episode of early 2021, which investors may interpret as an outage. However, we might expect capital constraint concerns to persist one or more days, whereas outages tend to be short-lived (the median duration is 30 minutes and the longest in our sample is 245 minutes). 28",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 68,
    "chunk_index": 56,
    "word_count": 375,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "listings during the GameStop episode of early 2021, which investors may interpret as an outage. However, we might expect capital constraint concerns to persist one or more days, whereas outages tend to be short-lived (the median duration is 30 minutes and the longest in our sample is 245 minutes). 28",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 68,
    "chunk_index": 57,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "instead of day -5 through -1. The findings survive this robustness test. In Panel E, we raise the minimum threshold of retail investor interest by removing firms in the lowest quintile of predicted Robinhood trading (for Robinhood outages) and predicted aggregate retail trading (for traditional broker outages). Again, the findings remain robust. We also confirm the robustness of the comparison windows. The pseudo-outages are assumed to occur one hour after the actual event. However, some outages in the sample either last long enough, or occur late enough in the afternoon, that an equal length pseudo outage cannot be formed on the same trading day. This results in a pseudo sample with fewer observations, and therefore less statistical power. In Panel F of Table 9, we report the results from our analysis in which we only include observations from an equal observation subsample, formed by decreasing the length of each outage to match the length of the pseudo window. The outage results remain robust. Additionally, although we consider treated stocks as those with high predicted Robinhood trading for Robinhood outages and those with high aggregate retail trading for Traditional Broker outages, Panel G presents across-group evidence which continues to support the view that Robinhood investors harm liquidity while other retail investors improve it. For example, outages at Traditional Brokers lead to significantly lower liquidity in Robinhood-favored stocks, suggesting that the contrasting findings are not driven by underlying firm characteristics. We report an additional robustness analysis in Table IA3 in the Internet Appendix, which presents the traditional broker evidence separately for each broker. The effects of outages on financial markets are consistent across Schwab, E-Trade, and Ameritrade, and 28 of the 30 coefficients are statistically significant. 29",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 68,
    "chunk_index": 58,
    "word_count": 285,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "underlying firm characteristics. We report an additional robustness analysis in Table IA3 in the Internet Appendix, which presents the traditional broker evidence separately for each broker. The effects of outages on financial markets are consistent across Schwab, E-Trade, and Ameritrade, and 28 of the 30 coefficients are statistically significant. 29",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 68,
    "chunk_index": 59,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Our final robustness check plots the time-series of market quality measures before, during, and after outages. Analogous to the difference-in-differences analysis, we construct the measures separately for stocks with high and low retail interest. We measure the market quality measures on the outage date relative to the average during that time of day over the benchmark period of the previous five days, and we standardize the differences by dividing by the standard deviation of the benchmark observations. So that the plots show pre-outage trends and have a consistent outage window, this sample is comprised of the 12 Robinhood and 14 traditional retail broker outages that occur after 10:00am and that last no longer than 15 minutes. We plot the abnormal market quality measures in Figure 2 (Robinhood outage) and Figure 3 (traditional retail broker outages). The figures plot the measures for each five-minute interval over the period spanning 45 minutes before the outage to 45 minutes after the outage begins. The plots highlight that volume, illiquidity, and volatility drop (illiquidity and volatility rise) for stocks with high expected Robinhood (aggregate retail) trading precisely during the outage window reported on Downdetector, while remaining relatively flat for the control set of firms. Moreover, the plots generally follow parallel trends prior to the outage, and market conditions begin to return to normal fairly quickly after the outage ends. 5. Retail Investors and Market Making Firms In this section we examine the effects of retail investor trading on market making firms. In particular, we analyze the effects of outages on retail-broker affiliated quoting behavior, and we study how wholesaler profitability is impacted by toxic retail trading. 5.1 Brokerage Platform Outages and Dealer Quoting Behavior The market quality evidence in the previous section raises the question of how off- exchange trading influences measures of public market quality. Although off-exchange retail 30",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 68,
    "chunk_index": 60,
    "word_count": 306,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "retail-broker affiliated quoting behavior, and we study how wholesaler profitability is impacted by toxic retail trading. 5.1 Brokerage Platform Outages and Dealer Quoting Behavior The market quality evidence in the previous section raises the question of how off- exchange trading influences measures of public market quality. Although off-exchange retail 30",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 68,
    "chunk_index": 61,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "trading occurs in dark markets, trading must be reported to FINRA within ten seconds.26 However, the more natural path for dark trading to influence lit market quality is through the high frequency trading firms that make markets for retail investors. Payment for order flow arrangements have existed for decades (e.g. Battalio, 1997; Bessembinder and Kaufman, 1997). In recent years, however, the HFT firms that provide liquidity to retail orders off exchange have also become the largest market makers on public markets,27 which suggests that information about retail trading may influence lit market quality directly through these firms’ algorithms. FINRA regulation 5320 prohibits front-running of customer orders, and HFT firms implement information barriers to prevent market making units from obtaining knowledge of customer orders held by their wholesale (payment for order flow) units. However, algorithms for both units are influenced by the firm’s overall position and internal risk tolerance in the stock. If the firm reaches a threshold for inventory capacity, each unit’s appetite for risk will adjust accordingly.28 As a result, shocks to the operations of the wholesale unit may influence liquidity provision by the market making unit. We explore this channel by studying individual market maker quoting behavior. If the changes to market quality during outages are mediated by HFTs with payment for order flow arrangements with Robinhood or the other retail brokers, we would expect to observe changes specifically to the affiliated HFTs’ quoting behavior. Although HFT market makers often quote anonymously, their algorithms govern their mandated publicly displayed quotes, and it is 26 https://www.finra.org/filing-reporting/market-transparency-reporting/trade-reporting-faq#102 27 For example, Virtu Financial acquired Cohen Capital in 2011 and Citadel acquired KCG’s market making business in 2016. Currently Virtu and Citadel, which both internalize orders for Robinhood and other retail brokers, are two of the three designated market maker firms on NYSE. 28 Virtu Financial, Inc. states in their 2014 prospectus that “if our risk management system detects a trading strategy generating revenues outside of our preset limits it will freeze, or lockdown, that strategy and alert risk management personnel and management.” https://www.sec.gov/Archives/edgar/data/1592386/000104746914002070/a2218589zs- 1.htm 31",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 68,
    "chunk_index": 62,
    "word_count": 344,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "three designated market maker firms on NYSE. 28 Virtu Financial, Inc. states in their 2014 prospectus that “if our risk management system detects a trading strategy generating revenues outside of our preset limits it will freeze, or lockdown, that strategy and alert risk management personnel and management.” https://www.sec.gov/Archives/edgar/data/1592386/000104746914002070/a2218589zs- 1.htm 31",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 68,
    "chunk_index": 63,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "likely that material shocks to firm-wide retail order flow would influence the market maker quotes, which we identify with ITCH data (see Section 2.3). We explore this hypothesis in Table 10, which reports the results of estimating Equations (4) and (5) for depth imbalances and bid-ask spreads, respectively, measured from the quotes with the identities of Robinhood- or Traditional-Broker- affiliated dealers and unaffiliated dealers (listed in Table IA1 in the Internet Appendix). We report results for Robinhood outages in Panel A and Traditional Broker outages in Panel B. The regression results show that for high expected Robinhood (aggregate retail) trading stocks, outages are associated with narrowing (widening) of market maker spreads and decreased (increased) depth imbalances for Robinhood (Traditional Broker) affiliated market makers. Further, the effects on spreads and depth imbalances are insignificant for the unaffiliated market maker quotes. These results are consistent with the notion that the effects of retail trading on market quality are facilitated through dealers with payment for order flow arrangements with retail brokers. 5.2 Wholesaler Profits and Toxic Retail Trading The outage evidence indicates that when Robinhood investors are absent, market quality improves in stocks with high expected Robinhood trading, suggesting that less sophisticated investors create important inventory risks for market makers. In light of this evidence, a natural question arises as to why wholesalers would pay Robinhood for their order flow. In this section, we discuss potential explanations and evaluate their merits by analyzing wholesaler realized spread data from SEC disclosures. An essential feature of wholesalers’ payment for order flow arrangements with retail brokers is that services are offered for the overall portfolio rather than stock by stock or trade by trade. It is important to note that not all of Robinhood trading is likely to be toxic. Our outage 32",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 68,
    "chunk_index": 64,
    "word_count": 297,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "An essential feature of wholesalers’ payment for order flow arrangements with retail brokers is that services are offered for the overall portfolio rather than stock by stock or trade by trade. It is important to note that not all of Robinhood trading is likely to be toxic. Our outage 32",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 68,
    "chunk_index": 65,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "analysis employs a difference-in-difference approach that compares stocks in the highest quintile of expected Robinhood trading to the remaining four quintiles. The findings support the view that Robinhood investors create inventory risk in high interest stocks. However, Figure 2 provides no evidence that outages effect market quality for stocks in quintiles 1-4 of Robinhood interest. Affiliated wholesalers have incentives to commit to accepting order flow and paying competitive order flow rates across all stocks as long as profits in non-toxic stocks more than offset potential losses in toxic stocks. Wholesalers may also have incentives to pay for order flow specifically in toxic stocks. Robinhood employs a routing algorithm that is designed to foster competition among wholesalers. In particular, order flow for each stock is routed across multiple wholesalers based on the level of price improvement provided in the stock over the previous month.29 As a result, wholesalers have incentives to interact with toxic orders, i.e., orders that can may lead to low or even negative realized spreads, provided that future profits in the stock are sufficient to compensate for any losses in the short run. A key testable hypothesis is that stocks’ order flow should be toxic only temporarily. We test this prediction by collecting data on reported realized spreads from SEC Rule 605 disclosures for wholesaler firms that pay for Robinhood order flow. The realized spread data provide a monthly, stock-level approximation for the residual profit available to wholesalers (e.g., Conrad and Wahal, 2020; Jain, et al., 2021).30 In particular, we calculate wholesaler total dollar realized spreads for each stock-month by multiplying the average per share dollar realized spread 29 As discussed in comment 25 in the following SEC document: https://www.sec.gov/litigation/admin/2020/33- 10906.pdf. 30 For example, the SEC Disclosure of Order Execution and Routing Practices document states “The smaller the average realized spread, the more market prices have moved adversely to the market center's liquidity providers after the order was executed, which shrinks the spread \"realized\" by the liquidity providers. In other words, a low average realized spread indicates that the market center was providing liquidity even though prices were moving against it for reasons such as news or market volatility.” https://www.sec.gov/rules/final/34-43590.htm#P204_80792 33",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 68,
    "chunk_index": 66,
    "word_count": 363,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "center's liquidity providers after the order was executed, which shrinks the spread \"realized\" by the liquidity providers. In other words, a low average realized spread indicates that the market center was providing liquidity even though prices were moving against it for reasons such as news or market volatility.” https://www.sec.gov/rules/final/34-43590.htm#P204_80792 33",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 68,
    "chunk_index": 67,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "by the number of shares traded, and we then aggregate dollar spreads across Robinhood-affiliated wholesalers. We use the same data filters as above: price above $1, daily minimum of 50 Robinhood owners and 5,000 shares in aggregate retail volume, and CRSP, Compustat, TAQ, and ITCH data availability. The resulting sample is comprised of 1,817 stocks on average each month. Stock-level aggregate wholesaler profits average $5,172 each month, and the 25th and 75th percentiles are $3,065 and $14,755, respectively. We consider two proxies for toxic stocks that are likely to lead to low wholesaler realized spreads. The first measure captures heavy buying or selling by Robinhood investors and is calculated as the monthly absolute change in Robinhood ownership. The second measure is based on monthly mentions on WallStreetBets, with the premise that less sophisticated investors are likely to herd in stocks that are discussed heavily on finance social media. We form quintiles each month based on each of the two stock-level toxicity measures, and we analyze how wholesaler profits vary around the portfolio formation month.31 Figure 4 illustrates average wholesaler profits for month t, the month during which toxicity is measured, as well as the three months before and after t. Prior to the portfolio formation month, wholesaler profits are largely indistinguishable between toxic (Q5) and non-toxic (Q1-4) stocks using both measures of toxicity, suggesting that stock-level toxicity is not easily predictable. Wholesaler profits spreads dip into negative territory in month t for toxic stocks but return to positive and more than offset the losses during the toxic period. The results are consistent with wholesalers taking on Robinhood order flow that risks negative profits in the short-run in order to garner access to future profitable order flow. 31 The sample period for the Robinhood ownership proxy ends in August 2020, when Robinhood ownership data becomes unavailable, whereas the second proxy based on WallStreetBets mentions is available for the full sample period. 34",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 68,
    "chunk_index": 68,
    "word_count": 321,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "negative profits in the short-run in order to garner access to future profitable order flow. 31 The sample period for the Robinhood ownership proxy ends in August 2020, when Robinhood ownership data becomes unavailable, whereas the second proxy based on WallStreetBets mentions is available for the full sample period. 34",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 68,
    "chunk_index": 69,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "We note that average realized spreads for stocks in quintiles 1-4 are consistently positive, and since this portfolio represents roughly four times the size of toxic quintile, it indicates that trading across all Robinhood interest stocks produces reliably positive realized spreads. Thus, the evidence suggests that it is profitable in aggregate to purchase order flow from Robinhood. Table 11 tests whether wholesaler profits in month t are statistically different for toxic stocks using a regression approach. Specifically, for each event month from month t-3 to t+3, we regress wholesaler profits on an indicator variable that is equal to one if the stock is in the most toxic quintile in month t and zero otherwise. As in Figure 4, we consider two proxies for Robinhood interest, the absolute change in Robinhood owners (Panel A) and WallStreetBets activity (Panel B). Each specification includes firm and month fixed effects, and the reported intercepts are the average of the fixed effect coefficients in each specification. The coefficient on toxic captures the incremental effect on wholesaler realized spreads for stocks in the most toxic quintile. The regression results are consistent with the evidence in Figure 4. Specifically, wholesaler profits for toxic stocks are significantly lower in month t, both economically and statistically, but there is little evidence that wholesaler profits differ across stocks in the months before or after the toxic month. Moreover, as evidenced by the average of the fixed effects, dollar profits remain positive on average across stocks, suggesting that wholesalers earn positive spreads in aggregate from interacting with Robinhood order flow. The findings are consistent with the notion that wholesalers are willing to take on toxic order flow in the current month because doing so garners profitable future order flow in the same stocks. Moreover, wholesaler order flow profits from non- toxic stocks each month offset losses from toxic stocks. 6. Conclusion 35",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 68,
    "chunk_index": 70,
    "word_count": 311,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "are consistent with the notion that wholesalers are willing to take on toxic order flow in the current month because doing so garners profitable future order flow in the same stocks. Moreover, wholesaler order flow profits from non- toxic stocks each month offset losses from toxic stocks. 6. Conclusion 35",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 68,
    "chunk_index": 71,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "The rise of Robinhood, with its zero-commission trades and easy-to-use interface, has helped enable a dramatic increase in investor participation by new retail traders. We examine how this new group of investors trades and impacts market quality relative to other retail investors. We find evidence that Robinhood trading is strongly positively related to lagged social media mentions, whereas WallStreetBets does not positively impact retail trading at more traditional brokers. Further, Robinhood investors tend to exhibit momentum trading, in contrast with other retail investors who tend to be contrarian, consistent with liquidity provision. We exploit brokerage platform outages to measure the effects of the retail investors on market quality. Our analysis indicates that during platform outages, stocks favored by Robinhood users experience reduced bid-ask spreads and price impacts as well as lower return volatility, suggesting that Robinhood investors negatively impact market quality in stocks with high retail interest. In contrast, outages at other retail brokers have the opposite effect. Specifically, measures of market quality significantly deteriorate in stocks with high expected aggregate retail volume during outages at traditional brokers, suggesting that retail traders from the more traditional brokers have a positive effect on market quality. Pseudo-events that are assumed to occur one hour after the actual outage are not associated with changes in market quality. Additionally, the results remain robust after a number of additional robustness checks, and event-time plots confirm pre- outage parallel trends. However, we acknowledge that outages are unlikely to be truly exogenous, and we interpret the findings as reflecting the effects of retail investors during periods when investors place a high value on liquidity. We next examine the role HFTs play in mediating the effects of retail trading on financial markets. We observe that quoted bid-ask spreads narrow for Robinhood-affiliated HFTs and increase for Traditional-Broker-affiliated HFTs during outages. Further, decreases in trade and 36",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 68,
    "chunk_index": 72,
    "word_count": 307,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "during periods when investors place a high value on liquidity. We next examine the role HFTs play in mediating the effects of retail trading on financial markets. We observe that quoted bid-ask spreads narrow for Robinhood-affiliated HFTs and increase for Traditional-Broker-affiliated HFTs during outages. Further, decreases in trade and 36",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 68,
    "chunk_index": 73,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "quote imbalance during Robinhood outages suggest that Robinhood trading is associated with enhanced inventory risks for affiliated dealers in high retail interest stocks, whereas increases in imbalances during outages at traditional brokers suggest that the top quintile of retail trading at the more traditional brokers leads to diminished inventory risks. The public quoting results highlight the interaction between off-exchange trading and public market quality. Taken together, the findings indicate that the impact of retail investors on financial markets depends on the nature of their trading. Although we cannot definitively conclude that Robinhood traders are fundamentally different than investors at other retail brokers, the trading evidence suggests there is a considerable group of herding-oriented, momentum traders at Robinhood that creates inventory risk and harms liquidity in high retail interest stocks. In contrast, aggregate retail trading tends to be contrarian in nature, and their trading is associated with more balanced order flow and improved market quality. We conclude our analysis by shedding light on why wholesalers pay Robinhood for order flow if it potentially carries elevated inventory risk. Using realized spreads from 605 filings to proxy for wholesaler profits, we provide evidence suggesting that wholesalers pay for toxic (high inventory risk) order flow to maintain access to more profitable order flow. Specifically, we find evidence that realized spreads can be negative in the most toxic stocks, yet wholesalers profit overall by trading in Robinhood-oriented stocks. Moreover, we find evidence that stocks are toxic only temporarily, and thus wholesalers have incentives to accept toxic order flow in the short-run to gain access to future profitable order flow in the stock. 37",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 68,
    "chunk_index": 74,
    "word_count": 268,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "negative in the most toxic stocks, yet wholesalers profit overall by trading in Robinhood-oriented stocks. Moreover, we find evidence that stocks are toxic only temporarily, and thus wholesalers have incentives to accept toxic order flow in the short-run to gain access to future profitable order flow in the stock. 37",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 68,
    "chunk_index": 75,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Appendix A: Variable Definitions A.1 Key Explanatory Variables  Robinhood Change – Stock i’s change in Robinhood ownership measured over hourly, daily, and weekly horizons. Winsorized at 1% tails. Source: Web Scraping.  Robinhood % Change – Stock i’s change in Robinhood ownership measured over hourly, daily, and weekly horizons. Winsorized at 1% tails. Source: Web Scraping.  Robinhood – Indicator variable equal to one for stocks in top quintile of expected i,d-1 Robinhood Trading from fitted values (see Section 4.1.2).  Retail – Indicator variable equal to one for stocks in top quintile of expected aggregate i,d-1 retail trading from fitted values (see Section 4.1.2).  Outage – An indicator variable that denotes periods experiencing brokerage platform outages (1 if an outage occurs during period t and 0 otherwise). Source: Downdetector  Toxic – A monthly stock-level indicator that is designed to capture retail trading that creates inventory risk for wholesalers. Toxic denotes stocks in the top quintile of the absolute value of changes in Robinhood users in the current month, or stocks in the top quintile based on the total number of WallStreetBets mentions in the current month. A.2 Outcome Variables  Return (Table 2) – This variable represents security i's return measured over various intervals. For example, Return[1,5] represents the return from day 1 through day 5. Source: CRSP  Robinhood Purchases (Table 3) – Stock i’s daily change in Robinhood users that hold the stock, Winsorized at 1% tails. Source: Web Scraping.  Robinhood Trading (Table 4) – Stock i’s daily sum of absolute hourly changes in Robinhood users that hold the stock. Winsorized at 1% tails. Source: Web Scraping.  Aggregate Retail Order Imbalance (Table 3) – Signed aggregate retail volume scaled by total retail volume, using Boehmer et al., (2020) to identify retail trades. Winsorized at 1% tails. Source: TAQ.  Aggregate Retail Volume / Volume (Table 4) – Aggregate Retail Volume scaled by total Trading Volume.  Trading Volume (Tables 5, 9) – Natural log of the total share volume. Winsorized at 1% tails. Source: TAQ.  Trading Intensity (Tables 5, 9) – Natural log of the total number of trades. Winsorized at 1% tails. Source: TAQ.  Trade Imbalance (Tables 6, 9) – The absolute difference between the dollar volume of buy and sell trades, expressed as a percent of total dollar volume of buy and sell trades. Winsorized at 1% tails. Source: TAQ.  Depth-Weighted Imbalance (Tables 6, 9) – The imbalance of resting limit orders. It is the absolute difference between the depth-weighted limit buy order price distance from the quoted midpoint and the depth-weighted limit sell order distance from the quoted midpoint, 38",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 68,
    "chunk_index": 76,
    "word_count": 444,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "sell trades. Winsorized at 1% tails. Source: TAQ.  Depth-Weighted Imbalance (Tables 6, 9) – The imbalance of resting limit orders. It is the absolute difference between the depth-weighted limit buy order price distance from the quoted midpoint and the depth-weighted limit sell order distance from the quoted midpoint, 38",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 68,
    "chunk_index": 77,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "scaled by the quoted midpoint. We exclude stub quotes and quotes more than 10% away from the NBBO. Source: Nasdaq TotalView ITCH.  Quoted Spread (Tables 7, 9) – Equal-weighted average of best bid-ask spread, scaled by the midquote, during the intraday window. Winsorized at 1% tails. Source: TAQ.  Effective Spread (Tables 7, 9) – Equal-weighted average of the effective spread during the intraday window. For each transaction, the effective spread is defined as 2×|ln(P ) – ln(M )|, k k where P is the trade price and M is the prevailing midquote. Winsorized at 1% tails. Source: TAQ.  Realized Spread (Tables 7, 9) – Equal-weighted average of the realized spread during the intraday window. For each transaction, the realized spread is defined as 2×D (ln(P ) – k k ln(M )), where D equals 1 for a buy transaction and -1 for a sell transaction and is valid 5 k+5 k minutes after the kth transaction. Trade sign is based on Lee and Ready (1991) algorithm. Winsorized at 1% tails. Source: TAQ.  Price Impact (Tables 7, 9) – Equal‐weighted average of the price impact. For each transaction, the price impact is defined as 2×D (ln(M )- ln(M )), where M is the bid-ask k k+5 k k+5 mid-point five minutes after the kth transaction. Winsorized at 1% tails. Source: TAQ.  Volatility (Tables 8, 9) – The trade-based standard deviation of returns during the 5-minute period, if have a minimum of 10 trades. Winsorized at 1% tails. Source: TAQ.  Affiliated Market Maker Spreads (Table 10) – The average distance between the best bid and best offer of market makers that have payment for order flow arrangements with the broker experiencing the outage. MPID is identified from Nasdaq TotalView ITCH (See Table IA1 for the list of affiliated Market Makers). Spreads are time-weighted for each MPID during each five-minute window, and then averaged across MPIDs. We exclude stub quotes and quotes more than 10% away from the NBBO.  Other Market Maker Spreads (Table 10) – The average distance between the best bid and best offer of market makers that do not have payment for order flow arrangements with the broker experiencing the outage. MPID is identified from Nasdaq TotalView ITCH (See Table IA1 for complete list of unaffiliated market makers). Spreads are time-weighted for each MPID during each five-minute window, and then averaged across MPIDs. We exclude stub quotes and quotes more than 10% away from the NBBO.  Affiliated Market Maker Depth Imbalance (Tables 10) – The depth-weighted imbalance for the orders with MPID attributions, where only orders from market makers that have payment for order flow arrangement with the broker experiencing the outage are included. MPID is identified from Nasdaq TotalView ITCH (See Table IA1 for a complete list of affiliated Market Makers). We exclude stub quotes and quotes more than 10% away from the NBBO.  Other Market Maker Depth Imbalance (Table 10) – The depth-weighted imbalance for the orders with MPID attributions, where only orders from market makers that do not have payment for order flow arrangement with the broker experiencing the outage are included. MPID is identified from Nasdaq TotalView ITCH (See Table IA1 for complete list of unaffiliated market makers). We exclude stub quotes and quotes more than 10% away from the NBBO. 39",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 68,
    "chunk_index": 78,
    "word_count": 555,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "market makers that do not have payment for order flow arrangement with the broker experiencing the outage are included. MPID is identified from Nasdaq TotalView ITCH (See Table IA1 for complete list of unaffiliated market makers). We exclude stub quotes and quotes more than 10% away from the NBBO. 39",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 68,
    "chunk_index": 79,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": " Wholesaler Profits (Table 11) – For each stock-month, average dollar spreads are multiplied by the number of shares traded by the wholesaler. Total dollar spreads are then aggregated across Robinhood-affiliated wholesalers. Source: SEC Rule 605 reports. A.3 Control Variables for Tables 2-4  Return – This variable represents security i's return measured over various intervals. For example, Return[-5,-1] represents the return from day -5 through day -1. Return Overnight represents stock returns measured from the closing price on day t-1 to the opening price on day t. Winsorized at 1% tails. Source: CRSP.  Market Cap – Each security's price multiplied by the number of shares outstanding. We log transform market equity and lag it by one day. Winsorized at 1% tails. Source: CRSP.  Book-to-Market – The ratio of book equity from the most recent fiscal year to the market equity from the past December. Winsorized at 1% tails. Source: Compustat and CRSP  Return Skewness – The one-month idiosyncratic skewness of Harvey and Siddique (2000), calculated as the third moment of the residual obtained from the regression of the previous month’s daily returns on excess market returns and squared excess market returns. Winsorized at 1% tails. Source: CRSP.  WallStreetBets – an indicator variable representing stocks in quintile i based on number of i unique users who post about a stock on WallStreetBets over the previous five days. Source: Web Scraping.  Return Range – is the high closing price minus the low closing price from the previous 60 day period. Source: CRSP.  Volume – Natural log of the total share volume. Winsorized at 1% tails. Source: TAQ.  Price – The price of the stock on day t-1. 40",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 68,
    "chunk_index": 80,
    "word_count": 284,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": " Return Range – is the high closing price minus the low closing price from the previous 60 day period. Source: CRSP.  Volume – Natural log of the total share volume. Winsorized at 1% tails. Source: TAQ.  Price – The price of the stock on day t-1. 40",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 68,
    "chunk_index": 81,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Appendix B: WallStreetBets Search Approach We rely on natural language processing tools to identify stock mentions on the Reddit forum WallStreetBets. For each stock in our sample, we use company information to create a set of searchable tokens. Namely, the searchable tokens include ticker prepended by $, ticker without $ prepended, full company name including entity type (Inc., Co., LLC), full company name excluding entity type, first word of company name, and bi-grams of first two words in company name. To avoid misclassifications, we require the search tokens not to be contained in the 5000 most common words in the Oxford English Corpus (OEC), or the 5000 most common words or bigrams in the Top 10 Reddit forums in December 2018. We also remove common finance and social media acronyms. Non-unique searchable terms are removed so that each search token has a one-to-one mapping between the search term and stock. The algorithm is applied to the text from all posts and comments from WallStreetBets during the period of January 2019 to June 2021. The method is conservative in that it may not capture all mentions of an individual stock. However, it minimizes the likelihood of misidentifying stock mentions. Below are five examples: Company Name (Ticker) American Airlines Ford Motor United States Group Inc. Apple, Inc. Company Macy’s Inc Steel Corporation (AAL) (AAPL) (F) (M) (X) Included Search Terms $AAL, AAL, American Airlines $F, Group Inc., Ford Motor $X, American Airlines $AAPL, Company, United States Steel Group, AAPL, Ford Motor, Macy’s Inc., Corporation, American Airlines Apple Inc. Ford Macy’s United States Steel Excluded Search Terms American Apple F $M, M X, United States 41",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 68,
    "chunk_index": 82,
    "word_count": 273,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "(M) (X) Included Search Terms $AAL, AAL, American Airlines $F, Group Inc., Ford Motor $X, American Airlines $AAPL, Company, United States Steel Group, AAPL, Ford Motor, Macy’s Inc., Corporation, American Airlines Apple Inc. Ford Macy’s United States Steel Excluded Search Terms American Apple F $M, M X, United States 41",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "4.4 Brokerage Platform Outages and Price Volatility",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 68,
    "chunk_index": 83,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4 Brokerage Platform Outages and Price Volatility (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Bali, T., Hirshleifer, D., Peng, L. and Tang, Y., 2021. Attention, Social Interaction, and Investor Attraction to Lottery Stocks, Working Paper. Barber, B., Huang, X., Odean, T., and Schwarz, C., 2021. Attention Induced Trading and Returns: Evidence from Robinhood Users, Working Paper. Barber, B., Lin, S., and Odean. T., 2021. Resolving a Paradox: Retail Trades Positively Predict Returns but Are Not Profitable. Working Paper. Barber, B. and Odean, T., 2000. Trading is hazardous to your wealth: The Common Stock Investment Performance of Individual Investors. Journal of Finance 55, 773-806. Barber, B., and Odean, T., 2001. Boys will be Boys: Gender, Overconfidence, and Common Stock Investment. Quarterly Journal of Economics, 116: 261-292. Barber, B., Odean, T., and Zhu, N., 2009. Do Retail Trades Move Markets? Review of Financial Studies 22, 151-186. Barrot, J. N., Kaniel, R., & Sraer, D., 2016. Are Retail Traders Compensated for Providing Liquidity? Journal of Financial Economics, 120, 146-168. Basak, S. 2020. Robinhood Blows Past Rivals in Record Retail Trading Year. Retrieved from https://www.bloomberg.com/news/articles/2020-08-10/robinhood-blows-past-rivals-in- record-year-for-retail-investing Battalio, R., 1997. Third Market Broker‐Dealers: Cost Competitors or Cream Skimmers? Journal of Finance 52: 351-352. Battalio, R., Corwin, S. A., Jennings, R., 2016. Can Brokers Have It All? On the Relation between Make-Take Fees and Limit Order Execution Quality, Journal of Finance, 71: 2193-2238. Bessembinder, H., and Kaufman, H., 1997. A Cross-Exchange Comparison of Execution Costs and Information Flow for NYSE-Listed Stocks. Journal of Financial Economics 46: 293-319. Bianchi, M., 2018. Financial Literacy and Portfolio Dynamics. Journal of Finance 73: 831-859. Boehmer, E., Jones, C., Zhang, X., and Zhang, X., 2020. Tracking Retail Investor Activity. Journal of Finance, Forthcoming. Boehmer, E., and Song, W., 2020. Smart Retail Traders, Short Sellers, and Stock Returns, Working Paper. Bradley, D., Hanousek, J., Jame, R., and Xiao, Z. 2021. Place Your Bets? The Market Consequences of Investment Research on Reddit's Wallstreetbets, Working Paper. 42",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 68,
    "chunk_index": 84,
    "word_count": 309,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "2020. Tracking Retail Investor Activity. Journal of Finance, Forthcoming. Boehmer, E., and Song, W., 2020. Smart Retail Traders, Short Sellers, and Stock Returns, Working Paper. Bradley, D., Hanousek, J., Jame, R., and Xiao, Z. 2021. Place Your Bets? The Market Consequences of Investment Research on Reddit's Wallstreetbets, Working Paper. 42",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 68,
    "chunk_index": 85,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Buti, S., Rindi, B., and Werner, I., 2017. Dark Pool Trading Strategies, Market Quality and Welfare, Journal of Financial Economics, 124: 244-265. Brogaard, J., Hendershott, T., and Riordan, R., 2017. High-Frequency Trading and the 2008 Short Sale Ban, Journal of Financial Economics, 124: 22–42. Campbell, J. Y., and Kyle, A. S., 1993. Smart Money, Noise Trading, and Stock Price Behavior, Quarterly Journal of Economics, 108: 905–939. Chen, H., De, P., Hu, J., and Hwang, B.H., 2014. Wisdom of the Crowds: The Value of Stock Opinions Transmitted through Social Media. Review of Financial Studies 27, 1367-1403. Chordia, T., and Miao, B., 2020. Market Efficiency in Real Time: Evidence from Low-Latency Activity around Earnings Announcements. Journal of Accounting and Economics, 70: 1-27. Comerton-Forde, C., Malinova, K., and Park, A., 2018. Regulating Dark Trading: Order Flow Segmentation and Market Quality. Journal of Financial Economics, 130: 347-366. Conrad, J., and Wahal, S., 2010. The Term Structure of Liquidity Provision. Journal of Financial Economics, 136: 239-259. Cookson, J. A., Engelberg, J., and Mullins, W., 2020. Echo chambers. Working paper. Cookson, J. A., Fos, V., and Niessner, M., 2021, Does Disagreement Facilitate Informed Trading? Evidence from Activist Investors, Working Paper, University of Colorado. Cox, J., Van Ness, B., and Van Ness, R., 2022, Stock Splits and Retail Trading, Financial Review, forthcoming. DeLong, J. B., Shleifer, A., Summers, L. H., and Waldmann, R. J., 1990. Noise Trader Risk in Financial Markets, Journal of Political Economy, 98: 703–738. Dhar, R., Zhu, N., 2006. Up Close and Personal: Investor Sophistication and the Disposition Effect. Management Science 52, 726-740. Easley, D., Kiefer, N., and O’Hara, M., 1996. Cream-Skimming or Profit-Sharing? The Curious Role of Purchased Order Flow, Journal of Finance 51: 811-833. Farrell, M., Green, T. C., Jame, R., and Markov, S., 2020. The Democratization of Investment Research and the Informativeness of Retail Investor Trading, Working Paper. Foucault, T., Sraer, D., and Thesmar, D., 2011. Individual Investors and Volatility, Journal of Finance, 66: 1369-1406. Glossner, S., Matos, P., Ramelli, S., and Wagner, A., 2021, Do Institutional Investors Stabilize 43",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 68,
    "chunk_index": 86,
    "word_count": 339,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "and Markov, S., 2020. The Democratization of Investment Research and the Informativeness of Retail Investor Trading, Working Paper. Foucault, T., Sraer, D., and Thesmar, D., 2011. Individual Investors and Volatility, Journal of Finance, 66: 1369-1406. Glossner, S., Matos, P., Ramelli, S., and Wagner, A., 2021, Do Institutional Investors Stabilize 43",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 68,
    "chunk_index": 87,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Equity Markets in Crisis Periods? Evidence from COVID-19, Working Paper, University of Virginia. Glosten, L., and Milgrom, P. R., 1985. Bid, Ask and Transaction Prices in a Specialist Market with Heterogeneously Informed Traders, Journal of Financial Economics 14: 71–100. Goetzmann, W. N., Kumar, A., 2008. Equity Portfolio Diversification. Review of Finance 12, 433- 463. Greene, J., and Smart, S., 1999. Liquidity Provision and Noise Trading: Evidence from the “Investment Dartboard” Column, Journal of Finance 54: 1885-1899. Greenwood, N., and Nagel, S. 2009. Inexperienced Investors and Bubbles, Journal of Financial Economics 93: 239-258. Grossman, S., and Miller, M., 1988. Liquidity and Market Structure, Journal of Finance, 43: 617– 633. Hagströmer, B. and Nordén, L., 2013. The Diversity of High-Frequency Traders. Journal of Financial Markets, 16: 741-770. Hasbrouck, J., and Saar, G., 2013. Low-Latency Trading, Journal of Financial Markets, 16: 646- 679. Hendershott, T., Jones, C., and Menkveld, A., 2011. Does algorithmic trading improve liquidity? Journal of Finance, 66: 1–33. Hendershott, T., and A. J. Menkveld. 2014. Price Pressures. Journal of Financial Economics 114:405–23. Heimer, R., 2016. Peer Pressure: Social Interaction and the Disposition Effect. Review of Financial Studies 29, 3177–3209. Hirschey, N., 2020. Do High-Frequency Traders Anticipate Buying and Selling Pressure? Management Science, forthcoming Ho, T., and Stoll, H., 1981. Optimal Dealer Pricing under Transactions and Return Uncertainty, Journal of Financial Economics, 9:47–73. Hu, D., C. M. Jones, V. Zhang, and X. Zhang. 2021. The Rise of Reddit: How Social Media Affects Retail Investors and Short-Sellers’ Roles in Price Discovery. Working Paper. Jain, P., Mishra, S., O’Donoghue S., and Zhao, L., 2021. Trading volume shares and market quality: Pre- and post-zero commissions. Working Paper. Jame, R., Johnston, R., Markov, S., and Wolfe, M., 2016. The value of crowdsourced earnings 44",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 68,
    "chunk_index": 88,
    "word_count": 289,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Media Affects Retail Investors and Short-Sellers’ Roles in Price Discovery. Working Paper. Jain, P., Mishra, S., O’Donoghue S., and Zhao, L., 2021. Trading volume shares and market quality: Pre- and post-zero commissions. Working Paper. Jame, R., Johnston, R., Markov, S., and Wolfe, M., 2016. The value of crowdsourced earnings 44",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 68,
    "chunk_index": 89,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "forecasts. Journal of Accounting Research 54, 1077-1110. Kaniel, R., Saar, G., and Titman, S., 2008. Individual Investor Sentiment and Stock Returns. Journal of Finance 63, 273-310. Kaniel, R., Liu, S., Saar, G., and Titman, S., 2012. Individual Investor Trading and Return Patterns around Earnings Announcements. Journal of Finance 67, 639-680. Kelley, E., and Tetlock, P., 2013. How Wise are Crowds? Insights from Retail Orders and Stocks Returns. Journal of Finance 68, 1229-1265. Kelley, E., and Tetlock, P., 2017. Retail Short-Selling and Stock Prices. Review of Financial Studies 30, 801-834. Kirilenko, A., Kyle, A., Samadi, M., and Tuzun, T., 2011. The Flash Crash: High-Frequency Trading in an Electronic Market. Journal of Finance, 72: 967-998. Koijen, R. and Yogo, M., 2019. A demand system approach to asset pricing. Journal of Political Economy 127, 1475–1515. Korajczyk, R., and Murphy, D., 2019. High-Frequency Market Making to Large Institutional Trades, Review of Financial Studies, 32: 1034–1067. Kyle, Albert S., 1985. Continuous Auctions and Insider Trading, Econometrica, 53: 1315–1335. Llorente, G., Michaely, R., Saar, G., and Wang, J., 2002. Dynamic Volume-Return Relation of Individual Stocks, Review of Financial Studies, 15: 1005–1047. McCabe, C., 2021. It Isn’t Just AMC. Retail Traders Increase Pull on the Stock Market. Retrieved from https://www.wsj.com/articles/it-isnt-just-amc-retail-traders-increase-pull-on-the-stock- market-11624008602 Menkveld, A., Yueshen, B., and Zhu, H., 2017. Shades of Darkness: A Pecking Order of Trading Venues, Journal of Financial Economics, 124: 503-534. O’Hara, M., 2015. High frequency market microstructure, Journal of Financial Economics, 116: 257-270. Ozik, G., Sadka, R., and Shen, S., 2021. Flattening the Illiquidity Curve: Retail Trading during the COVID-19 Lockdown, Journal of Financial and Quantitative Analysis, forthcoming. Pedersen, L., 2021. Game On: Social Networks and Markets, Working Paper, New York University. Petersen, M.A., 2009. Estimating Standard Errors in Finance Panel Data Sets: Comparing Approaches. Review of Financial Studies, 22: 435-480. 45",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 68,
    "chunk_index": 90,
    "word_count": 299,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "the Illiquidity Curve: Retail Trading during the COVID-19 Lockdown, Journal of Financial and Quantitative Analysis, forthcoming. Pedersen, L., 2021. Game On: Social Networks and Markets, Working Paper, New York University. Petersen, M.A., 2009. Estimating Standard Errors in Finance Panel Data Sets: Comparing Approaches. Review of Financial Studies, 22: 435-480. 45",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 68,
    "chunk_index": 91,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Peress, J., and Schmidt, D., 2020. Glued to the TV: Distracted Noise Traders and Stock Market Liquidity, Journal of Finance, 75: 1083-1133. Ponczek, S. 2020. Robintrack, Chronicler of Day Trader Stock Demand, To Shut. Retrieved from https://www.bloomberg.com/news/articles/2020-08-08/robintrack-chronicler-of-day-trader- stock-demand-to-shut-down Popper, N., 2020. Robinhood Has Lured Young Traders, Sometimes With Devastating Results. Retrieved from https://www.nytimes.com/2020/07/08/technology/robinhood-risky- trading.html Porter, D., Tanggaard, C., Weaver, D., and Yu, W., 2008. Dispersed Trading and the Prevention of Market Failure: The Case of the Copenhagen Stock Exchange. European Financial Management, 14: 243-267. Rudegeair, P., and McCabe, C., 2021. Robinhood Is Going on a College Tour to Recruit New Customers. Retrieved from https://www.wsj.com/articles/robinhood-is-going-on-a-college- tour-to-recruit-new-customers-11631703600 Schifrin, M., and Gara, A., 2021. “Robinhood’s Triumph: More than a Billionaire Windfall. Retrieved from https://www.forbes.com/sites/schifrin/2021/07/29/robinhoods-ipo-triumph-more- than-a-billionaire-windfall Shkilko, A., and Sokolov, K., 2020. Every Cloud Has a Silver Lining: Fast Trading, Microwave Connectivity, and Trading Costs, Journal of Finance, 75: 2899-2927 Smith, K. A., 2020. Why Did the Robinhood App Go Down this Time? Retrieved from https://www.forbes.com/sites/advisor/2020/08/31/why-did-the-robinhood-app-go-down-this- time/ van der Beck, P., and Jaunin, C. 2021. The Equity Market Implications of the Retail Investment Boom, Working Paper, University of Lausanne. van Kervel, V., and Menkveld, A., 2019. High-Frequency Trading around Large Institutional Orders, Journal of Finance, 74: 1091-1137. van Rooij, M., Lusardi, A., Alessie, R., 2011. Financial Literacy and Stock Market Participation. Journal of Financial Economics 101, 449-472. Venkateswaran, S., 2019. The Millennial Robinhood: Take from the Poor and Give to the Rich. Retrieved from https://medium.com/@sidmvenkat/the-millenial-robinhood-take-from-the- poor-and-give-to-the-rich-11634892c4bc Welch, I., 2021. The Wisdom of the Robinhood Crowd. Journal of Finance, forthcoming. 46",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 68,
    "chunk_index": 92,
    "word_count": 256,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Lusardi, A., Alessie, R., 2011. Financial Literacy and Stock Market Participation. Journal of Financial Economics 101, 449-472. Venkateswaran, S., 2019. The Millennial Robinhood: Take from the Poor and Give to the Rich. Retrieved from https://medium.com/@sidmvenkat/the-millenial-robinhood-take-from-the- poor-and-give-to-the-rich-11634892c4bc Welch, I., 2021. The Wisdom of the Robinhood Crowd. Journal of Finance, forthcoming. 46 Weller, B. M. 2018. Does Algorithmic Trading Reduce Information Acquisition? The Review of Financial Studies, 31: 2184-2226. 47 Figure 1. Retail Trading and Broker Platform Outage Dates. Panel A plots the cumulative absolute value of hourly changes of Robinhood user positions for the Jan. 2019 to Aug. 2020 and the days in which the Robinhood platform experienced an interruption during the regular trading hours of 9:30 to 16:00 EST through June 2021. Panel B plots aggregate retail trading volume and broker platform outage dates for the traditional retail brokers (E-Trade, Ameritrade, and Schwab). Platform outages are defined as having at least 200 outage reports on Downdetector.com. 48",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 48,
    "page_range": "p.48-50",
    "total_pages": 68,
    "chunk_index": 93,
    "word_count": 157,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.48-50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "an interruption during the regular trading hours of 9:30 to 16:00 EST through June 2021. Panel B plots aggregate retail trading volume and broker platform outage dates for the traditional retail brokers (E-Trade, Ameritrade, and Schwab). Platform outages are defined as having at least 200 outage reports on Downdetector.com. 48 A. Volume B. Quoted Spread C. Effective Spread D. Realized Spread E. Price Impact F. Volatility Figure 2. Market Quality Surrounding Robinhood Outages. The figure illustrates changes in market quality surrounding Robinhood platform outages. The multiple panels show alternative measures of market quality for the subsample of stocks with high interest among Robinhood investors, proxied by fitted value estimates of Robinhood user changes during the control period of five trading days prior to the outage, alongside the market quality for the remaining set of sample stocks. Change in market quality in each panel is measured as the average firm’s difference between market quality on the day of the outage and the time-of-day matched market quality of the control period, scaled by standard deviation of the control period. The plots consider Robinhood platform outages reported on Downdetector that last for 15 minutes and begin after 10:00 AM. 49",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 50,
    "page_range": "p.50-51",
    "total_pages": 68,
    "chunk_index": 94,
    "word_count": 197,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.50-51)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "average firm’s difference between market quality on the day of the outage and the time-of-day matched market quality of the control period, scaled by standard deviation of the control period. The plots consider Robinhood platform outages reported on Downdetector that last for 15 minutes and begin after 10:00 AM. 49 A. Volume B. Quoted Spread C. Effective Spread D. Realized Spread E. Price Impact F. Volatility Low Retail Interest High Retail Interest Traditional Broker Outage Figure 3. Market Quality Surrounding Traditional Broker Outages. The figure illustrates changes in market quality surrounding other retail broker platform outages. The multiple panels show alternative measures of market quality for the subsample of stocks with high interest among retail investors in aggregate, proxied by fitted value estimates of aggregate retail order imbalance during the control period of five trading days prior to the outage, alongside the market quality for the remaining set of sample stocks. Change in market quality in each panel is measured as the average firm’s difference between market quality on the day of the outage and the time-of-day matched market quality of the control period, scaled by standard deviation of the control period. The plots consider broker platform outages reported on Downdetector that last for 15 minutes and begin after 10:00 AM. 50",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 51,
    "page_range": "p.51-52",
    "total_pages": 68,
    "chunk_index": 95,
    "word_count": 212,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.51-52)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "average firm’s difference between market quality on the day of the outage and the time-of-day matched market quality of the control period, scaled by standard deviation of the control period. The plots consider broker platform outages reported on Downdetector that last for 15 minutes and begin after 10:00 AM. 50 Figure 4. Wholesaler Profits and Toxic Retail Order Flow The figure plots average stock-level aggregate monthly realized dollar spreads for wholesalers with payment for order flow arrangements with Robinhood. In each month t, we identify “toxic” stocks as those likely to create inventory risks for wholesalers. In Panel A, toxic stocks are those in the top quintile of the absolute value of changes in Robinhood users in month t. In Panel B, toxic stocks are those in the top quintile based on the total number of WallStreetBets mentions in month t. In each panel, the remaining four quintiles are also plotted separately. Realized spread data is obtained from SEC rule 605 reports, and dollar spreads aggregated across wholesalers for each stock and then averaged across stocks. 51",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 52,
    "page_range": "p.52-53",
    "total_pages": 68,
    "chunk_index": 96,
    "word_count": 177,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.52-53)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "the top quintile based on the total number of WallStreetBets mentions in month t. In each panel, the remaining four quintiles are also plotted separately. Realized spread data is obtained from SEC rule 605 reports, and dollar spreads aggregated across wholesalers for each stock and then averaged across stocks. 51 Table 1. Summary Statistics for Retail Investors The table presents descriptive statistics for stocks commonly traded by retail investors. The sample includes 1,889 stocks that meet the data filters, and the sample period is January 2019 to June 2021. We require stocks in the sample to have a daily minimum of 50 Robinhood users, a daily minimum of 5,000 shares traded in aggregate retail volume, a weekly average of 500 Robinhood users in the week prior to platform outages, a stock price above $1, and to have data in the CRSP, COMPUSTAT, TAQ and ITCH databases. Robinhood Users is the number of unique accounts that hold the stock, WallStreetBets Mentions is the weekly number of unique users that mention the stock in a post or comment on the Reddit forum WallStreetBets, Robinhood Trading is the daily sum of absolute hourly changes in Robinhood users that hold the stock, Robinhood Purchases is the daily change in Robinhood users that hold the stock, Agg. Retail Volume / Volume is the daily volume of aggregate retail trades using the retail classification described in Boehmer et al., 2020 scaled by total volume, and Agg. Retail Order Imbalance is signed aggregate retail volume scaled by total retail volume. Daily Returns is the is the percentage change in daily stock prices, Return Skewness is the 60-day skewness of stock returns, and Return Range is the 60-day high closing price minus the 60-day low closing price. Market Cap and Book- to-Market are from the previous fiscal quarter-end, Trading Volume is the daily average of trading volume, Trading Intensity is the daily number of trades, and Agg. Retail Volume is the average of daily retail volume. The market quality measures Quoted Spread, Effective Spread, Realized Spread, and Price Impact are measured in basis points, 5-Minute Volatility is the daily average of the trade-based standard deviation of returns during the 5-minute period. Affiliated Market Maker Spreads are the average MPID quoted spreads according to whether the firm has a payment for order flow arrangement with the retail broker. If not, then the MPID quoted spreads are part of Other Market Maker Spreads. Trade Imbalance is the dollar volume imbalance of trading activity. Depth-Weighted Imbalance is the imbalance of resting limit orders. Affiliated Market Maker Depth Imbalance (Other Market Maker Depth Imbalance) represent imbalances in the limit order book for market makers affiliated (not) with the retail broker. Mean Std Dev 25th Median 75th Robinhood Users Holding Stock 9,795 42,025 607 1,404 4,147 WallStreetBets Mentions from Previous Week 73.2 903.6 4.6 8 19.4 Robinhood Trading 83.23 547.57 10.00 25.00 55.00 Robinhood Purchases 40.36 529.39 -8.00 3.00 19.00 Agg. Retail Volume / Volume 0.06 0.07 0.02 0.04 0.08 Agg. Retail Order Imbalance 0.12 0.31 -0.03 0.14 0.30 Daily Returns (BPs) 23.17 218.00 -17.72 0.67 22.93 Return Skewness (BPs) 23.89 148.50 -37.60 12.08 73.27 Return Range (BPs) 45.22 44.33 20.69 33.13 53.43 Market Cap (Millions) 18,698 38,795 1,339 4,148 16,060 Book-to-Market Ratio 0.38 0.47 0.08 0.21 0.61 Trading Volume (Millions) 10.32 24.93 1.29 3.16 8.51 Trading Intensity (Previous Week) 254.5 361.2 69.8 138.9 277.9 Agg. Retail Volume (Previous Week, Millions) 2.94 7.75 0.31 0.72 1.96 Quoted Spread (BPs) 16.77 15.46 6.02 11.89 22.02 Effective Spread (BPs) 13.58 11.52 5.46 10.08 17.80 Realized Spread (BPs) 4.69 9.08 0.17 1.34 6.24 Price Impact (BPs) 9.00 6.85 4.32 7.25 11.78 5-Minute Volatility (BPs) 12.45 8.79 6.31 9.97 15.80 Affiliated Market Maker Spread (BPs) 38.07 7.29 21.88 27.44 47.72 Other Market Maker Spread (BPs) 36.99 19.92 17.24 21.11 38.83 Trade Imbalance (BPs) 44.62 18.24 31.02 46.29 58.55 Depth-Weighted Imbalance (BPs) 336.14 283.86 32.37 105.38 248.17 Affiliated Market Maker Depth Imbalance (BPs) 56.96 102.23 35.85 45.04 85.15 Other Market Maker Depth Imbalance (BPs) 6.27 76.21 32.24 5.73 88.39 52",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 53,
    "page_range": "p.53",
    "total_pages": 68,
    "chunk_index": 97,
    "word_count": 672,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.53)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "47.72 Other Market Maker Spread (BPs) 36.99 19.92 17.24 21.11 38.83 Trade Imbalance (BPs) 44.62 18.24 31.02 46.29 58.55 Depth-Weighted Imbalance (BPs) 336.14 283.86 32.37 105.38 248.17 Affiliated Market Maker Depth Imbalance (BPs) 56.96 102.23 35.85 45.04 85.15 Other Market Maker Depth Imbalance (BPs) 6.27 76.21 32.24 5.73 88.39 52",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 54,
    "page_range": "p.54",
    "total_pages": 68,
    "chunk_index": 98,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.54)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Table 2. Retail Trading and Stock Returns The table presents results from daily Fama-MacBeth regressions of stock returns on Robinhood ownership changes and aggregate retail trade imbalances. Robinhood Change measures weekly changes in the number of Robinhood owners (Panel A) and percentage changes in the number of owners (Panel B). The dependent variable, Return[d,d+τ] (in percent), is compounded over days d through d+τ, where day d represents the day retail trading is measured. Aggregate Retail OIB measures weekly retail order imbalance following the methodology of Boehmer et al., 2020. Control variables are defined in Appendix A. Newey-West standard errors with lags equal to twice the horizon of the dependent variable are used. We include common stocks with a daily minimum of 50 and weekly average of 500 Robinhood users, 5,000 shares in average retail volume, and with a stock price of at least $1 during the months of January 2019 to August 2020, when the Robinhood ownership data end. Panel A: Weekly Change in Robinhood Users Return [1,3] Return [1,5] Return [1,20] Robinhood Change -0.049 -0.024 -0.058 -0.007 -0.039 0.125 (-1. 36) (-0.69) (-1. 22) (-0.16) (-0. 32) (0.97) Aggregate Retail OIB 0.239*** 0.217*** 0.546** (4.81) (3.37) (2.14) Ret[0] -0.030*** -0.038** -0.035 (-2.86) (-2.48) (-1.28) Ret[-1] 0.001 -0.015 -0.002 (0.15) (-1.28) (-0.11) Ret[-5,-1] -0.017** -0.016 -0.024 (-2.21) (-1.48) (-1.07) Market Cap[-1] -0.02 -0.03 -0.125 (-0.72) (-0.65) (-0.60) Book-to-Market -0.118** -0.170** -0.595 (-2.38) (-2.01) (-1.62) Skewness 0.026 0.060** 0.11 (1.36) (2.09) (1.14) Observations 664,481 561,403 664,286 561,239 662,805 560,055 Average R2 0.003 0.05 0.002 0.054 0.002 0.053 Panel B: Weekly Percentage Change in Robinhood Users Return [1,3] Return [1,5] Return [1,20] Robinhood % Change -0.161*** -0.146*** -0.217*** -0.184*** -0.218* -0.189 (-3. 41) (-3.31) (-3. 88) (-3.10) (-1. 91) (-1.54) Aggregate Retail OIB 0.253*** 0.237*** 0.565** (4.96) (3.58) (2.24) Ret[0] -0.026** -0.033** -0.03 (-2.46) (-2.14) (-1.10) Ret[-1] 0.003 -0.013 0 (0.30) (-1.09) (0.02) Ret[-5,-1] -0.014* -0.013 -0.02 (-1.87) (-1.16) (-0.90) Market Cap[-1] -0.023 -0.033 -0.119 (-0.82) (-0.73) (-0.58) Book-to-Market -0.118** -0.170** -0.592 (-2.40) (-2.04) (-1.62) Skewness 0.027 0.060** 0.115 (1.37) (2.07) (1.20) Observations 664,475 561,402 664,280 561,238 662,799 560,054 Average R2 0.005 0.052 0.004 0.055 0.003 0.054 53",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 54,
    "page_range": "p.54",
    "total_pages": 68,
    "chunk_index": 99,
    "word_count": 356,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.54)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "-0.013 0 (0.30) (-1.09) (0.02) Ret[-5,-1] -0.014* -0.013 -0.02 (-1.87) (-1.16) (-0.90) Market Cap[-1] -0.023 -0.033 -0.119 (-0.82) (-0.73) (-0.58) Book-to-Market -0.118** -0.170** -0.592 (-2.40) (-2.04) (-1.62) Skewness 0.027 0.060** 0.115 (1.37) (2.07) (1.20) Observations 664,475 561,402 664,280 561,238 662,799 560,054 Average R2 0.005 0.052 0.004 0.055 0.003 0.054 53",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 55,
    "page_range": "p.55",
    "total_pages": 68,
    "chunk_index": 100,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.55)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Table 3. Retail Trader Sophistication and Determinants of Retail Trade Direction The table reports the effects of stock characteristics on retail position changes. The dependent variable in the first two columns is the daily change in Robinhood user positions, while the dependent variable in the latter two columns is the aggregate retail order imbalance. The determinants of retail position changes are estimated for each stock and day in the sample using OLS regressions. The t-statistics from standard errors double clustered at the firm and day level are reported in parentheses, where 1%, 5%, and 10% significance levels are marked by ***, **, and * respectively. See Table 1 and Appendix A for further details on variable definitions. We include common stocks with a daily minimum of 50 and weekly average of 500 Robinhood users, 5,000 shares in average retail volume, and with a stock price of at least $1. Robinhood Purchases Agg. Retail Order Imbalance WallStreetBets 6.397*** 1.795 0.006*** -0.487 2 (5.431) (0.57) (2.805) (-0.086) WallStreetBets 11.882*** -4.092 0.012*** -0.482 3 (6.181) (-0.693) (3.801) (-1.064) WallStreetBets 10.759*** 2.996** 0.021*** -0.747* 4 (4.984) (2.165) (5.803) (-1.855) WallStreetBets 24.243*** 7.579*** 0.037*** -0.928*** 5 (4.067) (3.947) (7.494) (-2.963) Return Overnight 7.108*** -0.306*** (9.484) (-8.806) Return [t-2 to t-1] 0.883** -0.159** (2.337) (-2.181) Return [t-5 to t-2] 4.839** 0.019 (2.191) (1.174) Return Skewness 0.52*** 0.214*** (3.921) (2.022) Return Range 2.281* 0.394*** (1.769) (3.537) Volume t-1 -0.461 0.021*** (-0.87) (2.786) Price t-1 0.038* -0.0 (1.816) (-0.171) Market Cap t-1 0.088 -0.004* (1.596) (-1.883) Robinhood Purch t-1 0.946*** -0.004*** (28.026) (-6.955) Agg. Retail OIB t-1 8.406*** 0.826*** (2.578) (72.933) R-squared 0.0122 0.6237 0.0309 0.3136 54",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 55,
    "page_range": "p.55",
    "total_pages": 68,
    "chunk_index": 101,
    "word_count": 269,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.55)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "0.52*** 0.214*** (3.921) (2.022) Return Range 2.281* 0.394*** (1.769) (3.537) Volume t-1 -0.461 0.021*** (-0.87) (2.786) Price t-1 0.038* -0.0 (1.816) (-0.171) Market Cap t-1 0.088 -0.004* (1.596) (-1.883) Robinhood Purch t-1 0.946*** -0.004*** (28.026) (-6.955) Agg. Retail OIB t-1 8.406*** 0.826*** (2.578) (72.933) R-squared 0.0122 0.6237 0.0309 0.3136 54",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 56,
    "page_range": "p.56",
    "total_pages": 68,
    "chunk_index": 102,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.56)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Table 4. Measuring Expected Trading for Retail Investors The table reports the effects of stock characteristics on retail investor trading activity. The dependent variable in the first three columns is the daily sum of hourly position changes of Robinhood investors, while the dependent variable in the latter three columns is the daily volume of aggregate retail trading scaled by total volume. The determinants of retail trading activity are estimated for each stock and day in the sample using OLS regressions. The t-statistics from standard errors double clustered at the firm and day level are reported in parentheses, where 1%, 5%, and 10% significance levels are marked by ***, **, and * respectively. See Table 1 and Appendix A for further details on variable definitions. Robinhood Trading Agg. Retail Volume / Volume WallStreetBets 8.65 -0.374 0.005 -0.001 2 (0.135) (-0.909) (1.514) (-0.966) WallStreetBets 13.694*** 0.983 0.009 0.001 3 (6.382) (1.159) (0.961) (0.794) WallStreetBets 9.062*** 3.474** 0.017*** 0.001 4 (2.727) (1.978) (11.753) (0.212) WallStreetBets 41.516*** 13.556*** 0.024*** 0.003 5 (5.913) (3.285) (10.569) (1.397) Return 10.612*** 3.572*** 0.002*** 0.001*** Overnight (11.234) (8.117) (14.627) (5.593) Return 7.713** 11.108*** 0.001*** 0.013*** [t-2 to t-1] (2.495) (8.447) (10.508) (12.501) Return 6.993*** 5.423 0.003* -0.001 [t-5 to t-2] (4.624) (0.985) (1.863) (-1.333) Return Skewness 0.803** 0.55*** 0.013*** 0.003*** (2.281) (3.43) (6.814) (5.266) Return Range 33.282*** 0.877*** 0.001** 0.001** (5.466) (2.988) (2.306) (2.301) Volume 18.611*** 0.73*** 0.012*** 0.000* t-1 (10.075) (4.027) (11.727) (1.893) Price 0.62* 0.005** 0.001*** 0.000*** t-1 (1.897) (2.234) (6.757) (3.758) Market Cap 0.115 0.013 0.00 0.00 t-1 (0.091) (1.177) (1.343) (0.864) Robinhood Trade 0.905*** -0.002 t-1 (40.111) (-1.32) Retail Volume 3.232 1.009*** t-1 (0.347) (106.61) R-squared 0.215 0.805 0.238 0.860 55",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 56,
    "page_range": "p.56",
    "total_pages": 68,
    "chunk_index": 103,
    "word_count": 276,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.56)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "18.611*** 0.73*** 0.012*** 0.000* t-1 (10.075) (4.027) (11.727) (1.893) Price 0.62* 0.005** 0.001*** 0.000*** t-1 (1.897) (2.234) (6.757) (3.758) Market Cap 0.115 0.013 0.00 0.00 t-1 (0.091) (1.177) (1.343) (0.864) Robinhood Trade 0.905*** -0.002 t-1 (40.111) (-1.32) Retail Volume 3.232 1.009*** t-1 (0.347) (106.61) R-squared 0.215 0.805 0.238 0.860 55",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 57,
    "page_range": "p.57",
    "total_pages": 68,
    "chunk_index": 104,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.57)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Table 5: Retail Broker Platform Outages and Trading Activity The table reports the effects of retail broker outages on trading activity for stocks with high retail interest. The sample consists of 5-minute intervals, t, for each firm i during the window on day d when the platform experiences an outage, matched with 5-minute intervals for the same stock and time of day for each of the 5 trading days preceding the outage date. The first three columns report estimates for actual outages, the remaining specifications present estimates for pseudo outages, where observations are shifted by one hour from the end of the actual outage event. The dependent variables include the natural log of trading volume, the natural log of the number of trades, and the natural log of aggregate retail volume. The retail broker outages are indicated by the indictor variable Outage. The t variable Robinhood is equal to one for stocks in the top quintile of predicted Robinhood trading activity and zero i,d-1 otherwise, and the variable Retail is equal to one for stocks in the top quintile of predicted aggregate retail trading i,d-1 activity. We measure market activity during Robinhood platform outages in Panel A, and market activity during other retail broker platform outages in Panel B. The t-statistics from standard errors double clustered at the firm and day level are reported in parentheses, where 1%, 5%, and 10% significance levels are marked by ***, **, and * respectively. Each model specification includes firm and day fixed effects, and Δ R-squared values are incremental after fixed effects. See Appendix A for further details on variable definitions. Panel A: Stocks with High Expected Robinhood Trading during Robinhood Platform Outages Robinhood Outages Pseudo Outages Trading Trading Retail Trading Trading Retail Volume Intensity Volume Volume Intensity Volume Robinhood i,d-1 × Outage t -0.032** -0.018** -0.052*** 0.008 0.006 -0.021 (-2.066) (-2.316) (-2.359) (0.378) (0.295) (-0.149) Robinhood i,d-1 0.434*** 0.35*** 0.469*** 0.352*** 0.275*** 0.609*** (4.749) (4.453) (3.298) (3.266) (2.979) (2.618) Outage t -0.071 -0.056 -0.153 -0.032 -0.027 -0.068 (-0.863) (-0.956) (-0.800) (-0.602) (-0.666) (-0.313) Observations 1,826,443 1,826,443 1,826,443 1,731,100 1,731,100 1,731,100 Firm Clusters 1964 1964 1964 1964 1964 1964 Δ R-squared (%) 1.872 2.189 1.49 1.461 1.622 1.351 Panel B: Stocks with High Expected Aggregate Retail Trading during Outages at Traditional Brokers Traditional Broker Outages Pseudo Outages Trading Trading Retail Trading Trading Retail Volume Intensity Volume Volume Intensity Volume Retail i,d-1 × Outage t -0.026** -0.021** -0.107*** -0.010 -0.007 -0.068 (-2.192) (-1.985) (-3.091) (-0.455) (-0.39) (-0.213) Retail i,d-1 0.183*** 0.135*** 0.311** 0.168*** 0.12*** 0.349*** (2.840) (3.099) (2.276) (3.614) (3.762) (2.945) Outage t 0.011 0.012 0.129 -0.012 -0.012 0.037 (0.127) (0.217) (1.185 ) (-0.286) (-0.309) (0.276) Observations 3,452,964 3,452,964 3,452,964 3,215,633 3,215,633 3,215,633 Firm Clusters 1964 1964 1964 1964 1964 1964 Δ R-squared (%) 0.081 0.083 0.624 0.086 0.082 0.635 56",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 57,
    "page_range": "p.57",
    "total_pages": 68,
    "chunk_index": 105,
    "word_count": 467,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.57)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "0.311** 0.168*** 0.12*** 0.349*** (2.840) (3.099) (2.276) (3.614) (3.762) (2.945) Outage t 0.011 0.012 0.129 -0.012 -0.012 0.037 (0.127) (0.217) (1.185 ) (-0.286) (-0.309) (0.276) Observations 3,452,964 3,452,964 3,452,964 3,215,633 3,215,633 3,215,633 Firm Clusters 1964 1964 1964 1964 1964 1964 Δ R-squared (%) 0.081 0.083 0.624 0.086 0.082 0.635 56",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 58,
    "page_range": "p.58",
    "total_pages": 68,
    "chunk_index": 106,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.58)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Table 6. Retail Broker Platform Outages and Trade and Depth Order Imbalances The table reports the effects of retail broker outages on inventory imbalances for stocks with high retail interest. The dependent variable in each specification is a measure of either trade or depth imbalance. Trade Imbalance is the absolute difference between the dollar volume of buy and sell trades, expressed as a percent of all dollar volume traded and reported in basis points. Depth-weighted imbalance is the absolute difference between the depth-weighted limit buy order price distance from the quoted midpoint and the depth-weighted limit sell order distance from the quoted midpoint, scaled by the quoted midpoint and reported in basis points. The sample consists of 5-minute intervals, t, for each firm i during the window on day d when the brokerage platform experiences an outage, matched with 5-minute intervals for the same stock and time for each of the 5 trading days preceding the outage date. The Outage sample is the actual time window in which the retail platform experienced an outage along with the time-of-day matched control period. The Pseudo Outage is the time window one hour following the conclusion of the platform outage along the time-of-day matched control period which is also shifted by one hour. The independent variables are as described in Table 5, and Panel A represents the effect of Robinhood platform outages on stocks with predicted high Robinhood interest, and B reports results for the effect of traditional retail broker platform outages on stocks with high predicted aggregate retail interest. Each model specification includes firm and day fixed effects, and Δ R-squares are incremental after fixed effects. t-Statistics from standard errors double clustered at the firm and day level are reported in parentheses, where significance at the 1%, 5%, and 10% levels are marked on the coefficients by ***, **, and * respectively. Panel A: Robinhood Platform Outages and Stocks with High Expected Robinhood Trading Robinhood Outages Pseudo Outages Trade Depth-Weighted Trade Depth-Weighted Imbalances Imbalances Imbalances Imbalances Robinhood i,d-1 × Outage t -17.538** -27.738*** 16.948 -0.206 (-2.476) (-3.335) (0.253) (-0.035) Robinhood i,d-1 45.049*** 16.288** 24.919*** 9.646** (3.309) (3.445) (6.001) (2.409) Outage t -22.206 -6.146 -65.529 -8.818 (-0.157) (-1.026) (-1.192) (-1.313) Observations 1,826,443 1,826,443 1,731,100 1,731,100 Firm Clusters 1964 1964 1964 1964 Δ R-squared (%) 6.714 3.825 3.543 1.127 Panel B: Traditional Brokerage Platform Outages and Stocks with High Expected Aggregate Retail Trading Traditional Broker Outages Pseudo Outages Trade Depth-Weighted Trade Depth-Weighted Imbalances Imbalances Imbalances Imbalances Retail i,d-1 × Outage t 8.521** 16.294*** -10.311 -0.822 (2.3) (3.325) (-1.437) (-0.18) Retail i,d-1 -32.974 -0.373 12.699 -3.34 (-1.421) (-0.087) (1.354) (-0.671) Outage t 25.21 0.369 32.927 -3.516 (1.158) (0.083) (0.507) (-0.91) Observations 3,452,964 3,452,964 3,215,633 3,215,633 Firm Clusters 1964 1964 1964 1964 Δ R-squared (%) 4.533 3.078 2.596 0.326 57",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 58,
    "page_range": "p.58",
    "total_pages": 68,
    "chunk_index": 107,
    "word_count": 464,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.58)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "× Outage t 8.521** 16.294*** -10.311 -0.822 (2.3) (3.325) (-1.437) (-0.18) Retail i,d-1 -32.974 -0.373 12.699 -3.34 (-1.421) (-0.087) (1.354) (-0.671) Outage t 25.21 0.369 32.927 -3.516 (1.158) (0.083) (0.507) (-0.91) Observations 3,452,964 3,452,964 3,215,633 3,215,633 Firm Clusters 1964 1964 1964 1964 Δ R-squared (%) 4.533 3.078 2.596 0.326 57",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 59,
    "page_range": "p.59",
    "total_pages": 68,
    "chunk_index": 108,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.59)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Table 7. Retail Broker Platform Outages and Stock Liquidity The table reports the effects of Robinhood outages on measures of liquidity for stocks with high retail interest. The sample consists of 5-minute intervals, t, for each firm i during the window on day d when the retail brokerage platform experiences an outage, matched with 5-minute intervals for the same stock and time for each of the 5 trading days preceding the outage date. The outages sample is the actual time window of the outage, along with the time-of-day matched control period. The Pseudo outage is the time window one hour following the conclusion of the platform outage with the corresponding control period. The dependent variable is a measure of liquidity during the 5-minute window, where the measures include the Quoted Spread, Effective Spread, Realized Spread, and Price Impact, all expressed in basis points. The independent variables are as described in Table 5 and Section 4. Panel A represents the effect of Robinhood platform outages on stocks with predicted high Robinhood interest, and Panel B reports results for the effect of traditional brokerage platform outages on stocks with predicted high aggregate retail interest. Each model specification includes firm and day fixed effects, and Δ R-squared values are incremental after fixed effects. t-statistics from standard errors double clustered at the firm and day level are reported in parentheses, where 1%, 5%, and 10% significance levels are marked by ***, **, and * respectively. Platform Outages Pseudo Outages Quoted Effective Realized Price Quoted Effective Realized Price Spread Spread Spread Impact Spread Spread Spread Impact Panel A: Stocks with High Expected Robinhood Trading during Robinhood Platform Outages Robinhood × Outage -0.718*** -0.983*** -0.465** -0.413*** -0.711 -0.383 0.118 -0.482 i,d-1 t (-2.737) (-2.636) (-2.287) (-2.639) (-1.372) (-1.151) (0.377) (-1.217) Robinhood -0.23* -0.558** 0.209* 0.153*** -1.036* -0.099 0.101 -0.088 i,d-1 (-1.843) (-2.096) (1.731) (1.329) (-1.917) (-0.244) (0.232) (-0.199) Outage -0.348 -0.621 -0.253 -0.517 0.576 0.358 0.379 0.108 t (-0.081) (-0.179) (-0.136) (-0.284) (0.962) (0.702) (0.761) (0.134) Firm Clusters 1964 1964 1964 1964 1964 1964 1964 1964 Δ R-squared (%) 0.225 0.094 0.118 0.032 0.018 0.015 0.027 0.033 Panel B: Stocks with High Expected Aggregate Retail Trading during Traditional Broker Outages Retail i,d-1 × Outage t 0.381** 0.388*** 0.186** 0.202 0.044 -0.002 0.049 -0.052 (2.363) (2.857) (2.287) (1.564) (0.117) (-0.009) (0.182) (-0.325) Retail i,d-1 -1.404* -0.528 -1.66* 1.146* -1.043** -0.407*** -1.106*** 0.699*** (-1.744) (-1.381) (-1.833) (1.736) (-2.483) (-2.851) (-3.236) (2.676) Outage t -0.606 -0.448 -0.243 -0.188 -0.09 -0.018 -0.047 0.029 (-0.267) (-0.262) (-0.279) (-0.195) (-0.168) (-0.046) (-0.158) (0.096) Firm Clusters 1964 1964 1964 1964 1964 1964 1964 1964 Δ R-squared (%) 0.066 0.013 0.046 0.025 0.139 0.027 0.038 0.015 58",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 59,
    "page_range": "p.59",
    "total_pages": 68,
    "chunk_index": 109,
    "word_count": 443,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.59)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "-1.106*** 0.699*** (-1.744) (-1.381) (-1.833) (1.736) (-2.483) (-2.851) (-3.236) (2.676) Outage t -0.606 -0.448 -0.243 -0.188 -0.09 -0.018 -0.047 0.029 (-0.267) (-0.262) (-0.279) (-0.195) (-0.168) (-0.046) (-0.158) (0.096) Firm Clusters 1964 1964 1964 1964 1964 1964 1964 1964 Δ R-squared (%) 0.066 0.013 0.046 0.025 0.139 0.027 0.038 0.015 58",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 60,
    "page_range": "p.60",
    "total_pages": 68,
    "chunk_index": 110,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.60)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Table 8. Retail Broker Platform Outages and Stock Return Volatility The table reports the effects of retail brokerage outages on a measure of stock return volatility for stocks with high retail interest. The sample consists of 5-minute intervals, t, for each firm i during the window on day d when the retail brokerage platform experiences an outage, matched with 5-minute intervals for the same stock and time for each of the 5 trading days preceding the outage date. The outage sample is the actual time window in which the brokerage platform was down, along with the time-of-day matched control period. The Pseudo outage is the time window one hour following the conclusion of the platform outage along the time-of-day matched control period which is also shifted by one hour. The dependent variable is the volatility of returns during the 5-minute window, expressed in basis points. The independent variables are as described in Table 5 and Section 4. Panel A represents the effect of Robinhood platform outages on stocks with predicted high Robinhood interest, and Panel B reports results for the effect of traditional brokerage platform outages on stocks with predicted high aggregate retail interest. Each model specification includes firm and day fixed effects, and Δ R-squares are incremental after fixed effects. t-Statistics from standard errors double clustered at the firm and day level are reported in parentheses, where significance at the 1%, 5%, and 10% levels are marked on the coefficients by ***, **, and * respectively. Panel A: Robinhood Platform Outages and Stocks with High Expected Robinhood Trading Robinhood Outages Pseudo Outages Robinhood × Outage -0.250** -0.121 i,d-1 t (-2.219) (-0.407) Robinhood 0.238* 0.317* i,d-1 (1.934) (1.846) Outage -0.158 -0.268 t (-0.689) (-0.500) Firm Clusters 1,964 1,964 Δ R-squared (%) 0.038 0.017 Panel B: Traditional Brokers Platform Outages and Stocks with High Expected Aggregate Retail Trading Traditional Brokers Outages Pseudo Outages Retail × Outage 0.370** 0.057 i,d-1 t (2.081) (0.424) Retail 1.383*** 0.582*** i,d-1 (3.96) (4.032) Outage -0.321 -0.093 t (-0.192) (-0.241) Firm Clusters 1,964 1,964 Δ R-squared (%) 0.158 0.067 59",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 60,
    "page_range": "p.60",
    "total_pages": 68,
    "chunk_index": 111,
    "word_count": 343,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.60)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Panel B: Traditional Brokers Platform Outages and Stocks with High Expected Aggregate Retail Trading Traditional Brokers Outages Pseudo Outages Retail × Outage 0.370** 0.057 i,d-1 t (2.081) (0.424) Retail 1.383*** 0.582*** i,d-1 (3.96) (4.032) Outage -0.321 -0.093 t (-0.192) (-0.241) Firm Clusters 1,964 1,964 Δ R-squared (%) 0.158 0.067 59",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 61,
    "page_range": "p.61",
    "total_pages": 68,
    "chunk_index": 112,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.61)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Table 9. Retail Broker Platform Outages and Market Quality – Robustness Checks The table reports robustness checks of the results in Tables 5-8. For brevity, each panel reports only the interaction term that captures the effects of outages on stocks with high expected trading. Robinhood (Retail) denotes specifications in which treated firms are those with high expected Robinhood (Aggregate Retail) trading. Panel A excludes stocks with an increase of 20% or more in WallStreetBets Mentions on the outage date. Panel B excludes outages that begin prior to 9:45 AM EST. Panel C excludes outages in March 2020. Panel D considers a benchmark 6-10 days before the outage. Panel E excludes stocks in the lowest quintile of retail interest. Panel F matches the event periods more closely to the pseudo-event periods. Panel G uses expected aggregate retail trading for the Robinhood outages and expected Robinhood trading for the traditional broker outages. Trading Trading Agg. Retail Trade Depth Quoted Effective Realized Price Volatility Volume Intensity Volume Imbalance Imbalance Spread Spread Spread Impact Panel A: Exclude Firm-Outage Events with a 20% Spike in WallStreetBets Mentions Robinhood × RH Outage -0.027* -0.024* -0.121*** -2.338*** -2.519*** -0.108*** -0.229*** -0.135*** -0.084** -0.121*** i,d-1 t (-1.761) (-1.893) (-2.997) (-3.017) (-3.695) (-2.844) (-3.388) (-2.957) (-2.193) (-3.238) Retail × Other Outage -0.019** -0.008* -0.104** 6.135** 2.296*** 0.025** 0.168*** 0.241*** 0.08* 0.256*** i,d-1 t (-2.344) (-1.77) (-2.425) (2.181) (3.186) (2.084) (3.330) (3.465) (1.757) (2.671) Panel B: Exclude Platform Outages that begin before 10:00 AM Robinhood × RH Outage -0.013*** -0.012* -0.037** -5.145** -4.108*** -0.141** -0.189*** -0.193*** -0.127* -0.153*** i,d-1 t (-2.861) (-1.748) (-2.484) (-2.385) (-3.332) (-2.103) (-3.184) (-2.772) (-1.764) (-2.798) Retail × Other Outage -0.012* -0.007* -0.103** 5.499** 2.395** 0.187** 0.17*** 0.115** 0.046** 0.096* i,d-1 t (-1.919) (-1.861) (-2.359) (2.143) (2.129) (2.299) (2.639) (2.421) (2.354) (1.757) Panel C: Exclude All Platform Outages in March 2020 Robinhood × RH Outage -0.018* -0.016* -0.086*** -4.966* -8.063*** -0.273** -0.223* -0.129* -0.152* -0.116*** i,d-1 t (-1.771) (-1.789) (-2.888) (-1.803) (-3.164) (-2.734) (-1.763) (-1.708) (-1.678) (-3.482) Retail × Other Outage -0.090* -0.005* -0.138** 4.79*** 4.592*** 0.157* 0.139*** 0.281*** 0.05** 0.183* i,d-1 t (-1.887) (-1.742) (-2.436) (3.048) (3.143) (1.743) (2.738) (3.801) (1.992) (1.765) Panel D: Measure Benchmark Control Period 6 to 10 Days before Platform Outage (Instead of 1 to 5 Days before) Robinhood × RH Outage -0.011** -0.011* -0.16** -3.222*** -5.784*** -0.218*** -0.219* -0.18** -0.206*** -0.212*** i,d-1 t (-2.102) (-1.747) (-2.079) (-3.44) (-2.8) (-3.2) (-1.875) (-2.231) (-3.099) (-2.692) Retail × Other Outage -0.018* -0.015* -0.167*** 7.367** 4.587*** 0.22*** 0.186** 0.171*** 0.2** 0.204** i,d-1 t (-1.721) (-1.905) (-2.837) (2.032) (3.335) (3.222) (2.251) (2.721) (2.298) (2.249) 60",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 61,
    "page_range": "p.61",
    "total_pages": 68,
    "chunk_index": 113,
    "word_count": 430,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.61)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Outage -0.011** -0.011* -0.16** -3.222*** -5.784*** -0.218*** -0.219* -0.18** -0.206*** -0.212*** i,d-1 t (-2.102) (-1.747) (-2.079) (-3.44) (-2.8) (-3.2) (-1.875) (-2.231) (-3.099) (-2.692) Retail × Other Outage -0.018* -0.015* -0.167*** 7.367** 4.587*** 0.22*** 0.186** 0.171*** 0.2** 0.204** i,d-1 t (-1.721) (-1.905) (-2.837) (2.032) (3.335) (3.222) (2.251) (2.721) (2.298) (2.249) 60 Table 9. Retail Broker Platform Outages and Market Quality – Robustness Checks (continued) Trading Trading Agg. Retail Trade Depth Quoted Effective Realized Price Volatility Volume Intensity Volume Imbalance Imbalance Spread Spread Spread Impact Panel E: Exclude Firm-Outage events with Retail Interest in the Lowest Quintile Robinhood × RH Outage -0.044** -0.016* -0.113* -7.712* -10.114** -0.314*** -0.195*** -0.124*** -0.073*** -0.113** i,d-1 t (-2.213) (-1.873 (-1.821) (-2.385) (-2.213) (-2.956) (-2.314) (-2.645) (-3.129) (-2.374) Retail × Other Outage -0.027* -0.028* -0.188* 4.895*** 7.746*** 0.195*** 0.276* 0.251** 0.219*** 0.224** i,d-1 t (-1.813) (-1.764) (-2.114) (2.943) (3.218) (3.134) (1.893) (2.101) (2.820) (2.380) Panel F: Limit Outage Observations to Match Pseudo Outage Observations Robinhood × RH Outage -0.041* -0.010** -0.061* -15.322** -22.785** -0.081** -0.348** -0.123* -0.058* -0.129** i,d-1 t (-1.912) (-2.140) (-1.725) (-2.449) (-2.194) (-2.043) (-2.229) (-1.914) (-1.686) (-2.089) Retail × Other Outage -0.022* -0.029** -0.023** 8.943** 14.803** 0.165* 0.346** 0.156** 0.136* 0.216** i,d-1 t (-1.734) (-2.003) (-2.213) (2.063) (2.498) (1.894) (2.354) (2.499) (1.877) (2.309) Panel G: Alternative Expected Trading Measures Retail × RH Outage -0.011** -0.020** -0.035*** -14.231* -32.603*** -1.174*** -0.624*** -0.439** -0.223** -0.29*** i,d-1 t (-2.414) (-2.166) (-3.212) (-1.812) (-3.461) (-2.747) (-2.599) (-2.390) (-2.159) (-2.783) Robinhd × Other Outage -0.043** -0.036* -0.071** 12.139** 20.311*** 0.643** 0.565** 0.29* 0.172 0.214*** i,d-1 t (-2.361) (-1.755) (-2.179) (2.123) (3.192) (2.225) (2.366) (1.721) (0.524) (2.648) 61",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 62,
    "page_range": "p.62",
    "total_pages": 68,
    "chunk_index": 114,
    "word_count": 268,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.62)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Outage -0.011** -0.020** -0.035*** -14.231* -32.603*** -1.174*** -0.624*** -0.439** -0.223** -0.29*** i,d-1 t (-2.414) (-2.166) (-3.212) (-1.812) (-3.461) (-2.747) (-2.599) (-2.390) (-2.159) (-2.783) Robinhd × Other Outage -0.043** -0.036* -0.071** 12.139** 20.311*** 0.643** 0.565** 0.29* 0.172 0.214*** i,d-1 t (-2.361) (-1.755) (-2.179) (2.123) (3.192) (2.225) (2.366) (1.721) (0.524) (2.648) 61",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 63,
    "page_range": "p.63",
    "total_pages": 68,
    "chunk_index": 115,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.63)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Table 10. Outages and Quoting by HFTs that have Order Flow Arrangements with the Broker Experiencing the Outage The table reports the effects of retail brokerage outages on affiliated- and unaffiliated-market maker spreads and inventory imbalance for stocks with high retail investor interest. The dependent variable in each specification is a measure of either market maker spreads or depth imbalance, which are computed for the subset of orders with MPID attributions, partitioned by market makers with and without payment for order flow arrangements with the broker experiencing the outage. These variables are described in more detail in Section 2 and Appendix A. The sample consists of 5-minute intervals, t, for each firm i during the window on day d when the broker experiences an outage, matched with 5-minute intervals for the same stock and time for each of the 5 trading days preceding the outage date. The outage sample is the actual time window in which the brokerage platform experienced an outage along with the time-of-day matched control period. The Pseudo Outage is the time window one hour following the conclusion of the platform outage along the time-of-day matched control period which is also shifted by one hour. The independent variables are as described in Table 5. Panel A represents the effect of Robinhood platform outages on stocks with predicted high Robinhood interest, and Panel B reports results for the effect of traditional brokerage platform outages on stocks with predicted high aggregate retail interest. Each model specification includes firm and day fixed effects, and Δ R-squares are incremental after fixed effects. t-Statistics from standard errors double clustered at the firm and day level are reported in parentheses, where significance at the 1%, 5%, and 10% levels are marked on the coefficients by ***, **, and * respectively. Panel A: Stocks with High Expected Robinhood Trading during Robinhood Platform Outages Robinhood Outages Pseudo Outages Affiliated Affiliated Other Market Affiliated Other Market Market Other Market Affiliated Market Maker Maker Depth Market Maker Maker Depth Maker Maker Market Maker Other Market Depth Imbal. Imbalance Depth Imbal. Imbalance Spreads Spreads Spreads Maker Spreads Robinhood i,d-1 × Outage t -4.544*** -2.895 -19.962*** 4.669 -1.37 -10.169 -0.984 4.432 (-3.723) (-0.997) (-2.852) (0.398) (-1.639) (-0.93) (-0.249) (0.342) Robinhood i,d-1 -2.693** -0.667 15.998** 1.126 -0.829** 1.185 0.039** -3.518 (-2.138) (-1.217) (2.441) (0.158) (-2.335) (-1.107) (2.017) (-0.506) Outage t -0.795 0.893 6.234 -7.519 0.786 5.599 1.617 4.558 (-0.49) (0.341) (0.442) (-0.409) (1.07) (0.697) (0.441) (0.37) Firm Clusters 1,964 1,964 1,964 1,964 1,964 1,964 1,964 1,964 Δ R-Squared (%) 2.434 4.553 1.427 0.216 6.650 3.072 0.431 0.102 62",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 63,
    "page_range": "p.63",
    "total_pages": 68,
    "chunk_index": 116,
    "word_count": 428,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.63)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "0.039** -3.518 (-2.138) (-1.217) (2.441) (0.158) (-2.335) (-1.107) (2.017) (-0.506) Outage t -0.795 0.893 6.234 -7.519 0.786 5.599 1.617 4.558 (-0.49) (0.341) (0.442) (-0.409) (1.07) (0.697) (0.441) (0.37) Firm Clusters 1,964 1,964 1,964 1,964 1,964 1,964 1,964 1,964 Δ R-Squared (%) 2.434 4.553 1.427 0.216 6.650 3.072 0.431 0.102 62 Table 10. Outages and Quoting by HFTs that have Order Flow Arrangements with the Broker Experiencing the Outage (continued) Panel B: Stocks with High Expected Aggregate Retail Trading during Outages at other Brokers Traditional Broker Outages Pseudo Outages Affiliated Affiliated Other Market Affiliated Other Market Affiliated Other Market Market Maker Other Market Market Maker Maker Depth Market Maker Maker Market Maker Maker Depth Spreads Maker Spreads Depth Imbal. Imbalance Spreads Spreads Depth Imbal. Imbalance Retail i,d-1 × Outage t 4.279*** -0.323 6.681** -7.972 -0.266 -0.613 -6.703 2.907 (3.423) (-1.265) (2.526) (-0.685) (-0.518) (-0.599) (-0.753) (0.312) Retail i,d-1 -1.802** -0.496 -6.725 -9.71* -0.358 -2.894 2.845 -10.781* (-1.998) (-1.487) (-1.561) (-1.676) (-1.189) (-1.396) (0.525) (-1.83) Outage t -0.128 -1.603 -7.142 -11.14 1.105 -0.066 -1.529 -4.729 (-0.097) (-0.114) (-1.419) (-0.834) (1.111) (-0.082) (-0.22) (-0.562) Firm Clusters 1,964 1,964 1,964 1,964 1,964 1,964 1,964 1,964 Δ R-Squared (%) 2.583 2.966 1.125 0.531 2.561 1.914 0.128 0.214 63",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 64,
    "page_range": "p.64-65",
    "total_pages": 68,
    "chunk_index": 117,
    "word_count": 203,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.64-65)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "2.845 -10.781* (-1.998) (-1.487) (-1.561) (-1.676) (-1.189) (-1.396) (0.525) (-1.83) Outage t -0.128 -1.603 -7.142 -11.14 1.105 -0.066 -1.529 -4.729 (-0.097) (-0.114) (-1.419) (-0.834) (1.111) (-0.082) (-0.22) (-0.562) Firm Clusters 1,964 1,964 1,964 1,964 1,964 1,964 1,964 1,964 Δ R-Squared (%) 2.583 2.966 1.125 0.531 2.561 1.914 0.128 0.214 63 Table 11. Wholesaler Profits and Toxic Retail Order Flow The table reports estimates from regressions of wholesaler monthly aggregate dollar realized spreads around months with high expected imbalances in Robinhood order flow. The sample consists of aggregate monthly stock- level dollar realized spreads for wholesalers with payment for order flow arrangements with Robinhood, as reported in SEC Rule 605 reports. The dependent variable is stock-month total dollar realized spread, where dollar spreads are aggregated across wholesalers. The key independent variable is Toxic, which is designed to capture retail trading that creates inventory risk for wholesalers. Panel A measures toxic stocks as those in the top quintile of the absolute value of changes in Robinhood users in month t. In Panel B, toxic stocks are those in the top quintile based on the total number of WallStreetBets mentions in month t. Each model specification includes firm and month fixed effects, and Intercept denotes the average of intercept values across all of the intercept values with an accompanying test of significance. The t-statistics from standard errors double clustered at the firm and month level are reported in parentheses, where 1%, 5%, and 10% significance levels are marked by ***, **, and * respectively. See Appendix A for detailed variable definitions. t-3 t-2 t-1 t t+1 t+2 t+3 Panel A: Monthly Robinhood Imbalance Proxied by Changes in Robinhood users Intercept 6,946.0*** 6,778.4*** 6,709.2*** 5,582.5*** 5,528.2*** 5,270.0*** 5,084.8*** (9.63) (8.47) (7.65) (6.75) (6.13) (5.22) (3.60) Toxic i,t 846.5 -436.6 1,515.7 -6,121.1** 407.79 324.97 -1,098.0 (1.15) (-1.45) (0.420) (-2.45) (0.155) (0.120) (-0.368) Fixed Effects Firm and Month Firm Clusters 1,889 1,889 1,889 1,889 1,889 1,889 1,889 R-squared 0.124 0.114 0.105 0.142 0.147 0.101 0.078 Panel B: Wall Intercept 5,881.4*** 5,718.6*** 4,990.8*** 6,221.4*** 5,768.9*** 4,453.0*** 4,110.7*** (11.35) (11.68) (10.34) (10.17) (12.90) (11.24) (9.88) Toxic i,t 1,750.9 593.0 1,044.0 -7,149.7*** -3,944.6* 2,328.7 1,220.0 (1.18) (0.870) (1.28) (-3.02) (-1.72) (1.47) (1.01) Fixed Effects Firm and Month Firm Clusters 1,964 1,964 1,964 1,964 1,964 1,964 1,964 R-squared 0.095 0.130 0.107 0.162 0.163 0.102 0.132 64",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 65,
    "page_range": "p.65",
    "total_pages": 68,
    "chunk_index": 118,
    "word_count": 386,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.65)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "6,221.4*** 5,768.9*** 4,453.0*** 4,110.7*** (11.35) (11.68) (10.34) (10.17) (12.90) (11.24) (9.88) Toxic i,t 1,750.9 593.0 1,044.0 -7,149.7*** -3,944.6* 2,328.7 1,220.0 (1.18) (0.870) (1.28) (-3.02) (-1.72) (1.47) (1.01) Fixed Effects Firm and Month Firm Clusters 1,964 1,964 1,964 1,964 1,964 1,964 1,964 R-squared 0.095 0.130 0.107 0.162 0.163 0.102 0.132 64",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "References",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 68,
    "chunk_index": 119,
    "word_count": 50,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "Table IA1. Affiliated Nasdaq Market Makers Panel A lists the Nasdaq dealers with payment for order flow arrangements with retail brokers during the January 2019 to June 2021 sample period, and Panel B lists the remaining set of (Nasdaq and FINRA member) market makers. Panel A: Retail-Affiliated Market Participant IDs MPID Name MPID Name CTDL Citadel Derivatives Group LLC SOHO Two Sigma Securities LLC CDRG Citadel Securities LLC TSSM Two Sigma Securities LLC ETMM G1 Execution Services LLC UBSS UBS Securities LLC (Non-Robinhood) JSCA Jane Street Capital LLC (E-Trade Only) VIRT Virtu Americas LLC NITE VIRTU Americas LLC WSEA Wolverine Securities LLC (Robinhood Only) OHOS Two Sigma Securities LLC Panel B: Unaffiliated Market Participant IDs MPID Name MPID Name ALNC A.G.P. / ALLIANCE GLOBAL PARTNERS MAXM Maxim Group LLC AGIS Aegis Capital Corp. MZHO Mizuho Securities USA LLC AEXG ALTERNATIVE EXECUTION GROUP MSCO MORGAN STANLEY & CO. LLC RILY B. RILEY SECURITIES, INC. STXG Muriel Siebert & Co, Inc LEHM Barclays Capital Inc./Le NATL National Securities Corporation BCMX BERENBERG CAPITAL MARKETS LLC NEED Needham & Company, LLC BMOC BMO Capital Markets Corp. ALNC Network 1 Financial Securities Inc. BOSC Boenning & Scattergood, Inc. NORT Northland Securities, Inc. MLCO Bofa Securities, Inc. OPCO Oppenheimer & Co. Inc. KING C. L. King & Associates, Inc. OTAA OTA LLC ADAM CANACCORD GENUITY INC. PAUL Paulson Investment Company, Inc. CSTI CANACCORD GENUITY LLC. PIPR Piper Sandler & Co. CANT Cantor Fitzgerald & Co. PUMA Puma Capital, Llc CFGN CELADON FINANCIAL GROUP LLC LAFC R. F. Lafferty & Co., Inc. SBSH Citigroup Global Markets Inc. RAJA Raymond James & Associates, Inc. DOTC COLLIERS SECURITIES LLC RBCM RBC CAPITAL MARKETS, LLC COWN Cowen and Company, LLC BARD Robert W. Baird & Co. Incorporated CHLM Craig-Hallum Capital Group LLC ROTH Roth Capital Partners, LLC DADA D.A. Davidson & Co. SGAS SG Americas Securities, LLC FLTG FLOW TRADERS U.S. LLC SPHN Stephens Inc. GSCO GOLDMAN SACHS & CO. LLC STFL Stifel, Nicolaus & Company, Incorporated GRFN GRIFFIN FINANCIAL GROUP, LLC INTL StoneX Financial Inc. GTSM GTS SECURITIES LLC RHCO Suntrust Robinson Humphrey, Inc. GUGS Guggenheim Securities, LLC SUFI Susquehanna Financial Group, LLP HOVD HOVDE GROUP, LLC LEER SVB LEERINK LLC IMCC IMC FINANCIAL MARKETS BNCH The Benchmark Company, LLC IMPC Imperial Capital, LLC VERT The Vertical Trading Group, LLC JPMS J.P. Morgan Securities LLC TRLN Tradelink Securities, LLC JANY Janney Montgomery Scott Inc. TLSA TRADELINK SECURITIES, LLC JEFF JEFFERIES LLC WABR Wall Street Access JSSF JMP Securities LLC VNDM Wall Street Access JGUN Joseph Gunnar & Co. LLC WEDB WEDBUSH SECURITIES INC. KBWI Keefe, Bruyette & Woods, Inc. WCHV WELLS FARGO SECURITIES, LLC KEYB KEYBANC CAPITAL MARKETS INC. WBLR WILLIAM BLAIR LTCO Ladenburg, Thalmann & Co., Inc. WDCO Wilson-Davis & Co., Inc. IA. 1",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "Internet Appendix",
    "page_number": 66,
    "page_range": "p.66",
    "total_pages": 68,
    "chunk_index": 120,
    "word_count": 456,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.66)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "JSSF JMP Securities LLC VNDM Wall Street Access JGUN Joseph Gunnar & Co. LLC WEDB WEDBUSH SECURITIES INC. KBWI Keefe, Bruyette & Woods, Inc. WCHV WELLS FARGO SECURITIES, LLC KEYB KEYBANC CAPITAL MARKETS INC. WBLR WILLIAM BLAIR LTCO Ladenburg, Thalmann & Co., Inc. WDCO Wilson-Davis & Co., Inc. IA. 1 Table IA2. Retail Broker FAQ Webpage Categories among Website Visitors in 2020 The table presents website usage patterns of Robinhood and other retail brokers using data obtained from SimilarWeb and AlexaInternet in July of 2020. The table illustrates the most visited FAQ topic pages among the broker websites, excluding account-related questions or FAQ topics not provided by all brokers, i.e. retirement account related questions. Question categories are aggregated across similar question types and ranked according to the prevalence of the FAQ topic on the website, where prevalence is measured as the number of FAQ web page visits divided by the total web page visits of the broker, expressed as page views per 1,000 site visitors. Robinhood Other Retail Brokers Visits Visits Rank FAQ Category /1,000 FAQ Category /1,000 1 What is the Stock Market 6.49 What are Stock Splits 1.67 2 What is the DJIA 6.07 What is an ETF 1.48 3 What is the S&P 500 5.78 What are Puts and Calls 1.45 4 What is a PE Ratio 5.73 What are the Different Order Types 1.41 5 What are Different Order Types 4.96 How to Trade IPOs 1.32 6 What is a Fiscal Year 4.72 What is RSI 1.25 7 What are Extended Hours 4.36 How to Find Investments 1.22 8 How to Trade / Invest 4.24 How are Investments Taxed 1.20 9 How to Find Investments 3.97 Mutual Funds vs ETFs 1.15 10 What is Pattern Day Trading 3.83 Trading Fees 1.14 IA. 2",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "Internet Appendix",
    "page_number": 67,
    "page_range": "p.67",
    "total_pages": 68,
    "chunk_index": 121,
    "word_count": 297,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.67)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  },
  {
    "text": "What is RSI 1.25 7 What are Extended Hours 4.36 How to Find Investments 1.22 8 How to Trade / Invest 4.24 How are Investments Taxed 1.20 9 How to Find Investments 3.97 Mutual Funds vs ETFs 1.15 10 What is Pattern Day Trading 3.83 Trading Fees 1.14 IA. 2 Table IA3. Retail Broker Platform Outages and Market Quality – Individual Broker Evidence The repeats the analysis in Table 9 for each traditional brokerage firm separately. Panel A reports the results for Schwab outages, Panel B analyzes E-Trade outages, and Panel C studies TD Ameritrade outages. Trading Trading Agg. Retail Trade Depth Quoted Effective Realized Price Volatility Volume Intensity Volume Imbalance Imbalance Spread Spread Spread Impact Panel A: Charles Schwab Outages Retail × Outage -0.007* -0.005* -0.095* 8.608** 6.931** 0.135 0.167** 0.16** 0.058* 0.047** i,d t (-1.687) (-1.831) (-1.951) (2.012) (2.482) (1.247) (2.184) (2.137) (1.852) (2.023) Panel B: E-Trade Outages Retail × Outage -0.008* -0.003 -0.007* 8.333* 6.879** 0.071* 0.112** 0.138* 0.077*** 0.054* i,d t (-1.707) (-1.453) (-1.883) (1.741) (2.119) (1.809) (2.180) (1.879) (2.819) (1.899) Panel C: TD Ameritrade Outages Retail × Outage -0.009** -0.008* -0.119** 2.139* 2.022** 0.112* 0.101* 0.169** 0.116** 0.156* i,d t (-2.104) (-1.752) (-2.390) (1.775) (2.385) (1.905) (1.852) (2.163) (2.386) (1.776) IA. 3",
    "title": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages",
    "source_type": "pdf",
    "document_id": "508c65beae92",
    "source_file": "Retail Trader Sophistication and Stock Market Quality Evidence from Brokerage Outages.pdf",
    "section": "Internet Appendix",
    "page_number": 68,
    "page_range": "p.68",
    "total_pages": 68,
    "chunk_index": 122,
    "word_count": 207,
    "author": "Green, Clifton",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.68)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220602141921-04'00'",
    "duration": null
  }
]