[
  {
    "text": "Retail Traders Love 0DTE Options... But Should They? ∗ † ‡ Heiner Beckmeyer Nicole Branger Leander Gayda First version: March 30, 2023 This version: March 30, 2023 Abstract Our study is the first to investigate the implications of trading in options that expire on the same day – so-called “0DTE” options. Almost the entire growth of trading in S&P 500 index options can be traced back to demand for 0DTE options. We use recent exchange-related developments to identify option trades that originate from retail investors, and find that more than 75% of their trades in S&P 500 options today are in 0DTE contracts. While retail investors benefit from significant price improvements, such as lower effective spread, they experience losses on average: Between February 2021 and February 2023, retail investors lost $184,000ontheaverageday; sincetheintroductionofadailyexpirationcalendarin May of 2022, this number has grown to average losses of $358,000 per day. We find that retail investors correctly take the expensiveness of 0DTE options into account when placing their orders, but that the substantial spreads charged by market makersleadtosignificantlosses. Ourstudyisacautionarytaleagainstunrestricted access to highly complex trading vehicles by investors who lack sufficient financial education. Keywords: Retail Trading, Options, WallStreetBets, Payment for Order Flow, 0DTE JEL classification: G4, G5, G12, D4 ∗University of Mu¨nster. heiner.beckmeyer@wiwi.uni-muenster.de. †University of Mu¨nster. nicole.branger@wiwi.uni-muenster.de. ‡University of Mu¨nster. leander.gayda@wiwi.uni-muenster.de. Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 34,
    "chunk_index": 0,
    "word_count": 220,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "by market makersleadtosignificantlosses. Ourstudyisacautionarytaleagainstunrestricted access to highly complex trading vehicles by investors who lack sufficient financial education. Keywords: Retail Trading, Options, WallStreetBets, Payment for Order Flow, 0DTE JEL classification: G4, G5, G12, D4 ∗University of Mu¨nster. heiner.beckmeyer@wiwi.uni-muenster.de. †University of Mu¨nster. nicole.branger@wiwi.uni-muenster.de. ‡University of Mu¨nster. leander.gayda@wiwi.uni-muenster.de. Electronic copy available at: https://ssrn.com/abstract=4404704 Retailinvestorsloveoptionsthatexpireonthesameday. Overthepastfewmonths, these so-called “0DTE” options (short for zero days to expiration) represent more than 75% of thetotalvolumethatretailinvestorstransactinS&P500indexoptions. Theirlottery-like payoffs(Bali,Cakici,andWhitelaw,2011;Filippou,Garcia-Ares,andZapatero,2018)and perceived potential for generating quick profits are appealing to retail investors. Today, there are numerous websites aimed at teaching retailers how to trade these options,1 and “0DTE” is frequently discussed on the popular r/wallstreetbets forum on Reddit. User reports on r/wallstreetbets have documented both success stories and losing tens of thousands of dollars trading 0DTE options. In a recent Forbes article, Vineer Bhansali asked ChatGPT for its opinion on the dangers of 0DTE options. Here’s what the AI had to say: “The danger with 0DTE options is that the price of the underlying asset can move quickly and unpredictably, especially on the day of expiration. This can result in significant gains or losses, depending on the direction of the price movement.”2 Financial professionals also expressed their concerns about the substantial growth in 0DTE options trading. Quoting a white paper by J.P. Morgan, Reuters reports that 0DTE options might contribute to market fragility and have the potential to amplify market downturns, potentiallyturninga“5%intradaymarketdeclineintoa25%rout”.3 Weshowthatalmost the entire growth in S&P 500 options trading over the last few years can be attributed to these ultra-short-term contracts. The recent surge in 0DTE options trading is accommodated by a longstanding effort of the Chicago Board Options Exchange (Cboe) towards offering shorter-term options 1For example https://0-dte.com. 2https://www.forbes.com/sites/vineerbhansali/2023/03/03/gamma-mama-could-0dte- options-be-the-cause-of-the-next-market-meltdown/?sh=53c647b61a77. 3https://www.reuters.com/markets/us/0dte-options-could-turn-5-intraday-market- decline-into-25-rout-jpmorgan-2023-03-06/. 1 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 34,
    "chunk_index": 1,
    "word_count": 289,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "trading over the last few years can be attributed to these ultra-short-term contracts. The recent surge in 0DTE options trading is accommodated by a longstanding effort of the Chicago Board Options Exchange (Cboe) towards offering shorter-term options 1For example https://0-dte.com. 2https://www.forbes.com/sites/vineerbhansali/2023/03/03/gamma-mama-could-0dte- options-be-the-cause-of-the-next-market-meltdown/?sh=53c647b61a77. 3https://www.reuters.com/markets/us/0dte-options-could-turn-5-intraday-market- decline-into-25-rout-jpmorgan-2023-03-06/. 1 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 34,
    "chunk_index": 2,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "with additional expirations. In 2005, the Cboe initiated a pilot program that introduced Weekly options with expiration dates on each Friday. Subsequently, in 2016, Monday and Wednesday expirations were added. As of May 2022, the Cboe introduced options that expire on each weekday. Whileshort-term optionsallow investors tohedge riskswith greaterprecision,theycanalsobeusedforspeculativepurposes. Thelowernominalprices of short-term options compared to longer-term contracts, may have contributed to the overall increase in retail participation in S&P 500 options trading. Furthermore, on July 9, 2020, the Securities Industry and Financial Markets Association (“SIFMA”) issued a letter to the Cboe supporting the changes in proposal SR-CBOE-2020-051 to encourage greaterretailparticipationinS&P500indexoptions. TheCboewasproposingtoactivate its Automated Price Improvement Mechanism (AIM) for S&P 500 options, a move which SIFMA notes “should incentivize increased retail customer auction participation in SPX options and provide retail customers with execution and price improvement opportunities in SPX options”.4 Price improvements for smaller order sizes of up to 10 contracts are thought to attract more retail flows. Of course, short-term options are particularly in line with retailers’ desire to trade in smaller quantities: they appear cheap on paper, with low notional prices. The Cboe also notes that smaller order sizes are favored by market makers who take the opposite side of the trades. Smaller orders are easier to hedge, “which may encourage Market-Makers to compete to provide price improvement in an electronic competitive auction process.” This paper is an investigation on whether these changes benefit retail investors. Our Results. To the best of our knowledge, our study is the first to systematically assess the trading behavior in 0DTE options in general, and its implications for retail investors in particular. We start our analysis by providing a number of stylized facts 4https://www.sifma.org/wp-content/uploads/2020/07/SIFMA-Comment-Letter-on-Cboe-SPX- AIM-.pdf 2 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 34,
    "chunk_index": 3,
    "word_count": 288,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "Results. To the best of our knowledge, our study is the first to systematically assess the trading behavior in 0DTE options in general, and its implications for retail investors in particular. We start our analysis by providing a number of stylized facts 4https://www.sifma.org/wp-content/uploads/2020/07/SIFMA-Comment-Letter-on-Cboe-SPX- AIM-.pdf 2 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 34,
    "chunk_index": 4,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "about 0DTE trading. Since January of 2021 we can identify retail trades in S&P 500 options through transaction code “SLAN”, short for “Single Leg Auction Non ISO”. Other studies have used this identification for equity options (Bryzgalova, Pavlova, and Sikorskaya, 2023; Ernst and Spatt, 2022). We use this novelty for an analysis of 0DTE trading between January 2021 and February 2023. First, we show that 0DTE options are responsible for most of the overall growth in the trading activity of S&P 500 options. Today, more than 40% of all traded contracts expire on the same day and most positions in these ultra-short-term options are closed before maturity. Second, end consumers buy more 0DTE options than they sell. This in turn leaves the option market maker with a net-short position. Using detailed Open/Close data, which breaks down each day’s options volume by the market participants from which it originates, we can show that the aggregate net-short position of market makers in 0DTE options has grown considerably inrecentmonths. Optionmarketmakers’hedgingactivityhasthepotentialtoexacerbate intraday market swings, consistent with the previously mentioned market commentary by J.P. Morgan, which warns of the potential dangers of 0DTE trading. As a third stylized fact, we show that 0DTE options are particularly popular among retail investors. Overall, the share of retail trading in S&P 500 options fluctuates between 3% and 4%. For 0DTE options, this share exceeds 6% and today around 75% of all retail trades in S&P 500 options are in 0DTE options. Fourth, the proposed price improvement discussed in Cboe proposal SR-CBOE-2020-051 works: effective spreads for retail orders are smaller than for the remaining 0DTE trades. Overall, we find that retail investors favor small order sizes, with 72.2% of all orders trading a single option. Apart from differences in the order size, we find few systematic differences between retail and non- retail trading in 0DTE options. The two trader groups buy and sell options with roughly equal frequency, slightly favor puts over calls, and focus on at-the-money and slightly out- of-the-money 0DTE options with 3–24 hours to maturity. Finally, “0DTE” is a popular 3 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 34,
    "chunk_index": 5,
    "word_count": 350,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "and non- retail trading in 0DTE options. The two trader groups buy and sell options with roughly equal frequency, slightly favor puts over calls, and focus on at-the-money and slightly out- of-the-money 0DTE options with 3–24 hours to maturity. Finally, “0DTE” is a popular 3 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 34,
    "chunk_index": 6,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "topic in discussions on Reddit’s r/wallstreetbets. Since mid-2020, it is mentioned in over 20 comments per day on the “Daily Discussion” and “What Are Your Moves Tomorrow” threads. We next investigate if the popularity of 0DTE options by retail investors is founded in the aggregate performance of their 0DTE investments. The answer is a resounding “No”: across our sample period spanning a little over two years, retail investors together lost more than $70 million. More than $50 million of these losses are the result of the transaction costs they have to pay. The remaining $20 million are a result of poor positioning. We also observe, however, that the cumulative losses gross-of-fees have remained relatively constant since November of 2022 – the losses driven by transaction costs continue to grow. Market makers profit from retail demand in 0DTE options, through high levels of fees, fees that we show are larger than for the remaining retail orders, including for short-term options with only a week to expiration. Retaillossesfrom0DTEoptionshavegrownovertime, especiallysincetheintroduction of option expirations on every weekday. Average daily retail losses amount to $−184,000 for the entire sample. This number has accelerated considerably in recent months. From May 16th, 2022, which marks the introduction of a daily expiration calendar by the Cboe, daily retail losses have grown to $−358,000. Roughly 60% of daily losses are the result of transaction costs, 60% are driven by investments in 0DTE put options, and retail buys show particularly poor performance. Since January of 2022, we find that the overall level of expensiveness of 0DTE options has increased drastically. We measure the expensiveness using the Cboe’s VIX formula on all option trades between 9:30 and 9:40. We show that retail investors have learned to take the overall expensiveness of 0DTE options into account when deciding whether to favor buy or sell orders. While they favored additional buying whenever 0DTE options 4 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 34,
    "chunk_index": 7,
    "word_count": 317,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "VIX formula on all option trades between 9:30 and 9:40. We show that retail investors have learned to take the overall expensiveness of 0DTE options into account when deciding whether to favor buy or sell orders. While they favored additional buying whenever 0DTE options 4 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 34,
    "chunk_index": 8,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "were particularly expensive in the early parts of our sample, we can show that they correctly engage in additional selling since May 16th of 2022. This translates into more profitable sell orders of retail investors. All in all, we find that retail investors’ selling decisions are profitable. In contrast, their buying decisions are particularly troublesome and carry most of their aggregate losses. Related Literature Our paper adds to a growing literature analyzing the behavior of retail investors. Early studies on the topic suggest that retail investors make systematic mistakes and are gener- ally uninformed Barber and Odean (2000, 2008). More recently, Eaton, Green, Roseman, and Wu (2022b) show that the absence of Robinhood investors leads to improved market conditions. In contrast to these studies, Boehmer, Jones, Zhang, and Zhang (2021) build on a novel identification of retail investors from trade-level data and find that retail order imbalances predict future short-term stock returns. In line with this, Welch (2022) shows that the aggregate portfolio of Robinhood investors performs well and accredits retail in- vestors some ability to time market movements. Boehmer and Song (2020) find that the short-selling activity of retail investors predicts negative stock returns. Finally, Barber, Lin, and Odean (2022) reconcile the seemingly conflicting evidence on the performance of retail trading activity. Our results add to this debate by focusing on ultra-short-term S&P 500 index options. We show that a) retail investors consider information about the overall expensiveness of 0DTE options in their trade positioning and sizing, and b) that their aggregate losses are primarily driven by paying hefty transaction fees. We also add to the literature on options trading by retail investors and lottery-like pref- erences of investors. Bauer, Cosemans, and Eichholtz (2009) show that retail investors use options primarily to gamble and Lakonishok, Lee, Pearson, and Poteshman (2007) 5 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 34,
    "chunk_index": 9,
    "word_count": 307,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "by paying hefty transaction fees. We also add to the literature on options trading by retail investors and lottery-like pref- erences of investors. Bauer, Cosemans, and Eichholtz (2009) show that retail investors use options primarily to gamble and Lakonishok, Lee, Pearson, and Poteshman (2007) 5 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 34,
    "chunk_index": 10,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "uncover speculative purposes as the primary trading motive. Byun and Kim (2016) come to a similar conclusion. In line with this, Boyer and Vorkink (2014) show that skewness negatively predicts future option returns, which the authors attribute to intermediaries requiring greater compensation for facilitating the demand for lottery-like options (Bali et al., 2011). The results of Lipson, Tomio, and Zhang (2023) suggest that the option trading activity of retail investors has the potential to increase the volatility in the un- derlying securities, and Blau, Bowles, and Whitby (2016) find a similar result for overall gambling demand in options. In a recent study, Bryzgalova et al. (2023) show how to identify retail trades in options using transaction-level data. The authors find that retail investors on aggregate lose money in single equity and ETF options. Furthermore, Eaton, Green, Roseman, and Wu (2022a) show that retail option demand has an impact on the expensiveness of equity options, and Ernst and Spatt (2022) document large payment for order flow in the options market and limited evidence of price improvements for retail investors. We add to these studies by focusing on the recent trend of trading options that expire on the same day. 0DTE options are particularly popular among retail investors and today represent the bulk of retail trading in S&P 500 options. While these options are a way to satisfy the demand for lottery-like payoffs (Bali et al., 2011; Filippou et al., 2018), retail investors pay a hefty premium to participate, especially in the form of high transaction costs. Our results are a cautionary tale of the dangers of allowing unrestricted access for retail investors to 0DTE options. Their hunger for lottery-like assets, coupled with lively discussions about the benefits of trading these options on forums like Reddit, as well as their prominent display in popular trading platforms attracts investors that lack the financial education required for assets as complex as options that expire on the same day. For example, the Robinhood app displays short-term options per default, whose seemingly cheap nominal prices attract retail demand. An unregulated rollout of daily 6 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 34,
    "chunk_index": 11,
    "word_count": 353,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "platforms attracts investors that lack the financial education required for assets as complex as options that expire on the same day. For example, the Robinhood app displays short-term options per default, whose seemingly cheap nominal prices attract retail demand. An unregulated rollout of daily 6 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 34,
    "chunk_index": 12,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "expirations for single equity options has the potential to significantly amplify the losses faced by retail investors. With this, we also add to the literature on investor protection (Campbell, Jackson, Madrian, and Tufano, 2011; Vokata, 2021). 2. Data We use trade-level data for S&P500 options provided by Cboe. Because S&P500 options are exclusively traded on Cboe exchanges, this covers 100% of their volume. Our dataset of intraday trade data starts in January 2005 and ends in February 2023. As our focus is on investigating the implications of retail trading in 0DTE options we restrict most of our analyses to the period between January 2021 and February 2023. We augment information about S&P500 option trades with high-frequency data on market maker quotes. As our analyses require us to classify trades into buys and sells, we merge every transaction from the trade-level data with the last available bid- and ask-quotes. The trade direction is identified using the quote rule following Muravyev (2016), such that trades with prices above (below) the mid-quote are classified as buy (sell). Transaction-level options data is noisy. We thus employ the filters proposed by Bryz- galova et al. (2023). Specifically, we remove canceled trades, trades with nonpositive size, and trades with a negative bid-ask spread. Furthermore, we only consider those trades for which the trade price is above the prevailing best bid minus the bid-ask spread and below the best ask plus this spread. Should multiple trades enter at the same time and with the same trade ID, we handle them as a single trade. Finally, we have obtained data on the signed trading volume for each option×day. This Open/Close dataset provides a breakdown of who initiated a trade and whether the tradeestablishedanewpositionorclosedanexistingone. Optiontradesforeachcontract 7 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 34,
    "chunk_index": 13,
    "word_count": 292,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "same time and with the same trade ID, we handle them as a single trade. Finally, we have obtained data on the signed trading volume for each option×day. This Open/Close dataset provides a breakdown of who initiated a trade and whether the tradeestablishedanewpositionorclosedanexistingone. Optiontradesforeachcontract 7 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 34,
    "chunk_index": 14,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "are categorized as either open buy, open sell, close buy, or close sell. Each category is further broken down into different types of market participants: customers, professional customers, broker-dealers, firms, and market makers. 3. 0DTE Options and Retail Investors 3.1. Growth of 0DTE Options Trading To get a feel for the popularity of 0DTE options, we show the monthly trading volume in S&P 500 options for our sample period from 01/2005 to 02/2023 in Panel A of Fig- ure 1. We separate the transacted volume in 0DTE options from the volume in all other maturities. While 0DTE options have played a small role until 2018, they have since rapidly risen in popularity. Over the last five years, they represent the largest portion of the overall growth in S&P 500 options trading. Panel B of Figure 1 corroborates this finding. It gives the monthly trading volume since 2018. The entire growth in index options trading is amassed in short-term options with maturities of up to four days. The bulk of this increase is concentrated in options that expire on the same day. In fact, the volume in options with more than four days to maturity has slightly decreased since 2018. The increase in 0DTE options trading is particularly pronounced starting since May of 2022. This date marks the introduction of Tuesday and Thursday expirations for S&P 500 options. Since then, options on the S&P 500 expire on every weekday, such that investors always have access to ultra-short-term 0DTE options. Finally, we show the volume share by option maturity in Panel C of Figure 1. In 2018, options with a maturity of up to a week represented between 20%–30% of all transacted S&P 500 option contracts. This number has steadily grown since then and stands at 8 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 34,
    "chunk_index": 15,
    "word_count": 300,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "show the volume share by option maturity in Panel C of Figure 1. In 2018, options with a maturity of up to a week represented between 20%–30% of all transacted S&P 500 option contracts. This number has steadily grown since then and stands at 8 Electronic copy available at: https://ssrn.com/abstract=4404704 Panel A: Monthly Trading Volume 60 40 20 0 2006 2008 2010 2012 2014 2016 2018 2020 2022 noilliM Non-0DTE 0DTE Panel B: Monthly Trading Volume 60 40 20 0 2018 2019 2020 2021 2022 2023 noilliM Rest 0dte 1dte 2dte 3dte 4dte Panel C: Monthly Trading Share 60 % 4 0 20 0 2018 2019 2020 2021 2022 2023 Fig. 1. Trading in S&P 500 options The figure shows the monthly trading volume and trading share in S&P 500 options across different option maturities. Panel A plots the the monthly trading volume from January 2004 until February 2023. PanelBshowsthemonthlytradingvolumefromJanuary2018untilFebruary2023. PanelCplots the monthly trading share from January 2018 until February 2023 more than 60% today. Of this 60%, about two thirds are found in 0DTE options which have seen the largest increase in demand. Overall, there is a large demand for short-term and ultra-short term options exposure. Moreover, we investigate who provides liquidity in this rapidly expanding market and warehouses the associated risks of selling 0DTE options. It is well documented that market makers play a crucial role in option markets by providing liquidity and ensuring thatthereisacontinuoussupplyofbuyersandsellersforoptions. Accordingly,weprovide 9 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 10,
    "page_range": "p.10-11",
    "total_pages": 34,
    "chunk_index": 16,
    "word_count": 244,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.10-11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "term options exposure. Moreover, we investigate who provides liquidity in this rapidly expanding market and warehouses the associated risks of selling 0DTE options. It is well documented that market makers play a crucial role in option markets by providing liquidity and ensuring thatthereisacontinuoussupplyofbuyersandsellersforoptions. Accordingly,weprovide 9 Electronic copy available at: https://ssrn.com/abstract=4404704 1 Non-0DTE 0DTE 0 % -1 -2 Apr-21 Jul-21 Oct-21 Jan-22 Apr-22 Jul-22 Oct-22 Jan-23 Fig. 2. 5-day moving average market maker order imbalance The figure shows the daily 5-day moving average market maker order imbalance in S&P 500 0DTE and non-0DTE options from February 2021 until February 2023. The market maker order imbalance is defined as the number of contracts bought minus the number of contracts sold by the market makers (seeeq.(1)). Therespectivedailyorderimbalanceof0DTEandnon-0DTEoptionsisscaledbythedaily total number of S&P 500 options traded. a breakdown of the overall order imbalance of the aggregate option market maker over time in Figure 2 . We use the Open/Close profile described in Section 2, which identifies options trade that originated from the market maker. The relative order imbalance is defined as: (cid:80) BuyMM,j − (cid:80) SellMM,j OrdImbMM,j = j,t t j,t t (1) t (cid:80) Volume t t We separately show the order imbalance for 0DTE options, as well as the remaining trading activity. Throughout 2021 and up until May of 2022, we find that option market makers were exclusively net-short in 0DTE options and predominantly so in options of other maturi- ties. On average, the aggregate order imbalance was tilted towards short positions, with market makers absorbing roughly 0.4%−0.9% more short than long positions in 0DTE options. For the remaining maturities, this number fluctuates between −2% and +0.15%. In May of 2022 we see a shift in the market maker’s order imbalance for both types of options. For non-0DTE options, we find that it turns positive on most days. Market 10 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 34,
    "chunk_index": 17,
    "word_count": 312,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "options. For the remaining maturities, this number fluctuates between −2% and +0.15%. In May of 2022 we see a shift in the market maker’s order imbalance for both types of options. For non-0DTE options, we find that it turns positive on most days. Market 10 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 34,
    "chunk_index": 18,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "makers increased their long-exposure in these options, as they absorbed the demand of end consumers to primarily short options with maturities of more than a day. In contrast, we find that the order imbalance for 0DTE options turns even more negative. Since July of 2022 it is consistently below −1%. End consumers have net-long demand for these options. Market makers consequently absorb this demand and hold a large 0DTE option portfolio that is net-short. In the introduction we have referred to a market commentary by J.P. Morgan, warning of the potential dangers of 0DTE trading. Option market makers have negative Gamma exposure, as a result of their large and negative order imbalance. To hedge their exposure, they need to invest into the direction of the market movement, potentially increasing the magnitude of intraday market swings. Ni, Pearson, Poteshman, and White (2021) and Barbon, Beckmeyer, Buraschi, and Moerke (2022) study the broader implications of the hedging activity of option market makers on the volatility and prices of the underlying stocks. Gayda, Gru¨nthaler, and Harren (2022) show that option market makers try to manage their Gamma exposure by encouraging changes in end consumer demand. Note that since 0DTE options expire at the end of the day, the order imbalance figures shown here are equivalent to the market maker’s inventory. For options with longer maturities, this equivalence does not hold. 3.2. 0DTE and Retail Investors Identifying Retail Trades. To identify retail trades, we capitalize on the Cboe’s re- cent decision to incentivize greater price improvements for small S&P 500 options orders. Cboe proposal SR-CBOE-2020-05 encourages greater retail participation in these options by activating Cboe’s Automated Price Improvement Mechanism (AIM). As the Securities Industry and Financial Markets Association (“SIFMA”) notes in a letter issued on July 9, 2020, “this should incentivize increased retail customer auction participation in SPX 11 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 34,
    "chunk_index": 19,
    "word_count": 310,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "SR-CBOE-2020-05 encourages greater retail participation in these options by activating Cboe’s Automated Price Improvement Mechanism (AIM). As the Securities Industry and Financial Markets Association (“SIFMA”) notes in a letter issued on July 9, 2020, “this should incentivize increased retail customer auction participation in SPX 11 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 34,
    "chunk_index": 20,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "options and provide retail customers with execution and price improvement opportunities in SPX options”. The implementation of the proposed changes allows us to identify retail trades. Trades of an order size up to 10 contracts may enjoy price improvements and are consequently listed with OPRA type description SLAN short for Single Leg Auction Non Iso. Since February, 22 of 2021, this allows us to identify the majority of retail trading in S&P 500 indexoptions. FollowingBryzgalovaetal.(2023)wefocusouranalysisonsingle-legtrades that undergo the aforementioned price improvement mechanism. We also refer to these trades as with the acronym SLIM. The authors show that SLIM identifies retail trades in single equity options better than heuristics based on small order sizes. We use their insight to understand the implications of retail trading in ultra-short-term index options. We can report that our results are qualitatively unchanged if we also include multi-leg AIMtrades. WedecidetoexcludethemforthesameargumentasBryzgalovaetal.(2023) in that these sophisticated strategies are likely followed by small professional investors and hedge funds. The studies by Ernst and Spatt (2022) and Hendershott, Khan, and Riordan (2022) use the same approach to identify retail trades. 0DTE Options Are Popular Among Retail Investors. So far, we have looked at the overall volume of S&P 500 options and its composition. Trading in ultra-short-term options has grown considerably since 2020. From now on, our focus is on retail trading in 0DTE options. Panel A of Figure 3 shows the evolution of retail trading in 0DTE options, as well as in all other maturities. We can identify retail trades between January of 2021 and February of 2023. During this period, retail trading in S&P 500 options has grown steadily, from roughly half a million contracts per month for the first half of 2021 up to a million contracts for 2021’s second half and the first quarter of 2022. Since May of 2022 the growth in retail volume has picked up even more, which coincides with the 12 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 34,
    "chunk_index": 21,
    "word_count": 323,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "a million contracts per month for the first half of 2021 up to a million contracts for 2021’s second half and the first quarter of 2022. Since May of 2022 the growth in retail volume has picked up even more, which coincides with the 12 Electronic copy available at: https://ssrn.com/abstract=4404704 Panel A: Monthly SLIM Trading Volume 1.5 1 0.5 0 Apr-21 Jul-21 Oct-21 Jan-22 Apr-22 Jul-22 Oct-22 Jan-23 noilliM Total 0DTE Panel B: Monthly SLIM Share relative to Total Volume 5 Total 0DTE Non-0DTE 4 % 3 2 1 0 Apr-21 Jul-21 Oct-21 Jan-22 Apr-22 Jul-22 Oct-22 Jan-23 Panel C: Monthly SLIM 0DTE Share relative to Total SLIM Volume 80 60 % 40 20 Apr-21 Jul-21 Oct-21 Jan-22 Apr-22 Jul-22 Oct-22 Jan-23 Fig. 3. SLIM options volume ThisfigureshowsthemonthlySLIMtradingvolumeandshareinSPXoptionsfromFebruary2021until February 2023. Panel A shows the monthly SLIM trading volume for all SPX options and 0DTE SPX options. Panel B shows the monthly SLIM share of the trading volume for all SPX options, 0DTE SPX options and non-0DTE SPX options. Panel C shows the monthly SLIM trading volume in 0DTE SPX options relative to the monthly SLIM trading volume in all SPX options. introduction of Tuesday and Thursday expirations for S&P 500 options. In fact, most of the growth in retail trading of index options is attributable to 0DTE options. Today, more than a million 0DTE contracts are bought and sold by retail investors every single month. Panel B provides a breakdown of how important retail trading is for the overall market ofS&P500options. Weseparatelyconsider0DTEoptionsandoptionswithamaturityof 13 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 34,
    "chunk_index": 22,
    "word_count": 258,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "retail trading of index options is attributable to 0DTE options. Today, more than a million 0DTE contracts are bought and sold by retail investors every single month. Panel B provides a breakdown of how important retail trading is for the overall market ofS&P500options. Weseparatelyconsider0DTEoptionsandoptionswithamaturityof 13 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 34,
    "chunk_index": 23,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "at least one day. Across all maturities, retail investors made up roughly 2% of all volume in 2021. This number has grown to about 4% today. For 0DTE options, retail investors play an exaggerated role: in 2021, roughly 4% of all 0DTE volume was transacted for and by retail accounts. In 2022 this number has grown considerably and now exceeds 6% of all 0DTE volume. The share in non-0DTE options, in contrast, hovers close to 2% across our entire sample. Finally, we show the fraction of retail volume that can be ascribed to 0DTE options in Panel C of Figure 3. Growing from less than 40% at the beginning of 2021, 0DTE options today represent about three quarters of all retail trading in S&P 500 options. A careful consideration of the drawbacks and benefits posed by these options is therefore not only in there interest of the retail investor community but also in the interest of financial regulators. Wenowtakeacloserlookatthetradingdecisionsin0TEoptionsforretailinvestorsand non-retail investors. We investigate whether the two investor groups differ systematically in their contract choice, chosen holding period and trade direction. Table 1 shows the average quoted and effective spreads, the number of trades and total volume, split by a number of option characteristics, including the option type (puts vs. calls), the order size and direction, as well as the option’s time-to-maturity and moneyness. We first confirm that the proposed price improvement mechanism works. For this, we define the quoted and effective spread of trade j as: Ask −Bid |Trade Price −Bid |×2 j j j j QS = , ES = (2) j Mid j Mid j j Table 1 confirms that quoted and effective spreads are in fact lower for retail trades. Retail investors benefit from the price improvement mechanism and enjoy substantially better trade execution than non-retail traders. On average, they pay an effective spread 14 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 34,
    "chunk_index": 24,
    "word_count": 313,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "Mid j Mid j j Table 1 confirms that quoted and effective spreads are in fact lower for retail trades. Retail investors benefit from the price improvement mechanism and enjoy substantially better trade execution than non-retail traders. On average, they pay an effective spread 14 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 34,
    "chunk_index": 25,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "of 6.1% for calls and 4.9% for puts, compared to 13.1% and 10.1% – a considerable improvement of more than 50%. Next, we turn to the number of trades and trading volume. The largest difference betweenretailtradesandtheremainderisinthesizeoftheorders. Retailersfavorsmaller order sizes, with 72.2% of all orders trading a single option. 25.2% trade between 2 and 5 options, only 2.6% between 6 and 10, and naturally no retail orders trade more than 10 contracts. The SLIM procedure only allows us to identify retail traders of order sizes up to 10 contracts. While non-retail investors also favor small order sizes, they occasionally trade in larger quantities, such that more than half of their volume is transacted through orders of 11 contracts or larger. We find a slight systematic difference in the trade direction between retail and non- retail investors. We can identify about 44.7% (37.3%) of retail (non-retail) trades as a buy and 37.3% (45.3%) as sell. The remaining 18% (16.9%) are executed at the mid. A further separation by put and call options agrees with this. Results for calls and puts are comparable. We cannot confirm retail investors’ preference for call options that Bryzgalova et al. (2023) document for single equity options. Retail investors tend to enter 0DTE options positions in the first half of the trading day. 63.4% of their trades and 62.2% of their total volume is executed with 3–24 hours until the option expires. For non-retail investors, these numbers amount to 61.3% and 60.9%. Daily expirations are settled at 4pm Eastern time. Non-retail investors trade a largerfractioninoptionswithlessthan3hourstoexpiration. About36.6%oftheirtrades are in these maturities, compared to 38.6% for retail investors. As the option approaches expiration, we find that effective and quoted spreads widen. Interestingly, retail investors continue to trade 0DTE options with less than an hour until expiration. Furthermore, retail traders favor at-the-money contracts, as well as contracts slightly out-of-the-money. 15 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 34,
    "chunk_index": 26,
    "word_count": 314,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "38.6% for retail investors. As the option approaches expiration, we find that effective and quoted spreads widen. Interestingly, retail investors continue to trade 0DTE options with less than an hour until expiration. Furthermore, retail traders favor at-the-money contracts, as well as contracts slightly out-of-the-money. 15 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 34,
    "chunk_index": 27,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "Table 1: SLIM vs. Non-SLIM trading in 0DTE options ThetableshowsthedailyaveragecharacteristicsofSLIMandnon-SLIM0DTEtrades. Thesamplecovers the period from February 2021 until February 2023. The quoted and effective spreads are measured as in 2. Trades are classified as buy, sell and mid according to the quote rule following Muravyev (2016). The moneyness is defined as the log-moneyness at the time of the trade. 0DTE SLIM 0DTE Non-SLIM Characteristic Category Freq. (%) Volume(%) QS(%) ES(%) Freq. (%) Volume(%) QS(%) ES(%) Type Call 49.9 49.9 8.1 5.0 49.1 48.6 22.2 12.8 Put 50.1 50.1 8.6 5.1 50.9 51.4 19.0 9.7 Size 1 75.8 50.2 8.3 5.1 51.8 14.2 18.5 10.2 2-5 22.4 40.6 8.5 4.9 31.7 25.6 21.6 11.7 6-10 1.8 9.2 10.8 5.8 9.7 21.4 23.3 12.5 11-100 0.0 0.0 0.0 0.0 6.7 37.4 25.9 14.9 Above100 0.0 0.0 0.0 0.0 0.2 1.4 54.9 18.4 Direction Buy 44.7 43.8 8.2 6.2 37.7 37.7 26.4 21.1 Sell 37.3 36.7 8.1 5.9 45.3 45.4 15.4 7.2 Mid 18.0 19.5 8.7 0.0 16.9 16.9 21.0 0.0 Direction: Call Buy 22.6 22.1 8.1 6.3 19.0 18.8 30.4 24.9 Sell 18.3 17.9 7.9 5.7 22.0 21.8 15.7 7.2 Mid 9.1 9.8 8.4 0.0 8.1 8.0 21.2 0.0 Direction: Put Buy 22.1 21.7 8.1 6.2 18.7 18.9 22.8 17.7 Sell 19.0 18.8 8.4 6.2 23.3 23.6 15.2 7.1 Mid 8.9 9.7 9.3 0.0 8.8 8.9 21.0 0.0 TTM 1hour 11.3 11.9 14.8 8.5 15.5 15.9 33.2 21.6 1-3hours 25.3 25.8 8.5 5.4 23.1 23.2 20.5 11.2 3-24hours 63.4 62.2 7.0 4.3 61.3 60.9 17.1 8.6 Moneyness: Call Below-2% 0.0 0.0 2.0 0.5 0.0 0.0 2.5 0.4 -0.5%to-2% 0.4 0.4 2.9 0.8 1.1 1.0 3.2 0.7 AtTheMoney 33.7 34.4 5.6 3.0 24.1 22.5 9.6 5.0 0.5%to2% 14.7 14.0 18.7 11.6 20.9 21.4 34.7 19.8 Above2% 1.1 1.1 57.7 44.9 3.0 3.7 134.0 115.5 Moneyness: Put Below-2% 2.9 2.8 58.8 31.7 5.8 7.0 76.9 48.1 -0.5%to-2% 17.9 17.0 13.1 8.7 23.0 23.6 19.5 8.9 AtTheMoney 28.8 29.8 5.3 2.8 21.0 19.8 8.6 4.3 0.5%to2% 0.4 0.4 3.4 0.9 1.0 1.0 3.7 0.8 Above2% 0.0 0.0 2.9 0.6 0.0 0.0 3.0 0.4 Together, these options represent more than 90% of their transacted volume. 0DTE on r/wallstreetbets. 0DTE options are a frequent discussion point by retail investors on Reddit’s r/wallstreetbets. In Figure 4 we plot the average number of daily mentions of either ‘0DTE’ or ‘0 DTE’ in the comment sections of the “Daily Discussion” and “What Are Your Moves Tomorrow” threads. The two threads are where most of the discussions on r/wallstreetbets take place. Nonetheless, a simple search reveals that many individual threads exist that focus on the 0DTE topic. The number of mentions 16 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 34,
    "chunk_index": 28,
    "word_count": 445,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "of the “Daily Discussion” and “What Are Your Moves Tomorrow” threads. The two threads are where most of the discussions on r/wallstreetbets take place. Nonetheless, a simple search reveals that many individual threads exist that focus on the 0DTE topic. The number of mentions 16 Electronic copy available at: https://ssrn.com/abstract=4404704 7102 8102 9102 0202 1202 2202 25 20 15 10 5 0 snoitneM 'ETD 0'|'ETD0' fo rebmuN Fig. 4. Mentions of ‘0DTE’ and ‘0 DTE’ on Reddit’s r/wallstreetbets Thefigureshowstheaveragenumberofcommentsonthe“DailyDiscussion”and“WhatAreYourMoves Tomorrow” threads on Reddit’s r/wallstreetbets. We show the average number of mentions per month between 2017 and 2022. we show here is therefore a lower bound on the topic’s overall discussion intensity. 0DTE options are first mentioned at the end of 2018 but infrequently so. Throughout 2019 we observe a steady increase in the number of comments mentioning the topic. Right around the time of the Covid outbreak and mandated lockdowns worldwide we find a pronounced spike in the popularity of 0DTE options on r/wallstreetbets. The number of mentions reaches its peak in mid-2020 with more than 25 comments devoted to the topic on the average day. Since then, the average number of daily mentions has hovered around 15–20, highlighting a large interest of retail investors to learn about and discuss 0DTE trading. 4. Profitability of 0DTE SLIM Trades Is the popularity of 0DTE by retail investors founded in the success of their aggregate trading activity in these options? We document that retail investors consistently lose 17 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 34,
    "chunk_index": 29,
    "word_count": 251,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "interest of retail investors to learn about and discuss 0DTE trading. 4. Profitability of 0DTE SLIM Trades Is the popularity of 0DTE by retail investors founded in the success of their aggregate trading activity in these options? We document that retail investors consistently lose 17 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 34,
    "chunk_index": 30,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "money, especially after transaction costs. While they correctly incorporate the overall level of expensiveness of 0DTE options in their decision to buy or sell, they fail to out- perform the hefty spreads they are asked to pay. 4.1. Retail Investors Lose Money On 0DTE Options We follow Bryzgalova et al. (2023) and compute the dollar profits of each retail trade j as follows: $Profit = Direction ×Size ×100×(Payoff −O ), (3) j j j j j where Direction is +1 for buys and -1 for sell orders, Size the trade’s order size in contracts and 100 the contract multiplier typical for S&P 500 options. Finally, Payoff is the option’s payoff at maturity, i.e., max(S −K) for calls and max(K−S ) settlement settlement for puts, with the value of the S&P 500 at settlement, S . Thereby, we implicitly settlement assume that the contracts are held to expiration. We evaluate the trade’s gross and net profits separately. To compute its gross profits, we set O to the prevailing mid-quote at the time of the trade. For its net profits, we use j the actual transaction price, which we observe in our trade-level dataset. This gives us a comparison of the aggregate profits of retail trading in 0DTE options before and after transaction fees paid to the market maker. For the 18% of SLIM trades that occur at the mid-quote (see Table 1), the gross and net profits will naturally be the same. We show the cumulative net and gross profits in Figure 5. There is little movement in 2021 but the cumulative profits are already negative. At the end of 2021 and until around May of 2022, aggregate gross profits turn positive for a while, but profits net-of- fees continue to hover around zero. May of 2022 is when things turn bleak: gross profits dip into negative territory and stand at around $-20 million at the end of our sample. Profits net-of-fees perform much worse and have exceeded $-70 million today. Whereas 18 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 34,
    "chunk_index": 31,
    "word_count": 337,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "fees continue to hover around zero. May of 2022 is when things turn bleak: gross profits dip into negative territory and stand at around $-20 million at the end of our sample. Profits net-of-fees perform much worse and have exceeded $-70 million today. Whereas 18 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 34,
    "chunk_index": 32,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "20 0 -20 -40 -60 -80 May-21 Sep-21 Dec-21 Mar-22 Jun-22 Oct-22 Jan-23 noilliM Net Profit Gross Profit Fig. 5. Cumulative daily net and gross profits of 0DTE 0DTE SLIM options The figure shows the daily cumulative net and gross profit as in equation 3 in 0DTE SLIM options from February 2021 until February 2023. cumulative gross profits stayed relatively constant after November of 2022, reflecting a sensible choice of contracts by retailers, net profits continued to fall. We provide a detailed breakdown of aggregate retail profits in Table 2. On the average day, retail investors have lost $184,000 and since May 16th of 2022 a whopping $358,000 on 0DTE trades. Panel C shows average daily profits per month. Consistent with the evidence in Figure 5, profits and losses fluctuate relatively little in 2021. Accompanying the overall growth in retail interest, 0DTE profits and losses are significantly larger in all of 2022. For example, in January of 2022, the aggregate retail trading in 0DTE options generated $300,000 per day and after fees. Since the introduction of daily expirations in May of 2022, net profits have turned consistently negative. September, October and De- cember of 2022 mark the months with the largest retail losses caused by 0DTE exposure. Retail investors lost more than $500,000 on the average day. For most of 2022, gross profits are close to $200,000 per day larger than net-profits but are also predominantly negative. Retailers’ profits differ depending on whether they trade calls or put. While both contracts lead to a negative net and gross profits over the whole sample and in the subsample starting in May 2022, losses are between 20% and 50% larger for puts than for calls. 19 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 34,
    "chunk_index": 33,
    "word_count": 289,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "differ depending on whether they trade calls or put. While both contracts lead to a negative net and gross profits over the whole sample and in the subsample starting in May 2022, losses are between 20% and 50% larger for puts than for calls. 19 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 34,
    "chunk_index": 34,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "Table 2: Average daily net and gross profits in 0DTE SLIM options The table shows the daily average net and gross profits as in equation 3 for all 0DTE SLIM options and 0Dte SLIM calls, puts and options that are classified as buy and sell according to the quote rule followingMuravyev(2016). PanelAreportsthedailyaveragenetandgrossprofitsfortheentiresample from February 2021 until February 2023. Panel B for the period of continuous offering of 0DTE options from May 16, 2022 until February 2023. Panel C reports the daily average profits by month, Panel D by weekday and Panel E by trading hour. Net Profits, 100k Gross Profits, 100k AllOptions Call Put Buy Sell AllOptions Call Put Buy Sell Panel A: Full Sample -1.84 -0.84 -1.00 -3.12 1.27 -0.49 -0.18 -0.30 -2.38 1.89 Panel B: From May 16th, 2022 -3.58 -1.40 -2.18 -9.89 6.30 -1.40 -0.34 -1.06 -8.70 7.30 Panel C: By Month Feb-21 -0.44 -0.14 -0.31 -0.14 -0.30 -0.32 -0.08 -0.24 -0.07 -0.25 Mar-21 -0.17 -0.08 -0.09 1.21 -1.38 -0.08 -0.03 -0.05 1.25 -1.33 Apr-21 -0.21 -0.01 -0.19 -0.46 0.26 -0.16 0.01 -0.17 -0.44 0.28 May-21 -0.33 -0.24 -0.10 0.01 -0.35 -0.23 -0.19 -0.04 0.07 -0.30 Jun-21 -0.14 -0.07 -0.07 -0.59 0.44 -0.03 -0.02 -0.01 -0.53 0.50 Jul-21 -0.02 0.39 -0.41 -0.66 0.64 0.18 0.50 -0.32 -0.55 0.73 Aug-21 -0.22 0.12 -0.33 0.69 -0.91 -0.08 0.19 -0.27 0.77 -0.85 Sep-21 -0.28 -0.65 0.37 -2.11 1.83 0.03 -0.51 0.54 -1.95 1.98 Oct-21 -0.01 -0.04 0.02 0.84 -0.86 0.30 0.12 0.18 1.01 -0.71 Nov-21 0.61 -0.37 0.98 0.80 -0.18 0.94 -0.21 1.15 0.98 -0.03 Dec-21 0.80 -0.18 0.98 7.93 -7.14 1.16 -0.01 1.17 8.12 -6.96 Jan-22 3.00 2.92 0.08 21.19 -18.18 3.66 3.22 0.44 21.54 -17.88 Feb-22 -1.20 -0.93 -0.27 -3.42 2.22 -0.44 -0.58 0.15 -3.01 2.57 Mar-22 -0.90 0.05 -0.95 2.90 -3.80 -0.36 0.31 -0.67 3.20 -3.57 Apr-22 1.75 -2.06 3.81 17.45 -15.70 2.58 -1.69 4.27 17.93 -15.35 May-22 -4.09 -0.57 -3.51 -17.64 13.55 -2.61 0.10 -2.72 -16.82 14.20 Jun-22 -4.79 -4.05 -0.74 -12.17 7.37 -3.28 -3.35 0.07 -11.35 8.07 Jul-22 -1.73 1.00 -2.73 0.07 -1.80 -0.10 1.83 -1.93 0.94 -1.04 Aug-22 -4.88 -3.24 -1.64 -11.41 6.53 -2.96 -2.32 -0.63 -10.36 7.41 Sep-22 -6.48 -5.02 -1.46 -17.41 10.93 -3.57 -3.70 0.14 -15.83 12.26 Oct-22 -5.01 -0.44 -4.56 -12.93 7.92 -2.19 0.95 -3.14 -11.40 9.22 Nov-22 -0.14 2.34 -2.48 5.93 -6.07 2.33 3.55 -1.22 7.28 -4.95 Dec-22 -6.36 -4.25 -2.11 -28.86 22.51 -3.93 -3.11 -0.82 -27.52 23.59 Jan-23 -0.32 2.56 -2.88 12.54 -12.86 2.26 3.89 -1.63 13.95 -11.69 Feb-23 -5.21 -3.57 -1.63 -25.19 19.99 -2.49 -2.17 -0.32 -23.70 21.20 Panel D: By Weekday Mon -0.31 -0.17 -0.14 -1.27 0.96 -0.12 -0.08 -0.04 -1.17 1.05 Tue -0.51 -0.26 -0.26 -2.00 1.49 -0.29 -0.15 -0.14 -1.88 1.59 Wed -0.09 -0.12 0.03 0.22 -0.31 0.15 -0.00 0.16 0.35 -0.20 Thu -0.36 -0.11 -0.24 -0.05 -0.31 -0.17 -0.02 -0.15 0.05 -0.22 Fri -0.26 -0.04 -0.22 0.40 -0.66 -0.00 0.09 -0.09 0.54 -0.55 Panel E: By Hour 9:30 -0.20 -0.09 -0.11 -0.30 0.10 -0.05 -0.02 -0.03 -0.21 0.16 10:00 -0.23 -0.13 -0.10 -0.39 0.16 0.00 -0.02 0.02 -0.26 0.27 11:00 -0.19 -0.12 -0.07 -0.43 0.24 -0.04 -0.05 0.01 -0.35 0.31 12:00 -0.12 -0.10 -0.02 -0.29 0.17 0.00 -0.04 0.04 -0.23 0.23 13:00 -0.29 -0.09 -0.21 -0.36 0.07 -0.17 -0.03 -0.14 -0.29 0.12 14:00 -0.20 -0.02 -0.18 -0.34 0.14 -0.05 0.05 -0.10 -0.26 0.21 15:00 -0.20 -0.11 -0.10 -0.32 0.12 -0.07 -0.04 -0.03 -0.25 0.18 20 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 34,
    "chunk_index": 35,
    "word_count": 566,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "12:00 -0.12 -0.10 -0.02 -0.29 0.17 0.00 -0.04 0.04 -0.23 0.23 13:00 -0.29 -0.09 -0.21 -0.36 0.07 -0.17 -0.03 -0.14 -0.29 0.12 14:00 -0.20 -0.02 -0.18 -0.34 0.14 -0.05 0.05 -0.10 -0.26 0.21 15:00 -0.20 -0.11 -0.10 -0.32 0.12 -0.07 -0.04 -0.03 -0.25 0.18 20 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 34,
    "chunk_index": 36,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "Differences in profits are much more pronounced between buy and sell orders. While long positions in options lose money on average, short positions are profitable even after fees. However, the losses on long positions exceed the gains made from shorting and end consumers are predominantly long (see Figure 2), turning the aggregate retail profits – both net- and gross-of-fees – negative. The profitable profits of the short positions suggest that some retail investors reap the variance risk premium. Selling insurance against (ultra-short-term) variance risks is profitable on average, and our results suggest that some retail investors follow the strategy of providing insurance to other market participants. On average, however, retail investors are more often long than short, such that their aggregate profits are negative. Panel D provides the average profit-and-loss profile for each weekday. On an average Monday, retail investors lost $23,000 between February 2021 and February 2023. Today, these numbers are significantly larger, in line with the pronounced growth in retail 0DTE trading we observe in Section 3. We again find that the trades’ transaction costs are particularly bad for the aggregate profits. Finally, Panel E summarizes the dollar prof- its by trading hour on the 0DTE options’ expiration day. We find considerable losses throughout the trading day for both puts and calls. 4.2. 0DTE Expensiveness and Retail Trade Direction Thepoorperformanceofaggregateretailtradingin0DTEoptionsispotentiallydrivenby aneglectofretailinvestorstotaketheoptions’expensivenessintoaccount. Forameasure of the overall expensiveness of 0DTE options, we compute a VIX from realized trades in 0DTE options within each 10 minute window of a trading day. This pools the information of realized trades and their prices. We interpolate the option prices within and between strike prices of options for which we recorded a trade. For this, we follow Berger, Dew- 21 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 34,
    "chunk_index": 37,
    "word_count": 290,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "options within each 10 minute window of a trading day. This pools the information of realized trades and their prices. We interpolate the option prices within and between strike prices of options for which we recorded a trade. For this, we follow Berger, Dew- 21 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 34,
    "chunk_index": 38,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "80 0DTE 9DTE 30DTE 60 40 20 0 Apr-21 Jul-21 Oct-21 Jan-22 Apr-22 Jul-22 Oct-22 Jan-23 Fig. 6. 5-day moving average of the 0DTE, 9DTE and 30DTE opening VIX level Thefigureshowsthe5daymovingaveragelevelofthe0-day,0-dayand30-dayopeningVIXfromJanuary 2021 unitl February 2023. The 9-day and 30-day opening VIX are provided by the Cboe. The 0-day VIX is calculated by fitting the SVI model of Gatheral (2006) through the reported implied volatilities of all out-the-money 0DTE SPX option trades that occur between 9:30 and 9:40 for each day using the methodology from Zeliade (2012). Becker, and Giglio (2020) and fit the SVI model of Gatheral (2006) through the reported implied volatilities of all out-the-money 0DTE S&P 500 option trades that occur within each 10-minute window using the methodology of Zeliade (2012). The resulting implied volatilities are subsequently reverted into option prices and the ultra-short-term VIX is estimated as: 2erT (cid:88) VIX0DTE = O (K ,T)∆K . (4) t T t i i Ki Accordingly, the VIX0DTE is an intuitive measure for the overall realized expensiveness of 0DTE options, as it is a direct result of traded prices. In Figure 6, we show the time-series of VIX0DTE, measured each day with trades be- tween 9:30 and 9:40. For reference, we overlay the opening 9-day VIX in orange and the opening 30-day VIX in yellow, both taken from the Cboe’s website. For better visibility, we plot 5-day moving averages. As we would expect, we find a downward-sloping term structure. VIX0DTE is larger than the 30-day VIX for most of our sample. Interestingly, we find an inverse effect when comparing the 9-day with the 30-day VIX. The former tends to be at the same level, or even below the latter. At the beginning of 2022 we 22 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 34,
    "chunk_index": 39,
    "word_count": 291,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "larger than the 30-day VIX for most of our sample. Interestingly, we find an inverse effect when comparing the 9-day with the 30-day VIX. The former tends to be at the same level, or even below the latter. At the beginning of 2022 we 22 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 34,
    "chunk_index": 40,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "see a distinct disconnect between the ultra-short-end and the remainder of the VIX term structure. VIX0DTE has increased drastically, whereas both the 9-day and 30-day VIX have remained at their previous levels. Throughout 2022, the level of the VIX0DTE has seen several spikes above 60. Both the 9- and 30-day VIX are reasonably calm for our sample period. Both hover around 20 with occasional spikes to 30. In line with this, the financial press has picked up on the notion of ‘The “broken” VIX, ’.5 The introduction of continuous trading in ultra-short-term options through daily expirations may have con- tributed to a relatively calm 9- and 30-day VIX, with most of the variation in expected volatility now captured by VIX0DTE. We now test whether there is a relation between gains and losses of retail investors in 0DTE options and the options’ overall expensiveness, proxied for by VIX0DTE. We first regress the hold-to-maturity dollar performance of all trades within a 10-minute window on VIX0DTE measured using the same trade information. Table 3 shows that for the full sample, more expensive 0DTE options contributed to the poor performance of the aggregateretailportfolio. AonestandarddeviationincreaseinVIX0DTE resultsin$−1289 largerlossesgross-of-feesand$−2559largerlossesnet-of-fees. Thecoefficientissignificant at the 1%-level only for the net-of-fees profits, suggesting that market makers increase their spreads with a rising VIX0DTE. In fact, we document a significant connection between effective spreads paid and VIX0DTE in Table A2. This validates VIX0DTE as an overall expensiveness measure of retail trades. The second column replicates this analysis for the sample starting on May 16th of 2022, that is since the introduction of a daily expiration schedule for S&P 500 options. From May 2022 onward, the profits and losses of retail trades are unrelated to VIX0DTE, both gross- and net-of-fees. This hints at a learning effect among retail investors in that they tilt their decisions to buy or sell 0DTE options in accordance with the options’ overall 5https://www.ft.com/content/90224106-f6a2-4ca9-b053-77f51a493677. 23 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 34,
    "chunk_index": 41,
    "word_count": 321,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "onward, the profits and losses of retail trades are unrelated to VIX0DTE, both gross- and net-of-fees. This hints at a learning effect among retail investors in that they tilt their decisions to buy or sell 0DTE options in accordance with the options’ overall 5https://www.ft.com/content/90224106-f6a2-4ca9-b053-77f51a493677. 23 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 34,
    "chunk_index": 42,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "Table 3: 0DTE SLIM net and gross profits and option expensiveness The table depicts regressions of the net and gross profits as in equation 3 in 0DTE SLIM options on the standardized 0DTE VIX (VIX0DTE) at a 10 minute frequency from 9:30 until 15:50. The time series t covers the full sample from February 2021 until February 2023 and the period of continuous offering of 0DTE options from May 16, 2022 until February 2023. The t-statistics are given in parenthesis below and are calculated using Newey-West standard errors with optimal lag length. Full Sample From May 16th, 2022 ProfitsNet ProfitsGross ProfitsNet ProfitsGross t t t t α -7138.3 -3732.2 -12486.1 -6929.9 (-9.36) (-4.97) (-8.97) (-5.01) VIX0DTE -2559.3 -1288.7 -46.6 8.3 t (-3.02) (-1.55) (-0.03) (0.01) adj. R2 (%) 0.17 0.04 -0.01 -0.01 expensiveness. We investigate this learning pattern in more detail: do retail investors change their decision to buy or sell 0DTE options in line with the options’ expensiveness? For this, we regress the aggregate retail order imbalance on VIX0DTE. We define retailers’ order imbalance as: (cid:80) BuySLIM ×|∆Buy|− (cid:80) SellSLIM ×|∆Sell| ∆ OrdImbSLIM = t t t t t t (5) t (cid:80) Volume ×|∆ | t t t The results are provided in Table 4. For the full sample, we find additional buying pressure by retail investors whenever VIX0DTE is high. A one standard deviation increase inVIX0DTE leadsto10.22%greaterbuyingactivitybyretailinvestors. Theeffectishighly significant. In other words, retail investors buy 0DTE options whenever it is particulary expensivetodoso. FromMay16thof2022onward, however, thisrelationshipreverses. A larger VIX0DTE is related to additional selling pressure by retail investors, consistent with retail investors reaping the short-term variance risk premium whenever 0DTE options are particularly expensive (Goyal and Saretto, 2009). A one standard deviation increase in VIX0DTE is associated with 4.61% greater selling activity. 24 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 34,
    "chunk_index": 43,
    "word_count": 300,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "VIX0DTE is related to additional selling pressure by retail investors, consistent with retail investors reaping the short-term variance risk premium whenever 0DTE options are particularly expensive (Goyal and Saretto, 2009). A one standard deviation increase in VIX0DTE is associated with 4.61% greater selling activity. 24 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 34,
    "chunk_index": 44,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "Table 4: 0DTE SLIM order imbalance and option expensiveness The table depicts regressions of the standardized ∆-weighted and unweighted order imbalance as in equation5in0DTESLIMoptionsonthestandardized0DTEVIX(VIX0DTE)ata10minutefrequency t from 9:30 until 15:50. The time series covers the full sample from February 2021 until February 2023 and the period of continuous offering of 0DTE options from May 16, 2022 until February 2023. The t-statistics are given in parenthesis below and are calculated using Newey-West standard errors with optimal lag length. Full Sample From May 16th, 2022 ∆OrdImbSLIM OrdImbSLIM ∆OrdImbSLIM OrdImbSLIM t t t t α -0.0078 -0.0210 -0.0001 -0.0136 (-0.63) (-1.59) (-0.01) (-0.82) VIX0DTE 0.1022 0.1093 -0.0461 -0.0354 t (9.28) (9.53) (-3.64) (-2.51) adj. R2 (%) 1.3618 1.6952 0.2517 0.1502 In Table 5 we show further evidence that retail investors consider the overall expen- siveness of 0DTE in their investment decisions. For this, we regress the holding period returnsofretailtradeswithineach10-minutewindowonthesameperiod’sVIX0DTE. The holding period return is a trade’s dollar performance scaled by its initial investment, i.e., the trade price the retail investor had to pay initially. For the entire sample, we find that retail sell orders are particularly profitable in a high VIX0DTE environment. A one stan- dard deviation of the latter increases holding period returns of short positions by 4.96%. In contrast, we find a positive but insignificant relationship for buy orders. The results in Table 5 are in line with a negative variance risk premium. Entering a long position in 0DTE options, exposes the investor to a long position in ultra-short-term variance, i.e., the investor is hedged against increases in the variance of the underlying. Following this logic, the average long position of retail investors loses −53% of its value across the full sample and −61% for the sample since May 2022. Selling insurance, in contrast, earns a large premium for the average trade with returns of 48% and 56%, respectively. The dependence on the VIX0DTE confirms the intuition that the variance risk premium scales with the level of volatility, such that it is larger in absolute terms for a larger level of VIX0DTE. 25 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 34,
    "chunk_index": 45,
    "word_count": 346,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "for the average trade with returns of 48% and 56%, respectively. The dependence on the VIX0DTE confirms the intuition that the variance risk premium scales with the level of volatility, such that it is larger in absolute terms for a larger level of VIX0DTE. 25 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 34,
    "chunk_index": 46,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "Table 5: 0DTE SLIM returns and option expensiveness The table depicts regressions of the log returns of 0DTE SLIM options on the standardized 0DTE VIX (VIX0DTE) at a 10-minute frequency from 9:30 until 15:50. Trades are classified as buy and sell t according to the quote rule following Muravyev (2016). The returns for trades classified as buy (sell) aredefinedastheaggregate$-payoff($-premium)receivedscaledbytheaggregate$-premium($-payoff) paid the for each 10-minute window. The time series covers the full sample from February 2021 until February 2023 and the period of continuous offering of 0DTE options from May 16, 2022 until February 2023. The t-statistics are given in parenthesis below and are calculated using Newey-West standard errors with optimal lag length. Full Sample From May 16th, 2022 ReturnBuy ReturnSell ReturnBuy ReturnSell t t t t α -0.5356 0.4882 -0.6119 0.5652 (-21.65) (20.22) (-19.42) (18.36) VIX0DTE -0.0310 0.0496 -0.0608 0.0949 t (-1.24) (1.97) (-1.85) (2.83) adj. R2 (%) 0.0690 0.1959 0.3183 0.8100 The second column of Table 5 again restricts the sample period to the introduction of daily expirations in May of 2022. We again find a significantly positive impact of expensiveness on the holding period return of short positions. A one standard deviation increase of VIX0DTE leads to 9.49% larger returns on sold positions. For buy orders we again find a negative impact of −6.08%, this time marginally significant with a t-statistic of −1.85. Table 2 has shown that profits of sell orders tend to be positive. Especially at times of high 0DTE expensiveness do these retail orders perform well. Their overall performance, however, is overshadowed by poor buying choices and hefty fees paid on each trade. 5. Conclusion Retailtradersexhibitastrongpreferenceforhigh-risk,lottery-likeassets(Balietal.,2011; Bali, Brown, Murray, and Tang, 2017) and have found the perfect investment vehicle in 0DTE options, i.e., options that expire within the same day. Reddit and other websites 26 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 34,
    "chunk_index": 47,
    "word_count": 305,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "is overshadowed by poor buying choices and hefty fees paid on each trade. 5. Conclusion Retailtradersexhibitastrongpreferenceforhigh-risk,lottery-likeassets(Balietal.,2011; Bali, Brown, Murray, and Tang, 2017) and have found the perfect investment vehicle in 0DTE options, i.e., options that expire within the same day. Reddit and other websites 26 Electronic copy available at: https://ssrn.com/abstract=4404704 promote 0DTE options as a guaranteed method for generating quick profits. This paper provides evidence that 0DTE options are not a lucrative investment vehicle for retail traders. Since the introduction of daily expirations, retail investors incurred significant losses, amounting to $358,000 per day, on their investments in 0DTE S&P 500 options. While their profits are already negative gross of transaction fees, we show that retail investors on average have learned to make informed buying and selling decisions that align with the overall level of expensiveness in the 0DTE market. Yet, they neglect to considerthesubstantialspreads, whichfurtherdepresstheirprofits. Ourfindingsindicate that more than 60% of the $358,000 lost each day comes in the form of transaction costs. The recent surge in retail options trading has been facilitated by exchange-related developments advocated by the Cboe and affiliated special interest groups. Although we find that the Cboe’s proposals have led to lower effective spreads, the associated benefits for retail investors do not sufficiently offset the increased risk inherent in the positions favored by such investors and the general fee structure of the options market. Our study is a cautionary tale against allowing unrestricted access for retail investors to 0DTE options. Their hunger for lottery-like assets leads to large aggregate losses. Should daily expirations be rolled out for single equity options, the potential losses retail investors face are amplified manifold. 27 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 34,
    "chunk_index": 48,
    "word_count": 279,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "study is a cautionary tale against allowing unrestricted access for retail investors to 0DTE options. Their hunger for lottery-like assets leads to large aggregate losses. Should daily expirations be rolled out for single equity options, the potential losses retail investors face are amplified manifold. 27 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "1. Introduction",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 34,
    "chunk_index": 49,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "Bali,T.G.,Brown,S.J.,Murray,S.,Tang,Y.,2017.Alottery-demand-basedexplanation of the beta anomaly. Journal of Financial and Quantitative Analysis 52, 2369–2397. Bali, T. G., Cakici, N., Whitelaw, R. F., 2011. Maxing out: Stocks as lotteries and the cross-section of expected returns. Journal of financial economics 99, 427–446. Barber, B. M., Lin, S., Odean, T., 2022. Resolving a paradox: Retail trades positively predict returns but are not profitable. Available at SSRN 3783492 . Barber, B. M., Odean, T., 2000. Trading is hazardous to your wealth: The common stock investment performance of individual investors. The journal of Finance 55, 773–806. Barber, B. M., Odean, T., 2008. All that glitters: The effect of attention and news on the buying behavior of individual and institutional investors. The review of financial studies 21, 785–818. Barbon, A., Beckmeyer, H., Buraschi, A., Moerke, M., 2022. Liquidity provision to lever- aged etfs and equity options rebalancing flows . Bauer, R., Cosemans, M., Eichholtz, P., 2009. Option trading and individual investor performance. Journal of Banking & Finance 33, 731–746. Berger, D., Dew-Becker, I., Giglio, S., 2020. Uncertainty shocks as second-moment news shocks. The Review of Economic Studies 87, 40–76. Blau, B. M., Bowles, T. B., Whitby, R. J., 2016. Gambling preferences, options markets, and volatility. Journal of Financial and Quantitative Analysis 51, 515–540. Boehmer, E., Jones, C. M., Zhang, X., Zhang, X., 2021. Tracking retail investor activity. The Journal of Finance 76, 2249–2305. 28 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "References",
    "page_number": 29,
    "page_range": "p.29-30",
    "total_pages": 34,
    "chunk_index": 50,
    "word_count": 232,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.29-30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "Blau, B. M., Bowles, T. B., Whitby, R. J., 2016. Gambling preferences, options markets, and volatility. Journal of Financial and Quantitative Analysis 51, 515–540. Boehmer, E., Jones, C. M., Zhang, X., Zhang, X., 2021. Tracking retail investor activity. The Journal of Finance 76, 2249–2305. 28 Electronic copy available at: https://ssrn.com/abstract=4404704 Boehmer, E., Song, W., 2020. Smart retail traders, short sellers, and stock returns. Short Sellers, and Stock Returns (October 23, 2020) . Boyer, B. H., Vorkink, K., 2014. Stock options as lotteries. The Journal of Finance 69, 1485–1527. Bryzgalova, S., Pavlova, A., Sikorskaya, T., 2023. Retail trading in options and the rise of the big three wholesalers. Journal of Finance forthcoming. Byun, S.-J., Kim, D.-H., 2016. Gambling preference and individual equity option returns. Journal of Financial Economics 122, 155–174. Campbell, J. Y., Jackson, H. E., Madrian, B. C., Tufano, P., 2011. Consumer financial protection. Journal of Economic Perspectives 25, 91–114. Eaton, G. W., Green, T. C., Roseman, B., Wu, Y., 2022a. Retail option traders and the implied volatility surface. Available at SSRN 4104788 . Eaton, G. W., Green, T. C., Roseman, B. S., Wu, Y., 2022b. Retail trader sophistica- tion and stock market quality: Evidence from brokerage outages. Journal of Financial Economics 146, 502–528. Ernst, T., Spatt, C.S., 2022.Paymentfororderflowandassetchoice.Tech.rep., National Bureau of Economic Research. Filippou, I., Garcia-Ares, P. A., Zapatero, F., 2018. Demand for lotteries: The choice between stocks and options. Available at SSRN 3016462 . Gatheral, J., 2006. The volatility surface: A Practitioner’s Guide. John Wiley & Sons. Gayda, L., Gru¨nthaler, T., Harren, J., 2022. Option liquidity and gamma imbalances. Available at SSRN 4138512 . 29 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "References",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 34,
    "chunk_index": 51,
    "word_count": 272,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "Demand for lotteries: The choice between stocks and options. Available at SSRN 3016462 . Gatheral, J., 2006. The volatility surface: A Practitioner’s Guide. John Wiley & Sons. Gayda, L., Gru¨nthaler, T., Harren, J., 2022. Option liquidity and gamma imbalances. Available at SSRN 4138512 . 29 Electronic copy available at: https://ssrn.com/abstract=4404704 Goyal, A., Saretto, A., 2009. Cross-section of option returns and volatility. Journal of Financial Economics 94, 310–326. Hendershott, T., Khan, S., Riordan, R., 2022. Option auctions. Available at SSRN 4110516 . Lakonishok, J., Lee, I., Pearson, N. D., Poteshman, A. M., 2007. Option market activity. The Review of Financial Studies 20, 813–857. Lipson, M.L., Tomio, D., Zhang, J., 2023.Arealcostoffreetrades: Retailoptiontrading increases the volatility of underlying securities. Available at SSRN 4383463 . Muravyev, D., 2016. Order flow and expected option returns. The Journal of Finance 71, 673–708. Ni, S. X., Pearson, N. D., Poteshman, A. M., White, J., 2021. Does option trading have a pervasive impact on underlying stock prices? The Review of Financial Studies 34, 1952–1986. Vokata, P., 2021. Engineering lemons. Journal of Financial Economics 142, 737–755. Welch, I., 2022. The wisdom of the robinhood crowd. The Journal of Finance 77, 1489– 1527. Zeliade, S., 2012. Quasi-explicit calibration of gatheral’s svi model. Technical Report . 30 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "References",
    "page_number": 31,
    "page_range": "p.31-32",
    "total_pages": 34,
    "chunk_index": 52,
    "word_count": 211,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.31-32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "of Financial Studies 34, 1952–1986. Vokata, P., 2021. Engineering lemons. Journal of Financial Economics 142, 737–755. Welch, I., 2022. The wisdom of the robinhood crowd. The Journal of Finance 77, 1489– 1527. Zeliade, S., 2012. Quasi-explicit calibration of gatheral’s svi model. Technical Report . 30 Electronic copy available at: https://ssrn.com/abstract=4404704 Appendix A. Additional Summary Statistics Table A1: SLIM vs. Non-SLIM Trading in non-0DTE Options ThetableshowsthedailyaveragecharacteristicsofSLIMandnon-SLIMnon-0DTEtrades. Thesample coverstheperiodfromFebruary2021untilFebruary2023. Thequotedandeffectivespreadsaremeasured asin2. Tradesareclassifiedasbuy, sellandmidaccordingtothequoterulefollowingMuravyev(2016). The moneyness is defined as the log-moneyness at the time of the trade. Non-0DTE SLIM Non-0DTE Non-SLIM Characteristic Category Freq. (%) Volume(%) QS(%) ES(%) Freq. (%) Volume(%) QS(%) ES(%) Type Call 48.7 48.1 5.0 2.8 42.9 37.1 7.5 2.4 Put 51.3 51.9 4.8 2.4 57.1 62.9 6.1 2.2 Size 1 76.6 51.9 4.6 2.5 45.4 6.2 6.0 2.0 2-5 21.8 40.3 5.5 2.6 31.5 13.0 6.5 2.1 6-10 1.6 7.8 7.0 2.7 10.8 12.1 8.0 2.4 11-100 0.0 0.0 0.0 0.0 11.4 49.8 7.9 3.5 Above100 0.0 0.0 0.0 0.0 0.9 18.8 12.5 6.6 Direction Buy 42.2 41.3 4.5 3.1 37.7 40.7 5.9 3.2 Sell 40.6 40.0 4.6 3.1 41.8 43.4 6.3 2.6 Mid 17.2 18.8 6.1 0.0 20.5 16.0 8.7 0.0 Direction: Call Buy 20.6 20.0 4.9 3.4 16.1 14.9 6.7 3.6 Sell 19.7 19.2 4.9 3.3 18.2 16.5 7.0 2.6 Mid 8.4 8.9 5.6 0.0 8.6 5.7 9.8 0.0 Direction: Put Buy 21.6 21.3 4.2 2.9 21.6 25.8 5.4 2.9 Sell 20.9 20.8 4.5 2.9 23.6 26.9 5.8 2.6 Mid 8.9 9.8 6.7 0.0 11.8 10.3 7.9 0.0 TTM Below3days 54.6 54.4 6.3 3.4 34.6 25.9 10.3 3.9 3-10days 30.8 30.9 4.8 2.4 28.8 24.9 7.1 2.3 Above10days 14.6 14.8 4.3 1.8 36.6 49.2 3.6 1.1 Moneyness: Call Below-2% 0.3 0.3 1.6 0.2 1.6 0.9 1.4 0.2 -0.5%to-2% 1.4 1.4 1.4 0.4 2.5 1.8 1.3 0.3 AtTheMoney 20.8 20.9 1.7 0.8 9.7 7.9 1.6 0.6 0.5%to2% 15.9 15.4 4.8 2.7 13.8 10.5 5.3 1.6 Above2% 10.2 10.1 14.7 8.4 15.4 15.9 15.4 5.1 Moneyness: Put Below-2% 16.6 16.7 10.4 5.4 31.7 42.8 8.9 3.3 -0.5%to-2% 14.5 14.4 3.1 1.6 12.7 9.6 3.1 0.9 AtTheMoney 18.6 19.1 1.7 0.7 9.0 7.5 1.6 0.6 0.5%to2% 1.2 1.3 1.8 0.4 2.2 1.8 1.7 0.3 Above2% 0.4 0.4 2.1 0.3 1.5 1.2 1.7 0.2 31 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "References",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 34,
    "chunk_index": 53,
    "word_count": 379,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "16.6 16.7 10.4 5.4 31.7 42.8 8.9 3.3 -0.5%to-2% 14.5 14.4 3.1 1.6 12.7 9.6 3.1 0.9 AtTheMoney 18.6 19.1 1.7 0.7 9.0 7.5 1.6 0.6 0.5%to2% 1.2 1.3 1.8 0.4 2.2 1.8 1.7 0.3 Above2% 0.4 0.4 2.1 0.3 1.5 1.2 1.7 0.2 31 Electronic copy available at: https://ssrn.com/abstract=4404704 Table A2: 0DTE SLIM effective dollar spreads and option expensiveness The table depicts regressions of the effective dollar spreads of 0DTE SLIM options on the standardized 0DTE VIX (VIX0DTE) at a 10-minute frequency from 9:30 until 15:50. The effective dollar spread is t definedastheabsolutedifferencebetweenthetradepriceandmidpricemultipliedby2. Thetimeseries covers the full sample from February 2021 until February 2023 and the period of continuous offering of 0DTE options from May 16, 2022 until February 2023. The t-statistics are given in parenthesis below and are calculated using Newey-West standard errors with optimal lag length. Full Sample From May 16th, 2022 α 0.0526 0.0509 (250.03) (360.07) VIX0DTE 0.0068 0.0043 t (28.61) (18.84) adj. R2 (%) 27.1331 33.9112 32 Electronic copy available at: https://ssrn.com/abstract=4404704 Table A3: Total transaction costs paid and option expensiveness The table depicts regressions of the total transaction costs of 0DTE SLIM options on the standardized 0DTE VIX (VIX0DTE) at a 10-minute frequency from 9:30 until 15:50. The total transaction costs are t defined as the aggregated difference between the trade price and the mid price within each 10-minute window. The time series covers the full sample from February 2021 until February 2023 and the period ofcontinuousofferingof0DTEoptionsfromMay16,2022untilFebruary2023. Thet-statisticsaregiven in parenthesis below and are calculated using Newey-West standard errors with optimal lag length. Full Sample From May 16th, 2022 α 3393.2076 5529.2418 (53.48) (71.92) VIX0DTE 1118.5731 221.8065 t (18.28) (2.89) adj. R2 (%) 13.5419 0.5138 33 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "References",
    "page_number": 33,
    "page_range": "p.33-34",
    "total_pages": 34,
    "chunk_index": 54,
    "word_count": 286,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.33-34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  },
  {
    "text": "until February 2023 and the period ofcontinuousofferingof0DTEoptionsfromMay16,2022untilFebruary2023. Thet-statisticsaregiven in parenthesis below and are calculated using Newey-West standard errors with optimal lag length. Full Sample From May 16th, 2022 α 3393.2076 5529.2418 (53.48) (71.92) VIX0DTE 1118.5731 221.8065 t (18.28) (2.89) adj. R2 (%) 13.5419 0.5138 33 Electronic copy available at: https://ssrn.com/abstract=4404704",
    "title": "Retail Traders Love 0DTE Options... But Should They",
    "source_type": "pdf",
    "document_id": "ffb6e43fc04f",
    "source_file": "Retail Traders Love 0DTE Options... But Should They.pdf",
    "section": "References",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 34,
    "chunk_index": 55,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230330085131Z",
    "duration": null
  }
]