[
  {
    "text": "Sentiment and the Effectiveness of Technical Analysis: Evidence from the Hedge Fund Industry* David M. Smith Na Wang Ying Wang Edward J. Zychowicz May 24, 2014 ABSTRACT This paper presents a unique test of the effectiveness of technical analysis in different sentiment environments by focusing on its usage by the most sophisticated and astute investors, hedge fund managers. We document that during high-sentiment periods, hedge funds using technical analysis exhibit higher returns, lower risk, and superior market-timing ability than those non- users. The advantages for hedge funds of using technical analysis disappear in low-sentiment periods. These findings are consistent with the view that technical analysis performs relatively better in high-sentiment periods with larger mispricing, which cannot be fully exploited by arbitrage activities due to short-sale impediments. Key words: Hedge funds, technical analysis, investor sentiment, fund performance, risk, timing ability JEL classification: G12, G14, G23 * We are grateful to Jianfeng Yu for his helpful comments and suggestions. D. M. Smith is at State University of New York at Albany; email: dsmith@albany.edu. N. Wang is at Hofstra University; email: Na.Wang@hofstra.edu. Y. Wang is at State University of New York at Albany; email: ywang@albany.edu. E. J. Zychowicz is at Hofstra University; email: Edward.J.Zychowicz@hofstra.edu.",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 43,
    "chunk_index": 0,
    "word_count": 201,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "for his helpful comments and suggestions. D. M. Smith is at State University of New York at Albany; email: dsmith@albany.edu. N. Wang is at Hofstra University; email: Na.Wang@hofstra.edu. Y. Wang is at State University of New York at Albany; email: ywang@albany.edu. E. J. Zychowicz is at Hofstra University; email: Edward.J.Zychowicz@hofstra.edu.",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 43,
    "chunk_index": 1,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "The value of technical analysis has been a subject of debate for decades. On the one hand, the efficient markets hypothesis states that asset prices reflect all relevant publicly available information (Fama (1965)). Conceptually, if the market is efficient and asset prices are aligned with fundamental intrinsic values, technical analysis, which relies heavily on the availability of historical data, would have limited power to predict future price movements. However, a growing body of literature contends that investor sentiment could drive asset mispricing (Baker and Wurgler (2006) and Shleifer and Summers (1990)). In such sentiment environments where prices are decoupled from intrinsic values, technical analysis focusing on price patterns and trading volume may present a more effective mode of analysis for investors and traders. In a similar vein, Han, Yang, and Zhou (2013) argue that there may be a heavier reliance on technical analysis when fundamental information such as earnings and economic outlook are less precise. Importantly, the extant literature suggests that the sentiment-induced mispricing may not be symmetrical in high and low sentiment environments due to short-sale constraints (Stambaugh, Yu, and Yuan (2012) and Shen and Yu (2013)). The significance of short-sale constraints traces back to Miller (1977), who argues that the impediments to short-selling such as arbitrage risk, trading costs, behavioral biases of traders, and institutional constraints play a significant role in limiting arbitrage by rational investors. During high sentiment periods, the optimistic views of not-fully-rational investors tend to drive security overpricing, and rational investors cannot eliminate this overpricing due to the impediments to short selling. In contrast, during periods of low sentiment, the passive views of the not-fully-rational investors may not be reflected as security underpricing, since rational investors can fully counter these passive views by holding long positions of securities. As a result, high-sentiment-driven overpricing is more 1",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 43,
    "chunk_index": 2,
    "word_count": 301,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "to the impediments to short selling. In contrast, during periods of low sentiment, the passive views of the not-fully-rational investors may not be reflected as security underpricing, since rational investors can fully counter these passive views by holding long positions of securities. As a result, high-sentiment-driven overpricing is more 1",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 43,
    "chunk_index": 3,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "prevalent than low-sentiment-driven underpricing and the market tends to be less efficient in high sentiment periods than in low sentiment periods. Thus, we would expect technical analysis to be a more effective investment tool during high sentiment periods when market mispricing is most acute. These arguments sound intuitively appealing, however, it is challenging to conduct a convincing empirical test of the effectiveness of technical analysis, since the technical rules and approaches are essentially limitless in number, and practitioners tend to use many of these tools in combination. Despite the accumulating evidence on the forecasting potential of technical analysis techniques,1 there is less consensus as to whether these technical approaches can generate superior performance after accounting for transaction costs and risk (see Park and Irwin (2007) for an extensive survey of the profitability of technical trading strategies). In our paper, we recognize the challenges and shortcomings of testing individual or a particular set of technical rules. Instead, we utilize a sample of hedge funds that are self-reported technical analysis users/nonusers as a unique setting, and provide evidence of the relative effectiveness of technical analysis, however applied in the hands of sophisticated hedge fund managers, during different sentiment periods. This is potentially important from at least two perspectives. First, it is an indirect, but realistic way to test for the usefulness of technical analysis while circumventing the need to examine specific rules in isolation. As noted by Zhu and Zhou (2009), the field of technical analysis has no unifying and general theory. Rather, it is the study of market action utilizing the somewhat subjective interpretation of price charts or the more objective quantitative analysis of historical price and volume indicators. The possible number and combinations of indicators comprising a trading or investment system are virtually 1 See, for example, Brock, Lakonishok, and LeBaron (1992), Neely, Weller, and Dittmar (1997), Lo, Mamaysky, and Wang (2000), Kavajecz and Odders-White (2004), and Menkhoff and Taylor (2007). 2",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 43,
    "chunk_index": 4,
    "word_count": 322,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "of historical price and volume indicators. The possible number and combinations of indicators comprising a trading or investment system are virtually 1 See, for example, Brock, Lakonishok, and LeBaron (1992), Neely, Weller, and Dittmar (1997), Lo, Mamaysky, and Wang (2000), Kavajecz and Odders-White (2004), and Menkhoff and Taylor (2007). 2",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 43,
    "chunk_index": 5,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "unlimited and often proprietary to hedge funds. Second, our investigation contributes to the existing research devoted to testing the efficacy of technical analysis, by focusing on its use by perhaps the most elite, highly skilled, motivated, and rational group of investors. Therefore, our paper is unique in that, unlike existing research that considers tests of individual technical techniques, our study proposes that if there is a non-naïve class of technical analysis users that can effectively navigate the complexities involved in profitably applying technical approaches, it would be hedge funds. Our paper aims to test the relative efficacy of technical analysis by comparing the performance, risk, and timing abilities of hedge funds using technical analysis relative to those non-users in different sentiment periods. It is especially important to examine whether technical analysis is an effective tool for managing risk in addition to improving performance, since technical analysis approaches have the potential to identify periods that warrant the implementation of hedges. It is also important to investigate the issue of timing, because timing has been identified as one of the sources of alpha and hedge funds are uniquely designed to take full advantage of this source of alpha (see for example Chen (2007), Chen and Liang (2007), and Lo (2008)). Our testable hypothesis is that technical analysis users have higher performance, lower risk, and better timing abilities than nonusers in high sentiment periods when sentiment- induced overpricing is substantial and the market is less efficient. In contrast, performance of technical analysis users and nonusers may not differ in low sentiment periods when the market is more efficient and the benefit of using technical analysis is limited. Using data from the Lipper TASS hedge fund database over the period of 1994-2010, we find evidence supportive of our hypothesis. First, we find that in our sample, the hedge fund users of technical analysis on average have significantly higher returns in high sentiment 3",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 43,
    "chunk_index": 6,
    "word_count": 319,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "using technical analysis is limited. Using data from the Lipper TASS hedge fund database over the period of 1994-2010, we find evidence supportive of our hypothesis. First, we find that in our sample, the hedge fund users of technical analysis on average have significantly higher returns in high sentiment 3",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 43,
    "chunk_index": 7,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "environments compared to nonusers. This differential performance is robust to the application of four- and seven-factor models. However, and as expected, in low sentiment periods, with more accurate prices, hedge fund use of technical analysis is found to be less valuable and even counterproductive. Second, the use of technical analysis by hedge funds is associated with lower fund risk, and the benefits are more prominent in high sentiment periods. Finally, in comparison to nonusers, hedge funds using technical analysis in general exhibit better market timing ability only during high market sentiment periods but not during low sentiment periods. These results are robust even after controlling for fund characteristics and various fixed effects. They are also robust to a subperiod analysis, the use of pre-fee returns, rolling sentiments, and the sentiment level, and the exclusion of non-equity-focused hedge funds. Interestingly, we find that hedge funds that report using fundamental analysis tend to underperform in high sentiment periods, further supporting our arguments that technical analysis is more useful in less efficient market environments when fundamental analysis is comparatively ineffective (Han, et al. (2013)). The proposition that the effectiveness of technical analysis depends on the market environment has precedence in the literature. For example, Han, et al. (2013) suggest that in market environments where the precision of fundamental information becomes less reliable, the incentive to use technical approaches may increase and the usefulness of technical analysis would be greater. Moreover, Antoniou, Doukas, and Subrahmanyam (2013) report that a six- month momentum strategy is profitable when sentiment is high, whereas momentum profits are substantially less during periods of low sentiment. We take a different approach and examine the efficacy of technical analysis as a general investment tool in the hands of hedge fund managers, and we document the relative advantages of using technical analysis during high sentiment 4",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 43,
    "chunk_index": 8,
    "word_count": 304,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "high, whereas momentum profits are substantially less during periods of low sentiment. We take a different approach and examine the efficacy of technical analysis as a general investment tool in the hands of hedge fund managers, and we document the relative advantages of using technical analysis during high sentiment 4",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 43,
    "chunk_index": 9,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "periods in terms of superior performance as well as better risk controlling and market timing ability. Our paper makes several contributions. Despite considerable academic evidence that specific technical analysis strategies often underperform buy-and-hold investing, technical analysis is employed by one in five hedge funds industry-wide. We provide supporting evidence for the rationale of the sophisticated managers that with great flexibility in their investment approaches, they would use the approach only if they consider it to have high value added. More importantly, we document that the efficacy of technical analysis is related to the prevailing sentiment in the market. Therefore, our paper is part of the growing literature on the asymmetric sentiment effect which has been used to explain many asset price behaviors and anomalies.2 Furthermore, it offers insights for the potential performance enhancement of market investors and traders by integrating technical analysis into their decision making process during high sentiment periods. To the best of our knowledge, our article is the first to combine the strands of literature concerning hedge fund investment, technical analysis, and market sentiment. Our evidence supports the idea that technical analysis in the form it is practiced by hedge fund managers has significant benefits, but investor sentiment, which can be estimated a priori, appears to be an important catalyst. The remainder of the paper is organized as follows. Section 2 presents the data on hedge funds and investor sentiment. Section 3 discusses the measures of hedge fund performance, risk, and timing abilities. Section 4 provides empirical results, and Section 5 concludes the paper. 2 See, for example, the mean-variance relation (Yu and Yuan (2011)), the idiosyncratic volatility puzzle (Stambaugh, Yu, and Yuan (2013)), the momentum phenomenon (Antoniou, et al. (2013)), and the forward premium puzzle (Yu (2013)). 5",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 43,
    "chunk_index": 10,
    "word_count": 292,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "risk, and timing abilities. Section 4 provides empirical results, and Section 5 concludes the paper. 2 See, for example, the mean-variance relation (Yu and Yuan (2011)), the idiosyncratic volatility puzzle (Stambaugh, Yu, and Yuan (2013)), the momentum phenomenon (Antoniou, et al. (2013)), and the forward premium puzzle (Yu (2013)). 5",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 43,
    "chunk_index": 11,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "2. Data 2.1 Hedge Funds Our hedge fund data come from the Lipper TASS database, one of the most comprehensive hedge fund databases used in the literature.3 To mitigate survivorship bias, we include both live and graveyard funds with net monthly returns denominated in U.S. dollars.4 Our sample period starts in January 1994 when TASS started to collect information on graveyard hedge funds, and ends in December 2010 when our sentiment data end. To alleviate backfill and incubation biases, we delete return observations of a fund occurring prior to the date it was added to the database (Aggarwal and Jorion (2010)). We also require a fund to have at least 24 monthly returns during the whole sample period and at least 12 monthly returns during each sentiment period to be included in the analysis. Finally, we delete the “undefined” type of funds and keep funds with the following primary investment strategies: Convertible Arbitrage, Dedicated Short Bias, Emerging Markets, Equity Market Neutral, Event Driven, Fixed Income Arbitrage, Fund of Funds, Global Macro, Long/Short Equity, Managed Futures, and Multi-Strategy. Our final sample contains 5,135 hedge funds, of which 3,290 are live and 1,845 are graveyard. TASS provides information on whether each fund uses technical analysis. Panel A of Table 1 reports summary statistics on the use of technical analysis for the entire sample as well as live and graveyard funds. Overall, 19.1% of hedge funds use technical analysis. Among the live funds, 21.6% are users of technical analysis, in contrast to only 14.6% of graveyard funds, indicating that hedge funds using technical analysis might be less likely to fail. 3 See, for example, Fung and Hsieh (1997), Liang (2000), Brown, Goetzmann, and Park (2001), Getmansky, Lo, and Makarov (2004), Agarwal, Daniel, and Naik (2009), and Chen (2011). 4 Aggarwal and Jorion (2010) show that it is sufficient to eliminate most situations of the same fund appearing multiple times in the database by removing funds with returns reported in currencies other than US dollars 6",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 43,
    "chunk_index": 12,
    "word_count": 332,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "Getmansky, Lo, and Makarov (2004), Agarwal, Daniel, and Naik (2009), and Chen (2011). 4 Aggarwal and Jorion (2010) show that it is sufficient to eliminate most situations of the same fund appearing multiple times in the database by removing funds with returns reported in currencies other than US dollars 6",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 43,
    "chunk_index": 13,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "It is worth noting that the data on technical analysis use from TASS are “snapshot” information as of December 2010. This raises a concern that our analysis might be subject to a look-ahead bias because the use of technical analysis by hedge funds might vary over time. Following Chen (2011), we carefully address this concern in Section 4.5.1 with robust subperiod analysis, and show that only 1.3% of funds in the sample change the technical analysis indicator from 2002 to 2010. Therefore, the lack of historical information on technical analysis use should not pose a serious issue for our analysis, if any. Panel B of Table 1 reports summary statistics of various hedge fund characteristics. As of December 2010, the average fund age is 7.6 years. The average (median) fund size is $155.5 ($42.7) million, and the median hedge fund requires a minimum investment of $0.5 million. Lockup restrictions are imposed on investors by 26.4% of the funds in our sample, with an average length of 0.28 years (3.4 months). The average redemption notice period is 40 days (1.3 months). On average hedge funds charge an annual management fee of 1.5% of total assets and an incentive fee of 15.7% of fund profits. Finally, roughly two-thirds of the sample funds have a high water mark or use derivatives, 58% employ leverage, and 89% use effective auditing.5 To examine the relation between the use of technical analysis and fund characteristics, we estimate a logistic regression with controls for style fixed effects. The un-tabulated results show that age is positively related to technical analysis use, suggesting that seasoned managers have higher reputation costs and thus have more incentives to manage risk (Brown, et al. (2001)), or alternatively, that technical analysis users are less likely to fail. We also find that incentive fee, derivatives use, and leverage have significant positive effects on the use of technical analysis. In particular, hedge funds charging 1% incentive fees have a 0.28% higher probability of using 5 Liang (2003) shows that hedge-fund data quality in TASS depends heavily on audit timeliness and the identity of the auditor. Following Liang (2003), we define effective auditing to be one if an auditing record exists in the database, and zero otherwise. 7",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 43,
    "chunk_index": 14,
    "word_count": 372,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "have a 0.28% higher probability of using 5 Liang (2003) shows that hedge-fund data quality in TASS depends heavily on audit timeliness and the identity of the auditor. Following Liang (2003), we define effective auditing to be one if an auditing record exists in the database, and zero otherwise. 7",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 43,
    "chunk_index": 15,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "technical analysis compared to funds charging no incentive fee; derivatives (leverage) users have an 8.1% (5.8%) higher probability of using technical analysis than those non-users. Finally, we find that redemption notice period, high watermark, and minimum investment are significantly negatively related to the use of technical analysis. Compared to funds with no redemption notice period, funds requiring a one-month redemption notice period have a 3.5% lower chance of using technical analysis. Hedge funds with a high water mark have a 3% lower probability of using technical analysis. 2.2 Investor Sentiment Baker and Wurgler (2006) note that a high sentiment period is often characterized by an increase in investor demand for speculative investments, accompanied by a shortening of the average investor’s time horizon. We use a monthly market-based sentiment measure constructed by Baker and Wurgler (2006) and available from Jeffrey Wurgler’s website. Their composite sentiment index is based on the first principal component of six proxies for investor sentiment. These proxies are the closed-end fund discount, the number and the first-day returns of IPOs, NYSE turnover, the equity share in total new issues, and the dividend premium. To capture the degree of mispricing, we use the orthogonal sentiment measures, which are based on sentiment proxies orthogonalized to macroeconomic conditions. Table 2 shows summary statistics for the Baker-Wurgler beginning-of-month sentiment measures from January 1994 until their final month of availability, December 2010. Following Stambaugh, et al. (2012), we divide the entire sample period into two subsamples. The first subsample covers periods of high sentiment where the beginning-of-month sentiment is higher than the sample median of 0.02. The second subsample reflects periods of low sentiment in 8",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 43,
    "chunk_index": 16,
    "word_count": 274,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "final month of availability, December 2010. Following Stambaugh, et al. (2012), we divide the entire sample period into two subsamples. The first subsample covers periods of high sentiment where the beginning-of-month sentiment is higher than the sample median of 0.02. The second subsample reflects periods of low sentiment in 8",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 43,
    "chunk_index": 17,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "which the beginning-of-month sentiment is lower than the sample median. The mean (median) of the high sentiment period is 0.50 (0.28), and that of the low sentiment period is -0.21 (-0.14). The standard deviations of the high and low sentiment periods are 0.59 and 0.21, respectively. 3. Methodology In this section, we discuss measures of hedge fund performance, risk, and timing abilities used in this paper. Our measures are based on monthly net-of-fee returns, and estimated over the full sample period as well as the high and low sentiment periods. 3.1. Performance Measures We first measure the performance of hedge funds using each fund’s average monthly return during the specified sample periods. We also estimate hedge fund alphas by controlling for risk exposures with the following regression: K R r  F  , (1) it ft i ik kt it k1 where R is the monthly return for an individual hedge fund i in month t, r represents the risk- it ft free rate in month t, α is the risk-adjusted performance measure of hedge fund i, β is the factor i ik loading of hedge fund i on factor k, F is the factor k in month t, and ε is the error term. kt it We consider two sets of risk factors. The four-factor model of Carhart (1997) contains the market risk premium, a small-minus-big size factor (SMB), a high-minus-low book-to- market factor (HML), and a momentum (MOM) factor. The seven factors proposed by Fung and Hsieh (2004) are the market risk premium (SNPMRF), Wilshire small cap minus large cap return (SCMLC), change in constant maturity yield of the 10-year Treasury (BD10 RET), change in the spread of Moody’s Baa minus the 10-year Treasury (BAAMTSY), bond PTFS (PTFSBD), 9",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 43,
    "chunk_index": 18,
    "word_count": 292,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "The seven factors proposed by Fung and Hsieh (2004) are the market risk premium (SNPMRF), Wilshire small cap minus large cap return (SCMLC), change in constant maturity yield of the 10-year Treasury (BD10 RET), change in the spread of Moody’s Baa minus the 10-year Treasury (BAAMTSY), bond PTFS (PTFSBD), 9",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 43,
    "chunk_index": 19,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "currency PTFS (PTFSFX), and commodities PTFS (PTFSCOM), where PTFS denotes primitive trend-following strategies. 3.2. Risk Measures We consider the following eight risk measures using the monthly returns during the full sample periods, high sentiment and low sentiment periods, respectively: total risk, market risk, idiosyncratic risk, downside risk, return skewness, kurtosis, coskewness, and cokurtosis. Total risk is the standard deviation of monthly returns for each hedge fund during the specified sample period. Total risk consists of market risk and idiosyncratic risk. Market risk is the estimated coefficient of the market excess return in Fung and Hsieh (2004) seven-factor model for each hedge fund. Estimation of the market risk using Carhart (1997) four-factor model yields similar results. Idiosyncratic risk is the standard deviation of the residuals from Fung and Hsieh’s seven- factor regression. Downside risk is measured following Chen (2011) method: cov(R,R |R 0) cov(R,R ) DownsideRisk   i m m  i m , (2) var(R |R 0) var(R ) m m m where R is the monthly return of hedge fund i, and R is the equity market monthly return. i m Intuitively, this is the beta for a fund conditional on negative market returns minus the fund’s unconditional beta. The more positive the value of this measure, the higher is the risk to the investor. Skewness and Kurtosis are the third and fourth moments of the distribution of performance for each hedge fund during a specified sample period. All else equal, more-negative skewness and high kurtosis are associated with higher risk. 10",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 43,
    "chunk_index": 20,
    "word_count": 254,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "the value of this measure, the higher is the risk to the investor. Skewness and Kurtosis are the third and fourth moments of the distribution of performance for each hedge fund during a specified sample period. All else equal, more-negative skewness and high kurtosis are associated with higher risk. 10 Coskewness and Cokurtosis are the third and fourth co-movements of the distribution of performance for each hedge fund, calculated as follows: ̅ ̅ (3) ̅ ̅ ̅ (4) ̅ where R and R are defined similarly as those in equation (2). i m 3.3. Timing Measures Following the existing literature on timing (e.g., Treynor and Mazuy (1966), Busse (1999), Chen and Liang (2007), Cao, Simin, and Wang (2013), and Cao, Chen, Liang, and Lo (2013)), we measure market timing, volatility timing, and liquidity timing during the specified sample periods using the following three regressions, respectively: ; (5) ̅̅̅ ̅̅ ; (6) ̅ ; (7) where MKT is the market excess return in month t, and Vol is the Chicago Board Options t t Exchange implied volatility index (VIX) at the end of month t, 11 V o l is the average of Vol over t sample periods, L is the Pastor and Stambaugh (2003) market liquidity measure in month t, and t L is the average of L over sample periods, and t im  ,  , and iv il  are the measures of hedge fund i’s market, volatility, and liquidity timing abilities, respectively. Furthermore, following Chen and Liang (2007), we also consider contemporaneously the three timing ability measures while adjusting for the seven common risk factors in Fung and Hsieh (2004):",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 43,
    "chunk_index": 21,
    "word_count": 274,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": " ,  , and iv il  are the measures of hedge fund i’s market, volatility, and liquidity timing abilities, respectively. Furthermore, following Chen and Liang (2007), we also consider contemporaneously the three timing ability measures while adjusting for the seven common risk factors in Fung and Hsieh (2004):",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 43,
    "chunk_index": 22,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "12 R it r ft i K k 1 ik F k t im M K T 2t iv M K T t ( V o l t V o l ) il M K T t ( L t L ) it                  , (8) where F represents the seven Fung and Hsieh risk factors defined previously. We also examine kt the contemporaneous timing abilities with the four-factor model of Carhart (1997), and the results are very similar to those using the seven-factor model. 4. Empirical Analysis The main focus of this paper is to examine the effectiveness of technical analysis usage by hedge funds in high and low market sentiment periods, and for comparison purposes, during the whole sample period as well. Specifically, we evaluate fund performance, risk, and timing abilities of technical analysis users versus non-users in the three sample periods in Section 4.1, 4.2, and 4.3, respectively. In Section 4.4, we compare the relative importance of technical analysis versus fundamental analysis in different sentiment periods. Section 4.5 investigates whether investors behave as if they are aware of the efficacy of technical analysis and respond by adjusting flows to technical analysis users and non-users accordingly. Section 4.6 provides a variety of robustness tests. 4.1. Use of Technical Analysis and Hedge Fund Performance 4.1.1. Univariate Analysis Table 3 reports the performance of hedge funds using technical analysis as compared to those nonusers in the three sample periods. First, over the entire sample period the average monthly return of the 981 users (4,154 nonusers) of technical analysis is 0.53% (0.45%), and the difference is statistically significant at the 1% level. The performance measured by the Carhart four-factor alpha (Alpha 4) shows no significant difference between the technical analysis users",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 43,
    "chunk_index": 23,
    "word_count": 306,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "over the entire sample period the average monthly return of the 981 users (4,154 nonusers) of technical analysis is 0.53% (0.45%), and the difference is statistically significant at the 1% level. The performance measured by the Carhart four-factor alpha (Alpha 4) shows no significant difference between the technical analysis users",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 43,
    "chunk_index": 24,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "and nonusers, but the Fung and Hsieh seven-factor alpha (Alpha 7) is significantly (p<5%) larger for the technical analysis users by the magnitude of 0.07% than for the nonusers. Technical analysis is likely to be more useful in high sentiment periods when there is more mispricing, so we focus on the performance difference of technical analysis users and nonusers in high sentiment periods. We find that in high sentiment periods, the users of technical analysis outperform nonusers based on all three measures. For example, the seven-factor alpha for technical analysis users averages 0.21%, which is significantly larger than that of nonusers by 0.11%. In contrast, during low sentiment periods, technical analysis users in general underperform nonusers. The average return of the users (nonusers) is 0.78% (0.98%), and the difference is statistically significant. The underperformance of technical analysis users based on the four-factor alpha is also significant. Although it is directionally consistent, the difference is not statistically significant with the seven-factor alpha. Across the three performance measures, a clear pattern is that the outperformance of technical analysis users exists only in high sentiment periods but not in low sentiment periods. Table 3 also shows that, irrespective of technical analysis usage, hedge fund performance in low sentiment periods is superior to that observed in high sentiment periods. For each of the respective performance measures, the figures for low sentiment exceed those for high sentiment. The time-serial sentiment effect on hedge fund performance is consistent with evidence documented in Frazzini and Lamont (2008) that high investor sentiment (measured by mutual fund flows) induces lower subsequent fund returns. 4.1.2. Regression Analysis 13",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 43,
    "chunk_index": 25,
    "word_count": 268,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "the respective performance measures, the figures for low sentiment exceed those for high sentiment. The time-serial sentiment effect on hedge fund performance is consistent with evidence documented in Frazzini and Lamont (2008) that high investor sentiment (measured by mutual fund flows) induces lower subsequent fund returns. 4.1.2. Regression Analysis 13",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 43,
    "chunk_index": 26,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "In this subsection, we control for various fund characteristics to study the effectiveness of technical analysis usage by hedge funds. We conduct a cross-sectional regression of fund performance (measured by average return, four-factor alpha, and seven-factor alpha) on a dummy variable indicating technical analysis use and other variables controlling for fund characteristics, fund categories, and inception years.6 The regression results are reported in Table 4 with the significance obtained using White (1980) standard errors. Focusing on the coefficients regarding technical analysis use, we find that only during high sentiment periods are the coefficients significantly positive, with a magnitude of 0.116%, 0.074%, and 0.089% for average return, four-factor alpha, and seven-factor alpha, respectively. Technical analysis use has a significant negative or insignificant effect on hedge fund performance during low sentiment periods. Considering the entire sample period, we find no significant effect of using technical analysis on fund performance using any of the three measures. The effects of other fund characteristics are also worth noting. First, lockup period has a significant positive effect on fund performance during low sentiment periods, while the effects during high sentiment periods are negative or insignificant. On the other hand, the redemption notice period has a significant positive effect on fund performance only during high sentiment periods. The results demonstrate that the share illiquidity premium documented in Aragon (2007) is mainly driven by the lockup (redemption notice) period in low (high) sentiment periods. Second, consistent with Ackermann, McEnally, and Ravenscraft (1999) and Agarwal, Boyson, and Naik (2009), we document that incentive fees are positively related to all three measures of performance during the whole sample period; however, this positive relation is only significant 6 We exclude fund age and size in cross-sectional regressions to avoid a look-ahead bias. As a robustness check, we include these two variables and document qualitatively similar results. 14",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 43,
    "chunk_index": 27,
    "word_count": 306,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "positively related to all three measures of performance during the whole sample period; however, this positive relation is only significant 6 We exclude fund age and size in cross-sectional regressions to avoid a look-ahead bias. As a robustness check, we include these two variables and document qualitatively similar results. 14",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 43,
    "chunk_index": 28,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "in high sentiment periods but not in low sentiment periods. Furthermore, we find that effective auditing improves hedge fund performance irrespective of the sample period considered, indicating that due diligence could be a source of fund alpha (Brown, Fraser, and Liang (2008)). Finally, the use of derivatives improves fund performance during the whole sample period, but this result is mainly driven by high sentiment periods.7 Overall, the cross-sectional regressions provide robust evidence on the efficacy of using technical analysis by hedge funds. The most notable result is that even in a multivariate context, we find that the use of technical analysis is associated with higher hedge fund performance during high sentiment periods, but the outperformance of technical analysis users is not evident during low sentiment periods. 4.2. Use of Technical Analysis and Hedge Fund Risk Taking We have documented that technical analysis users perform significantly better than nonusers during high sentiment periods. To the extent that hedge funds using technical analysis systematically assume substantial risks during high sentiment periods, our results may result from misclassifying as excess return some risks that are not fully reflected in the four- and seven- factor models. Therefore, in this subsection we examine the effect of technical analysis use on the risk-taking behavior of hedge funds during different sentiment periods. Specifically, we investigate whether technical analysis users exhibit lower risk than non-users, especially during high sentiment periods. 7 Similar to what we have found for low sentiment periods, Chen (2011) documents that derivatives use does not enhance performance. As a robustness check, we also use exactly the same sample period as in Chen (2011) and document an insignificant relation between derivatives use and fund performance, suggesting that our full-sample result is different from Chen (2011) mainly due to the use of an extended sample period. 15",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 43,
    "chunk_index": 29,
    "word_count": 301,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "enhance performance. As a robustness check, we also use exactly the same sample period as in Chen (2011) and document an insignificant relation between derivatives use and fund performance, suggesting that our full-sample result is different from Chen (2011) mainly due to the use of an extended sample period. 15",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 43,
    "chunk_index": 30,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "Table 5 reports results of univariate analysis comparing the risk taking of technical analysis users and nonusers during the entire sample period as well as high and low sentiment periods. Panel A shows that during the full sample period, the use of technical analysis is associated with significantly higher total and idiosyncratic risk of hedge funds. However, technical analysis users exhibit lower market risk, downside risk, kurtosis, and cokurtosis, and less-negative skewness, all of which are desirable traits. Considering the risk taking of hedge funds during high and low sentiment periods in Panels B and C respectively yields directionally similar results, although the differences in those desirable risk traits between users and nonusers tend to be more significant when investor sentiment is high. The overall results appear in favor of technical analysis users especially in high sentiment periods. Table 6 reports the cross-sectional regressions of fund risk taking on the use of technical analysis after controlling for fund characteristics and category dummies during the different sample periods. The statistical significance is again obtained using White (1980) standard errors. In general, we find that using technical analysis reduces the risk taking of hedge funds during high sentiment periods (Panel B), but the evidence is mixed during low sentiment periods (Panel C). Most notably, the use of technical analysis is significantly associated with lower downside risk and cokurtosis, and less-negative skewness regardless of the market sentiment regime, implying that technical analysis users bear lower downside and higher-moment risk than non- users, although the evidence is slightly weaker in low sentiment periods. However, technical analysis reduces market risk in high sentiment periods, while increasing total risk and idiosyncratic risk in low sentiment periods. Overall the multivariate regression results show stronger evidence in support of the effectiveness of technical analysis in terms of reducing hedge fund risk during high sentiment periods. 16",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 43,
    "chunk_index": 31,
    "word_count": 308,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "periods. However, technical analysis reduces market risk in high sentiment periods, while increasing total risk and idiosyncratic risk in low sentiment periods. Overall the multivariate regression results show stronger evidence in support of the effectiveness of technical analysis in terms of reducing hedge fund risk during high sentiment periods. 16",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 43,
    "chunk_index": 32,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "Table 6 also shows that the effects of other fund characteristics on the risk taking behavior of hedge funds are in general consistent with Chen (2011). For instance, lockup (redemption notice) period has a significant positive (negative) impact on fund total risk, market risk, and idiosyncratic risk during all the sample periods. Management fee and incentive fee are associated with higher total and idiosyncratic risk and lower market and downside risk, while high watermark are negatively related to fund risk taking. High-quality auditing also lowers fund risk taking during high sentiment periods, but the effects during low sentiment periods are weaker. It is not surprising that the use of leverage is associated with higher risk. Finally, the use of derivatives is negatively related to risk taking during the whole sample period and high sentiment periods, but shows a much weaker effect during low sentiment periods. In general, these results suggest that the use of technical analysis in hedge funds is associated with lower fund risk, and the benefits are most prominent in high sentiment periods. This finding has important implications for investors, traders, and fund managers that technical analysis appears to be a valuable tool to reduce downside risk and higher-moment risk of hedge funds. 4.3. Use of Technical Analysis and Hedge Fund Timing Abilities In this subsection, we examine whether there are significant differences in timing abilities between technical analysis users and nonusers among hedge funds in different sentiment periods. To address this question, we examine three aspects of timing abilities: market timing, volatility timing, and liquidity timing. Timing has been identified as one of the important sources of hedge fund alpha (Lo (2008)). If technical analysis is a useful tool of timing when market mispricing is 17",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 43,
    "chunk_index": 33,
    "word_count": 289,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "sentiment periods. To address this question, we examine three aspects of timing abilities: market timing, volatility timing, and liquidity timing. Timing has been identified as one of the important sources of hedge fund alpha (Lo (2008)). If technical analysis is a useful tool of timing when market mispricing is 17",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 43,
    "chunk_index": 34,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "most acute, we expect technical analysis users to exhibit better timing abilities than nonusers in high sentiment periods. Panel A of Table 7 reports results on the three timing abilities estimated separately during the whole sample period and high and low sentiment periods. During the entire sample period, technical analysis users on average show a positive market timing ability and the nonusers do not have market timing ability, and the difference of the market timing ability between users and nonusers is significantly positive. The negative difference regarding volatility timing between technical analysis users and nonusers indicates that technical analysis users are better at timing market volatility and reduce their exposure when market volatility is high. Regarding the liquidity timing, again we find that liquidity timing ability is significantly higher for technical analysis users than nonusers. The three timing abilities estimated separately in high and low sentiment periods show roughly similar patterns, but the results in low sentiment periods are not as significant as those in high sentiment periods. A notable exception is the inferior market timing ability of technical analysis users that we detect in low sentiment periods. When we estimate contemporaneously the three timing abilities with the Fung and Hsieh seven-factor model, in Panel B of Table 7, we find that during high sentiment periods technical analysis users have better market timing ability than nonusers. The difference is significant at the 10% level. We do not find a difference between users and nonusers for volatility timing or liquidity timing. In contrast, during low sentiment periods technical analysis users show significantly worse market timing ability and better volatility timing than nonusers. But there is no difference in the liquidity timing ability between the users and nonusers. To control for the possible effects of other fund characteristics, we regress the three timing ability coefficients (estimated separately) on the technical analysis dummy variables and 18",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 43,
    "chunk_index": 35,
    "word_count": 313,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "timing ability and better volatility timing than nonusers. But there is no difference in the liquidity timing ability between the users and nonusers. To control for the possible effects of other fund characteristics, we regress the three timing ability coefficients (estimated separately) on the technical analysis dummy variables and 18",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 43,
    "chunk_index": 36,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "fund characteristics. The results are reported in Table 8. Although the signs of the technical analysis dummy coefficients are consistent with those timing results in the Panel A of Table 7 – positive for market and liquidity timing, and negative for volatility timing – only the market timing coefficients for the whole sample and high sentiment periods are statistically significant. This again verifies the relative efficacy of technical analysis for market timing in high sentiment periods. Only a few fund characteristics significantly affect timing ability. For example, hedge funds using derivatives have better market and volatility timing abilities than nonusers during the whole sample period and high sentiment periods. Hedge funds charging higher management fees and incentive fees show better volatility timing during the whole sample period.8 Overall, we find strong and consistent evidence that the use of technical analysis is associated with better market timing ability in high sentiment periods. This result may explain our earlier finding of value gains to hedge funds that use technical analysis. The evidence also indicates that technical analysis might be an effective tool of market timing especially in high sentiment periods when there is more mispricing in the market. Our finding is consistent with Brunnermeier and Nagel (2004) and Griffin, Harris, Shu, and Topaloglu (2011), who find that during the technology-bubble of the early 2000s hedge funds trade in the same direction as the tech-stock-fueled market upturn. Thus, rather than engaging in arbitrage that would tend to align prices with intrinsic values in a high-sentiment-induced market episode of overpricing, hedge funds actively time the market, riding the trend and then reducing their exposure before the bubble bursts. 8 Giambona and Golec (2009) show that management fee is positively related to mutual fund managers’ market volatility timing strategies. 19",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 43,
    "chunk_index": 37,
    "word_count": 295,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "prices with intrinsic values in a high-sentiment-induced market episode of overpricing, hedge funds actively time the market, riding the trend and then reducing their exposure before the bubble bursts. 8 Giambona and Golec (2009) show that management fee is positively related to mutual fund managers’ market volatility timing strategies. 19",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "1. Introduction",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 43,
    "chunk_index": 38,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "We have documented the economic benefits of using technical analysis during periods of high-sentiment-induced mispricing. To provide further evidence, we compare the relative importance of technical analysis versus fundamental analysis in different sentiment periods. In a spirit similar to Han, et al. (2013), we expect that during high sentiment periods when fundamental information becomes less reliable, technical analysis would be more useful than fundamental analysis; during low sentiment periods when the market is relatively more efficient, fundamental analysis would be more useful than technical analysis. This argument suggests that while technical analysis is more useful in high sentiment periods, fundamental analysis should be a more effective tool in low sentiment periods. To address this issue, we employ the self-reported information from TASS on whether hedge funds use fundamental analysis. Approximately 46% of our sample funds are fundamental analysis users, and the correlation between fundamental and technical anlaysis usage is only 0.2. We perform a multivariate analysis similar to that in Table 4 by incorporating the use of fundamental analysis. The regression results for different sample periods appear in Table 9. Interestingly, during high sentiment periods, the coefficients on the use of fundamental analysis are significantly negative irrespective of the performance measure considered, indicating that fundamental analysis actually hurts hedge fund performance during periods of high-sentiment- induced overpricing when technical analysis appears consistently to improve fund performance. However, during low sentiment periods when the market is relatively more efficient, fundamental analysis shows some evidence of enhancing fund performance as measured by raw return and four-factor alpha, while technical analysis is less useful or even counterproductive. 20",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "4.4. Technical Analysis versus Fundamental Analysis",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 43,
    "chunk_index": 39,
    "word_count": 265,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4. Technical Analysis versus Fundamental Analysis (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "induced overpricing when technical analysis appears consistently to improve fund performance. However, during low sentiment periods when the market is relatively more efficient, fundamental analysis shows some evidence of enhancing fund performance as measured by raw return and four-factor alpha, while technical analysis is less useful or even counterproductive. 20",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "4.4. Technical Analysis versus Fundamental Analysis",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 43,
    "chunk_index": 40,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4. Technical Analysis versus Fundamental Analysis (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "Again, considering the entire sample period, we do not find any significant effects of either technical anlaysis or fundamental analysis on hedge fund performance. This additional evidence further supports our arguments on the relative usefulness of technical analysis in less efficient market environments when fundamental analysis is comparatively ineffective. Our finding also provides evidence in favor of rotating investment strategies (i.e., technical and fundamental analysis) in different sentiment peirods, and thus has important practical implications for investors, traders, and hedge fund managers. 4.5. Use of Technical Analysis and Investor Flows We have so far documented that using technical analysis is associated with significantly higher performance, lower risk, and better market timing ability of hedge funds during high sentiment periods but not during low sentiment periods. A natural question is whether investors behave as if they are aware of the efficacy of technical analysis and adjust their flows to technical analysis users and non-users accordingly. To address this question, we employ the following regression analysis of investor flows at an annual frequency for the whole sample period, high sentiment periods, and low sentiment periods, respectively:9 21 F l o w it 1 P e r f i,t 1 2 P e r f 2 i,t 1 T3 A i 4 P e r f i,t T1 A i C o n t r o l s it                 , (9) where Flow is the net fund flows of hedge fund i during period t, Perf is the fund return in it i,t-1 excess of the median fund return within the same investment category during period t-1, and TA i is a dummy variable for technical analysis use for fund i. The untabulated results show that irrespective of the sample period considered, fund flows are unrelated to the technical analysis dummy and the interaction of technical analysis and 9 We use annual frequency due to the share restrictions in the hedge fund industry. We also estimate regression models at a monthly frequency and find similar results.",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "4.4. Technical Analysis versus Fundamental Analysis",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 43,
    "chunk_index": 41,
    "word_count": 349,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4. Technical Analysis versus Fundamental Analysis (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "irrespective of the sample period considered, fund flows are unrelated to the technical analysis dummy and the interaction of technical analysis and 9 We use annual frequency due to the share restrictions in the hedge fund industry. We also estimate regression models at a monthly frequency and find similar results.",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "4.4. Technical Analysis versus Fundamental Analysis",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 43,
    "chunk_index": 42,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4. Technical Analysis versus Fundamental Analysis (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "prior performance. These results demonstrate that hedge fund investors do not appear to invest and redeem based on technical analysis usage during various sentiment periods. This suggests that investors do not view hedge funds’ use of technical analysis to be particularly beneficial or perilous to their wealth. 4.6. Robustness Checks In this subsection, we conduct several robustness tests to ascertain that our results hold under a variety of assumptions and conditions.10 First, we investigate whether the technical analysis indicator changes from 2002 to 2010 for most of hedge funds in the sample and repeat the analysis for the subperiod of 2003-2010. We then examine whether our results hold when returns are measured gross of fees. We also classify high and low sentiment periods on a rolling basis using the median sentiment level over the previous 10 years. We further run panel regressions based on the sentiment level. Finally, we exclude non-equity-focused hedge funds for an additional robustness check. 4.6.1. Subperiod Analysis The TASS hedge fund database provides only the latest “snapshot” information on technical analysis use and other fund characteristics. The lack of historical time series data raises a concern that the reported technical analysis usage might vary over time and thus our analysis might be subject to a look-ahead bias. To address this concern, we first obtain the January 2003 version of the TASS database which provides technical analysis data as of year-end 2002. We find that among the 2,459 live hedge funds in the 2003 database that remain alive through December 2010, only 12 funds change from technical analysis users to non-users and 21 funds 10 We find robustness results for fund performance, risk taking, and timing ability. For brevity, we only report the results based on hedge fund performance. 22",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "4.4. Technical Analysis versus Fundamental Analysis",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 43,
    "chunk_index": 43,
    "word_count": 293,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4. Technical Analysis versus Fundamental Analysis (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "funds in the 2003 database that remain alive through December 2010, only 12 funds change from technical analysis users to non-users and 21 funds 10 We find robustness results for fund performance, risk taking, and timing ability. For brevity, we only report the results based on hedge fund performance. 22",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "4.4. Technical Analysis versus Fundamental Analysis",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 43,
    "chunk_index": 44,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4. Technical Analysis versus Fundamental Analysis (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "change from non-users to users. The remaining 98.7% of funds have the same technical analysis indicator between these two dates. Our observation about technical analysis is consistent with reports by Ackermann, et al. (1999), Liang (2000), Aragon (2007), and Chen (2011) that fund characteristics such as incentive fees, lockup provisions, and derivatives use rarely change. As an additional robustness test, we repeat our basic analysis using a more recent sub- period of 2003-2010. This is particularly important because it mitigates the concern that the technical analysis indicator might vary significantly over the full sample period. Further, the sentiments characterizing this sub-period and its predecessor are different. The results from Panel A of Table 10 are similar to those from the full sample period in Table 3. We again show that the performance differences between technical analysis users and non-users are significantly positive during high sentiment periods, but become neutral or even significantly negative in low sentiment periods. Untabulated results also show that technical analysis users exhibit lower risk and better market timing ability than non-users in high sentiment periods. 4.6.2. Pre-fee Returns Our main analysis thus far is based on net-of-fee hedge fund returns. However, it is possible that technical analysis non-users actually perform better than users but charge disproportionately higher fees. To ensure that our results are not simply driven by fees, we estimate pre-fee returns for each hedge fund as a robustness test. To approximate pre-fee fund returns, we follow Teo (2009) and Chen (2011) and use the T-bill rate as the hurdle rate, apply a high-water mark when adjusting for incentive fees, and then add back management fees. We assume that fund returns accrue to a first-year investor. Panel B of Table 10 reports the performance differences between technical analysis users and nonusers for the whole sample period as well as high and low sentiment periods using our 23",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "4.4. Technical Analysis versus Fundamental Analysis",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 43,
    "chunk_index": 45,
    "word_count": 312,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4. Technical Analysis versus Fundamental Analysis (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "for incentive fees, and then add back management fees. We assume that fund returns accrue to a first-year investor. Panel B of Table 10 reports the performance differences between technical analysis users and nonusers for the whole sample period as well as high and low sentiment periods using our 23",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "4.4. Technical Analysis versus Fundamental Analysis",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 43,
    "chunk_index": 46,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4. Technical Analysis versus Fundamental Analysis (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "pre-fee return estimates. The results are qualitatively similar to those reported in Table 3. During high sentiment periods, technical analysis users have significantly higher pre-fee performance than non- users; during low sentiment periods, however, technical analysis users have lower or at best similar pre-fee performance compared to nonusers. 4.6.3. Sentiment Classification Based on Rolling Periods The use of the full sample median to categorize high and low sentiment periods might subject our results to a potential look-ahead bias. To address this concern, we classify high and low sentiment periods on a rolling basis using the median sentiment level over the previous 10 years as the point of demarcation between low and high sentiment periods.11 With each passing month, the most recent 10 years of sentiment data are used while the oldest one is dropped off. This rolling classification highlights the practical integration of sentiment with the use of technical indicators since high and low sentiment classifications are made ex ante. The results in Panel C of Table 10 are robust to the use of this alternative sentiment classification method. Similarly, we find that technical analysis users outperform non-users only during high sentiment periods. 4.6.4. Sentiment Level Our main analysis thus far is based on the classification of high and low sentiment periods. As an additional robustness check, we use the level of sentiment index to examine whether technical analysis is more effective when the sentiment level is higher. Specifically, we perform panel regressions of monthly hedge fund returns (in excess of the risk-free rate) on the beginning-of-month sentiment level, the technical analysis dummy, and the interaction of these 11 For example, for January 1994, we employ the beginning-of-month sentiment data from January 1984 to December 1993 to find the median sentiment, and if the beginning-of-month sentiment in January 1994 is higher than the median sentiment, we classify January 1994 as a high sentiment month; otherwise, it is categorized as a low sentiment month. 24",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "4.4. Technical Analysis versus Fundamental Analysis",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 43,
    "chunk_index": 47,
    "word_count": 324,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4. Technical Analysis versus Fundamental Analysis (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "we employ the beginning-of-month sentiment data from January 1984 to December 1993 to find the median sentiment, and if the beginning-of-month sentiment in January 1994 is higher than the median sentiment, we classify January 1994 as a high sentiment month; otherwise, it is categorized as a low sentiment month. 24",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "4.4. Technical Analysis versus Fundamental Analysis",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 43,
    "chunk_index": 48,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4. Technical Analysis versus Fundamental Analysis (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "two terms, controlling for style fixed effects (Model 1). We further control for other fund characteristics in Model 2. The results in Table 11 show that the coefficients on the interaction of sentiment and technical analysis are significantly positive, indicating that the use of technical analysis is associated with higher hedge fund performance when investor sentiments are higher. Moreover, consistent with what we have documented in Table 3, hedge fund performance is significantly negatively associated with the sentiment level. Overall our results are robust to the use of the sentiment level. 4.6.5. Equity-focused Hedge Funds Since the sentiment index is developed based on investor sentiments in the stock market, we perform a robustness check by focusing only on equity-focused hedge funds. In particular, we exclude Managed Futures, Fixed Income Arbitrage, and Global Macro, and our results remain qualitatively similar. We also perform panel regressions based on the sentiment level in Models 3 and 4 of Table 11. Again the results are similar to those obtained from the full sample (Models 1 and 2). We show that technical analysis is associated with superior hedge fund performance in high sentiment environments. 5. Conclusions This paper presents a unique approach to test whether technical analysis is a more useful investment tool in high sentiment periods when short-sale constraints might inhibit the elimination of sentiment-induced overpricing, than in low sentiment periods when sentiment- induced underpricing can be fully exploited by optimistic market participants (Stambaugh, et al. (2012)). Specifically, rather than testing individual technical rules, we focus on hedge fund 25",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "4.4. Technical Analysis versus Fundamental Analysis",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 43,
    "chunk_index": 49,
    "word_count": 256,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4. Technical Analysis versus Fundamental Analysis (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "investment tool in high sentiment periods when short-sale constraints might inhibit the elimination of sentiment-induced overpricing, than in low sentiment periods when sentiment- induced underpricing can be fully exploited by optimistic market participants (Stambaugh, et al. (2012)). Specifically, rather than testing individual technical rules, we focus on hedge fund 25 managers as some of the world’s most sophisticated and astute investors, and consider their employment of technical analysis in different sentiment periods irrespective of how they use it. Using data from the Lipper TASS hedge fund database over the period 1994-2010, we find that during periods of high investor sentiments when overpricing relative to intrinsic value is most likely to occur, the use of technical analysis is associated with higher returns, lower risk, and superior market timing ability of hedge funds. In contrast, the benefits for hedge funds of using technical analysis generally disappear in low sentiment periods. These results are robust to controlling for fund characteristics and various fixed effects, a subperiod analysis, the use of pre- fee returns, rolling sentiments, and the sentiment level, and the exclusion of non-equity-focused hedge funds. Our paper contributes to the long-standing debate on the efficacy of technical analysis, and thus has important implications for traders, portfolio managers, and investors. In particular, our findings can help traders and portfolio managers identify sources of alpha and decide when to implement technical analysis. For investors who have not recognized the varying benefits of technical analysis in diverse sentiment periods, our findings provide useful insight about the importance of tailoring the analytical approach to the market environment. 26",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "4.4. Technical Analysis versus Fundamental Analysis",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 43,
    "chunk_index": 50,
    "word_count": 262,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4. Technical Analysis versus Fundamental Analysis (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "help traders and portfolio managers identify sources of alpha and decide when to implement technical analysis. For investors who have not recognized the varying benefits of technical analysis in diverse sentiment periods, our findings provide useful insight about the importance of tailoring the analytical approach to the market environment. 26",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "4.4. Technical Analysis versus Fundamental Analysis",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 43,
    "chunk_index": 51,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4. Technical Analysis versus Fundamental Analysis (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "Ackermann, Carl, Richard McEnally, and David Ravenscraft, 1999, The performance of hedge funds: Risk, return, and incentives, Journal of Finance 54, 833-874. Agarwal, Vikas, Nicole M. Boyson, and Narayan Y. Naik, 2009, Hedge funds for retail investors? An examination of hedged mutual funds, Journal of Financial and Quantitative Analysis 44, 273-305. Agarwal, Vikas, Naveen D. Daniel, and Narayan Y. Naik, 2009, Role of managerial incentives and discretion in hedge fund performance, Journal of Finance 64, 2221-2256. Aggarwal, Rajesh K., and Philippe Jorion, 2010, The performance of emerging hedge funds and managers, Journal of Financial Economics 96, 238-256. Antoniou, Constantinos, John A. Doukas, and Avanidhar Subrahmanyam, 2013, Cognitive dissonance, sentiment, and momentum, Journal of Financial and Quantitative Analysis 48, 245-275. Aragon, George O., 2007, Share restrictions and asset pricing: Evidence from the hedge fund industry, Journal of Financial Economics 83, 33-58. Baker, Malcolm, and Jeffrey Wurgler, 2006, Investor sentiment and the cross-section of stock returns, Journal of Finance 61, 1645-1680. Brock, William, Josef Lakonishok, and Blake LeBaron, 1992, Simple technical trading rules and the stochastic properties of stock returns, Journal of Finance 47, 1731-1764. Brown, Stephen J., Thomas L. Fraser, and Bing Liang, 2008, Hedge fund due diligence: A source of alpha in a hedge fund portfolio strategy, Journal of Investment Management 6, 23-33. Brown, Stephen J., William N. Goetzmann, and James Park, 2001, Careers and survival: Competition and risks in the hedge fund and CTA industry, Journal of Finance 56, 1869- 1886. Brunnermeier, Markus K., and Stefan Nagel, 2004, Hedge fund and the technology bubble, Journal of Finance 59, 2013-2040. Busse, Jeffrey A., 1999, Volatility timing in mutual funds: evidence from daily returns, Review of Financial Studies 12, 1009-1041. Cao, Charles, Yong Chen, Bing Liang, and Andrew W. Lo, 2013, Can Hedge Funds Time Market Liquidity?, Journal of Financial Economics 109, 493-516. Cao, Charles, Timothy T. Simin, and Ying Wang, 2013, Do mutual fund managers time market liquidity?, Journal of Financial Markets 16, 279–307. Carhart, Mark M., 1997, On persistence in mutual fund performance, Journal of Finance 52, 57- 82. Chen, Yong, 2007, Timing ability in the focus market of hedge funds, Journal of Investment Management 5, 66-98. Chen, Yong, 2011, Derivatives use and risk taking: Evidence from the hedge fund industry, Journal of Financial and Quantitative Analysis 46, 1073-1106. Chen, Yong, and Bing Liang, 2007, Do market timing hedge funds time the market?, Journal of Financial and Quantitative Analysis 42, 827-856. Fama, Eugene F., 1965, The behavior of stock-market prices, Journal of Business 38, 34-105. Fung, William, and David A. Hsieh, 1997, Empirical characteristics of dynamic trading strategies: The case of hedge funds, Review of Financial Studies 10, 275-302. 27",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "References",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 43,
    "chunk_index": 52,
    "word_count": 441,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "time the market?, Journal of Financial and Quantitative Analysis 42, 827-856. Fama, Eugene F., 1965, The behavior of stock-market prices, Journal of Business 38, 34-105. Fung, William, and David A. Hsieh, 1997, Empirical characteristics of dynamic trading strategies: The case of hedge funds, Review of Financial Studies 10, 275-302. 27",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "References",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 43,
    "chunk_index": 53,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "Fung, William, and David A. Hsieh, 2004, Hedge fund benchmarks: A risk-based approach, Financial Analysts Journal 60, 65-81. Getmansky, Mila, Andrew W. Lo, and Igor Makarov, 2004, An econometric model of serial correlation and illiquidity in hedge fund returns, Journal of Financial Economics 74, 529- 610. Giambona, Erasmo, and Joseph Golec, 2009, Mutual fund volatility timing and management fees, Journal of Banking and Finance 589-599. Griffin, John M., Jeffrey R. Harris, Tao Shu, and Selim Topaloglu, 2011, Who drove and burst the tech bubble?, Journal of Finance 66, 1251-1290. Han, Yufeng, Ke Yang, and Guofu Zhou, 2013, A new anomaly: The cross-sectional profitability of technical analysis, Journal of Financial and Quantitative Analysis, forthcoming. Kavajecz, Kenneth A. , and Elizabeth R. Odders-White, 2004, Technical analysis and liquidity provision, Review of Financial Studies 17, 1043-1071. Liang, Bing, 2000, Hedge funds: The living and the dead, Journal of Financial & Quantitative Analysis 35, 309-326. Liang, Bing, 2003, The accuracy of hedge fund returns, Journal of Portfolio Management 29, 111-122. Lo, Andrew W., 2008, Where do alphas come from? A measure of active investment management, Journal of Investment Management 6, 1-29. Lo, Andrew W., Harry Mamaysky, and Jiang Wang, 2000, Foundations of technical analysis: Computational algorithms, statistical inference, and empirical implementation, Journal of Finance 55, 1705-1770. Menkhoff, Lukas, and Mark P. Taylor, 2007, The obstinate passion of foreign exchange professionals: Technical analysis, Journal of Economic Literature 45, 936-972. Miller, Edward M., 1977, Risk, uncertainty, and divergence of opinion, Journal of Finance 32, 1151-1168. Neely, Christopher, Paul Weller, and Rob Dittmar, 1997, Is technical analysis in the foreign exchange market profitable? A genetic programming approach, Journal of Financial and Quantitative Analysis 32, 405-426. Park, Cheol-Ho, and Scott H. Irwin, 2007, What do we know about the profitability of technical analysis?, Journal of Economic Surveys 21, 786-826. Pastor, Lubos, and Robert F. Stambaugh, 2003, Liquidity risk and expected stock returns, Journal of Political Economy 111, 642-685. Shen, Junyan, and Jianfeng Yu, 2013, Investor sentiment and economic forces, working paper, University of Minnesota. Shleifer, Andrei, and Lawrence H. Summers, 1990, The noise trader approach to finance, Journal of Economic Perspectives 4. Stambaugh, Robert F., Jianfeng Yu, and Yu Yuan, 2012, The Short of It: Investor Sentiment and Anomalies, Journal of Financial Economics 104, 288-302. Stambaugh, Robert F., Jianfeng Yu, and Yu Yuan, 2013, Arbitrage asymmetry and the idiosyncratic volatility puzzle, working paper. Teo, Melvyn, 2009, The geography of hedge funds, Review of Financial Studies 22, 3531-3561. Treynor, Jack L., and Kay Mazuy, 1966, Can mutual funds outguess the market?, Harvard Business Review 44, 131-136. White, Halbert, 1980, A heteroskedasticity-consistent covariance matrix estimator and a direct test for heteroskedasticity, Econometrica 48, 817-838. 28",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "References",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 43,
    "chunk_index": 54,
    "word_count": 445,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "Teo, Melvyn, 2009, The geography of hedge funds, Review of Financial Studies 22, 3531-3561. Treynor, Jack L., and Kay Mazuy, 1966, Can mutual funds outguess the market?, Harvard Business Review 44, 131-136. White, Halbert, 1980, A heteroskedasticity-consistent covariance matrix estimator and a direct test for heteroskedasticity, Econometrica 48, 817-838. 28 Yu, Jianfeng, 2013, A sentiment-based explanation of the forward premium puzzle, Journal of Monetary Economics 60, 474-491. Yu, Jianfeng, and Yu Yuan, 2011, Investor sentiment and the mean-variance relation, Journal of Financial Economics 100, 367-381. Zhu, Yingzi, and Guofu Zhou, 2009, Technical analysis: An asset allocation perspective on the use of moving averages, Journal of Financial Economics 92, 519-544. 29",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "References",
    "page_number": 30,
    "page_range": "p.30-31",
    "total_pages": 43,
    "chunk_index": 55,
    "word_count": 110,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.30-31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "puzzle, Journal of Monetary Economics 60, 474-491. Yu, Jianfeng, and Yu Yuan, 2011, Investor sentiment and the mean-variance relation, Journal of Financial Economics 100, 367-381. Zhu, Yingzi, and Guofu Zhou, 2009, Technical analysis: An asset allocation perspective on the use of moving averages, Journal of Financial Economics 92, 519-544. 29 Table 1 Summary Statistics of Hedge Funds Panel A presents the distribution of the use of technical analysis (TA) among the sample hedge funds by reporting the number of funds, the number of TA users, and the percentage of hedge funds that use TA as of December 2010. The sample includes both live and graveyard funds with net monthly returns denominated in U.S. dollars from the TASS hedge fund database over the period 1994-2010. Panel B reports summary statistics of fund characteristics. Fund size is the time-series average of monthly assets under management for each fund. High Water Mark, Audit, Leverage, and Derivatives Use are 0/1 survey response variables. The information on other fund characteristics is as of December 2010. Panel A: Distribution of the Use of Technical Analysis Sample/Subsample Number of Funds Number of TA Users % of TA Users All Funds 5,135 981 19.1 Live Funds 3,290 712 21.6 Graveyard Funds 1,845 269 14.6 Panel B: Summary Statistics of Fund Characteristics Variable Obs Mean Std. Dev. Min 25% Median 75% Max Fund Age (year) 5,135 7.58 4.36 1.75 4.42 6.42 9.75 33.83 Fund Size ($bil) 4,555 0.16 0.41 0.00 0.01 0.04 0.13 6.87 Lockup Period (years) 5,135 0.28 0.56 0.00 0.00 0.00 0.50 7.50 Notice Period (years) 5,135 0.11 0.08 0.00 0.04 0.08 0.16 1.00 Management Fee (%) 5,118 1.45 0.68 0.00 1.00 1.50 2.00 22.00 Incentive Fee (%) 5,099 15.72 7.50 0.00 10.00 20.00 20.00 50.00 High Water Mark (0/1) 5,118 0.64 0.48 0.00 0.00 1.00 1.00 1.00 Min Investment ($mil) 5,117 1.18 9.53 0.00 0.10 0.50 1.00 250.00 Audit (0/1) 5,135 0.89 0.32 0.00 1.00 1.00 1.00 1.00 Leverage (0/1) 5,135 0.58 0.49 0.00 0.00 1.00 1.00 1.00 Derivatives Use (0/1) 4,423 0.69 0.47 0.00 0.00 1.00 1.00 1.00 30",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "References",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 43,
    "chunk_index": 56,
    "word_count": 344,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "0.64 0.48 0.00 0.00 1.00 1.00 1.00 Min Investment ($mil) 5,117 1.18 9.53 0.00 0.10 0.50 1.00 250.00 Audit (0/1) 5,135 0.89 0.32 0.00 1.00 1.00 1.00 1.00 Leverage (0/1) 5,135 0.58 0.49 0.00 0.00 1.00 1.00 1.00 Derivatives Use (0/1) 4,423 0.69 0.47 0.00 0.00 1.00 1.00 1.00 30 Table 2 Summary Statistics of Investor Sentiment The table presents summary statistics of monthly composite investor sentiment index from Baker and Wurgler (2006) over the period 1994-2010. The index is based on the first principal component of six investor-sentiment proxies (i.e., the closed-end fund discount, the number and first-day returns of IPOs, NYSE turnover, the equity share in total new issues, and the dividend premium), where these sentiment proxies are orthogonalized to macroeconomic conditions. High (low) sentiment periods refer to those months when the beginning-of-month sentiment is higher (lower) than the sample median. Sample Period Obs Mean Std. Dev. Min 25% Median 75% Max All Months, 1994-2010 204 0.15 0.56 -0.90 -0.14 0.02 0.28 2.50 High Sentiment Periods 102 0.50 0.59 0.02 0.10 0.28 0.53 2.50 Low Sentiment Periods 102 -0.21 0.21 -0.90 -0.30 -0.14 -0.05 0.02 31",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "References",
    "page_number": 32,
    "page_range": "p.32-33",
    "total_pages": 43,
    "chunk_index": 57,
    "word_count": 188,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.32-33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "(lower) than the sample median. Sample Period Obs Mean Std. Dev. Min 25% Median 75% Max All Months, 1994-2010 204 0.15 0.56 -0.90 -0.14 0.02 0.28 2.50 High Sentiment Periods 102 0.50 0.59 0.02 0.10 0.28 0.53 2.50 Low Sentiment Periods 102 -0.21 0.21 -0.90 -0.30 -0.14 -0.05 0.02 31 Table 3 Use of Technical Analysis and Hedge Fund Performance by Investor Sentiment Periods The table compares the performance (in percent) of technical analysis users and nonusers among hedge funds in high and low sentiment periods as well as over the full sample period of 1994-2010. Performance is estimated using three measures: Ave Ret is the average monthly hedge-fund return, Alpha4 is the Carhart (1997) four-factor alpha, and Alpha7 is the Fung and Hsieh (2004) seven-factor alpha. High (low) sentiment periods refer to those months when the beginning-of-month Baker and Wurgler (2006) sentiment index is higher (lower) than the sample median. t-diff is the t-statistic from the test of whether the difference of means is zero, and p-diff is the associated p-value. Entire Period, 1994-2010 High Sentiment Periods Low Sentiment Periods Obs Ave Ret Alpha4 Alpha7 Obs Ave Ret Alpha4 Alpha7 Obs Ave Ret Alpha4 Alpha7 Users 981 0.529 0.169 0.230 816 0.386 -0.010 0.212 836 0.781 0.236 0.390 Nonusers 4,154 0.447 0.124 0.164 3,199 -0.060 -0.123 0.105 3,677 0.980 0.428 0.447 Difference 0.082 0.046 0.066 0.445 0.113 0.107 -0.198 -0.192 -0.057 t-diff 2.702 1.535 2.056 8.311 2.704 2.387 -4.534 -4.794 -1.293 p-diff 0.007 0.125 0.040 0.000 0.007 0.017 0.000 0.000 0.196 32",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "References",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 43,
    "chunk_index": 58,
    "word_count": 253,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "-0.010 0.212 836 0.781 0.236 0.390 Nonusers 4,154 0.447 0.124 0.164 3,199 -0.060 -0.123 0.105 3,677 0.980 0.428 0.447 Difference 0.082 0.046 0.066 0.445 0.113 0.107 -0.198 -0.192 -0.057 t-diff 2.702 1.535 2.056 8.311 2.704 2.387 -4.534 -4.794 -1.293 p-diff 0.007 0.125 0.040 0.000 0.007 0.017 0.000 0.000 0.196 32",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "References",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 43,
    "chunk_index": 59,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "Table 4 Regressions of Hedge Fund Performance on the Use of Technical Analysis by Investor Sentiment Periods The table reports the regression results of hedge fund performance (in percent) on the use of technical analysis after controlling for various fund characteristics and category and inception year dummies. Performance is measured by average monthly return (Ave Ret), the Carhart (1997) four- factor alpha (Alpha4), and the Fung and Hsieh (2004) seven-factor alpha (Alpha7), respectively. High (low) sentiment periods refer to those months when the beginning-of-month Baker and Wurgler (2006) sentiment index is higher (lower) than the sample median. The White (1980) heteroskedasticity-robust t-statistics are shown in parentheses. ***, **, * indicate significance at the 1%, 5%, and 10% levels, respectively. Entire Period, 1994-2010 High Sentiment Periods Low Sentiment Periods Variable Ave Ret Alpha4 Alpha7 Ave Ret Alpha4 Alpha7 Ave Ret Alpha4 Alpha7 Technical Analysis Use 0.015 0.042 0.042 0.116** 0.074* 0.089* -0.060 -0.100** -0.015 (0.47) (1.29) (1.17) (2.22) (1.66) (1.74) (-1.36) (-2.06) (-0.27) Lockup Period 0.066*** 0.029 0.032 -0.089* -0.025 0.009 0.140*** 0.055* 0.089** (2.76) (1.39) (1.25) (-1.94) (-0.64) (0.22) (3.66) (1.91) (2.40) Notice Period 0.464** 0.612*** 0.320 0.738** 0.878*** 0.684* -0.074 0.171 -0.138 (2.09) (2.91) (1.35) (2.16) (3.00) (1.94) (-0.23) (0.59) (-0.39) Management Fee 0.004 -0.007 -0.029 -0.001 0.019 -0.028 0.032 0.032 0.031 (0.12) (-0.21) (-1.03) (-0.02) (0.60) (-0.77) (0.94) (0.97) (0.92) Incentive Fee 0.011*** 0.008*** 0.009*** 0.018*** 0.006* 0.008* 0.001 0.005 0.005 (4.14) (3.04) (3.00) (3.94) (1.67) (1.91) (0.15) (1.35) (1.35) High Water Mark 0.037 0.041 0.078** -0.097* 0.040 0.118** -0.000 -0.036 0.022 (1.17) (1.26) (2.20) (-1.83) (0.92) (2.49) (-0.00) (-0.82) (0.47) Min Investment 0.009 0.022** 0.011 0.035** 0.057*** 0.043*** -0.021 0.011 -0.016 (1.04) (2.49) (1.11) (2.44) (4.94) (3.16) (-1.63) (1.16) (-1.12) Audit 0.219*** 0.354*** 0.269*** 0.044 0.258*** 0.298*** 0.281*** 0.284*** 0.253*** (4.30) (6.90) (5.44) (0.55) (3.21) (3.42) (3.96) (3.14) (2.92) Leverage 0.003 -0.001 -0.010 0.026 0.024 -0.023 -0.034 -0.071** -0.070* (0.11) (-0.05) (-0.35) (0.56) (0.68) (-0.56) (-0.89) (-2.07) (-1.78) Derivatives Use 0.078*** 0.059** 0.097*** 0.164*** 0.089** 0.085* -0.054 -0.052 0.012 (2.83) (2.22) (3.46) (3.28) (2.21) (1.86) (-1.34) (-1.41) (0.29) Constant 0.084 -0.150 -0.168 -0.162 -0.502*** -0.482*** -0.459* 0.802* 0.127 (0.60) (-0.74) (-0.89) (-0.91) (-3.52) (-3.22) (-1.69) (1.78) (0.63) Category Dummies Yes Yes Yes Yes Yes Yes Yes Yes Yes Inception Year Dummies Yes Yes Yes Yes Yes Yes Yes Yes Yes Number of Obs 4403 4403 4403 3594 3594 3594 3839 3839 3839 Adjusted R-square 0.089 0.088 0.070 0.144 0.051 0.042 0.121 0.066 0.049 33",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "References",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 43,
    "chunk_index": 60,
    "word_count": 407,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "(-1.69) (1.78) (0.63) Category Dummies Yes Yes Yes Yes Yes Yes Yes Yes Yes Inception Year Dummies Yes Yes Yes Yes Yes Yes Yes Yes Yes Number of Obs 4403 4403 4403 3594 3594 3594 3839 3839 3839 Adjusted R-square 0.089 0.088 0.070 0.144 0.051 0.042 0.121 0.066 0.049 33",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "References",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 43,
    "chunk_index": 61,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "Table 5 Use of Technical Analysis and Hedge Fund Risk Taking by Investor Sentiment Periods This table compares the average risk levels of technical analysis users and nonusers among hedge funds in high and low sentiment periods as well as over the full sample period of 1994-2010. Risk is estimated by eight measures: Total risk is the standard deviation of monthly fund returns; Market risk is the estimated coefficient of the market excess return in the Fung and Hsieh (2004) seven-factor model; Idiosyncratic risk is the standard deviation of the residuals from Fung and Hsieh’s seven-factor model; Downside risk is the beta for a fund conditional on negative market returns minus the fund’s unconditional beta; Skewness and Kurtosis are the third and fourth moments of the distribution of fund returns; Coskewness and Cokurtosis are the third and fourth co-movements of the distribution fund returns. High (low) sentiment periods refer to those months when the beginning-of-month Baker and Wurgler (2006) sentiment index is higher (lower) than the sample median. t-diff is the t-statistic from the test of whether the difference of means is zero, and p-diff is the associated p-value. Panel A: Fund Risk Taking during Whole Sample Period, 1994-2010 Obs Total Risk Mkt Risk Idio Risk Downside Skewness Kurtosis Coskew Cokurt Users 981 4.357 0.215 3.718 -0.107 -0.182 5.677 0.187 0.157 Nonusers 4,154 3.840 0.251 3.111 0.041 -0.578 6.273 0.388 0.364 Difference 0.517 -0.035 0.608 -0.148 0.397 -0.596 -0.200 -0.207 t-diff 4.506 -2.524 6.420 -9.617 8.884 -2.544 -3.257 -11.194 p-diff 0.000 0.012 0.000 0.000 0.000 0.011 0.000 0.000 Panel B: Fund Risk Taking during High Sentiment Periods Obs Total Risk Mkt Risk Idio Risk Downside Skewness Kurtosis Coskew Cokurt Users 816 4.760 0.186 3.293 -0.122 -0.212 4.627 -0.023 0.130 Nonusers 3,199 4.171 0.318 2.591 0.017 -0.598 5.051 0.370 0.405 Difference 0.589 -0.133 0.702 -0.139 0.386 -0.424 -0.393 -0.274 t-diff 4.220 -6.958 7.356 -6.981 8.663 -2.516 -5.643 -11.490 p-diff 0.000 0.000 0.000 0.000 0.000 0.012 0.000 0.000 Panel C: Fund Risk Taking during Low Sentiment Periods Obs Total Risk Mkt Risk Idio Risk Downside Skewness Kurtosis Coskew Cokurt Users 836 3.728 0.221 2.821 -0.124 0.068 4.260 0.253 0.170 Nonusers 3,677 3.067 0.255 2.146 0.026 -0.069 4.463 0.328 0.247 Difference 0.661 -0.033 0.675 -0.150 0.136 -0.203 -0.075 -0.077 t-diff 6.387 -2.127 8.757 -3.616 3.578 -1.461 -1.295 -4.870 p-diff 0.000 0.034 0.000 0.000 0.000 0.144 0.195 0.000 34",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "References",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 43,
    "chunk_index": 62,
    "word_count": 395,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "Coskew Cokurt Users 836 3.728 0.221 2.821 -0.124 0.068 4.260 0.253 0.170 Nonusers 3,677 3.067 0.255 2.146 0.026 -0.069 4.463 0.328 0.247 Difference 0.661 -0.033 0.675 -0.150 0.136 -0.203 -0.075 -0.077 t-diff 6.387 -2.127 8.757 -3.616 3.578 -1.461 -1.295 -4.870 p-diff 0.000 0.034 0.000 0.000 0.000 0.144 0.195 0.000 34",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "References",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 43,
    "chunk_index": 63,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "Table 6 Regressions of Hedge Fund Risk Taking on the Use of Technical Analysis by Investor Sentiment Periods The table reports the regression results of hedge fund risk taking on the use of technical analysis after controlling for various fund characteristics and category and inception year dummies. Risk is estimated by eight measures: Total risk is the standard deviation of monthly fund returns; Market risk is the estimated coefficient of the market excess return in the Fung and Hsieh (2004) seven-factor model; Idiosyncratic risk is the standard deviation of the residuals from Fung and Hsieh’s seven-factor model; Downside risk is the beta for a fund conditional on negative market returns minus the fund’s unconditional beta; Skewness and Kurtosis are the third and fourth moments of the distribution of fund returns; Coskewness and Cokurtosis are the third and fourth co-movements of the distribution fund returns. High (low) sentiment periods refer to those months when the beginning-of-month Baker and Wurgler (2006) sentiment index is higher (lower) than the sample median. The White (1980) heteroskedasticity-robust t-statistics are shown in parentheses. ***, **, * indicate significance at the 1%, 5%, and 10% levels, respectively. Panel A: Fund Risk Taking during Whole Sample Period, 1994-2010 Total Risk Mkt Risk Idio Risk Downside Skewness Kurtosis Coskew Cokurt Technical Analysis Use 0.049 -0.022 0.133 -0.084*** 0.256*** -0.621*** -0.069 -0.109*** (0.43) (-1.40) (1.35) (-4.50) (5.67) (-2.78) (-1.28) (-5.58) Lockup Period 0.339*** 0.052*** 0.243*** -0.008 0.020 -0.264 0.053 0.057*** (3.10) (4.42) (2.63) (-0.55) (0.61) (-1.49) (0.99) (2.90) Notice Period -1.686** -0.238*** -0.989* 0.018 -0.129 4.691*** -0.043 -0.073 (-2.41) (-3.03) (-1.66) (0.20) (-0.41) (3.15) (-0.20) (-0.68) Management Fee 0.145* -0.018** 0.215*** -0.020* 0.043 -0.156 -0.033 -0.036** (1.90) (-1.98) (2.80) (-1.67) (1.58) (-1.12) (-1.27) (-2.43) Incentive Fee 0.041*** -0.002* 0.047*** -0.003** 0.019*** -0.009 -0.006** -0.004*** (4.33) (-1.71) (5.86) (-2.40) (4.29) (-0.27) (-2.51) (-2.69) High Water Mark -0.792*** -0.014 -0.562*** -0.033** -0.070 -0.118 -0.076 -0.007 (-6.73) (-1.02) (-5.83) (-2.24) (-1.49) (-0.45) (-1.21) (-0.36) Min Investment -0.188*** -0.011*** -0.163*** 0.012*** -0.033*** 0.008 0.012 -0.008 (-6.48) (-3.03) (-6.28) (2.89) (-2.60) (0.11) (0.64) (-1.53) Audit -0.486*** -0.026 -0.398*** -0.109*** -0.114* 0.479* 0.082 -0.097*** (-2.88) (-1.19) (-2.73) (-3.08) (-1.86) (1.78) (0.41) (-3.69) Leverage 0.459*** 0.016 0.416*** -0.005 0.065* -0.184 -0.086 0.008 (4.90) (1.32) (5.37) (-0.36) (1.70) (-0.91) (-1.29) (0.49) Derivatives Use -0.277** -0.021 -0.187** -0.046*** -0.009 0.100 0.012 -0.055*** (-2.53) (-1.53) (-2.06) (-3.51) (-0.21) (0.42) (0.15) (-3.25) Constant 5.900*** -0.477*** 2.558*** 0.459*** 0.206 4.004*** -0.385 -0.242 (8.47) (-3.73) (5.32) (5.15) (0.99) (5.05) (-1.21) (-1.44) Category Dummies Yes Yes Yes Yes Yes Yes Yes Yes Inception Year Dummies Yes Yes Yes Yes Yes Yes Yes Yes Number of Obs 4403 4403 4403 4403 4403 4403 4403 4403 Adjusted R-square 0.201 0.188 0.180 0.104 0.124 0.081 0.032 0.214 35",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "References",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 43,
    "chunk_index": 64,
    "word_count": 451,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "(-3.73) (5.32) (5.15) (0.99) (5.05) (-1.21) (-1.44) Category Dummies Yes Yes Yes Yes Yes Yes Yes Yes Inception Year Dummies Yes Yes Yes Yes Yes Yes Yes Yes Number of Obs 4403 4403 4403 4403 4403 4403 4403 4403 Adjusted R-square 0.201 0.188 0.180 0.104 0.124 0.081 0.032 0.214 35",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "References",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 43,
    "chunk_index": 65,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "Table 6 (continued) Panel B: Fund Risk Taking during High Sentiment Periods Total Risk Mkt Risk Idio Risk Downside Skewness Kurtosis Coskew Cokurt Technical Analysis Use -0.032 -0.054** 0.080 -0.071*** 0.201*** -0.518*** -0.249*** -0.128*** (-0.22) (-2.40) (0.60) (-2.92) (4.40) (-3.32) (-3.25) (-5.05) Lockup Period 0.635*** 0.064*** 0.448*** -0.006 0.004 -0.158 -0.062 0.080*** (4.44) (3.99) (3.40) (-0.33) (0.10) (-1.22) (-0.87) (2.62) Notice Period -2.070** -0.466*** -1.344* 0.084 0.045 0.398 0.267 -0.116 (-2.45) (-4.14) (-1.68) (0.65) (0.16) (0.38) (0.94) (-0.81) Management Fee 0.126 -0.011 0.246*** -0.030** 0.042 -0.126 -0.039 -0.046** (1.32) (-0.77) (2.74) (-1.97) (1.38) (-0.98) (-1.13) (-2.53) Incentive Fee 0.052*** -0.006*** 0.059*** -0.002 0.009** 0.028* -0.006 -0.004* (4.47) (-3.64) (5.33) (-1.30) (2.23) (1.78) (-1.60) (-1.96) High Water Mark -0.866*** -0.016 -0.493*** -0.035* -0.142*** -0.145 -0.040 -0.020 (-5.82) (-0.76) (-3.71) (-1.67) (-2.89) (-0.67) (-0.50) (-0.87) Min Investment -0.177*** 0.003 -0.172*** 0.001 -0.041*** 0.010 -0.001 -0.000 (-4.25) (0.55) (-4.88) (0.29) (-3.35) (0.19) (-0.08) (-0.06) Audit -0.623*** -0.040 -0.399** -0.063 -0.024 0.255 -0.066 -0.081** (-2.81) (-1.30) (-2.15) (-1.61) (-0.41) (1.35) (-0.47) (-2.47) Leverage 0.601*** 0.042** 0.523*** 0.013 0.082** -0.084 0.029 0.014 (5.35) (2.38) (5.14) (0.74) (2.10) (-0.61) (0.42) (0.69) Derivatives Use -0.323** -0.026 -0.177 -0.058*** 0.031 0.053 0.037 -0.081*** (-2.37) (-1.28) (-1.47) (-3.14) (0.76) (0.35) (0.40) (-3.78) Constant 3.638*** 0.188*** -0.235 1.605*** -1.196*** 5.404*** 1.333*** 0.786*** (6.83) (2.65) (-0.46) (20.58) (-5.53) (5.53) (6.57) (8.07) Category Dummies Yes Yes Yes Yes Yes Yes Yes Yes Inception Year Dummies Yes Yes Yes Yes Yes Yes Yes Yes Number of Obs 3594 3594 3594 3594 3593 3593 3594 3594 Adjusted R-square 0.185 0.162 0.160 0.083 0.129 0.125 0.040 0.212 36",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "References",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 43,
    "chunk_index": 66,
    "word_count": 263,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "(2.65) (-0.46) (20.58) (-5.53) (5.53) (6.57) (8.07) Category Dummies Yes Yes Yes Yes Yes Yes Yes Yes Inception Year Dummies Yes Yes Yes Yes Yes Yes Yes Yes Number of Obs 3594 3594 3594 3594 3593 3593 3594 3594 Adjusted R-square 0.185 0.162 0.160 0.083 0.129 0.125 0.040 0.212 36",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "References",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 43,
    "chunk_index": 67,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "Table 6 (continued) Panel C: Fund Risk Taking during Low Sentiment Periods Total Risk Mkt Risk Idio Risk Downside Skewness Kurtosis Coskew Cokurt Technical Analysis Use 0.295*** 0.006 0.292*** -0.157*** 0.089** -0.066 -0.067 -0.036** (2.82) (0.33) (3.20) (-3.62) (2.22) (-0.42) (-0.79) (-2.16) Lockup Period 0.294*** 0.041*** 0.185*** -0.035* 0.006 -0.139 0.132** 0.049*** (3.38) (3.34) (2.61) (-1.81) (0.22) (-1.36) (2.46) (3.90) Notice Period -1.770*** -0.178** -1.005* -0.427 -0.292 4.327*** -0.246 -0.088 (-2.73) (-2.01) (-1.76) (-1.27) (-1.02) (3.82) (-0.64) (-0.99) Management Fee 0.105 -0.034*** 0.199** -0.023 0.040* -0.109 -0.071** -0.042*** (1.33) (-2.75) (2.53) (-1.04) (1.70) (-1.22) (-2.05) (-3.23) Incentive Fee 0.028*** -0.002 0.032*** 0.001 0.014*** -0.025 0.004 -0.002* (3.05) (-1.41) (4.09) (0.30) (4.00) (-1.56) (0.81) (-1.82) High Water Mark -0.275*** 0.015 -0.247*** -0.054 -0.113*** -0.212 -0.019 0.033** (-2.78) (0.99) (-2.95) (-1.19) (-2.83) (-1.39) (-0.32) (2.19) Min Investment -0.162*** -0.013*** -0.144*** 0.016** 0.001 -0.057 -0.015 -0.014*** (-7.02) (-3.48) (-7.83) (2.33) (0.07) (-1.63) (-1.39) (-3.60) Audit 0.009 -0.007 -0.000 -0.148* -0.076 0.079 -0.165* -0.038 (0.06) (-0.23) (-0.00) (-1.72) (-1.19) (0.36) (-1.76) (-1.52) Leverage 0.152* 0.002 0.140** -0.065 0.058* 0.039 -0.143** 0.001 (1.88) (0.17) (2.10) (-1.17) (1.65) (0.29) (-2.52) (0.09) Derivatives Use -0.078 -0.022 -0.031 0.029 -0.009 -0.316** -0.007 -0.033** (-0.91) (-1.41) (-0.45) (0.62) (-0.23) (-1.97) (-0.15) (-2.29) Constant 3.597*** -0.579*** 1.408** 0.953*** 0.147 2.143*** -0.127 -0.494*** (5.51) (-2.96) (2.49) (2.71) (1.09) (4.68) (-0.50) (-2.59) Category Dummies Yes Yes Yes Yes Yes Yes Yes Yes Inception Year Dummies Yes Yes Yes Yes Yes Yes Yes Yes Number of Obs 3839 3839 3839 3839 3839 3839 3839 3839 Adjusted R-square 0.216 0.150 0.201 0.045 0.065 0.051 0.028 0.174 37",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "References",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 43,
    "chunk_index": 68,
    "word_count": 263,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "(-2.96) (2.49) (2.71) (1.09) (4.68) (-0.50) (-2.59) Category Dummies Yes Yes Yes Yes Yes Yes Yes Yes Inception Year Dummies Yes Yes Yes Yes Yes Yes Yes Yes Number of Obs 3839 3839 3839 3839 3839 3839 3839 3839 Adjusted R-square 0.216 0.150 0.201 0.045 0.065 0.051 0.028 0.174 37",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "References",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 43,
    "chunk_index": 69,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "Table 7 Use of Technical Analysis and Hedge Fund Timing Ability by Investor Sentiment Periods This table compares the timing ability (in percent) of technical analysis users and nonusers among hedge funds in high and low sentiment periods as well as over the full sample period of 1994-2010. In Panel A, we estimate market, volatility, and liquidity timing separately as in Equations 5-7. In Panel B, we estimate market, volatility, and liquidity timing jointly with the Fung and Hsieh (2004) seven-factor model as in Equation 8. High (low) sentiment periods refer to those months when the beginning-of-month Baker and Wurgler (2006) sentiment index is higher (lower) than the sample median. t-diff is the t-statistic from the test of whether the difference of means is zero, and p-diff is the associated p-value. Panel A: Market, Volatility, and Liquidity Timing Abilities Estimated Separately Entire Period, 1994-2010 High Sentiment Periods Low Sentiment Periods Obs Market Volatility Liquidity Obs Market Volatility Liquidity Obs Market Volatility Liquidity Users 981 0.445 -0.853 0.314 816 1.338 -0.913 0.393 836 -1.398 -1.158 1.114 Nonusers 4,154 -0.522 -0.108 -0.189 3,199 -0.002 -0.167 -0.558 3,677 -0.658 -0.084 0.831 Difference 0.967 -0.744 0.503 1.341 -0.747 0.951 -0.741 -1.074 0.284 t-diff 7.335 -5.286 5.020 5.547 -3.447 4.261 -3.168 -3.749 2.127 p-diff 0.000 0.000 0.000 0.000 0.001 0.000 0.002 0.000 0.033 Panel B: Market, Volatility, and Liquidity Timing Abilities Estimated Jointly with the Fung and Hsieh 7-factor Model Entire Period, 1994-2010 High Sentiment Periods Low Sentiment Periods Obs Market Volatility Liquidity Obs Market Volatility Liquidity Obs Market Volatility Liquidity Users 981 -0.019 -0.670 -0.171 816 0.653 0.084 -0.672 836 -3.167 -2.356 -0.087 Nonusers 4,154 -0.450 -0.456 -0.355 3,199 -0.254 -0.284 -0.880 3,677 -1.024 -0.396 0.066 Difference 0.368 -0.214 0.320 0.907 0.368 0.208 -2.142 -1.960 -0.153 t-diff 2.517 -1.162 1.860 1.717 0.831 1.103 -3.357 -3.051 0.555 p-diff 0.012 0.246 0.063 0.086 0.406 0.270 0.001 0.002 0.578 38",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "References",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 43,
    "chunk_index": 70,
    "word_count": 313,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "0.084 -0.672 836 -3.167 -2.356 -0.087 Nonusers 4,154 -0.450 -0.456 -0.355 3,199 -0.254 -0.284 -0.880 3,677 -1.024 -0.396 0.066 Difference 0.368 -0.214 0.320 0.907 0.368 0.208 -2.142 -1.960 -0.153 t-diff 2.517 -1.162 1.860 1.717 0.831 1.103 -3.357 -3.051 0.555 p-diff 0.012 0.246 0.063 0.086 0.406 0.270 0.001 0.002 0.578 38",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "References",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 43,
    "chunk_index": 71,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "Table 8 Regressions of Hedge Fund Timing Ability on the Use of Technical Analysis by Investor Sentiment Periods The table reports the regression results of hedge fund timing ability (in percentage) on the use of technical analysis after controlling for various fund characteristics and category and inception year dummies. We estimate market, volatility, and liquidity timing separately as in Equations 5-7. High (low) sentiment periods refer to those months when the beginning-of-month Baker and Wurgler (2006) sentiment index is higher (lower) than the sample median. The White (1980) heteroskedasticity-robust t-statistics are shown in parentheses. ***, **, * indicate significance at the 1%, 5%, and 10% levels, respectively. Entire Period, 1994-2010 High Sentiment Periods Low Sentiment Periods Market Volatility Liquidity Market Volatility Liquidity Market Volatility Liquidity Technical Analysis Use 0.470*** -0.197 0.056 0.747** -0.115 0.136 -0.309 -0.603 0.120 (3.05) (-1.14) (0.44) (2.30) (-0.43) (0.69) (-1.15) (-1.45) (0.68) Lockup Period -0.098 0.277 0.049 0.046 0.053 -0.071 -0.060 0.038 0.032 (-0.61) (0.99) (0.67) (0.18) (0.31) (-0.68) (-0.32) (0.11) (0.33) Notice Period 0.254 1.911** -1.726*** -1.865 3.190 -0.740 2.998** 0.674 0.028 (0.34) (2.31) (-3.14) (-1.10) (1.32) (-0.72) (2.22) (0.51) (0.04) Management Fee 0.085 -0.335** 0.132 0.132 -0.467*** 0.176 0.158 -0.214 0.261* (0.97) (-2.53) (1.34) (0.83) (-2.67) (0.92) (0.92) (-1.16) (1.84) Incentive Fee 0.017 -0.020** -0.004 0.012 -0.006 0.006 -0.004 -0.012 -0.010 (1.61) (-2.07) (-0.42) (0.70) (-0.43) (0.28) (-0.19) (-0.48) (-0.80) High Water Mark 0.145 -0.128 0.116 0.337 -0.181 -0.105 0.017 0.396 -0.054 (1.09) (-0.97) (1.19) (1.46) (-0.88) (-0.56) (0.07) (1.52) (-0.41) Min Investment -0.087* 0.077 -0.011 -0.047 0.002 -0.005 -0.008 -0.037 -0.013 (-1.84) (0.95) (-0.51) (-0.62) (0.03) (-0.10) (-0.15) (-0.41) (-0.45) Audit 0.634** -0.409 0.154 0.319 -0.182 -0.665 1.107** -1.066 0.716** (2.42) (-1.51) (0.68) (0.86) (-0.46) (-0.88) (2.02) (-1.17) (2.13) Leverage 0.112 0.014 0.085 -0.144 0.202 0.081 0.121 0.425 0.081 (0.92) (0.10) (0.95) (-0.68) (0.94) (0.67) (0.56) (1.63) (0.69) Derivatives Use 0.335*** -0.231* 0.186* 0.636*** -0.461** 0.203 -0.112 -0.122 -0.099 (2.84) (-1.91) (1.79) (3.03) (-2.24) (1.50) (-0.49) (-0.43) (-0.78) Constant -2.566*** 1.202 -1.385** -10.184*** 38.355*** 1.215* -7.714 0.984 -3.186** (-4.03) (1.10) (-2.43) (-11.00) (46.08) (1.88) (-1.42) (0.44) (-2.28) Category Dummies Yes Yes Yes Yes Yes Yes Yes Yes Yes Inception Year Dummies Yes Yes Yes Yes Yes Yes Yes Yes Yes Number of Obs 4403 4403 4403 3594 3594 3594 3839 3839 3839 Adjusted R-square 0.062 0.046 0.044 0.064 0.053 0.040 0.045 0.025 0.042 39",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "References",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 43,
    "chunk_index": 72,
    "word_count": 391,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "(-1.42) (0.44) (-2.28) Category Dummies Yes Yes Yes Yes Yes Yes Yes Yes Yes Inception Year Dummies Yes Yes Yes Yes Yes Yes Yes Yes Yes Number of Obs 4403 4403 4403 3594 3594 3594 3839 3839 3839 Adjusted R-square 0.062 0.046 0.044 0.064 0.053 0.040 0.045 0.025 0.042 39",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "References",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 43,
    "chunk_index": 73,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "Table 9 Regressions of Hedge Fund Performance on the Use of Technical and Fundamental Analysis by Investor Sentiment Periods The table reports the regression results of hedge fund performance (in percentage) on the use of technical and fundamental analysis after controlling for various fund characteristics and category and inception year dummies. Performance is measured by average monthly return (Ave Ret), the Carhart (1997) four-factor alpha (Alpha4), and the Fung and Hsieh (2004) seven-factor alpha (Alpha 7), respectively. High (low) sentiment periods refer to those months when the beginning-of-month Baker and Wurgler (2006) sentiment index is higher (lower) than the sample median. The White (1980) heteroskedasticity-robust t-statistics are shown in parentheses. ***, **, * indicate significance at the 1%, 5%, and 10% levels, respectively. Entire Period, 1994-2010 High Sentiment Periods Low Sentiment Periods Ave Ret Alpha4 Alpha7 Ave Ret Alpha4 Alpha7 Ave Ret Alpha4 Alpha7 Technical Analysis Use 0.005 0.051 0.053 0.158*** 0.108** 0.123** -0.105** -0.122** -0.017 (0.14) (1.46) (1.38) (2.88) (2.27) (2.25) (-2.25) (-2.39) (-0.29) Fundamental Analysis Use 0.036 -0.031 -0.038 -0.149*** -0.119*** -0.118*** 0.153*** 0.078** 0.009 (1.32) (-1.09) (-1.27) (-3.04) (-2.89) (-2.65) (3.88) (1.97) (0.22) Lockup Period 0.066*** 0.030 0.033 -0.086* -0.022 0.011 0.137*** 0.053* 0.089** (2.72) (1.42) (1.27) (-1.86) (-0.57) (0.29) (3.55) (1.85) (2.39) Notice Period 0.458** 0.617*** 0.326 0.767** 0.901*** 0.707** -0.103 0.156 -0.140 (2.06) (2.93) (1.37) (2.24) (3.07) (2.01) (-0.31) (0.53) (-0.40) Management Fee 0.005 -0.008 -0.030 -0.004 0.016 -0.031 0.036 0.034 0.031 (0.15) (-0.24) (-1.06) (-0.10) (0.52) (-0.84) (1.05) (1.02) (0.92) Incentive Fee 0.011*** 0.008*** 0.009*** 0.018*** 0.006 0.008* 0.001 0.005 0.005 (4.16) (3.02) (2.97) (3.87) (1.60) (1.85) (0.26) (1.41) (1.35) High Water Mark 0.034 0.043 0.081** -0.085 0.050 0.128*** -0.016 -0.044 0.021 (1.06) (1.34) (2.28) (-1.60) (1.13) (2.65) (-0.36) (-0.99) (0.44) Min Investment 0.010 0.022** 0.011 0.034** 0.056*** 0.042*** -0.020 0.012 -0.016 (1.06) (2.47) (1.09) (2.36) (4.81) (3.07) (-1.59) (1.20) (-1.12) Audit 0.220*** 0.353*** 0.267*** 0.043 0.258*** 0.297*** 0.285*** 0.286*** 0.254*** (4.34) (6.90) (5.43) (0.54) (3.21) (3.42) (4.05) (3.17) (2.93) Leverage 0.001 0.001 -0.008 0.035 0.031 -0.016 -0.044 -0.076** -0.070* (0.02) (0.02) (-0.27) (0.76) (0.89) (-0.39) (-1.16) (-2.22) (-1.79) Derivatives Use 0.075*** 0.061** 0.100*** 0.172*** 0.095** 0.092** -0.065 -0.057 0.011 (2.74) (2.29) (3.56) (3.45) (2.37) (1.98) (-1.61) (-1.54) (0.27) Constant 0.059 -0.128 -0.141 0.146 -0.593*** -1.516*** -0.567** 0.747* 0.120 (0.42) (-0.63) (-0.75) (0.71) (-3.34) (-8.59) (-2.04) (1.67) (0.60) Category Dummies Yes Yes Yes Yes Yes Yes Yes Yes Yes Inception Year Dummies Yes Yes Yes Yes Yes Yes Yes Yes Yes Number of Obs 4403 4403 4403 3594 3594 3594 3839 3839 3839 Adjusted R-square 0.089 0.088 0.071 0.146 0.054 0.044 0.124 0.068 0.049 40",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "References",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 43,
    "chunk_index": 74,
    "word_count": 431,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "(-2.04) (1.67) (0.60) Category Dummies Yes Yes Yes Yes Yes Yes Yes Yes Yes Inception Year Dummies Yes Yes Yes Yes Yes Yes Yes Yes Yes Number of Obs 4403 4403 4403 3594 3594 3594 3839 3839 3839 Adjusted R-square 0.089 0.088 0.071 0.146 0.054 0.044 0.124 0.068 0.049 40",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "References",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 43,
    "chunk_index": 75,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "Table 10 Robustness Checks: Use of Technical Analysis and Hedge Fund Performance by Investor Sentiment Periods The table provides robustness tests on the performance (in percentage) differences of technical analysis users and nonusers among hedge funds in high and low sentiment periods as well as over the entire sample period. Performance is estimated by three measures: Ave Ret is the average monthly hedge-fund return, Alpha4 is the Carhart (1997) four-factor alpha, and Alpha7 is the Fung and Hsieh (2004) seven-factor alpha. High (low) sentiment periods refer to those months when the beginning-of-month Baker and Wurgler (2006) sentiment index is higher (lower) than the sample median. In Panel A, the results are obtained from a recent sample period of 2003-2010. In Panel B, performance is estimated based on pre- fee hedge fund returns. In Panel C, we classify high and low sentiment periods on a rolling basis using the median sentiment level over the previous 10 years. t-diff is the t-statistic from the test of whether the difference of means is zero, and p-diff is the associated p-value. Panel A: Recent Sample Period of 2003-2010 Entire Recent Sample, 2003-2010 High Sentiment Periods Low Sentiment Periods Obs Ave Ret Alpha4 Alpha7 Obs Ave Ret Alpha4 Alpha7 Obs Ave Ret Alpha4 Alpha7 Users 752 0.580 0.205 0.312 532 0.300 -0.067 0.332 724 0.808 0.232 0.453 Nonusers 3,635 0.469 0.146 0.175 2,497 -0.228 -0.163 0.089 3,446 1.020 0.435 0.469 Difference 0.111 0.060 0.137 0.528 0.095 0.243 -0.212 -0.203 -0.017 t-diff 3.335 1.932 3.849 8.083 2.192 4.763 -4.556 -5.246 -0.360 p-diff 0.001 0.053 0.000 0.000 0.029 0.000 0.000 0.000 0.719 Panel B: Pre-fee Hedge Fund Returns Entire Sample, 1994-2010 High Sentiment Periods Low Sentiment Periods Obs Ave Ret Alpha4 Alpha7 Obs Ave Ret Alpha4 Alpha7 Obs Ave Ret Alpha4 Alpha7 Users 981 0.690 0.329 0.390 816 0.549 0.152 0.374 836 0.941 0.393 0.549 Nonusers 4,137 0.588 0.263 0.304 3,185 0.075 0.014 0.242 3,661 1.112 0.568 0.586 Difference 0.102 0.066 0.086 0.474 0.138 0.132 -0.172 -0.175 -0.037 t-diff 3.305 2.169 2.647 8.767 3.279 2.907 -4.090 -4.295 -0.832 p-diff 0.001 0.030 0.008 0.000 0.001 0.004 0.000 0.000 0.406 Panel C: Rolling Sentiment (based on the Median of Previous 10-year Sentiments) Entire Sample, 1994-2010 High Sentiment Periods Low Sentiment Periods Obs Ave Ret Alpha4 Alpha7 Obs Ave Ret Alpha4 Alpha7 Obs Ave Ret Alpha4 Alpha7 Users 981 0.529 0.169 0.230 823 0.306 -0.060 0.164 887 0.862 0.294 0.492 Nonusers 4,154 0.447 0.124 0.164 3,311 -0.183 -0.177 0.059 3,827 1.093 0.503 0.509 Difference 0.082 0.046 0.066 0.488 0.117 0.106 -0.231 -0.209 -0.017 t-diff 2.702 1.535 2.056 8.531 2.642 2.128 -4.651 -5.229 -0.342 p-diff 0.007 0.125 0.040 0.000 0.008 0.033 0.000 0.000 0.733 41",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "References",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 43,
    "chunk_index": 76,
    "word_count": 444,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "-0.060 0.164 887 0.862 0.294 0.492 Nonusers 4,154 0.447 0.124 0.164 3,311 -0.183 -0.177 0.059 3,827 1.093 0.503 0.509 Difference 0.082 0.046 0.066 0.488 0.117 0.106 -0.231 -0.209 -0.017 t-diff 2.702 1.535 2.056 8.531 2.642 2.128 -4.651 -5.229 -0.342 p-diff 0.007 0.125 0.040 0.000 0.008 0.033 0.000 0.000 0.733 41 Table 11 Use of Technical Analysis, Sentiment Levels, and Hedge Fund Performance The table reports the panel regression results of monthly hedge fund returns (in excess of risk free rate) on the beginning-of-month sentiment level, the use of technical analysis, and the interaction of these two terms, controlling for various fund characteristics and category dummies. Models 1 and 2 are estimated using our entire sample of hedge funds. Models 3 and 4 are estimated using the hedge funds sample excluding Managed Futures, Fixed Income Arbitrage, and Global Macro. The White (1980) heteroskedasticity-robust t-statistics are shown in parentheses. ***, **, * indicate significance at the 1%, 5%, and 10% levels, respectively. Variable Model 1 Model 2 Model 3 Model 4 Sentiment Level -0.980*** -0.986*** -1.029*** -1.045*** (-41.36) (-41.63) (-41.37) (-42.04) Technical Analysis Use 0.019 0.002 -0.023 0.006 (0.75) (0.09) (-0.86) (0.22) Sentiment Level * Technical Analysis Use 0.263*** 0.264*** 0.173*** 0.168*** (5.16) (5.19) (3.11) (3.03) Lockup Period 0.059*** 0.045** (2.83) (2.16) Notice Period 0.462*** 0.414*** (3.29) (2.80) Management Fee -0.009 -0.021 (-0.46) (-0.91) Incentive Fee 0.010*** 0.009*** (5.31) (4.53) High Water Mark -0.143*** -0.188*** (-6.05) (-7.40) Min Investment -0.000 -0.000 (-0.98) (-1.39) Audit 0.214*** 0.139*** (5.22) (3.17) Leverage 0.043** 0.055*** (2.06) (2.58) Derivatives Use 0.074*** 0.070*** (3.34) (3.05) Constant -0.304* -0.146 (-1.71) (-0.81) Category Dummies Yes Yes Yes Yes Number of Obs 270,530 269,501 229,680 228,907 Adjusted R-square 0.009 0.010 0.011 0.012 42",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "References",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 43,
    "chunk_index": 77,
    "word_count": 282,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  },
  {
    "text": "-0.188*** (-6.05) (-7.40) Min Investment -0.000 -0.000 (-0.98) (-1.39) Audit 0.214*** 0.139*** (5.22) (3.17) Leverage 0.043** 0.055*** (2.06) (2.58) Derivatives Use 0.074*** 0.070*** (3.34) (3.05) Constant -0.304* -0.146 (-1.71) (-0.81) Category Dummies Yes Yes Yes Yes Number of Obs 270,530 269,501 229,680 228,907 Adjusted R-square 0.009 0.010 0.011 0.012 42",
    "title": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry",
    "source_type": "pdf",
    "document_id": "08debafe9caa",
    "source_file": "Sentiment and the Effectiveness of Technical Analysis Evidence from the Hedge Fund Industry.pdf",
    "section": "References",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 43,
    "chunk_index": 78,
    "word_count": 50,
    "author": "Wang, Ying",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140524105341+08'00'",
    "duration": null
  }
]