[
  {
    "text": "Smart Retail Traders, Short Sellers, and Stock Returns Ekkehart Boehmer and Wanshan Song October 23, 2020 Abstract Using short sell transactions data from 2010 to 2016, this paper is the first to provide a comprehensive sample of short selling initiated by retail investors. We find that retail short selling can predict negative stock returns. A trading strategy that mimics weekly retail shorting earns an annualized risk-adjusted value-(equal-) weighted return of 6% (12.25%). Their predictive power is beyond that coming from retail investors as a group or from off-exchange institutional short sellers. Our results suggest that retail short sellers can profitably exploit public information, especially when it is negative. Retail short sellers also tend to be contrarians who provide liquidity when the market is one-sided due to (institutional) buying pressure. Ekkehart Boehmer: eboehmer@smu.edu.sg, Singapore Management University. Wanshan Song: songwanshan@mail.shufe.edu.cn, Shanghai University of Finance and Economics. We are grateful to Eric Kelley, David Hirshleifer, Kathleen Hanley, Zhe Zhang, Weikai Li, and other seminar participants at Singapore Management University, University of California Irvine, Lehigh University, Auburn University, Shanghai University of Finance and Economics, and Fudan University for their helpful comments. 1 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 55,
    "chunk_index": 0,
    "word_count": 193,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "Economics. We are grateful to Eric Kelley, David Hirshleifer, Kathleen Hanley, Zhe Zhang, Weikai Li, and other seminar participants at Singapore Management University, University of California Irvine, Lehigh University, Auburn University, Shanghai University of Finance and Economics, and Fudan University for their helpful comments. 1 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "1. Introduction",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 55,
    "chunk_index": 1,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "In the academic world, short sellers are generally regarded as informed traders who help promote price discovery and supply liquidity. Boehmer, Jones, and Zhang (2008) attribute most of the price discovery that accrues with short selling to institutional traders rather than retail short sellers. Yet, because of data limitations, it is difficult to generate large-sample evidence on this issue. The main role that retail short sellers play remains ambiguous. Earlier literature suggests that retail investors are noise traders who do not contribute to price discovery (Odean, 1998; Barber and Odean, 2000; 2001; 2008), but recent literature disagrees with this view (Kaniel, Saar, and Titman, 2008; Kaniel, Liu, Saar, and Titman, 2012; Kelley and Tetlock, 2013; Barrot, Kaniel, and Sraer, 2016; Boehmer, Jones, Zhang, and Zhang, 2019). Here, we examine whether retail traders’ short selling can account for the information reflected by retail trades. We examine retail short sellers, a new, yet understudied, group of traders. Our sample starts with FINRA TRF transaction-level short-sale data, which must be reported to the public since September 20091. This dataset includes transaction time (in seconds), share price, and number of shares for every off-exchange short sale transaction in an exchange-listed stock, and is a subset of the transactions reported in the daily TAQ (exchange code “D”). In addition, a review of the order routing disclosures required by Rule 606 of Regulation NMS reveals that nearly all retail orders are routed to off-exchange market makers2 and reported to FINRA TRFs. By combining these two observations, we can identify retail short-selling as a subset of FINRA TRF dataset. Overall, we provide new evidence on the sources of price discovery and liquidity provision. 1 FINRA’s website includes two types of data: The first is the “daily file” that includes aggregate daily short volume for each firm. The second is the “monthly file” that includes transaction-by-transaction detail of short sale trades reported to the consolidated tape. To look at transaction price of each short sell transaction that happened off-exchange, we use the monthly file. 2 See “SEC 2010 Concept Release on Equity Market Structure”. 2 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "1. Introduction",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 55,
    "chunk_index": 2,
    "word_count": 352,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "the “monthly file” that includes transaction-by-transaction detail of short sale trades reported to the consolidated tape. To look at transaction price of each short sell transaction that happened off-exchange, we use the monthly file. 2 See “SEC 2010 Concept Release on Equity Market Structure”. 2 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "1. Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 55,
    "chunk_index": 3,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "Boehmer, Jones, Zhang, and Zhang (2019) document that the OTC market makers generally provide retail orders with a small price improvement. Exploiting this observation, they identify retail trades from TAQ data and find that they are quite informed, but the precise nature of retail investors’ information remains unclear. Moreover, the existence and the role of retail short sellers are not clear either. In this paper, we dissect the joint presence of short sellers, retail traders (including retail short sellers) and other over-the-counter trading that we mostly attribute to dark pool trading by exploiting this novel comprehensive short sell transaction level dataset. We also ask which traders’ order flows are related to liquidity provision and which to price discovery. Additionally, we highlight the heterogeneity among retail investors and address the effect of trading platforms and the degree of immediacy that either side of the trade demands. Our results are consistent with the information hypothesis: retail short sellers have and act on unique information beyond that coming from other investors, but they are also consistent with strategic liquidity provision that retail short sellers provide to other traders in one-sided markets. This paper is the first to construct a comprehensive sample and provide evidence of retail short selling. Exploiting short sell transaction data provided by FINRA, we identify marketable retail short sell orders as those short sale orders that experience sub-penny price improvement compared to the national best bid and offer. Our sample is from January 2010 to December 2016 and includes total 5,332 stocks, with an average of 3,532 stocks each day. On average, retail short sellers trade 7,925 shares per stock-day, which is around 10.92% of retail trading, 6.36% of off-exchange short selling, and about 0.78% of total trading volumes. We find that retail short sales significantly predict negative future returns. A portfolio that mimics weekly retail shorting earns a risk-adjusted value-(equal-) weighted return of 3 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "1. Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 55,
    "chunk_index": 4,
    "word_count": 320,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "which is around 10.92% of retail trading, 6.36% of off-exchange short selling, and about 0.78% of total trading volumes. We find that retail short sales significantly predict negative future returns. A portfolio that mimics weekly retail shorting earns a risk-adjusted value-(equal-) weighted return of 3 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "1. Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 55,
    "chunk_index": 5,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "0.024% (0.049%) during the next 20 trading days, or 6% (12.25%) annualized. Using a cross- sectional regression, we find that most of the predictive power survives after controlling for firm characteristics, such as firm size, book to market, turnover, volatility, and past returns. The predictive power also remains significant after controlling for the trading activity of other presumably informed traders. Specifically, we control for the order imbalance of retail investors, defined as retail buy volumes minus retail long sell volumes. We also control for other off-exchange short sales, which mostly reflect shorting in dark pools by non-retail traders. The results suggest that retail short sellers are informed traders. But are there any differences between retail investors’ overall trades and their short sales? Retail investors who are able to sell short stocks may be different from the typical retail investors, who do not necessarily have margin accounts that allow short selling (Gamble and Xu, 2017). To address this question, we conduct double sorts. The first sort is on retail trading and the second sort is on retail shorting. This approach provides portfolios that vary in terms of retail shorting activity but hold constant the level of overall (other) retail trading. We find that retail short selling can predict future negative returns in each of the five quintile portfolios, suggesting that retail short sellers have additional information over the information that retail investors have in general. In addition, we use cross-sectional regressions to test whether retail short sellers trade the same particular types of firms as other retail traders do. The results show that retail short sellers can predict returns in all market cap and liquidity groups that we employ. The predictions of retail short sellers are stronger for liquid stocks. In contrast, other (non-short) retail traders can better predict small-cap and illiquid stocks, but they have less predictive power for returns of large-cap and liquid stocks. This is different from the typical retail investors who tend to have an information advantage in small firms. In contrast, retail short sellers’ predictive power is of similar strength across size portfolios. 4 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "1. Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 55,
    "chunk_index": 6,
    "word_count": 353,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "they have less predictive power for returns of large-cap and liquid stocks. This is different from the typical retail investors who tend to have an information advantage in small firms. In contrast, retail short sellers’ predictive power is of similar strength across size portfolios. 4 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 55,
    "chunk_index": 7,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "How should we interpret the observation that retail short sellers as a group seem to be able to predict stock returns? We consider two alternative explanations about retail shorting and stock prices to shed light on these issues. First, retail short sellers are informed traders who are at least as sophisticated as institutional short sellers. In this view, retail short sellers have access to public information that they can exploit in their trading. They benefit as this information is fully incorporated into stock prices (Christophe, Ferri, and Angel, 2004; Engelberg, Reed, and Ringgenberg, 2012; Boehmer, Jones, Wu, and Zhang, 2020). To test this hypothesis, we select a sample of news related to corporate earnings’ information and analysts’ information. By separating days when there is news from those days when there is no news, we find that retail short sellers’ predictive power for next week’s return doubles on news days compared to non-news days. Next, we select the days with only negative news announcement, including the days with negative unexpected earnings’ surprises, analyst recommendation downgrades, and negative analyst earnings revision. We find that retail short sellers have greater predictive power on negative news days. Specifically, the prediction of retail short selling on negative news days is -0.074%, which is up to 5 times more informative about the cross-section of next week’s return compared to other days. The prediction for next month’s return on negative news days is -0.119%, which doubles compared with other non- negative news days. Put differently, negative news announcements cover around 16.3% of all the underperformance related to retail shorting. We test the differences in information advantage among the group of retail investors. There is no evidence that other retail traders (other than retail short sellers) act on such public information. Aside from an information advantage, retail short selling has another potential explanation. This second hypothesis is related to liquidity provision. According to this story, retail short sellers step in and trade against buying pressure in the market when buyers are more aggressive. As the buying pressure subsides, prices revert to fundamental values and short 5 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 55,
    "chunk_index": 8,
    "word_count": 353,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "potential explanation. This second hypothesis is related to liquidity provision. According to this story, retail short sellers step in and trade against buying pressure in the market when buyers are more aggressive. As the buying pressure subsides, prices revert to fundamental values and short 5 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 55,
    "chunk_index": 9,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "sellers cover their positions and earn negative (i.e., profitable) returns. In this view, retail short sellers’ trading patterns and their predictive power result from gradual reversals of price pressures (Nagel, 2012; Diether, et al., 2009; Comerton-Forde, et al., 2016; Arif, et al., 2020). To test whether the liquidity-provision argument is consistent with the data, we first look at the sensitivity of past returns to retail shorts. We find that retail short sellers are strong contrarians. High retail shorting follows positive past returns, suggesting that retail short sellers step in to initiate or increase their shorting positions after prices rise. This is broadly consistent with liquidity provision. Second, we directly look at the relation between retail short sellers and contemporaneous and past buying pressure. When there is greater overall buying pressure (defined as a positive Lee and Ready (1991) order imbalance), retail short sellers increase their positions. By dividing overall buying pressure into retail buying pressure (defined as a positive retail order imbalance, excluding retail short sells) and institutional buying pressure (defined as a positive Lee and Ready order imbalance, but excluding the retail order imbalance), retail short sellers increase their activities more with contemporaneous institutional buying pressure. Both retail short sellers and institutional buying pressures are related with subsequent negative stock returns. This observation is also consistent with the liquidity provision story: Retail short sellers step in to provide liquidity to impatient institutional buyers when there is temporary contemporaneous price pressure. Next, we more directly address the question whether retail short sellers’ orders relate to new information and when they relate to liquidity provision. We isolate the relation between informed retail short selling and returns on news days from the relation on non-news days. On non-news days, return reversals are known to be larger than on news days (Tetlock, 2010). Results indicate that retail short sell orders are less contrarian relative to past returns on days 6 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 55,
    "chunk_index": 10,
    "word_count": 322,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "selling and returns on news days from the relation on non-news days. On non-news days, return reversals are known to be larger than on news days (Tetlock, 2010). Results indicate that retail short sell orders are less contrarian relative to past returns on days 6 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "1. Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 55,
    "chunk_index": 11,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "with news releases. Next, we separate the relation between retail short selling and returns on the stocks with positive buying pressures from the stocks without buying pressures. Results show that retail short sell orders are more contrarian relative to past returns on stocks with positive buying pressure. Taken together, retail short sellers provide liquidity in response to liquidity shocks in the absence of news releases and in the presence of price pressure in market. Closely related papers that discuss retail short selling are Boehmer, Jones, and Zhang (2008) and Kelley and Tetlock (2017). BJZ (2008) study retail short sales that are executed on the New York Stock Exchange. But for retail orders, brokers tend to internalize their orders or route unwanted orders to wholesalers. Brokers are not likely to route retail orders to registered exchanges. In addition, BJZ (2008) show that informed short selling comes mainly from institutions while informed retail shorts are insignificant. In a related paper, Kelley and Tetlock (2017) also look at the relationship between retail short sales and their predictive power for future returns. Like us, KT (2017) also document a negative relationship between retail shorting and returns. But compared with their paper, our paper differs in three important ways. First, KT (2017) use older data that rely on only one brokerage, which may limit inferences. Moreover, our data set is produced on an ongoing basis and regulators seem to be intent to have the relevant trading locations produce it for now. We find that retail short selling better predicts institutional trading than retail trading, especially when there is large institutional buying pressure. Second, KT (2017) are moot regarding liquidity supply by retail short selling. Yet, it is important to understand whether retail short sellers really trade on information or act as liquidity providers. KT’s (2017) data do not allow them to address this issue. With our data, we find that retail short sellers are quite skilled at predicting institutional demand. Retail short 7 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "1. Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 55,
    "chunk_index": 12,
    "word_count": 333,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "to understand whether retail short sellers really trade on information or act as liquidity providers. KT’s (2017) data do not allow them to address this issue. With our data, we find that retail short sellers are quite skilled at predicting institutional demand. Retail short 7 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "1. Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 55,
    "chunk_index": 13,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "sellers trade into this demand and seem to earn a reward for providing liquidity. In contrast to KT’s (2017) result that retail short selling best predicts retail trading, we show that retail traders benefit significantly by trading on the other side from institutional traders. Third, we address the effect of dark pool trading and the degree of immediacy that the either side of the trade demands. When predicting next week’s returns, retail short sellers generate more explanatory power than institutional short sellers. However, when predicting next month’s returns, institutional short sellers predict future returns more successfully in dark pools. This is consistent with Zhu (2014), who shows that informed exchanges are more attractive to informed traders, and dark pools are more attractive to uninformed traders. So, if short sellers value immediacy and have short lived information, they will route the orders to one of the exchanges rather than to a dark pool. Overall, this paper is the first to use a broad, publicly available dataset to study the trading decisions of retail short sellers. We analyze marketable short sell orders from retail traders in the U.S. equity market between 2010 and 2016. We find that retail short sales are integral to both price discovery and liquidity provision. Retail short sellers have distinct predictive powers beyond those coming from other informed traders in general. This paper is organized as follows. Section 2 describes the data sources and sample construction. Section 3 contains portfolio results, including a comparison between retail short selling and other retail trading. Section 4 presents the main cross-sectional regressions in which we use retail short sales to predict returns. Section 5 provides analysis to disentangle the information advantage hypothesis from the liquidity provision hypothesis. Section 6 concludes. 8 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "1. Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 55,
    "chunk_index": 14,
    "word_count": 295,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "comparison between retail short selling and other retail trading. Section 4 presents the main cross-sectional regressions in which we use retail short sales to predict returns. Section 5 provides analysis to disentangle the information advantage hypothesis from the liquidity provision hypothesis. Section 6 concludes. 8 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "1. Introduction",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 55,
    "chunk_index": 15,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "2. Data 2.1. Sample Construction We obtain retail short sell transactions level data from two sources: retail transactions data from the daily Trade and Quote (TAQ) database and short sell transactions data from the Financial Industry Regulatory Authority (FINRA). First, we follow Boehmer et al. (2019) to identify retail transactions in the data. In the U.S., most equity trades initiated by retail investors do not take place on registered exchanges. Instead, they are executed either by wholesalers (e.g., Citadel, Jump) or via brokers internalization (e.g., Charles Schwab, TD Ameritrade). Orders executed in one of these ways are reported to FINRA’s Trade Reporting Facility (TRF), which will show up in TAQ with exchange code “D.” In addition, as a part of routing process, brokers or wholesalers will generally provide retail orders with sub-penny price improvement over a round penny. Therefore, retail sales are filled with prices just above a round penny, and retail purchases are filled with prices just below a round penny. In contrast, institutional orders that are sent to exchanges or dark pools are prohibited from using fractional pennies. There is one exception that allows institutional participants to print crossing network execution as fractional pennies (i. e., 0.5 pennies). Therefore, we select the trades in TAQ data with exchange code “D” that additionally receive sub-penny price improvement. For 𝑃 , 𝑍 = 100∗𝑚𝑜𝑑(𝑃 ,0.01). If 𝑖,𝑡 𝑖,𝑡 𝑖,𝑡 𝑍 is in the interval (0, 0.4), we mark it as a retail seller-initiated transaction. If 𝑍 is in the 𝑖,𝑡 𝑖,𝑡 interval (0.6, 1), it is a retail buyer-initiated transaction. The second data source, available from FINRA, makes off-exchange short sell transactions public. To increase the transparency of short-sale transactions, after the financial crisis, the Securities and Exchange Commission (SEC) has required self-regulatory 9 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "1. Introduction",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 55,
    "chunk_index": 16,
    "word_count": 299,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "𝑖,𝑡 𝑖,𝑡 interval (0.6, 1), it is a retail buyer-initiated transaction. The second data source, available from FINRA, makes off-exchange short sell transactions public. To increase the transparency of short-sale transactions, after the financial crisis, the Securities and Exchange Commission (SEC) has required self-regulatory 9 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "1. Introduction",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 55,
    "chunk_index": 17,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "organizations (SROs)3 to provide short sell transactions on their website. This includes the FINRA Trade Reporting Facility (TRF)4 that provides a mechanism for the reporting of short- sell transactions that take place OTC rather than on an exchange. The FINRA website provides detailed off-exchange short sale transactions from the ‘consolidated tape.’ The data cover the period from September 2009 to 2020 and include a market center identifier (Nasdaq TRF, NYSE, TRF, or ADF),5 stock symbol, date, time, price, volume, and trader type (exempt or nonexempt from short sell rule). The FINRA short sale data are a sub-sample of off-exchange transaction data reported in the daily TAQ (exchange code “D”). This paper is one of the first to exploit the high-frequency FINRA TRF short selling dataset. In our sample, it covers a long sample period of 7 years from 2010 to 2016 for all national market system stocks. In sum, exploiting the availability of short sale trade data from FINRA, we can identify retail short sell transactions. We start with FINRA’s off-exchange short sale transaction prices 𝑃 , and mark the short sale transactions prices above a round penny. These deviations indicate 𝑖,𝑡 price improvement and thus a retail short sale. In fractions of one penny 𝑍 = 100∗ 𝑖,𝑡 𝑚𝑜𝑑(𝑃 ,0.01), that is 0< 𝑍 <0.4. This approach allows us to identify the short sell 𝑖,𝑡 𝑖,𝑡 transactions initiated by retail investors. Specifically, we only include short sales during normal market hours (09:30:00 to 16:00:00) and only include shorts that are not exempt. To be included in the sample, we require matching data in daily TAQ and the FINRA data. If a stock has no retail short selling on that day, it will be noted as zero shares traded with zero number of trades. For the analysis, within a given trading day, we sum up all the retail short sell shares or the number of retail short selling 3 SROs include registered exchanges (i.e., NYSE, NASDAQ, or Bats), and FIRNA. 4 TRFs are operated by a registered national exchange (i.e., NASDAQ or NYSE). All TRFs are subject to FINRA’s oversight. 5 In our sample, we only include market center of Nasdaq TRF (‘Q’), which corresponds to daily TAQ data with exchange code ‘D’ and TRF ‘Q/T’, and NYSE TRF (‘N’), which corresponds to daily TAQ data with exchange code ‘D’ and TRF ‘N.’ 10 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "1. Introduction",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 55,
    "chunk_index": 18,
    "word_count": 399,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "oversight. 5 In our sample, we only include market center of Nasdaq TRF (‘Q’), which corresponds to daily TAQ data with exchange code ‘D’ and TRF ‘Q/T’, and NYSE TRF (‘N’), which corresponds to daily TAQ data with exchange code ‘D’ and TRF ‘N.’ 10 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "1. Introduction",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 55,
    "chunk_index": 19,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "trades for a stock. Then this data is merged with stock return data from CRSP and accounting data from Compustat. We only include common stocks with share code 10 or 11 listed on one of the three main exchanges NYSE, NASDAQ, or Amex with a minimum stock price of $1 at the previous month-end. Our sample is from January 2010 to December 2016. It includes 5,332 distinct stocks totally with an average of 3,532 stocks on each trading day. 2.2. Summary Statistics Table 1 provides summary statistics of the variables used in the paper. We pool observations across stocks and across days, and calculate the mean, standard deviation, median, 25th, and 75th percentile. There are total 6,224,866 observations. We use the millisecond data from daily TAQ and calculate shares traded and the number of trades for each stock-day from 2010 to 2016. We calculate trading volume during normal market hours and filter out trades with prices below zero and with a correction indicator other than zero. On average, for each stock-day, the mean trading volume (vol) is around 1.148 million and the mean number of trades (trd) is around 5,603. Next, we follow Lee and Ready (1991) to identify the transactions initiated by buyers or sellers. On average, buyer-initiated trading volume (vol_buy) is around 0.569 million and seller-initiated trading volume (vol_sell) is around 0.578 million. The number of buyer-initiated trades (trd_buy) and seller-initiated trades (trd_sell) is similar, which is around 2,800 on each stock-day. Next, we select the OTC trades that took place away from the exchanges. These OTC trades have exchange code “D” in daily TAQ. On average, for each stock-day, OTC trading volume (otcvol) is around 0.394 million, which is around 1/3 of all the shares traded. We select retail marketable orders, which are the orders receiving sub-penny price improvements relative to the NBBO. If there is no retail trading on that day, both retail buys and retail sells are documented as zero on that day. On average, daily buy volumes from retail investors 11 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "1. Introduction",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 55,
    "chunk_index": 20,
    "word_count": 342,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "marketable orders, which are the orders receiving sub-penny price improvements relative to the NBBO. If there is no retail trading on that day, both retail buys and retail sells are documented as zero on that day. On average, daily buy volumes from retail investors 11 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "1. Introduction",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 55,
    "chunk_index": 21,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "(rtlvol_buy) are 42,526 shares and the daily sell volumes from retail investors (rtlvol_sell) are 42,177 shares. Thus, trades from retail investors are around 7.5% of the total shares traded. Moreover, we select OTC short sells reported on the FINRA website, and only include them in the sample when they can be matched with the daily TAQ data. If there is no OTC shorting on that day, it will be noted as zero. The average daily short sell volume that took place off-exchange (otcshort_vol) is 160,189 shares and the average daily off-exchange short sell trades (otcshort_trd) are 583 trades. Thus, OTC short selling is around 37.93% of the total OTC trading volume or 12.69% of the average total shares traded each day. To obtain retail shorting, we look at OTC short sell transaction price 𝑃 and require a 𝑖,𝑡 transaction price above a round penny. That is, let 𝑍 = 100∗𝑚𝑜𝑑(𝑃 ,0.01) be the fraction 𝑖,𝑡 𝑖,𝑡 of a penny associated with OTC short sell transaction price 𝑃 , and select it if 0< 𝑍 <0.4. For 𝑖,𝑡 𝑖,𝑡 each stock-day, retail short sale volume (rtlshort_vol) is 7,925 shares, and retail short sell trades (rtlshort_trd) are 24. Finally, to evaluate the relative importance of retail short sales as a fraction of total retail trading and total off-exchange short selling, we report the relevant percentages at the bottom of Table 1. On average, retail short sale shares are around 10.92% of retail investors’ traded shares (rtlshort_rtlvol) and around 6.36% of all OTC short selling shares (rtlshort_otcshortvol). Overall, retail short sell volumes are around 0.78% of all the shares traded each day (rtlshort), and retail short sell trades are around 0.53% of all the trades (rtlshort_t). 12 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "1. Introduction",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 55,
    "chunk_index": 22,
    "word_count": 289,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "retail investors’ traded shares (rtlshort_rtlvol) and around 6.36% of all OTC short selling shares (rtlshort_otcshortvol). Overall, retail short sell volumes are around 0.78% of all the shares traded each day (rtlshort), and retail short sell trades are around 0.53% of all the trades (rtlshort_t). 12 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "1. Introduction",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 55,
    "chunk_index": 23,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "To study whether retail short sells can predict stock returns, our analysis begins by constructing calendar-time portfolios where returns represent the performance of stocks with different levels of retail short selling. If retail short sellers are informed, the stocks heavily shorted by retail investors should underperform the stocks not shorted or lightly shorted by retail investors. To minimize the impact of microstructure noise on our results, we focus on weekly horizons of retail short sells, i. e., retail short sell activities over the previous 5 trading days [t-5, t-1]. Each day, we sort all the stocks into quintiles based on weekly retail short selling, where portfolio 1 consists of stocks with the least retail short selling and portfolio 5 consists of the stocks with the most retail short selling. We use 4 measures to proxy for retail short selling. The first two are unstandardized shorting measures: weekly retail short selling volumes (rtlshort_vol_w) and weekly retail short selling trades (rtlshort_trd_w); and the next two are standardized measures: weekly percentage of retail short selling volume (rtlshort_w), scaled by total traded shares, and weekly percentage of retail short selling trades (rtlshort_t_w), scaled by total number of trades. After stocks are sorted into quintiles each day, we skip one day (t=0) and then hold a value-(equal-) weighted portfolio for 20 trading days [t+1, t+20]. This process is repeated each trading day, so there are 20 overlapping portfolios. To deal with the overlap, a calendar-time approach is used to calculate the average daily returns (Jegadeesh and Titman, 1993). Thus, each trading day’s portfolio return is the simple average of 20 different daily portfolio returns, and 1/20 of portfolios is rebalanced each day (Boehmer et al., 2008). Average daily returns for each portfolio are either value-weighted or equal-weighted across all the stocks in the portfolio. Value-weighted portfolios use market-value weights at the previous month-end, with the weights summing to one for each portfolio on each trading 13 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "3.1. Single Sort Portfolios: Retail Short Selling",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 55,
    "chunk_index": 24,
    "word_count": 326,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Single Sort Portfolios: Retail Short Selling (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "day (Boehmer et al., 2008). Average daily returns for each portfolio are either value-weighted or equal-weighted across all the stocks in the portfolio. Value-weighted portfolios use market-value weights at the previous month-end, with the weights summing to one for each portfolio on each trading 13 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "3.1. Single Sort Portfolios: Retail Short Selling",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 55,
    "chunk_index": 25,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Single Sort Portfolios: Retail Short Selling (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "day. Equal-weighted portfolios are equal-weighted across portfolios on each trading day. Table 2 reports both raw returns and alphas for each portfolio. Each portfolio’s alpha is the intercept from a time-series regression of its daily excess returns on the three Fama and French (1993) daily return factors, based on market, size, and book-to-market. We calculate the spread portfolio return, which is the return of the heavily shorted stocks (quintile 5) minus the return of the lighted shorted stocks (quintile 1). The result in Table 2 suggests that retail shorting predicts negative returns, no matter what measure is used. Daily (annualized) value-weighted alphas of the spread portfolios are - 0.024%, -0.027%, -0.024%, -0.027% (-6%, -6.75%, -6%, -6.75%), respectively. The significance of the spread returns is 5% or better in all regressions. Daily (annualized) equal- weighted alphas of the spread portfolios are larger, which can arrive at -0.075%, -0.074%, - 0.049%, -0.045% (-18.75%, -18.5%, -12.25%, -11.25%). Both magnitude and significance are larger, compared to the value-weighted portfolio results, implying that retail short sellers are better able to predict returns for the small-cap stocks. Below, we will focus on the standardized shares measure (weekly retail short’s percentage of volume rtlshort_w) and on the value- weighted portfolio returns. Table 2 reports returns on the monthly horizons, which are likely to match the short sellers’ horizons. In addition, we also test the return predictions at other time horizons, reported in Appendix A1. We look at the next 5 trading days’ returns [t+1, t+5], the next 1 month returns [t+1, t+20], the next 2 month returns [t+21, t+40], and the next 3 month returns [t+41, t+60]. For example, using weekly retail short’s share of volume (rtlshort_w) to divide the sample, the daily value-weighted alpha of the spread portfolio is larger in the short term [t+1, t+5], with - 0.028% and a t-value of -2.695. In the longer term at [t+21, t+40], the return difference is smaller and becomes less significant, with -0.017% and a t-value of -1.783. Even in [t+41, t+60], we do not observe no return reversals, but the return difference becomes insignificant. 14 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "3.1. Single Sort Portfolios: Retail Short Selling",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 55,
    "chunk_index": 26,
    "word_count": 354,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Single Sort Portfolios: Retail Short Selling (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "a t-value of -2.695. In the longer term at [t+21, t+40], the return difference is smaller and becomes less significant, with -0.017% and a t-value of -1.783. Even in [t+41, t+60], we do not observe no return reversals, but the return difference becomes insignificant. 14 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "3.1. Single Sort Portfolios: Retail Short Selling",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 55,
    "chunk_index": 27,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Single Sort Portfolios: Retail Short Selling (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "Since quintile 1 includes the stocks with low retail shorting and no retail shorting at the same time, we perform an additional estimation. We put the stock-days without retail shorting in the 1st quintile, and then equally divide the rest into 4 quartiles6. This way, return spreads will be less noisy. For example, using weekly retail short’s share of volumes (rtlshort_w) to sort the sample, the daily value-weighted alpha of the spread portfolio during the next 20 trading days is -0.054% with a t-value of -5.119, annualized at -13.5%. This suggests that stocks heavily shorted by retails will underperform the stocks not shorted by retail investors. 3.2. Double Sort Portfolios: Retail Trading and Retail Short Selling Table 2 suggests that retail short selling can significantly predict negative returns. But recent studies by Boehmer, et al. (2019), Kelley and Tetlock (2013), and Barrot, et al.(2016) find that retail investors are informed in a more general sense (i.e., even when they are not shorting). This retail flow can predict future stock returns even when we do not condition on retail short sales. So it is useful to establish whether retail traders’ short selling contains additional information over the information that retail trades have in general. Specifically, we ask what is the difference between retail investors’ long trades and their short sales? To answer this question and to highlight the differences, if any, we conduct double sorts: all the stocks are first sorted on retail trading and second sorted on retail shorting. This approach considers the predictive power of retail short sellers beyond the predictive power that retail flows have in the aggregate. Specifically, on each trading day, we first sort all the stocks into quintiles based on weekly retail order imbalances. Within equal quintile, we then sort stocks into quintiles based on weekly retail shorting. Retail order imbalance is calculated as retail buyer-initiated volume 6 Portfolio returns using this approach have one drawback: the number of stocks in each quintile is not equal. On average, there are 383 stocks each day in the 1st quintile, and 787 stocks each day in the next 4 quartiles. 15 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "3.1. Single Sort Portfolios: Retail Short Selling",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 55,
    "chunk_index": 28,
    "word_count": 359,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Single Sort Portfolios: Retail Short Selling (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "retail buyer-initiated volume 6 Portfolio returns using this approach have one drawback: the number of stocks in each quintile is not equal. On average, there are 383 stocks each day in the 1st quintile, and 787 stocks each day in the next 4 quartiles. 15 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "3.1. Single Sort Portfolios: Retail Short Selling",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 55,
    "chunk_index": 29,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Single Sort Portfolios: Retail Short Selling (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "(rtlvol_buy) minus retail long seller-initiated volume (rtlvol_sell-rtlshort_vol), scaled by total shares of volume (vol) for each stock-day. This approach excludes retail short sales from retail order imbalances. We skip one day and calculate the value-weighted portfolio returns using a 20-day holding period, where returns are presented in percent. As before, we use a calendar- time approach to calculate returns and adjust overlaps. Therefore, the result in Table 3 is a set of stocks that differ in retail shorting but have similar overall retail trading. In Table 3, after controlling for weekly retail order imbalances, the predictive power of retail shorting using raw returns is preserved across the medium three retail order imbalances quintiles, and the predictive power of retail shorting using risk-adjusted returns is preserved across all the five retail order imbalance quintiles. Specifically, Column (1) presents a portfolio of stocks with the lowest retail order imbalances and column (5) presents a portfolio of stocks with the highest retail order imbalances. Comparing column (1) and column (5), stocks that are heavily bought by retail investors outperform stocks that are heavily sold by retail investors, which is consistent with Boehmer et al. (2019). Within each column, it includes stocks with different levels of retail shorting, where row (1) has the least retail shorting and row (5) has the most retail shorting. The return difference between row (5) and row (1) is smaller in the first three columns and becomes larger in the last two columns. For example, when retail buying is ranked in the 2nd column, the raw return spread and alpha spread are -0.017% and -0.022% ( - 4.25% and -5.5% annualized). When retail buying is ranked in the 5th column, the raw return spread and alpha spread are -0.024% and -0.050% ( -6% and -12.5% annualized). Overall, Table 3 shows that among the stocks that have similar retail flows, the stocks where retail traders short more underperform. In addition, retail shorting is more predictive of 16 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "3.1. Single Sort Portfolios: Retail Short Selling",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 55,
    "chunk_index": 30,
    "word_count": 332,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Single Sort Portfolios: Retail Short Selling (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "raw return spread and alpha spread are -0.024% and -0.050% ( -6% and -12.5% annualized). Overall, Table 3 shows that among the stocks that have similar retail flows, the stocks where retail traders short more underperform. In addition, retail shorting is more predictive of 16 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "3.1. Single Sort Portfolios: Retail Short Selling",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 55,
    "chunk_index": 31,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Single Sort Portfolios: Retail Short Selling (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "returns within the subset of stocks that other retail investors have heavily bought7. Therefore, the double sort results suggest that retail shorting is based on the information that is distinct from the information that retail traders have as a group. 4. Regression Results 4.1. Return Predictions of Retail Short Selling Portfolio results in Table 2 and Table 3 are based on univariate sorts that could reflect omitted variable bias, or other variables that predict returns could be correlated with retail shorting. In this section, we ask whether retail short sales can predict returns after controlling for trading by other informed investors and for firm characteristics. To address this question, we use a Fama-Macbeth (1973) regression of future returns on weekly retail shorting. Analogously to the portfolio returns above, dependent variables are the next 20 days’ returns [t+1, t+20]. Since we use overlapping daily data for short sells and return measures, the standard deviations of the time series are adjusted using Newey-West (1987) with 20 lags. In panel A, dependent variable is cumulative raw returns from t+1 to t+20. In panel B, dependent variable is cumulative risk-adjusted returns from t+1 to t+20, with betas estimated from previous year. All the returns are in percent. As control variables, we include past returns over three different horizons: the previous week [t-5, t-1] ret(w-1), the previous month [t-26, t-6] ret(m-1), and the previous year [t-251, t-26] ret(y-1). It is important to include past returns since retail short sellers may be contrarian traders. We also include log (market cap), log (book to market), turnover, and daily return volatility, all from the previous month. These firm characteristics are related to public 7 We also switch the sorting sequence. Retail net buying can only predict returns for the stocks which are less likely to be shorted by retail investors. It means that retail short selling can take advantage of other retail trading, while other retail trading cannot take advantage of retail short selling. 17 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "3.1. Single Sort Portfolios: Retail Short Selling",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 55,
    "chunk_index": 32,
    "word_count": 332,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Single Sort Portfolios: Retail Short Selling (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "Retail net buying can only predict returns for the stocks which are less likely to be shorted by retail investors. It means that retail short selling can take advantage of other retail trading, while other retail trading cannot take advantage of retail short selling. 17 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "3.1. Single Sort Portfolios: Retail Short Selling",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 55,
    "chunk_index": 33,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Single Sort Portfolios: Retail Short Selling (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "information and impact future returns. Finally, we also consider trading by other investors. We include other retail investors’ net buying rtloib (i. e., net buying by retail traders who are not shorting in a trade), since retail trading is known to be related to returns. Here, “other” retail activity is measured as: (rtlvol_buy-(rtlvol_sell-rtlshort_vol))/vol. We also include non-retail off-exchange shorts, darkshort. This measure is calculated as: (otcshort_vol-rtlshort_vol)/vol. These non-retail OTC shorts generally represent institutional shorting in dark pools. To be consistent with the previous sorts in Table 2 and Table 3, We use weekly retail order imbalance and weekly dark pool short sells. All the independent variables are standardized each day to facilitate comparisons of the coefficients. At the first stage, for each day, we estimate the following cross-sectional regression: 𝑟 = 𝑏 +𝑏 ∗𝑟𝑡𝑙𝑠ℎ𝑜𝑟𝑡_𝑤 +𝑟∗𝑥 +𝑒 (1) 𝑖,𝑡+1,𝑡+20 0 1 𝑖,𝑡−1 𝑖,𝑡−1 𝑖,𝑡 In the second stage, we calculate time-series averages of daily regression coefficients. Table 4 reports regression estimates. The 1st column shows the univariate impact of retail short sells. The standardized coefficient is -0.114%, with a t-statistic of 4.04, suggesting that if retail investors short sell more in each week, the return on that stock for next month is significantly lower. In terms of magnitude, the quintile range for rlshort_w is (0.8522-(- 0.6984))=1.5506. Multiplying the quintile difference with the standardized coefficient: - 0.114%*1.5506=-0.177% (or annualized at -2.12%). The 2nd column in Table 4 adds control variables for public information. The magnitude of the retail shorting coefficient declines slightly to -0.065%, but it remains significant at the 1% level. The slightly lower coefficients suggest that retail short sellers trade on some public signals, but they have additional information that buyers or long sellers don’t have. The negative coefficients on the past week’s returns and the positive coefficients on the past year’s returns reflect the presence of short-term 18 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "3.1. Single Sort Portfolios: Retail Short Selling",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 55,
    "chunk_index": 34,
    "word_count": 314,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Single Sort Portfolios: Retail Short Selling (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "suggest that retail short sellers trade on some public signals, but they have additional information that buyers or long sellers don’t have. The negative coefficients on the past week’s returns and the positive coefficients on the past year’s returns reflect the presence of short-term 18 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "3.1. Single Sort Portfolios: Retail Short Selling",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 55,
    "chunk_index": 35,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Single Sort Portfolios: Retail Short Selling (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "return reversals at the 1% level and a marginally significant indication of long-term return momentum at the 5% level. The 3rd column introduces non-retail dark pool short sales, darkshort_w. It has a coefficient of -0.085%, which is also a strong predictor of the future negative returns. For retail short selling rtlshort_w, the coefficients decrease from column (2) to column (3), implying that retail short sellers and dark pool short sellers partially share the same information. But even after controlling for the dark pool shorting, retail shorting can still predict negative returns with a magnitude of -0.051% and a t-statistics of 2.58. The 4th column introduces retail net buying rtloib_w, which can positively predict future returns consistent with the results in Boehmer et al. (2019). It has a standardized coefficient of 0.126%. For retail short selling rtlshort_w, the coefficients increase from column (2) to column (4), implying that the information of retail short sellers is partly different from the information that other retail traders have as a group, even when controlling for firm characteristics. In panel B, we change dependent variables from cumulative raw returns to cumulative risk-adjusted returns. The predictive power of retail short selling is similar in both magnitude and significance and it remains a significant predictor of future negative returns. For example, in column (2), the standardized coefficient on rtlshort_w is -0.056% and it is significantly below 1%. The coefficient on rtlshort_w decreases from column (2) to column (3) and increases from column (2) to column (4), suggesting again there exists overlap of information among short sellers and distinction of information among retail investors. In addition, size becomes negatively significant and book-to-market ratio becomes positively significant.8 8 Since Panel A and B have similar results, we will focus on the results using raw returns as dependent variables. The results using risk-adjusted cumulative returns as dependent variables are qualitatively identical and available upon request. 19 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "3.1. Single Sort Portfolios: Retail Short Selling",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 55,
    "chunk_index": 36,
    "word_count": 321,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Single Sort Portfolios: Retail Short Selling (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "significant and book-to-market ratio becomes positively significant.8 8 Since Panel A and B have similar results, we will focus on the results using raw returns as dependent variables. The results using risk-adjusted cumulative returns as dependent variables are qualitatively identical and available upon request. 19 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "3.1. Single Sort Portfolios: Retail Short Selling",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 55,
    "chunk_index": 37,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Single Sort Portfolios: Retail Short Selling (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "As a robustness check, we change dependent variables from next 20 days’ returns to next 5 days’ returns [t+1, t+5], reported in Appendix A2. Retail shorting is a strong predictor for next week’s returns. When included alone as an independent variable in column (1), the standardized coefficient on retail short sells is -0.031% with a t-value of 4.13. That means the monthly predictions will be -0.124% (-0.031%*4), larger than the prediction magnitude for next month’s returns of -0.114% reported in Table 4. What is more, coefficient on darkshort_w becomes insignificant in column (3), suggesting that dark pool shorting is less aggressive than retail shorting in the short term. Retail trading rtloib_w in column (4) is still a strong positive predictor for next week returns with a coefficient of 0.050%. Consistent with Zhu (2014), informed traders (i.e., short sellers) have a disincentive to route the informed orders to dark venues due to more execution risk. To sum up, Table 4 shows that short sales initiated by retail investors negatively predict future stock returns. Their predictive power is not subsumed by firm characteristics or other specific trader types. Two related studies by BJZ (2008) and KT (2017) also find that retail shorting can predict stock returns, but both samples are quite limited. Our results hold even when controlling for the imbalances of other traders, and our results are distinct from the results for all retail activities as a group. 4.2. Comparing Return Predictions for Retail Short Selling vs. Other Retail Trading We have shown that retail shorting can predict stock returns. But are short sellers special, or do they trade on the same information as other retail traders do? The results in Table 4 suggest that retail order imbalances have greater predictive power than do retail short sales. To compare retail short sellers to the typical non-short retail investors, we use sub-sample cross- sectional regressions. 20 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "3.1. Single Sort Portfolios: Retail Short Selling",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 55,
    "chunk_index": 38,
    "word_count": 319,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Single Sort Portfolios: Retail Short Selling (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "the same information as other retail traders do? The results in Table 4 suggest that retail order imbalances have greater predictive power than do retail short sales. To compare retail short sellers to the typical non-short retail investors, we use sub-sample cross- sectional regressions. 20 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "3.1. Single Sort Portfolios: Retail Short Selling",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 55,
    "chunk_index": 39,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Single Sort Portfolios: Retail Short Selling (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "In Table 5, all stocks are sorted into three groups based on firm size at the end of the previous month in Panel A and on firm liquidity at the end of the previous month in Panel B. Then, we re-estimate Fama-Macbeth (1973) regressions within each group. That is, all the coefficients can be different within each size group/each liquidity group. Next, we calculate the total retail order imbalance rtloib_total_w, which includes retail short sells. That is: (rtlvol_buy-rtlvol_sell)/vol. We further divide it into two parts: one is retail short sells rtlshort_w, calculated as rtlshort_vol/vol; the other is retail net buying rtloib_w, calculated as (rtlvol_buy-(rtlvol_sell-rtlshort_vol))/vol, this time excluding retail short sells. In Panel A Table 5, Columns (1) and (2) report results for small-cap stocks. In column (1), total retail order imbalance is a strong predictor of future stock return. The standardized coefficient is 0.189% with a t-statistics of 10.18. In column (2), we divide total retail order imbalance into two parts: retail short selling and retail net buying. The coefficient on rtlshort_w is -0.065% and the coefficient on rtloib_w is 0.182%. It means for small-cap stocks, retail trading tends to have greater predictive power than retail shorting, suggesting that retail investors are better informed in small-cap stocks. Next, for medium-cap stocks in columns (3) and (4), the relative predictions of retail shorting and retail net buying are similar. However, the picture is totally different in large-cap stocks in columns (5) and (6). Only retail shorting has a significant impact on stock pricing. In column (5), the coefficient of rtloib_total_w is not significant any more. In column (6), retail short sales remain a strong significant predictor of future negative returns with a coefficient of -0.071% and a t-statistic of 2.81, but retail net buying loses prediction with a t-value of only 0.99. In Panel B, results are similar when we use last month turnover to divide the sample. In columns (1) and (2), for illiquid stocks, retail investors’ trades have larger predictive powers for next month’s returns than retail short selling does. However, the result is different for medium-liquid stocks in columns (3) and (4) and for liquid stocks in columns (5) and (6). Retail 21 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "3.1. Single Sort Portfolios: Retail Short Selling",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 55,
    "chunk_index": 40,
    "word_count": 370,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Single Sort Portfolios: Retail Short Selling (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "and (2), for illiquid stocks, retail investors’ trades have larger predictive powers for next month’s returns than retail short selling does. However, the result is different for medium-liquid stocks in columns (3) and (4) and for liquid stocks in columns (5) and (6). Retail 21 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "3.1. Single Sort Portfolios: Retail Short Selling",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 55,
    "chunk_index": 41,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Single Sort Portfolios: Retail Short Selling (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "shorts have larger and more significant predictions on stock pricing than other retail investors’ trades do. For example, in column (5) for the liquid stocks, rtloib_total_w retains predictive power at the 5% level, which is, however, fully explained by rtlshort_w rather than retail net buying rtloib_w, which can be seen in column (6). The standardized coefficient on rtlshort_w is 0.185% with a t-value of 4.87. In contrast, the coefficient on rtloib_w is only 0.044% with a t-value of 1.50 only. This suggests that non-shorting retail investors are more informed about illiquid stocks, while retail short sellers are more informed about liquid stocks. Short selling constraints and large, fixed costs in gathering information could deter retail short sellers from acquiring the information on the illiquid stocks. Instead, retail short sellers actively trade the liquid stocks and profit from their mispricing. To sum up, the empirical results in Table 5 suggest that retail short sales have predictive power beyond that coming from other retail traders as a group. Retail short sellers, however, can access different information that helps them generate greater abnormal returns. 5. Retail Investors and Short-Selling 5.1. Information-Based Strategies Our earlier regression results suggest that retail shorting can predict stock returns. This raises the question why, and we examine a few alternative explanations. The first story is that retail short sellers are informed traders, like institutional short sellers as a group of smart traders that other studies have looked at. Short sellers either have the ability to anticipate public news and better analyze publicly available information (Engelberg, Reed, and Ringgenberg, 2012) or can uncover new information themselves (e. g., Christophe, Ferri, and Angel, 2004; Boehmer, Jones, Wu, and Zhang, 2020). Therefore, it is possible that retail short sellers’ trading strategies exploit public information in this way. In this section, we identify and separate out 22 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "3.1. Single Sort Portfolios: Retail Short Selling",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 55,
    "chunk_index": 42,
    "word_count": 310,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Single Sort Portfolios: Retail Short Selling (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "2012) or can uncover new information themselves (e. g., Christophe, Ferri, and Angel, 2004; Boehmer, Jones, Wu, and Zhang, 2020). Therefore, it is possible that retail short sellers’ trading strategies exploit public information in this way. In this section, we identify and separate out 22 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "3.1. Single Sort Portfolios: Retail Short Selling",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 55,
    "chunk_index": 43,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Single Sort Portfolios: Retail Short Selling (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "the days when there is news announcement, and test whether retail short sellers’ predictive power changes around these news days. 5.1.1. News Sample We include three sets of news that are either earnings- or analyst-related. First, we select quarterly earnings announcements from Compustat and compare the earnings announcements dates from I/B/E/S and Compustat and choose the earlier ones if they are different. Our sample has 5,158 stocks with earnings announcements. Around 1.55% of days have such an announcement. Next, we define the unexpected earnings surprise, UE. UE is calculated as the announced EPS for a quarter less the corresponding consensus EPS forecast. Around 0.49% of days announce negative unexpected earnings surprises (UE<0). The second news category consists of analyst recommendation changes from I/B/E/S. Our sample has 3,570 stocks with analyst recommendation changes. On average, changes occur on 0.94% of the sample days. We select negative news when an analyst recommendation change is downward. Negative analyst recommendation changes occur, on average, on 0.55% of the sample days. The third news category are analyst forecast revisions from I/B/E/S. Our sample contains 4,528 stocks that have available analyst forecast revisions. An average 5.47% of days have revision announcements and these are negative, on average, on 3.03% of sample days. Overall, 6.44% of all days are news days. On these news days, retail short sell volume accounts for 11.9% of total volume. 3.58% of all days are negative news days, and retail short sell volume is on average 7.37% of total volume on these negative news days. This suggests that a significant portion of retail short sales concentrates on news announcement dates. 23 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "3.1. Single Sort Portfolios: Retail Short Selling",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 55,
    "chunk_index": 44,
    "word_count": 274,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Single Sort Portfolios: Retail Short Selling (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "11.9% of total volume. 3.58% of all days are negative news days, and retail short sell volume is on average 7.37% of total volume on these negative news days. This suggests that a significant portion of retail short sales concentrates on news announcement dates. 23 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "3.1. Single Sort Portfolios: Retail Short Selling",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 55,
    "chunk_index": 45,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.1. Single Sort Portfolios: Retail Short Selling (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "Next, we separate out the days with earning or analyst-related information to study short sellers’ information. We introduce a dummy variable news dummy, which equals 1 if day t=0 has an earnings announcement, an analyst recommendation change, or an analyst forecast revision. We regress both next week’s returns [t+1, t+5] and next month’s returns [t+1, t+20] on weekly retail short sales, the news dummy, the interaction term of news dummy with weekly retail short sells, and controls. The Fama-Macbeth regression is as follows: 𝑟 = 𝑏 +(𝑏 +𝑏 ∗𝑁𝑒𝑤𝑠 𝐷𝑢𝑚𝑚𝑦 )∗𝑟𝑡𝑙𝑠ℎ𝑜𝑟𝑡_𝑤 +𝑏 ∗ 𝑖,𝑡+1,𝑡+𝑘 0 1 2 𝑖,𝑡 𝑖,𝑡−1 3 𝑁𝑒𝑤𝑠 𝐷𝑢𝑚𝑚𝑦 +𝑟∗𝑥 +𝑒 (2) 𝑖,𝑡 𝑖,𝑡−1 𝑖,𝑡 Table 6 Panel A uses all the news types, either positive news or negative news. The dependent variable in the first three columns is next week’s return. Column (1) shows the baseline results: the coefficient on weekly retail short sales is -0.018%, with a t-statistics of 3.01. Column (2) divides trading days into news days and non-news days. For overall retail shorting, the coefficient is -1.6 basis points, but on days with earning or analyst news, the coefficient is (-1.6)+(-1.8)=-3.4 basis points, which is more than double compared to the days without news. The incremental effect on earnings/analyst news days is also strongly statistically significant, with a t-statistic of 3.71. In column (3), we additionally introduce a news dummy to control for possible fixed time effects. The results are similar: the prediction on news days is (-1.6) +(-1.5) =-3.1 basis points, which almost doubles than the average effect of -1.6. But the predictions are quite short in the sense that the marginal difference between news days and non-news days becomes less significant in the longer term: when we regress next month’s return on the same variables in column (4), (5), and (6), the difference between news days and non-news days becomes less significant. There is another way to evaluate the importance of earnings’ and analysts’ news. One can use the fact that 6.44% of the days in the sample have an earnings-related or analyst-related 24 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "5.1.2. Regression Analysis",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 55,
    "chunk_index": 46,
    "word_count": 348,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.1.2. Regression Analysis (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "and (6), the difference between news days and non-news days becomes less significant. There is another way to evaluate the importance of earnings’ and analysts’ news. One can use the fact that 6.44% of the days in the sample have an earnings-related or analyst-related 24 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "5.1.2. Regression Analysis",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 55,
    "chunk_index": 47,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.1.2. Regression Analysis (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "announcement. That means, the overall underperformance for next week’s return associated with a one-standard-deviation increase in retail short sales is: 6.44% * (1.6+1.8) + (1 – 6.44%) * 1.6 = 1.75 basis points per day The first term reflects the portion of short-sellers’ information associated with earnings and analyst announcement days. In this case, it covers around 12.5% of overall underperformance. Panel B uses only negative news. The incremental effect on earning/analyst news days is much larger in magnitude and in significance for both next week’s return and next month’s return. For example, in column (2), the coefficient for overall retail shorting is -1.4 basis points and only marginally significant; but on days with negative earning or analyst-related news, the coefficient is (-1.4)+(-6.0)=-7.4 basis points, which is more than five times larger compared to the days without negative news. The incremental effect is also statistically significant below the 1% level with a t value of 11.89. Even after additionally introducing a news dummy to control for the possible time fixed effects in column (3), the prediction on negative news days is (-1.6) +(-1.7) =-3.3 basis points, which more than doubles the average effect of -1.6. In column (5), when predicting next-month returns, the coefficient for overall retail shorting is - 5.4 basis points. But on the days with negative news, the coefficient is (-5.4)+(-6.5)=-11.9 basis points, which is more than doubles compared to days without news. Introducing a dummy to control for time fixed effects in column (6), the difference between news days and non-news days is still -0.027% and statistically significant under 5% level.9 Observing that 3.58% of days are related to negative information, we can calculate the percentage of underperformance related to negative information as: 0.014*(1-3.58%)/[0.014*(1-3.58%)+0.074*3.58%]=16.3% 9 We also select the days with positive news only. For retail short selling, the marginal difference between positive news days and non-positive news days in predicting future returns is not significantly different from zero. 25 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "5.1.2. Regression Analysis",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 55,
    "chunk_index": 48,
    "word_count": 329,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.1.2. Regression Analysis (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "percentage of underperformance related to negative information as: 0.014*(1-3.58%)/[0.014*(1-3.58%)+0.074*3.58%]=16.3% 9 We also select the days with positive news only. For retail short selling, the marginal difference between positive news days and non-positive news days in predicting future returns is not significantly different from zero. 25 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "5.1.2. Regression Analysis",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 55,
    "chunk_index": 49,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.1.2. Regression Analysis (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "Therefore, negative news announcements cover around 16.3% of all underperformance related to retail shorting. Overall, news events appear to have a strong effect on retail short sellers’ ability to predict returns. As a robustness test, we also test whether there exists abnormal retail shorting around news announcement dates. If retail shorting level significantly increases prior to news announcement dates, it suggests that they can actively predict information (Chirstophe, Ferri, and Angel, 2004; Christophe, Ferri, and Hsieh, 2010; Boehmer, Jones, Wu, and Zhang, 2020). If retail shorting level increases around news announcement dates (Engelberg, et al, 2010), it suggests that they can better analyze information. In unreported results we, too, find that retail shorting only increases on and after news announcement dates, consistent with the point that retail short sellers can better process information. 5.1.3. Regression Setting Comparing Retail Short Selling vs. Other Retail Trading In this section, we compare the information advantage of retail short selling to that of other retail trading using cross-sectional regressions. We ask whether it is possible that non- shorting retail traders can exploit public information as well. As in the setting above, we identify the days when there are earnings- or analyst-related information events on day t=0. In column (1), we regress next week’s return [t+1, t+5] on total retail order imbalance rtloib_total_w [t-5, t-1], the news dummy (t=0), the interaction term of news dummy with weekly retail order imbalances, and controls. In column (2), we further divide total retail order imbalance into retail short selling rtlshort_w [t-5, t-1] and retail net buying rtloib_w [t-5, t-1], and then regress next week’s return on retail short selling, retail net buying, the news dummy, the interaction term of news dummy with retail shorting, the interaction term of news dummy with retail net buying, and controls. By comparing the interacted coefficients, we can evaluate the relative incremental stock returns associated with previous week’s retail trading/shorting activity that is due to earnings news or analyst changes. 26 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "5.1.2. Regression Analysis",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 55,
    "chunk_index": 50,
    "word_count": 333,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.1.2. Regression Analysis (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "with retail shorting, the interaction term of news dummy with retail net buying, and controls. By comparing the interacted coefficients, we can evaluate the relative incremental stock returns associated with previous week’s retail trading/shorting activity that is due to earnings news or analyst changes. 26 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "5.1.2. Regression Analysis",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 55,
    "chunk_index": 51,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.1.2. Regression Analysis (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "Table 7 reports the results. In column (1), the coefficient on the interaction term is not significantly different from zero, suggesting that on average, non-short retail investors cannot anticipate and exploit information. In column (2), the coefficient on the interaction term of retail shorting with news dummy is -0.018% with a t-statistic of 2.58, significant under 1% level. In contrast, the coefficient on the interaction term of retail net buying with news dummy is statistically indistinguishable from zero with a t-statistic of 0.74 only. The results are consistent with retail short selling conveying novel information. In contrast, there is no evidence that other retail traders act on such information. 5.2. Liquidity Provision Strategies Retail traders can also use short sales to provide liquidity to the impatient who require immediacy. As the buying pressure subsides, prices will revert to the fundamental values and short sellers can cover their positions and potentially earn positive returns. In this scenario, the trading patterns and return predictability are the result of short sellers receiving compensation for providing immediacy (Nagel, 2012). The literature is divided on this point. On one hand, recent studies by Kaniel, Saar, and Titman (2008), Kaniel, Liu, Saar, and Titman (2012), and Barrot, Kaniel, and Sraer (2016) find that retail investors as contrarian individuals can provide liquidity when market liquidity dries up. But none of these studies differentiates retail shorts from other types of retail trading. Retail short selling is different from the typical retail trading in that short sellers will incur costs from foregone interest on collateral and stand risks from recalling shares lent out. On the other hand, Arif, Ben-Rephael, and Lee (2020) show that short sellers frequently provide liquidity. Diether, Lee, and Werner (2009) and Comerton-Forde, Jones, and Putnins (2016) verify that short sellers can provide liquidity to impatient buyers. But most of these samples look at institutional short sells. So, in this section, we fill this gap and examine whether, and how, the role of retail short sellers differs from the role of other retail traders. 27 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "5.1.2. Regression Analysis",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 55,
    "chunk_index": 52,
    "word_count": 344,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.1.2. Regression Analysis (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "sellers can provide liquidity to impatient buyers. But most of these samples look at institutional short sells. So, in this section, we fill this gap and examine whether, and how, the role of retail short sellers differs from the role of other retail traders. 27 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "5.1.2. Regression Analysis",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 55,
    "chunk_index": 53,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.1.2. Regression Analysis (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "5.2.1. Are Retail Short Sellers Contrarian or Momentum Traders? We start by analyzing how retail short sales react to past returns. The dependent variable is the share of retail short sales on day t=0 rtlshort. We use Fama Macbeth regressions and various horizons of returns, including contemporaneous same-day returns ret(0), past week returns [t-5, t-1] ret(w-1), and past month returns [t-26, t-6] ret(m-1). For other control variables, we use log(market cap), log(book-to-market), turnover, and daily return volatility, all observed from the previous month-end. To control for autocorrelation in retail short sells, we also include its own lag, weekly retail short sells [t-5, t-1], or rtlshort_w. The last independent variable is bi-monthly short interest from Compustat shortint, which can proxy for the overall shorting on stock exchanges. We select the most recent short interest that can be observed on day t=0. That means the most recent short interest is reported on day t-1. To facilitate comparisons, we standardize both the dependent variable and the independent variables. The regression model is as: 𝑟𝑡𝑙𝑠ℎ𝑜𝑟𝑡 = 𝑏 +𝑏 ∗𝑟𝑒𝑡 +𝑏 ∗𝑟𝑒𝑡 +𝑏 ∗𝑟𝑒𝑡 +𝑟∗𝑥 +𝑒 (3) 𝑖,𝑡 0 1 𝑖,𝑡 2 𝑖,𝑡−5,𝑡−1 3 𝑖,𝑡−26,𝑡−6 𝑖,𝑡−1 𝑖,𝑡 Table 8 presents results. In column (1), independent variables only include returns. The coefficients on contemporaneous return, past week returns, and past month returns (𝑏 ,𝑏 ,𝑏 ) 1 2 3 are 0.014, 0.019 and 0.011, respectively. All three coefficients are positive and statistically significant, suggesting that retail short sellers are strong contrarians, who sell the stocks after prices rise. In column (2), we additionally include firm level characteristics from the previous month-end in the regression. The coefficients on the returns continue to be significant. Similar results are presented in column (3), when we control for past retail short sales and short interest as well. On average, more retail shorting tends to follow small stocks, growth stocks, more liquid stocks, and more volatile stocks. 28 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "5.1.2. Regression Analysis",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 55,
    "chunk_index": 54,
    "word_count": 322,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.1.2. Regression Analysis (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "returns continue to be significant. Similar results are presented in column (3), when we control for past retail short sales and short interest as well. On average, more retail shorting tends to follow small stocks, growth stocks, more liquid stocks, and more volatile stocks. 28 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "5.1.2. Regression Analysis",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 55,
    "chunk_index": 55,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.1.2. Regression Analysis (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "5.2.2. How Do Retail Short Sells React to Changes in Buying Pressure? It is possible that past and contemporaneous price increases are caused by factors that themselves trigger short selling activity. For example, larger past returns can arise when buying pressure increases during this period. But this effect would be purely liquidity-motivated rather than information-based if retail short sellers just step in to provide liquidity to the impatient buy orders. To better understand this relation, we use three variables that help control for buying pressure at the stock level. The first measure is based on Lee and Ready (1991). We classify trades as either buyer- initiated or seller-initiated, and then calculate order imbalance as: LRoib= (vol_buy- vol_sell)/vol. We construct an additional measure from these imbalances that differentiates between positive and negative imbalances. Following Diether, Lee, and Werner (2009) and Boehmer, Jones, and Zhang (2008), we define this measure as LRoib+, which equals LRoib if LRoib>0 otherwise zero. LRoib+_w includes positive buy-order imbalances in previous week. The second measure is retail net buying. Like above, we calculate the retail order imbalance as (rtlvol_buy-(rtlvol_sell-rtlshort_vol))/vol, and rtloib+ equals rtloib if rtloib>0 and zero otherwise. rtloib+_w includes positive retail buy net buying over the previous week. The third measure is the imbalance based on “other” trades (other than retail), or otheroib+. To construct this measure, we subtract retail trades from overall trades, so this measure also captures institutional trades. Otheroib is calculated as ((vol_buy-rtlvol_buy)- (vol_sell-rtlvol_sell))/vol, and otheroib+ equals otheroib if otheroib>0 and zero otherwise. Otheroib+_w includes positive other buy-order imbalances over the previous week. Before partitioning into positive oib+ and negative oib-, we standardize order imbalance so that both the dependent and the other independent variables to have zero mean and unit standard deviation each day. Table 9 presents cross-sectional regression results of 29 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "5.1.2. Regression Analysis",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 55,
    "chunk_index": 56,
    "word_count": 305,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.1.2. Regression Analysis (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "imbalances over the previous week. Before partitioning into positive oib+ and negative oib-, we standardize order imbalance so that both the dependent and the other independent variables to have zero mean and unit standard deviation each day. Table 9 presents cross-sectional regression results of 29 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "5.1.2. Regression Analysis",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 55,
    "chunk_index": 57,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.1.2. Regression Analysis (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "retail short sells on contemporaneous and past buying pressures, controlling for the returns, log (market cap), log (book-to-market), turnover, volatility, last week retail shorting, and the most recent short interest. Column (1) shows that today’s retail short selling is positively correlated with both contemporaneous and past buy order imbalances, which is consistent with a liquidity provision story. The coefficients on LRoib+ and LRoib+_w are 0.014 and 0.010, respectively. Both are significant at the 1% level. In column (2), retail short sells are also positively related to contemporaneous and past retail buy order imbalances. The coefficients on rtloib+ and rtloib+_w are 0.021 and 0.032 with t-statistics of 7.31 and 34.90. In column (3), where we introduce other buy order imbalances which are most likely to reflect institutional buying pressures, retail short sells are significantly positively correlated with contemporaneous “other” buy-order imbalances in a much larger magnitude. The coefficient on otheroib+ is 0.153 with a t-statistic of 27.84. There is no evidence, however, that retail short sales are related to other order imbalances in the past. In column (4), when we put retail order imbalances and “other” order imbalances together in the same regression, retail short sells have a much larger relation with institutional order imbalances (magnitude of 0.149 and t value of 27.57) than with retail order imbalances (magnitude of 0.025 and t value of 9.16). In sum, the estimates in Table 9 show that with greater (institutional) buying pressure, retail short sellers will increase their positions and step in to provide liquidity. Especially, in unreported results, institutional buying pressures are related to the subsequent negative returns. Combining this with the prior results that greater retail short selling is associated with future negative stock returns in Table 2 and Table 4 as well, our results suggest that retail short sellers receive compensation for providing liquidity to institutions that need to execute their trades immediately, consistent with Kaniel et al. (2008). 30 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "5.1.2. Regression Analysis",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 55,
    "chunk_index": 58,
    "word_count": 325,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.1.2. Regression Analysis (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "short selling is associated with future negative stock returns in Table 2 and Table 4 as well, our results suggest that retail short sellers receive compensation for providing liquidity to institutions that need to execute their trades immediately, consistent with Kaniel et al. (2008). 30 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "5.1.2. Regression Analysis",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 55,
    "chunk_index": 59,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.1.2. Regression Analysis (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "So far, we have presented evidence that retail short sellers as a group act as informed traders. In addition, retail short sellers strategically provide liquidity, when needed, by aggressive buyers. This prompts the question when retail traders’ embrace information trading and when they switch to liquidity providers. To address this question, we decompose the relation of retail short selling activities to past returns into days with news announcement and days without news, when return reversals are known to be larger (Tetlock, 2010). We interact the news dummy on day t=0 with contemporaneous and past returns. The interaction terms could reflect the difference between liquidity provisions’ trading on news and non-news days. The regression is as follows: 𝑟𝑡𝑙𝑠ℎ𝑜𝑟𝑡 = 𝑏 +𝑏 ∗𝑟𝑒𝑡 ∗𝑛𝑒𝑤𝑠 𝑑𝑢𝑚𝑚𝑦 +𝑏 ∗𝑟𝑒𝑡 ∗𝑛𝑒𝑤𝑠 𝑑𝑢𝑚𝑚𝑦 +𝑏 ∗ 𝑖,𝑡 0 1 𝑖,𝑡 𝑖,𝑡 2 𝑖,𝑡−5,𝑡−1 𝑖,𝑡 3 𝑟𝑒𝑡 ∗𝑛𝑒𝑤𝑠 𝑑𝑢𝑚𝑚𝑦 +𝑏 ∗𝑟𝑒𝑡 +𝑏 ∗𝑟𝑒𝑡 +𝑏 ∗𝑟𝑒𝑡 +𝑟∗ 𝑖,𝑡−26,𝑡−6 𝑖,𝑡 4 𝑖,𝑡 5 𝑖,𝑡−5,𝑡−1 6 𝑖,𝑡−26,𝑡−6 𝑥 +𝑒 (4) 𝑖,𝑡−1 𝑖,𝑡 Table 10 Panel A reports the results. In column (1), we use all news types. Without news, the relation of retail shorting to contemporaneous return (𝑏 ) is 0.016. The positive 4 correlation suggests that retail short sellers are strong contrarians. But on the days with news announcement, this relation decreases to 0.010 (𝑏 +𝑏 ). The coefficient on the interaction 1 4 term of news dummy with contemporaneous return (𝑏 ) is -0.006, implying that on news release 1 days, retail short sellers become less contrarian relative to returns. The relation between retail shorting and past returns also decreases significantly on news release days. Similar results apply to Column (2) where we only select the days of negative news, including negative unexpected earning surprise, or analyst recommendation downgrades, or analyst negative revision of forecasts. On negative news release days, the relation of retail shorting with contemporaneous return decreases to 0.08 (0.017-0.009), suggesting that retail short sellers are 31 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "5.3. Discussion",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 55,
    "chunk_index": 60,
    "word_count": 325,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.3. Discussion (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "select the days of negative news, including negative unexpected earning surprise, or analyst recommendation downgrades, or analyst negative revision of forecasts. On negative news release days, the relation of retail shorting with contemporaneous return decreases to 0.08 (0.017-0.009), suggesting that retail short sellers are 31 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "5.3. Discussion",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 55,
    "chunk_index": 61,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.3. Discussion (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "less contrarian relative to past returns when they are accompanied by negative news. However, results are different in column (3). When we only select positive news announcement days, all the interaction terms (𝑏 , 𝑏 ,𝑏 ) are insignificant from zero, suggesting that retail short selling 1 2 3 can’t exploit positive information, so that it won’t affect retail traders liquidity provision strategies. We also separate days when the market is more one-sided with greater temporary buying pressure. As above, we continue to use positive order imbalances to proxy for buying pressures on individual stocks. We interact positive order imbalances with contemporaneous and past returns, which can reflect the difference between liquidity provisions’ trading on stocks with or without liquidity shocks. The regression is as follows: 𝑟𝑡𝑙𝑠ℎ𝑜𝑟𝑡 = 𝑏 +𝑏 ∗𝑟𝑒𝑡 ∗𝑜𝑖𝑏(+) +𝑏 ∗𝑟𝑒𝑡 ∗𝑜𝑖𝑏(+) +𝑏 ∗ 𝑟𝑒𝑡 ∗ 𝑖,𝑡 0 1 𝑖,𝑡 𝑖,𝑡 2 𝑖,𝑡−5,𝑡−1 𝑖,𝑡 3 𝑖,𝑡−26,𝑡−6 𝑜𝑖𝑏(+) +𝑏 ∗𝑟𝑒𝑡 +𝑏 ∗𝑟𝑒𝑡 +𝑏 ∗𝑟𝑒𝑡 +𝑟∗ 𝑥 +𝑒 (5) 𝑖,𝑡 4 𝑖,𝑡 5 𝑖,𝑡−5,𝑡−1 6 𝑖,𝑡−26,𝑡−6 𝑖,𝑡−1 𝑖,𝑡 Table 10 Panel B reports results. In column (1), we use LRoib+ to proxy for overall buying pressure, which equals LRoib if LRoib>0 otherwise zero. All the interaction terms (𝑏 ,𝑏 ,𝑏 ) are positively significant. The average relation of retail shorting with 1 2 3 contemporaneous return (𝑏 ) is 0.004, but for the stocks with buying pressure, the relation 4 increases to 0.018 (0.004+0.014). This suggests that retail short sellers become more contrarian relative to the returns on stocks with greater temporary buying pressures. Column (2) uses positive retail net buying to proxy for retail buying pressure and column (3) uses positive “other” net buying to proxy for institutional buying pressure. The interaction terms (𝑏 ) are both 1 positively significant, but larger for institutional buying pressure than for retail buying pressures. In column (3), the average relation of retail shorting with contemporaneous return (𝑏 ) even becomes negative of -0.003, suggesting that retail short sales are not contrarian in the 4 32 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "5.3. Discussion",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 55,
    "chunk_index": 62,
    "word_count": 339,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.3. Discussion (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "1 positively significant, but larger for institutional buying pressure than for retail buying pressures. In column (3), the average relation of retail shorting with contemporaneous return (𝑏 ) even becomes negative of -0.003, suggesting that retail short sales are not contrarian in the 4 32 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "5.3. Discussion",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 55,
    "chunk_index": 63,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.3. Discussion (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "short term for the stocks without impatient institutional buyers. But for the stocks with larger institutional buying pressure, the relation increases to 0.007 (0.010-0.003). Overall, the results in Table 10 suggest that retail short sellers tend to use different trading strategies than regular retail traders do. Retail short sellers provide liquidity, possibly in a strategic manner, and typically trade act as contrarians, especially when there is temporary (institutional) buying pressure. But at other times, retail short sellers have private information. In these cases, retail traders behave more aggressively and are less contrarian relative to past returns. 6. Conclusions In this paper, we provide extensive evidence that retail short sellers can, as a group, predict returns. Exploiting FINRA’s short sell transaction data, we select a large group of short sell transactions initiated by retail investors between January 2010 and December 2016. We characterize the trading patterns and strategies of retail short sellers and find that retail short selling is a strong predictor of negative stock returns. A portfolio that mimics weekly retail shorting earns a risk-adjusted value-(equal-) weighted return of 0.024% (0.049%) in the next 20 trading days, annualized at 6% (12.25%). Using a formal cross-sectional regression, we find that most of the predictive power survives after controlling for firm characteristics and the activities of other informed traders. Our study contributes to the literature about the information that retail investors have. Recent literature finds that there is a positive relation between retail investors’ trading and future returns (Kaniel, et al., 2008; Kelley and Tetlock 2013; Boehmer, et al., 2019). We contribute to this literature. Among other things, we can differentiate smart transactions by retail short sellers from the entire set of retail trading. We find that the trading patterns of these 33 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "5.3. Discussion",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 55,
    "chunk_index": 64,
    "word_count": 296,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.3. Discussion (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "(Kaniel, et al., 2008; Kelley and Tetlock 2013; Boehmer, et al., 2019). We contribute to this literature. Among other things, we can differentiate smart transactions by retail short sellers from the entire set of retail trading. We find that the trading patterns of these 33 Electronic copy available at: https://ssrn.com/abstract=3723096 retail short sellers have distinct predictive powers that go beyond the information that retail traders have as a group. Retail short sellers tend to use different trading strategies depending on market conditions. When there is greater buying pressure and the market is rather one-sided, retail short sellers step in to provide liquidity and earn compensation for it. At other times, retail short sellers act more aggressively to exploit their information. In contrast, non-short retail orders cannot act on such information. This, retail short sales are integral to both price discovery and liquidity provision. Our study also contributes to the literature about the different types of short sellers and their strategies. Boehmer, Jones, and Zhang (2008) find that about 75% of all short sales are executed by institutions while individuals only represent less than 2%. As a group, retail investors may face high lending fees and entrance restrictions when short selling. Therefore, only the more sophisticated retail investors may initiate short selling activities. Our paper is consistent with this view. We provide empirical results showing that retail short sellers can indeed exploit public information and predict returns. But this is not all—retail short sellers also have their own private information that is distinct from the information that other retail investors have in general. Finally, retail short sellers do not only trade on the information and make prices more efficient—they can also strategically switch to become liquidity providers when needed. 34 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "5.3. Discussion",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 55,
    "chunk_index": 65,
    "word_count": 294,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.3. Discussion (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "have their own private information that is distinct from the information that other retail investors have in general. Finally, retail short sellers do not only trade on the information and make prices more efficient—they can also strategically switch to become liquidity providers when needed. 34 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "5.3. Discussion",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 55,
    "chunk_index": 66,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.3. Discussion (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "Arif, Salman, Azi Ben-Rephael, and Lee, Charles M.C., 2000. How Do Short Sellers Interact with Other Professional Investors? Evidence from the Daily Trades of Active Fund Managers Barber, B.M. and Odean, T., 2000. Trading is hazardous to your wealth: The common stock investment performance of individual investors. Journal of Finance, 55(2), pp.773-806. Barber, B.M. and Odean, T., 2001. Boys will be boys: Gender, overconfidence, and common stock investment. The quarterly journal of economics, 116(1), pp.261-292. Barber, B.M. and Odean, T., 2008. All that glitters: The effect of attention and news on the buying behavior of individual and institutional investors. Review of Financial Studies, 21(2), pp.785-818. Barrot, J.N., Kaniel, R. and Sraer, D., 2016. Are retail traders compensated for providing liquidity? Journal of Financial Economics, 120(1), pp.146-168. Boehmer, E., Jones, C.M. and Zhang, X., 2008. Which shorts are informed? Journal of Finance, 63(2), pp.491-527. Boehmer, E., Jones, C.M., Wu, J.J. and Zhang, X., 2020. What do short sellers know? Review of Finance. Boehmer, E., Jones, C.M., Zhang, X. and Zhang, X., 2019. Tracking retail investor activity. Chordia, T. and Subrahmanyam, A., 2004. Order imbalance and individual stock returns: Theory and evidence. Journal of Financial Economics, 72(3), pp.485-518. Christophe, S.E., Ferri, M.G. and Angel, J.J., 2004. Short selling prior to earnings announcements. Journal of Finance, 59(4), pp.1845-1876. Christophe, S.E., Ferri, M.G. and Hsieh, J., 2010. Informed trading before analyst downgrades: Evidence from short sellers. Journal of Financial Economics, 95(1), pp.85-106. Comerton-Forde, C., Jones, C.M. and Putniņš, T.J., 2016. Shorting at close range: a tale of two types. Journal of Financial Economics, 121(3), pp.546-568. Comerton-Forde, C., Malinova, K. and Park, A., 2018. Regulating dark trading: Order flow segmentation and market quality. Journal of Financial Economics, 130(2), pp.347-366. 35 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "References",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 55,
    "chunk_index": 67,
    "word_count": 290,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "Jones, C.M. and Putniņš, T.J., 2016. Shorting at close range: a tale of two types. Journal of Financial Economics, 121(3), pp.546-568. Comerton-Forde, C., Malinova, K. and Park, A., 2018. Regulating dark trading: Order flow segmentation and market quality. Journal of Financial Economics, 130(2), pp.347-366. 35 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "References",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 55,
    "chunk_index": 68,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "Diether, K.B., Lee, K.H. and Werner, I.M., 2008. Short-sale strategies and return predictability. Review of Financial Studies, 22(2), pp.575-607. Engelberg, J.E., Reed, A.V. and Ringgenberg, M.C., 2012. How are shorts informed: Short sellers, news, and information processing. Journal of Financial Economics, 105(2), pp.260- 278. Fama, E.F. and French, K.R., 1993. Common risk factors in the returns on stocks and bonds. Journal of Financial Economics, 33(1), pp.3-56. Fama, E.F. and MacBeth, J.D., 1973. Risk, return, and equilibrium: Empirical tests. Journal of Political Economy, 81(3), pp.607-636. Gamble, K.J. and Xu, W., 2017. Informed retail investors: Evidence from retail short sales. Journal of Empirical Finance, 40, pp.59-72. Jain, A. and Jain, C., 2017. Is Short Selling in OTC Stocks Informative? Jegadeesh, N. and Titman, S., 1993. Returns to buying winners and selling losers: Implications for stock market efficiency. Journal of Finance, 48(1), pp.65-91. Kaniel, R., Liu, S., Saar, G. and Titman, S., 2012. Individual investor trading and return patterns around earnings announcements. Journal of Finance, 67(2), pp.639-680. Kaniel, R., Saar, G. and Titman, S., 2008. Individual investor trading and stock returns. Journal of Finance, 63(1), pp.273-310. Kelley, E.K. and Tetlock, P.C., 2013. How wise are crowds? Insights from retail orders and stock returns. Journal of Finance, 68(3), pp.1229-1265. Kelley, E.K. and Tetlock, P.C., 2017. Retail short selling and stock prices. Review of Financial Studies, 30(3), pp.801-834. Kwan, A., Masulis, R. and McInish, T.H., 2015. Trading rules, competition for order flow and market fragmentation. Journal of Financial Economics, 115(2), pp.330-348. Lee, C. and Ready, M.J., 1991. Inferring trade direction from intraday data. Journal of Finance, 46(2), pp.733-746. Nagel, S., 2012. Evaporating liquidity. Review of Financial Studies, 25(7), pp.2005-2039. 36 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "References",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 55,
    "chunk_index": 69,
    "word_count": 280,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "2015. Trading rules, competition for order flow and market fragmentation. Journal of Financial Economics, 115(2), pp.330-348. Lee, C. and Ready, M.J., 1991. Inferring trade direction from intraday data. Journal of Finance, 46(2), pp.733-746. Nagel, S., 2012. Evaporating liquidity. Review of Financial Studies, 25(7), pp.2005-2039. 36 Electronic copy available at: https://ssrn.com/abstract=3723096 Odean, T., 1998. Are investors reluctant to realize their losses? Journal of Finance, 53(5), pp.1775-1798. Reed, A.V., Samadi, M. and Sokobin, J.S., 2018. Shorting in broad daylight: Short sales and venue choice. Journal of Financial and Quantitative Analysis, pp.1-24. Tetlock, P.C., 2010. Does public financial news resolve asymmetric information? Review of Financial Studies, 23(9), pp.3520-3557. Zhu, H., 2014. Do dark pools harm price discovery?. The Review of Financial Studies, 27(3), pp.747-789. 37 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "References",
    "page_number": 37,
    "page_range": "p.37-38",
    "total_pages": 55,
    "chunk_index": 70,
    "word_count": 127,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.37-38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "Short sales and venue choice. Journal of Financial and Quantitative Analysis, pp.1-24. Tetlock, P.C., 2010. Does public financial news resolve asymmetric information? Review of Financial Studies, 23(9), pp.3520-3557. Zhu, H., 2014. Do dark pools harm price discovery?. The Review of Financial Studies, 27(3), pp.747-789. 37 Electronic copy available at: https://ssrn.com/abstract=3723096 Table 1: Summary Statistics This table presents summary statistics of U.S. common stocks listed on NYSE, AMEX and Nasdaq from January 2010 to December 2016 with a share price of at least $1. In Panel A, across all stocks and all days, we first report the pooled sample mean for traded shares (vol), number of trades (trd), buyer-initiated traded shares (vol_buy), seller-initiated traded shares (vol_sell), number of buyer-initiated trades (trd_buy), and number of seller-initiated trades (trd_sell). Data is from daily TAQ. Buys and sells are identified following the Lee and Ready (1991) algorithm. Panel B reports off-exchange trading and retail trading. It includes shares traded off-exchanges (otcvol), number of trades off-exchanges (otctrd), retail buy volumes (rtlvol_buy), retail sell volumes (rtlvol_sell), retail buy trades (rtltrd_buy), and retail sell trades (rtltrd_sell). OTC trading is from daily TAQ with exchange code “D”. Retail buys and sells are identified as the OTC trading with sub-penny price improvement. Panel C reports OTC short selling volumes (otcshort_vol) and OTC short selling trades (otcshort_trd). OTC short selling data is from FINRA. Panel C also reports retail short selling volumes (rtlshort_vol) and retail short selling trades (rtlshort_trd). Retail short selling is identified as the group of OTC short selling which has sub-penny price improvements compared with round penny. In Panel D, we calculate the percentage of retail shorting volumes/trades in total retail trading volumes /trades (rtlshort_rtlvol /rtlshort_rtltrd), the percentage of retail shorting volumes/ trades in total OTC shorting volumes/trades (rtlshort_otcshortvol /rtlshort_otcshorttrd), the percentage of retail shorting volumes in all the shares traded (rtlshort), and the percentage of retail shorting trades in all the number of trades (rtlshort_t). Variable N Mean Std Dev Median Q1 Q3 Panel A Vol 6224866 1,148,048 6,314,922 188,166 37,456 741,700 Trd 6224866 5,603 13,684 1,295 220 5,049 Vol_buy 6224866 569,372 3,000,150 91,177 17,297 366,708 Vol_sell 6224866 578,089 3,349,302 94,383 18,655 372,891 Trd_buy 6224866 2,802 6,879 639 105 2,518 Trd_sell 6224866 2,801 6,842 649 110 2,525 Panel B Otcvol 6224866 393,715 2,626,586 56,599 11,295 230,794 Otctrd 6224866 1,296 3,660 284 54 1,083 Rtlvol_buy 6224866 42,526 275,679 4,758 908 19,915 Rtlvol_sell 6224866 42,177 258,384 5,140 1,028 20,871 Rtltrd_buy 6224866 111 420 21 4 78 Rtltrd_sell 6224866 107 362 23 5 81 Panel C Otcshort_vol 6224866 160,189 1,010,098 19,049 3,233 88,155 Otcshort_trd 6224866 583 1,657 107 16 472 Rtlshort_vol 6224866 7,925 54,519 800 0 3,948 Rtlshort_trd 6224866 24 85 4 0 18 Panel D Rtlshort_rtlvol 5889923 10.92% 13.80% 7.04% 0.75% 15.20% Rtlshort_rtltrd 5889923 11.38% 12.83% 8.33% 1.69% 16.22% Rtlshort_otcshortvol 5840798 6.36% 10.99% 3.33% 0.53% 7.36% Rtlshort_otcshorttrd 5840798 5.45% 9.29% 3.19% 0.77% 6.36% Rtlshort 6224866 0.78% 2.21% 0.32% 0.00% 0.79% Rtlshort_t 6224866 0.53% 1.46% 0.25% 0.00% 0.56% 38 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "References",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 55,
    "chunk_index": 71,
    "word_count": 495,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "Panel D Rtlshort_rtlvol 5889923 10.92% 13.80% 7.04% 0.75% 15.20% Rtlshort_rtltrd 5889923 11.38% 12.83% 8.33% 1.69% 16.22% Rtlshort_otcshortvol 5840798 6.36% 10.99% 3.33% 0.53% 7.36% Rtlshort_otcshorttrd 5840798 5.45% 9.29% 3.19% 0.77% 6.36% Rtlshort 6224866 0.78% 2.21% 0.32% 0.00% 0.79% Rtlshort_t 6224866 0.53% 1.46% 0.25% 0.00% 0.56% 38 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "References",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 55,
    "chunk_index": 72,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "Table 2: Portfolio Returns Based on Retail Short Selling This table presents daily returns for portfolios based on weekly retail short sells from January 2010 to December 2016. Each day, stocks are sorted into quintiles based on weekly retail short selling volumes (rtlshort_vol_w) in Panel A, weekly retail short selling trades (rtlshort_trd_w) in Panel B, weekly retail short selling’s percentage of volumes (rtlshort_w) in Panel C, and weekly retail short selling’s percentage of trades (rtlshort_t_w) in Panel D. After skipping 1 day, value-(equal-) weighted portfolios are held for 20 trading days. This process is repeated each trading day, so each trading day’s portfolio return is an average of 20 different portfolios, with 1/20 of the portfolio rebalanced each day, following Jegadeesh and Titman (1993). Daily calendar time returns and Fama and French (1993) three factor alphas are reported in percent. Newey-West (1987) t- statistics based on five lags appear in parentheses. Panel A: Number of weekly retail short sell volume (rtlshort_vol_w) Panel B: Number of weekly retail short sell trades (rtlshort_trd_w) Value-weighted [1,20] Equal-weighted [1,20] Value-weighted [1,20] Equal-weighted [1,20] Return Alpha Return Alpha Return Alpha Return Alpha 1 (Least) 0.058 0.022 0.076 0.053 1 (Least) 0.059 0.026 0.078 0.057 2 0.061 0.016 0.061 0.020 2 0.062 0.018 0.059 0.019 3 0.059 0.010 0.055 0.006 3 0.059 0.011 0.053 0.002 4 0.056 0.005 0.046 -0.009 4 0.056 0.005 0.045 -0.010 5(Most) 0.048 -0.002 0.035 -0.023 5(Most) 0.048 -0.002 0.039 -0.018 5-1 -0.010 -0.024*** -0.041** -0.075*** 5-1 -0.010 -0.027*** -0.038** -0.074*** (-0.998) (-4.505) (-2.528) (-7.523) (-0.997) (-4.985) (-2.415) (-7.295) Panel C: Weekly retail shorting’s percentage of volume (rtlshort_w) Panel D: Weekly Retail shorting’s percentage of trades (rtlshort_t_w) Value-weighted [1,20] Equal-weighted [1,20] Value-weighted [1,20] Equal-weighted [1,20] Return Alpha Return Alpha Return Alpha Return Alpha 1 (Least) 0.061 0.017 0.073 0.045 1 (Least) 0.061 0.015 0.073 0.043 2 0.059 0.010 0.058 0.009 2 0.056 0.007 0.060 0.010 3 0.050 0.002 0.053 0.002 3 0.050 0.001 0.052 0.000 4 0.045 -0.006 0.047 -0.005 4 0.046 -0.006 0.046 -0.005 5(Most) 0.049 -0.006 0.041 -0.004 5(Most) 0.043 -0.011 0.041 -0.002 5-1 -0.012 -0.024*** -0.032*** -0.049*** 5-1 -0.018 -0.027** -0.032*** -0.045*** (-1.185) (-2.606) (-2.819) (-6.865) (-1.556) (-2.378) (-3.052) (-6.294) 39 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "References",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 55,
    "chunk_index": 73,
    "word_count": 367,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "0.002 3 0.050 0.001 0.052 0.000 4 0.045 -0.006 0.047 -0.005 4 0.046 -0.006 0.046 -0.005 5(Most) 0.049 -0.006 0.041 -0.004 5(Most) 0.043 -0.011 0.041 -0.002 5-1 -0.012 -0.024*** -0.032*** -0.049*** 5-1 -0.018 -0.027** -0.032*** -0.045*** (-1.185) (-2.606) (-2.819) (-6.865) (-1.556) (-2.378) (-3.052) (-6.294) 39 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "References",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 55,
    "chunk_index": 74,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "Table 3: Portfolio Returns Based on Retail Trading and Retail Short Selling This table presents daily value-weighted returns for portfolios first sorted on weekly retail order imbalances, and then sorted on weekly retail short sells. Sample period is from January 2010 to December 2016. Each day, stocks are first sorted into quintiles based on the weekly retail order imbalances, calculated as (retail buy volumes-retail long sell volumes)/total volumes, over the previous five trading day. Within each quintile, stocks are second sorted into quintiles based on retail short sell percentage of volumes over the previous five trading day. After skipping 1 day, value-weighted portfolios are held for 20 trading days. We adjust overlaps following Jegadeesh and Titman (1993). Daily calendar time returns and Fama and French (1993) three factor alphas are reported in percent. Newey-West (1987) t-statistics based on five lags appear in parentheses. Second sort: Weekly retail short sell percentage of volumes (rtlshort_w) First sort: Weekly retail order imbalances (rtloib_w) Value-weighted Return [1, 20] Value-weighted Alpha [1, 20] 1 (Low) 2 3 4 5 (High) 1 (Low) 2 3 4 5 (High) 1 (Least) 0.045 0.058 0.064 0.069 0.078 0.014 0.015 0.015 0.021 0.044 (2.462) (2.870) (2.855) (3.190) (3.958) (2.319) (3.021) (3.189) (4.445) (5.923) 2 0.047 0.057 0.063 0.058 0.066 0.006 0.009 0.012 0.010 0.021 (2.354) (2.641) (2.936) (2.857) (3.194) (1.371) (2.149) (3.479) (2.798) (3.150) 3 0.050 0.051 0.052 0.047 0.055 0.004 0.003 0.002 -0.004 0.007 (2.371) (2.470) (2.543) (2.212) (2.660) (0.797) (0.848) (0.668) (-1.244) (1.034) 4 0.035 0.044 0.048 0.044 0.041 -0.011 -0.003 -0.003 -0.010 -0.015 (1.641) (2.236) (2.285) (1.949) (1.606) (-2.041) (-0.802) (-0.923) (-2.176) (-1.438) 5 (Most) 0.033 0.041 0.042 0.041 0.054 -0.010 -0.007 -0.010 -0.015 -0.005 (1.397) (1.914) (1.929) (1.630) (1.711) (-1.594) (-1.502) (-2.548) (-1.884) (-0.273) 5-1 -0.012 -0.017*** -0.022*** -0.027** -0.024 -0.025*** -0.022*** -0.025*** -0.036*** -0.050** (-1.266) (-2.695) (-3.529) (-2.488) (-1.025) (-3.358) (-3.330) (-3.838) (-3.397) (-2.384) 40 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "References",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 55,
    "chunk_index": 75,
    "word_count": 316,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "(-1.438) 5 (Most) 0.033 0.041 0.042 0.041 0.054 -0.010 -0.007 -0.010 -0.015 -0.005 (1.397) (1.914) (1.929) (1.630) (1.711) (-1.594) (-1.502) (-2.548) (-1.884) (-0.273) 5-1 -0.012 -0.017*** -0.022*** -0.027** -0.024 -0.025*** -0.022*** -0.025*** -0.036*** -0.050** (-1.266) (-2.695) (-3.529) (-2.488) (-1.025) (-3.358) (-3.330) (-3.838) (-3.397) (-2.384) 40 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "References",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 55,
    "chunk_index": 76,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "Table 4: Cross-sectional Regressions of Returns on Retail Short Selling This table presents daily Fama Macbeth (1973) regressions of next month’s returns [t+1, t+20] on weekly retail short selling [t-5, t-1] (rtlshort_w) and control variables measured as of day t. Sample period is from January 2010 to December 2016. The dependent variable in Panel A is cumulative raw returns [t+1, t+20], and the dependent variable in Panel B is cumulative risk-adjusted returns [t+1, t+20] using Fama-French three factor model, with betas estimated from the previous year. We also include weekly dark pool non-retail short sells [t-5, t-1] (darkshort_w), calculated as (OTC short sell volumes-retail short sell volumes)/total volumes, and weekly retail order imbalance [t-5, t-1] (rtloib_w), calculated as (retail buy volumes-retail long sell volumes)/total volumes. Other control variables include previous week return [t-5, t-1] ret(w-1), previous month returns [t-25, t-6] ret (m- 1), and previous year returns [t-251, t-26] ret(y-1). We also include log(market cap) (size), log (book to market) (btm), monthly turnover (turn), and monthly volatility of daily returns (vol), all measured at the end of the previous month. To account for serial correlation in the coefficients, the standard deviation of time-series is adjusted using Newey-West with 20 lags. Dependent variables are in percent, and all the independent variables are standardized each day t. Panel A: Cumulative raw returns as dependent variable Y= Cumulative raw returns [t+1, t+20] 1 2 3 4 Rtlshort_w -0.114*** -0.065*** -0.051*** -0.073*** (-4.04) (-3.06) (-2.58) (-3.50) Darkshort_w -0.085*** (-2.74) Rtloib_w 0.126*** (11.70) Log(Size) 0.109 0.106 0.107 (1.42) (1.38) (1.39) Log(Btm) 0.113 0.106 0.114 (1.54) (1.45) (1.56) Turn -0.170*** -0.158*** -0.172*** (-3.44) (-3.35) (-3.48) Vol -0.343*** -0.337*** -0.342*** (-4.82) (-4.80) (-4.80) Ret (w-1) -0.143*** -0.137*** -0.148*** (-3.98) (-3.74) (-4.13) Ret (m-1) 0.048 0.046 0.051 (0.82) (0.78) (0.87) Ret (y-1) 0.157** 0.152** 0.156** (2.07) (2.01) (2.06) Intercept 1.013** 1.013** 1.013** 1.013** (2.57) (2.57) (2.57) (2.57) R square 0.001 0.041 0.042 0.042 # of days 1736 1736 1736 1736 Obs 5542587 5542587 5542587 5542587 41 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "References",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 55,
    "chunk_index": 77,
    "word_count": 333,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "(-4.13) Ret (m-1) 0.048 0.046 0.051 (0.82) (0.78) (0.87) Ret (y-1) 0.157** 0.152** 0.156** (2.07) (2.01) (2.06) Intercept 1.013** 1.013** 1.013** 1.013** (2.57) (2.57) (2.57) (2.57) R square 0.001 0.041 0.042 0.042 # of days 1736 1736 1736 1736 Obs 5542587 5542587 5542587 5542587 41 Electronic copy available at: https://ssrn.com/abstract=3723096 Panel B: Cumulative risk-adjusted returns as dependent variable Y= Cumulative risk-adjusted returns [t+1, t+20] 1 2 3 4 Rtlshort_w -0.070*** -0.056*** -0.038** -0.065*** (-2.93) (-3.26) (-2.41) (-3.81) Darkshort_w -0.122*** (-3.97) Rtloib_w 0.118*** (10.74) Log(Size) -0.223*** -0.224*** -0.224*** (-3.32) (-3.31) (-3.34) Log(Btm) 0.127*** 0.117*** 0.129*** (3.12) (2.84) (3.15) Turn -0.197*** -0.183*** -0.199*** (-4.26) (-4.06) (-4.30) Vol -0.294*** -0.287*** -0.293*** (-5.10) (-5.04) (-5.08) Ret (w-1) -0.141*** -0.132*** -0.146*** (-4.30) (-3.95) (-4.46) Ret (m-1) 0.042 0.040 0.045 (0.78) (0.74) (0.84) Ret (y-1) 0.161** 0.154** 0.160** (2.57) (2.47) (2.56) Intercept 0.119** 0.117** 0.117** 0.117** (2.04) (2.02) (2.02) (2.02) R square 0.001 0.029 0.030 0.029 # of days 1736 1736 1736 1736 Obs 5364476 5364476 5364476 5364476 42 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "References",
    "page_number": 42,
    "page_range": "p.42-43",
    "total_pages": 55,
    "chunk_index": 78,
    "word_count": 168,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.42-43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "(-4.46) Ret (m-1) 0.042 0.040 0.045 (0.78) (0.74) (0.84) Ret (y-1) 0.161** 0.154** 0.160** (2.57) (2.47) (2.56) Intercept 0.119** 0.117** 0.117** 0.117** (2.04) (2.02) (2.02) (2.02) R square 0.001 0.029 0.030 0.029 # of days 1736 1736 1736 1736 Obs 5364476 5364476 5364476 5364476 42 Electronic copy available at: https://ssrn.com/abstract=3723096 Table 5: Sub-sample Cross-sectional Regressions This table presents sub-sample daily Fama Macbeth (1973) regressions by firm market capitalization in Panel A and by firm liquidity in Panel B. Sample period is from January 2010 to December 2016. We first sort all the stocks into 3 groups based on previous month-end firm size/firm turnover, and then estimate Fama Macbeth (1973) regressions for each subgroup. Dependent variable is cumulative raw returns [t+1, t+20], and independent variables include total weekly retail order imbalance [t-5, t-1] (rtloib_total_w), which is (retail buy volumes-retail sell volumes)/total volumes, weekly retail short sells [t-5, t-1] (rtlshort_w), and weekly retail order imbalance [t- 5, t-1] (rtloib_w), which is (retail buy volumes-retail long sell volumes)/total volumes. Other control variables include previous week return [t-5, t-1] ret(w-1), previous month returns [t-25, t-6] ret (m-1), and previous year returns [t-251, t-26] ret(y-1). They also include log (market cap) (size), log (book to market) (btm), monthly turnover (turn), and monthly volatility of daily returns (vol), all measured at the end of previous month. To account for serial correlation in the coefficients, the standard deviations of time-series are adjusted using Newey-West with 20 lags. Dependent variables are in percent, and all the independent variables are standardized each day t. Panel A: Market-cap groups Y= Cumulative raw returns [t+1, t+20] Small Medium Large 1 2 3 4 5 6 Rtloib_total_w 0.189*** 0.117*** 0.023 (10.18) (5.94) (1.44) Rtlshort_w -0.065*** -0.103*** -0.071*** (-2.71) (-4.27) (-2.81) Rtloib_w 0.182*** 0.108*** 0.017 (9.81) (5.28) (0.99) Log(Size) 0.229** 0.226** 0.050 0.042 -0.069 -0.062 (2.08) (2.06) (1.04) (0.88) (-1.39) (-1.23) Log(Btm) 0.292*** 0.292*** 0.056 0.053 0.001 -0.007 (3.88) (3.89) (0.61) (0.57) (0.02) (-0.11) Turn -0.279*** -0.278*** -0.194*** -0.190*** -0.171*** -0.159** (-4.34) (-4.32) (-2.73) (-2.69) (-2.69) (-2.57) Vol -0.531*** -0.533*** -0.149* -0.147* 0.010 0.013 (-6.05) (-6.08) (-1.74) (-1.72) (0.12) (0.15) Ret (w-1) -0.232*** -0.231*** -0.104** -0.101** -0.038 -0.035 (-5.35) (-5.32) (-2.56) (-2.49) (-0.96) (-0.90) Ret (m-1) 0.112* 0.113* -0.002 0.001 0.028 0.030 (1.68) (1.69) (-0.03) (0.01) (0.41) (0.44) Ret (y-1) 0.228*** 0.229*** 0.105 0.109 0.071 0.074 (2.60) (2.60) (1.22) (1.27) (0.86) (0.90) Intercept 0.710* 0.710* 1.154** 1.154** 1.176*** 1.176*** (1.85) (1.85) (2.51) (2.51) (3.13) (3.13) R square 0.045 0.046 0.052 0.054 0.081 0.083 # of days 1736 1736 1736 1736 1736 1736 Obs 1846963 1846963 1848103 1848103 1847521 1847521 43 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "References",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 55,
    "chunk_index": 79,
    "word_count": 432,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "0.074 (2.60) (2.60) (1.22) (1.27) (0.86) (0.90) Intercept 0.710* 0.710* 1.154** 1.154** 1.176*** 1.176*** (1.85) (1.85) (2.51) (2.51) (3.13) (3.13) R square 0.045 0.046 0.052 0.054 0.081 0.083 # of days 1736 1736 1736 1736 1736 1736 Obs 1846963 1846963 1848103 1848103 1847521 1847521 43 Electronic copy available at: https://ssrn.com/abstract=3723096 Panel B: Turnover groups Y= Cumulative raw returns [t+1, t+20] Low Medium High 1 2 3 4 5 6 Rtloib_total_w 0.184*** 0.122*** 0.065** (10.75) (5.03) (2.33) Rtlshort_w -0.046** -0.138*** -0.185*** (-2.05) (-4.71) (-4.87) Rtloib_w 0.181*** 0.107*** 0.044 (10.82) (4.26) (1.50) Log(Size) -0.009 -0.009 -0.022 -0.041 0.358*** 0.325*** (-0.09) (-0.10) (-0.29) (-0.55) (4.06) (3.77) Log(Btm) 0.222*** 0.222*** 0.091 0.087 -0.029 -0.043 (3.67) (3.68) (1.38) (1.33) (-0.27) (-0.41) Turn 0.059 0.060 -0.016 -0.018 -0.292*** -0.278*** (0.94) (0.96) (-0.57) (-0.62) (-4.76) (-4.64) Vol -0.445*** -0.447*** -0.322*** -0.313*** -0.215** -0.194** (-6.98) (-6.99) (-4.52) (-4.41) (-2.38) (-2.19) Ret (w-1) -0.153*** -0.153*** -0.125*** -0.122*** -0.152*** -0.145*** (-4.17) (-4.17) (-3.39) (-3.30) (-3.27) (-3.13) Ret (m-1) 0.040 0.040 0.082 0.085 0.014 0.014 (0.74) (0.72) (1.37) (1.42) (0.18) (0.19) Ret (y-1) 0.215*** 0.215*** 0.174** 0.177** 0.106 0.122 (3.48) (3.48) (2.38) (2.42) (1.05) (1.19) Intercept 1.120*** 1.120*** 1.148*** 1.148*** 0.773 0.773 (3.36) (3.36) (2.89) (2.89) (1.63) (1.63) R square 0.044 0.045 0.051 0.053 0.059 0.061 # of days 1736 1736 1736 1736 1736 1736 Obs 1846963 1846963 1848103 1848103 1847521 1847521 44 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "References",
    "page_number": 44,
    "page_range": "p.44-45",
    "total_pages": 55,
    "chunk_index": 80,
    "word_count": 227,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.44-45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "0.122 (3.48) (3.48) (2.38) (2.42) (1.05) (1.19) Intercept 1.120*** 1.120*** 1.148*** 1.148*** 0.773 0.773 (3.36) (3.36) (2.89) (2.89) (1.63) (1.63) R square 0.044 0.045 0.051 0.053 0.059 0.061 # of days 1736 1736 1736 1736 1736 1736 Obs 1846963 1846963 1848103 1848103 1847521 1847521 44 Electronic copy available at: https://ssrn.com/abstract=3723096 Table 6: Cross-sectional Regression of Returns on Retail Short Selling: News vs. Non- News This table presents daily Fama Macbeth (1973) regressions of returns on retail short selling, by dividing days into news days and non-news days. Sample period is from January 2010 to December 2016. Panel A includes all types of news, and Panel B includes negative news only. The news dummy equals 1 if there is an earning announcement, analyst recommendation change, or analyst forecast revision on that date, and 0 otherwise. The negative news dummy equals 1 if there is negative unexpected earnings surprise, or analyst recommendation downgrades, or negative revisions of analyst forecasts on that date, and 0 otherwise. The dependent variables are cumulative raw returns over [t+1, t+5] and over [t+1, t+20]. Independent variables include weekly retail short sell share of volumes [t-5, t-1] rtlshort_w, interactions between rtlshort_w and news dummy, dummy variable news dummy(t=0). We also include previous week return [t-5, t-1] ret(w-1), previous month returns [t-25, t-6] ret (m-1), previous year returns [t-251, t-26] ret(y-1). We also include log market cap (size), log (book to market ratio) (btm), monthly turnover (turn), and monthly volatility of daily returns (vol), all measured at the end of previous month. To account for serial correlation in the coefficients, the standard deviations of time-series are adjusted using Newey-West with 5 lags and 20 lags. Dependent variables are in percent, and independent variables except dummy variable news are standardized each day t. Panel A: All types of news Y=Cumulative raw returns [t+1, t+5] Y=Cumulative raw returns [t+1, t+20] 1 2 3 4 5 6 Rtlshort_w -0.018*** -0.016*** -0.016*** -0.063*** -0.062*** -0.061*** (-3.01) (-2.75) (-2.71) (-3.02) (-2.99) (-2.94) Rtlshort_w * News dummy -0.018*** -0.015*** -0.015 -0.018* (-3.71) (-2.88) (-1.21) (-1.65) News dummy -0.031 -0.021 (-1.22) (-0.28) Controls yes yes yes yes yes yes R square 0.044 0.044 0.045 0.041 0.042 0.042 # of days 1736 1736 1736 1736 1736 1736 Obs 5540550 5540550 5540550 5540550 5540550 5540550 45 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "References",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 55,
    "chunk_index": 81,
    "word_count": 383,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "-0.015*** -0.015 -0.018* (-3.71) (-2.88) (-1.21) (-1.65) News dummy -0.031 -0.021 (-1.22) (-0.28) Controls yes yes yes yes yes yes R square 0.044 0.044 0.045 0.041 0.042 0.042 # of days 1736 1736 1736 1736 1736 1736 Obs 5540550 5540550 5540550 5540550 5540550 5540550 45 Electronic copy available at: https://ssrn.com/abstract=3723096 Panel B: Negative news only Y=Cumulative raw returns [t+1, t+5] Y=Cumulative raw returns [t+1, t+20] 1 2 3 4 5 6 Rtlshort_w -0.018*** -0.014** -0.016*** -0.060** -0.054** -0.057** (-2.89) (-2.15) (-2.61) (-2.57) (-2.35) (-2.46) Rtlshort_w * Negative news dummy -0.060*** -0.017*** -0.065*** -0.027** (-11.89) (-3.18) (-4.81) (-2.22) Negative news dummy -0.308*** -0.311*** (-8.78) (-3.17) Controls yes yes yes yes yes yes R square 0.046 0.047 0.047 0.043 0.044 0.044 # of days 1736 1736 1736 1736 1736 1736 Obs 5135789 5135789 5135789 5135789 5135789 5135789 46 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "References",
    "page_number": 46,
    "page_range": "p.46-47",
    "total_pages": 55,
    "chunk_index": 82,
    "word_count": 141,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.46-47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "-0.065*** -0.027** (-11.89) (-3.18) (-4.81) (-2.22) Negative news dummy -0.308*** -0.311*** (-8.78) (-3.17) Controls yes yes yes yes yes yes R square 0.046 0.047 0.047 0.043 0.044 0.044 # of days 1736 1736 1736 1736 1736 1736 Obs 5135789 5135789 5135789 5135789 5135789 5135789 46 Electronic copy available at: https://ssrn.com/abstract=3723096 Table 7: Cross-sectional Regressions of Returns on Retail Trading and Retail Short Selling: News vs. Non-News This table presents daily Fama Macbeth (1973) regressions of returns on retail short selling and retail order imbalances, by dividing days into news days and non-news days. Sample period is from January 2010 to December 2016. The news dummy equals to 1 if there is earning announcement, or analyst recommendation change, or analyst forecast revision on that date, else equals to 0. The dependent variables are cumulative raw returns over [t+1, t+5]. Independent variables include total weekly retail order imbalance [t-5, t-1] (rtloib_total_w), weekly retail short sells [t-5, t-1] (rtlshort_w), weekly retail order imbalance [t-5, t-1] (rtloib_w), and their interactions with dummy variable news dummy, as well as news dummy(t=0). Independent variables also include previous week return [t-5, t-1] ret(w-1), previous month returns [t-25, t-6] ret (m-1), previous year returns [t-251, t-26] ret(y-1). We also control log(market cap) (size), log (book to market) (btm), monthly turnover (turn), and monthly volatility of daily returns (vol), all measured at the end of previous month. To account for serial correlation in the coefficients, the standard deviations of time-series are adjusted using Newey-West with 5 lags. Dependent variables are in percent, and independent variables except dummy variable news are standardized each day t. Y=Cumulative raw returns [t+1, t+5] 1 2 Rtloib_total_w 0.053*** (12.67) Rtloib_total_w*News dummy -0.001 (-0.26) Rtlshort_w -0.015*** (-2.59) Rtlshort_w*News dummy -0.018*** (-2.58) Rtloib_w 0.052*** (12.07) Rtloib_w*News dummy -0.004 (-0.74) News dummy 0.021 0.048* (0.89) (1.92) Controls yes yes R square 0.045 0.047 # of days 1736 1736 Obs 5540550 5540550 47 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "References",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 55,
    "chunk_index": 83,
    "word_count": 320,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "1 2 Rtloib_total_w 0.053*** (12.67) Rtloib_total_w*News dummy -0.001 (-0.26) Rtlshort_w -0.015*** (-2.59) Rtlshort_w*News dummy -0.018*** (-2.58) Rtloib_w 0.052*** (12.07) Rtloib_w*News dummy -0.004 (-0.74) News dummy 0.021 0.048* (0.89) (1.92) Controls yes yes R square 0.045 0.047 # of days 1736 1736 Obs 5540550 5540550 47 Electronic copy available at: https://ssrn.com/abstract=3723096 Table 8: Cross-sectional Regressions of Determinants of Retail Short Selling This table presents daily Fama Macbeth (1973) regressions of determinants for retail short sells. Sample period is from January 2010 to December 2016. Dependent variable is retail short sell percentage of volumes on day t=0 rtlshort, and independent variables include contemporaneous day return t=0 ret(t=0), previous week return [t-5, t-1] ret(w-1), previous month returns [t-25, t-6] ret (m-1). We also include log (market cap) (size), log (book to market) (btm), monthly turnover (turn), and monthly volatility of daily returns (vol), all measured at the end of previous month. We also include weekly retail short sell percentage of volumes [t-5, t-1] rtlshort_w, and the most recent short interest shortint, which can be observed on day t=0. To account for serial correlation in the coefficients, the standard deviations of time-series are adjusted using Newey-West with 5 lags. All the dependent variable and independent variables are standardized each day t. Y=Rtlshort [t=0] 1 2 3 Rtlshort_w 0.106*** (47.27) Shortint -0.002 (-1.43) Log(Size) -0.074*** -0.059*** (-12.79) (-12.98) Log(Btm) -0.018*** -0.015*** (-19.08) (-21.50) Turn 0.015*** 0.012*** (9.09) (10.22) Vol 0.013*** 0.011*** (6.58) (6.86) Ret (t=0) 0.014*** 0.014*** 0.014*** (13.61) (15.28) (15.39) Ret (w-1) 0.019*** 0.019*** 0.017*** (14.21) (17.98) (18.45) Ret (m-1) 0.011*** 0.010*** 0.007*** (6.50) (8.83) (8.21) Intercept -0.000 -0.003*** 0.000*** (-0.43) (-8.57) (10.08) R square 0.003 0.014 0.027 # of days 1736 1736 1736 Obs 5542587 5542587 5542587 48 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "References",
    "page_number": 48,
    "page_range": "p.48",
    "total_pages": 55,
    "chunk_index": 84,
    "word_count": 290,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "0.014*** 0.014*** 0.014*** (13.61) (15.28) (15.39) Ret (w-1) 0.019*** 0.019*** 0.017*** (14.21) (17.98) (18.45) Ret (m-1) 0.011*** 0.010*** 0.007*** (6.50) (8.83) (8.21) Intercept -0.000 -0.003*** 0.000*** (-0.43) (-8.57) (10.08) R square 0.003 0.014 0.027 # of days 1736 1736 1736 Obs 5542587 5542587 5542587 48 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "References",
    "page_number": 49,
    "page_range": "p.49",
    "total_pages": 55,
    "chunk_index": 85,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "Table 9: Cross-sectional Regressions of Retail Short Selling on Buying Pressure This table presents daily Fama Macbeth (1973) regressions of retail short sells with buying pressures on individual stocks. Sample period is from January 2010 to December 2016. Dependent variable is retail short sell share of volumes on day t=0 rtlshort. Independent variables include positive contemporaneous Lee and Ready order imbalance LRoib+(0) and weekly Lee and Ready order imbalance [t-5, t-1] LRoib+_w. LRoib is calculated as (buy volumes-sell volumes)/total volumes, and LRoib+ equals LRoib if LRoib>0 and zero otherwise. Independent variables also include positive contemporaneous retail order imbalance rtloib+(0), weekly retail order imbalance [t-5, t-1] rtloib+_w, positive contemporaneous other order imbalance otheroib+ and weekly other order imbalance [t-5, t-1] otheroib+_w. Rtloib is calculated as (retail buy volumes – retail long sell volumes)/total volumes, and Rtloib+ equals rtloib if rtloib>0 and zero otherwise. Otheroib is calculated as ((buy volumes-retail buy volumes)- (sell volumes-retail sell volumes))/total volumes, and otheroib+ equals otheroib if otheroib>0 and zero otherwise. Other control variables include contemporaneous day return t=0 ret(0), previous week return [t-5, t-1] ret(w-1), previous month returns [t-25, t-6] ret (m-1), weekly retail short sell share of volumes [t-5, t-1] rtlshort_w, and the most recent short interest shortint, which can be observed on day t=0. We also include lo( market cap) (size), log (book to market) (btm), monthly turnover (turn), and monthly volatility of daily returns (vol), all measured at the end of previous month. To account for serial correlation in the coefficients, the standard deviations of time-series are adjusted using Newey-West with 5 lags. All the dependent variable and independent variables, except order imbalance, are standardized each day t. Order imbalance is not demeaned but standardized to have unit standard deviation before partitioning into positive and negative values. Y=Rtlshort [t=0] 1 2 3 4 LRoib+ 0.014*** (4.21) LRoib+_w 0.010*** (10.29) Rtloib+ 0.021*** 0.025*** (7.31) (9.16) Rtloib+_w 0.032*** 0.029*** (34.90) (35.09) Otheroib+ 0.153*** 0.149*** (27.84) (27.57) Otheroib+_w -0.008*** -0.010*** (-2.00) (-11.34) Controls yes yes yes yes R square 0.030 0.033 0.040 0.045 # of days 1736 1736 1736 1736 Obs 5542587 5542587 5542587 5542587 49 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "References",
    "page_number": 49,
    "page_range": "p.49",
    "total_pages": 55,
    "chunk_index": 86,
    "word_count": 355,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "(10.29) Rtloib+ 0.021*** 0.025*** (7.31) (9.16) Rtloib+_w 0.032*** 0.029*** (34.90) (35.09) Otheroib+ 0.153*** 0.149*** (27.84) (27.57) Otheroib+_w -0.008*** -0.010*** (-2.00) (-11.34) Controls yes yes yes yes R square 0.030 0.033 0.040 0.045 # of days 1736 1736 1736 1736 Obs 5542587 5542587 5542587 5542587 49 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "References",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 55,
    "chunk_index": 87,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "Table 10: Cross-sectional Regressions of Determinants of Retail Short Selling under Different Situations (News Days, Buying Pressure) This table presents daily Fama Macbeth (1973) regressions of retail short sells on returns and other control variables on the stocks with or without news in Panel A and with or without buying pressure in Panel B. The sample period is from January 2010 to December 2016. The dependent variable is retail short sell share of volumes on day t=0 rtlshort. In Panel A, news dummy equals 1 if there is earning announcement, or analyst recommendation change, or analyst forecast revision on that date, else equals to 0. We include interaction terms of contemporaneous and past returns with news dummy, returns, and news dummy. In Panel B, order imbalance LRoib+ /rtloib+/otheroib+ equals LRoib /rtloib /otheroib if greater than zero, and otherwise 0. We include interaction terms of contemporaneous and past returns with non-negative order imbalance, contemporaneous and past returns, and non-negative order imbalance. To account for serial correlation in the coefficients, the standard deviations of time-series are adjusted using Newey-West with 5 lags. All the dependent variables and independent variables except order imbalance and news, are standardized each day t. Order imbalance is not demeaned but standardized to have unit standard deviation before dividing into positive and negative values. Panel A: Interacted with news days Y=Rtlshort [t=0] 1 2 3 Ret (t=0)*News dummy -0.006*** (-8.82) Ret (w-1)*News dummy -0.002*** (-5.78) Ret (m-1)*News dummy -0.001 (-1.55) Ret (t=0)*Negative news dummy -0.009*** (-10.78) Ret (w-1)*Negative news dummy -0.004*** (-8.35) Ret (m-1)*Negative news dummy -0.001** (-2.42) Ret (t=0)*Positive news dummy -0.000 (-0.67) Ret (w-1)*Positive news dummy 0.000 (0.30) Ret (m-1)*Positive news dummy -0.000 (-0.06) Ret (t=0) 0.016*** 0.017*** 0.014*** (16.25) (15.66) (12.23) Ret (w-1) 0.019*** 0.021*** 0.020*** (14.76) (13.70) (13.16) Ret (m-1) 0.011*** 0.010*** 0.011*** (6.69) (5.57) (5.69) 50 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "References",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 55,
    "chunk_index": 88,
    "word_count": 308,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "-0.001** (-2.42) Ret (t=0)*Positive news dummy -0.000 (-0.67) Ret (w-1)*Positive news dummy 0.000 (0.30) Ret (m-1)*Positive news dummy -0.000 (-0.06) Ret (t=0) 0.016*** 0.017*** 0.014*** (16.25) (15.66) (12.23) Ret (w-1) 0.019*** 0.021*** 0.020*** (14.76) (13.70) (13.16) Ret (m-1) 0.011*** 0.010*** 0.011*** (6.69) (5.57) (5.69) 50 Electronic copy available at: https://ssrn.com/abstract=3723096 News dummy (News, Negative News, Positive News) -0.005 -0.008 -0.010* (-0.98) (-1.42) (-1.83) Intercept 0.001* 0.000* 0.001*** (1.67) (1.80) (2.65) R square 0.003 0.004 0.004 # of days 1736 1736 1736 Obs 5540542 5136506 5120716 51 Electronic copy available at: https://ssrn.com/abstract=3723096 Panel B: Interacted with buying pressure Y=Rtlshort [t=0] 1 2 3 Ret (t=0)*LRoib+ 0.014*** (10.42) Ret (w-1)*LRoib+ 0.004*** (3.20) Ret (m-1)*LRoib+ 0.003** (2.33) Ret (t=0)*Rtloib+ 0.003** (2.49) Ret (w-1)*Rtloib+ 0.010*** (8.98) Ret (m-1)*Rtloib+ 0.009*** (8.46) Ret (t=0)*Otheroib+ 0.010*** (5.23) Ret (w-1)*Otheroib+ -0.000 (-0.03) Ret (m-1)*Otheroib+ 0.001 (0.44) Ret (t=0) 0.004*** 0.011*** -0.003** (3.01) (9.14) (-2.21) Ret (w-1) 0.017*** 0.016*** 0.016*** (12.76) (12.21) (12.50) Ret (m-1) 0.010*** 0.008*** 0.010*** (5.53) (5.20) (5.96) Oib+(LRoib+, Rtloib+, Otheroib+) 0.041*** 0.062*** 0.159*** (9.16) (17.85) (22.55) Intercept -0.013*** -0.013*** -0.049*** (-8.90) (-17.00) (-22.50) R square 0.010 0.009 0.027 # of days 1736 1736 1736 Obs 5542587 5542587 5542587 52 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "References",
    "page_number": 51,
    "page_range": "p.51-53",
    "total_pages": 55,
    "chunk_index": 89,
    "word_count": 199,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.51-53)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "0.016*** 0.016*** (12.76) (12.21) (12.50) Ret (m-1) 0.010*** 0.008*** 0.010*** (5.53) (5.20) (5.96) Oib+(LRoib+, Rtloib+, Otheroib+) 0.041*** 0.062*** 0.159*** (9.16) (17.85) (22.55) Intercept -0.013*** -0.013*** -0.049*** (-8.90) (-17.00) (-22.50) R square 0.010 0.009 0.027 # of days 1736 1736 1736 Obs 5542587 5542587 5542587 52 Electronic copy available at: https://ssrn.com/abstract=3723096 Appendix A1: Portfolio Returns on days [x,y] based on Retail Short Selling This table presents daily value-weighted returns for portfolios based on weekly retail short sells from January 2010 to December 2016. Each day, stocks are sorted into quintiles based on weekly retail short selling’s percentage of volumes (rtlshort_w). After skipping 1 day, value-weighted portfolios are held for 5 trading days [1,5], 20 trading days [1,20], 40 trading days, and 60 trading days, respectively. This process is repeated each trading day, so each trading day’s portfolio return with horizon [x,y] is an average of (y-x+1) different portfolios, with 1/(y- x+1) of the portfolio rebalanced each day, following Jegadeesh and Titman (1993). Daily calendar time returns and Fama and French (1993) three factor alphas are reported in percent. Newey-West (1987) t-statistics based on five lags appear in parentheses. Weekly Retail shorting’s percentage of volume (rtlshort_ w) [1,5] [1,20] [21,40] [41,60] Return Alpha Return Alpha Return Alpha Return Alpha 1 (Least) 0.064 0.019 0.061 0.017 0.065 0.014 0.062 0.015 2 0.062 0.012 0.059 0.010 0.065 0.009 0.059 0.006 3 0.054 0.004 0.050 0.002 0.056 0.001 0.056 0.003 4 0.044 -0.008 0.045 -0.006 0.051 -0.007 0.047 -0.008 5(Most) 0.048 -0.009 0.049 -0.006 0.059 -0.003 0.058 0.001 5-1 -0.016 -0.028*** -0.012 -0.024*** -0.006 -0.017* -0.004 -0.015 (-1.362) (-2.695) (-1.185) (-2.606) (-0.603) (-1.783) (-0.398) (-1.540) 53 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "References",
    "page_number": 53,
    "page_range": "p.53",
    "total_pages": 55,
    "chunk_index": 90,
    "word_count": 276,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.53)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "3 0.054 0.004 0.050 0.002 0.056 0.001 0.056 0.003 4 0.044 -0.008 0.045 -0.006 0.051 -0.007 0.047 -0.008 5(Most) 0.048 -0.009 0.049 -0.006 0.059 -0.003 0.058 0.001 5-1 -0.016 -0.028*** -0.012 -0.024*** -0.006 -0.017* -0.004 -0.015 (-1.362) (-2.695) (-1.185) (-2.606) (-0.603) (-1.783) (-0.398) (-1.540) 53 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "References",
    "page_number": 54,
    "page_range": "p.54",
    "total_pages": 55,
    "chunk_index": 91,
    "word_count": 50,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.54)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "Appendix A2: Cross-sectional Regressions of Returns on Retail Short Selling This table presents daily Fama Macbeth (1973) regressions of next week’s return [t+1, t+5] on weekly retail short selling [t-5, t-1] (rtlshort_w) and control variables measured as of day t. The sample period is from January 2010 to December 2016. Dependent variable in Panel A is cumulative raw returns [t+1, t+5], and dependent variable in Panel B is cumulative risk-adjusted returns [t+1, t+5] using Fama-French three factor model, with betas estimated from previous year. We also include weekly dark pool non-retail short sells [t-5, t-1] (darkshort_w), calculated as (OTC short sell volumes-retail short sell volumes)/total volumes, and weekly retail order imbalance [t-5, t-1] (rtloib_w), calculated as (retail buy volumes-retail long sell volumes)/total volumes. Other control variables include previous week return [t-5, t-1] ret(w-1), previous month returns [t-25, t-6] ret (m-1), and previous year returns [t-251, t-26] ret(y-1). We also include log market cap (size), log (book to market) (btm), monthly turnover (turn), and monthly volatility of daily returns (vol), all measured at the end of previous month. To account for serial correlation in the coefficients, the standard deviation of time-series is adjusted using Newey-West with 5 lags. Dependent variables are in percent, and all the independent variables are standardized each day t. Panel A: Cumulative raw returns as dependent variable Y= Cumulative raw returns [t+1, t+5] 1 2 3 4 Rtlshort_w -0.031*** -0.018*** -0.017*** -0.022*** (-4.13) (-3.10) (-2.99) (-3.78) Darkshort_w -0.009 (-1.01) Rtloib_w 0.050*** (11.53) Log(Size) 0.038* 0.037* 0.038* (1.79) (1.74) (1.76) Log(Btm) 0.026 0.025 0.026 (1.50) (1.46) (1.54) Turn -0.049*** -0.047*** -0.050*** (-3.48) (-3.50) (-3.53) Vol -0.090*** -0.089*** -0.089*** (-4.48) (-4.50) (-4.47) Ret (w-1) -0.091*** -0.090*** -0.093*** (-6.16) (-6.07) (-6.31) Ret (m-1) -0.011 -0.011 -0.010 (-0.66) (-0.67) (-0.58) Ret (y-1) 0.053** 0.053** 0.053** (2.54) (2.54) (2.52) Intercept 0.241** 0.241** 0.241** 0.241** (2.25) (2.25) (2.25) (2.25) R square 0.001 0.043 0.045 0.044 # of days 1736 1736 1736 1736 obs 5542587 5542587 5542587 5542587 54 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "References",
    "page_number": 54,
    "page_range": "p.54",
    "total_pages": 55,
    "chunk_index": 92,
    "word_count": 330,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.54)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  },
  {
    "text": "(-6.31) Ret (m-1) -0.011 -0.011 -0.010 (-0.66) (-0.67) (-0.58) Ret (y-1) 0.053** 0.053** 0.053** (2.54) (2.54) (2.52) Intercept 0.241** 0.241** 0.241** 0.241** (2.25) (2.25) (2.25) (2.25) R square 0.001 0.043 0.045 0.044 # of days 1736 1736 1736 1736 obs 5542587 5542587 5542587 5542587 54 Electronic copy available at: https://ssrn.com/abstract=3723096 Panel B: Cumulative risk-adjusted returns as dependent variable Y= Cumulative risk-adjusted returns [t+1, t+5] 1 2 3 4 Rtlshort_w -0.024*** -0.015*** -0.013*** -0.019*** (-3.35) (-2.85) (-2.67) (-3.60) Darkshort_w -0.015* (-1.94) Rtloib_w 0.048*** (11.47) Log(Size) -0.037** -0.038** -0.037** (-2.50) (-2.53) (-2.52) Log(Btm) 0.034*** 0.033*** 0.034*** (3.57) (3.42) (3.62) Turn -0.053*** -0.052*** -0.054*** (-3.94) (-3.91) (-3.99) Vol -0.091*** -0.090*** -0.091*** (-6.11) (-6.09) (-6.10) Ret (w-1) -0.088*** -0.087*** -0.090*** (-7.14) (-6.99) (-7.31) Ret (m-1) -0.004 -0.004 -0.002 (-0.26) (-0.27) (-0.17) Ret (y-1) 0.051*** 0.050*** 0.050*** (2.99) (2.96) (2.96) Intercept 0.017 0.016 0.016 0.016 (1.29) (1.28) (1.27) (1.28) R square 0.001 0.027 0.028 0.028 # of days 1736 1736 1736 1736 obs 5364476 5364476 5364476 5364476 55 Electronic copy available at: https://ssrn.com/abstract=3723096",
    "title": "Smart Retail Traders, Short Sellers, and Stock Returns",
    "source_type": "pdf",
    "document_id": "1ecb7a45108b",
    "source_file": "Smart Retail Traders, Short Sellers, and Stock Returns.pdf",
    "section": "References",
    "page_number": 55,
    "page_range": "p.55",
    "total_pages": 55,
    "chunk_index": 93,
    "word_count": 168,
    "author": "SONG Wanshan",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.55)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20201026130753+08'00'",
    "duration": null
  }
]