[
  {
    "text": "Statistical Arbitrage in the U.S. Equities Market Marco Avellaneda∗†and Jeong-Hyun Lee∗ July 11, 2008 Abstract We study model-driven statistical arbitrage strategies in U.S. equities. Trading signals are generated in two ways: using Principal Component AnalysisandusingsectorETFs. Inbothcases,weconsidertheresiduals, oridiosyncraticcomponentsofstockreturns,andmodelthemasamean- reverting process, which leads naturally to “contrarian” trading signals. Themaincontributionofthepaperistheback-testingandcomparison ofmarket-neutralPCA-andETF-basedstrategiesoverthebroaduniverse ofU.S.equities. Back-testingshowsthat,afteraccountingfortransaction costs, PCA-based strategies have an average annual Sharpe ratio of 1.44 overtheperiod1997to2007,withamuchstrongerperformancespriorto 2003: during2003-2007,theaverageSharperatioofPCA-basedstrategies was only 0.9. On the other hand, strategies based on ETFs achieved a Sharperatioof1.1from1997to2007,butexperienceasimilardegradation of performance after 2002. We introduce a method to take into account daily trading volume information in the signals (using “trading time” as opposed to calendar time), and observe significant improvements in performance in the case of ETF-based signals. ETF strategies which use volume information achieve a Sharpe ratio of 1.51 from 2003 to 2007. The paper also relates the performance of mean-reversion statistical arbitrage strategies with the stock market cycle. In particular, we study in some detail the performance of the strategies during the liquidity cri- sis of the summer of 2007. We obtain results which are consistent with Khandani and Lo (2007) and validate their “unwinding” theory for the quant fund drawndown of August 2007. 1 Introduction Thetermstatisticalarbitrageencompassesavarietyofstrategiesandinvestment programs. Their common features are: (i) trading signals are systematic, or ∗Courant Institute of Mathematical Sciences, 251 Mercer Street, New York, N.Y. 10012 USA †FinanceConceptsSARL,49-51AvenueVictor-Hugo,75116Paris,France. 1",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 47,
    "chunk_index": 0,
    "word_count": 224,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "which are consistent with Khandani and Lo (2007) and validate their “unwinding” theory for the quant fund drawndown of August 2007. 1 Introduction Thetermstatisticalarbitrageencompassesavarietyofstrategiesandinvestment programs. Their common features are: (i) trading signals are systematic, or ∗Courant Institute of Mathematical Sciences, 251 Mercer Street, New York, N.Y. 10012 USA †FinanceConceptsSARL,49-51AvenueVictor-Hugo,75116Paris,France. 1 rules-based, as opposed to driven by fundamentals, (ii) the trading book is market-neutral, in the sense that it has zero beta with the market, and (iii) the mechanismforgeneratingexcessreturnsisstatistical. Theideaistomakemany bets with positive expected returns, taking advantage of diversification across stocks, to produce a low-volatility investment strategy which is uncorrelated with the market. Holding periods range from a few seconds to days, weeks or even longer. Pairs-tradingiswidelyassumedtobethe“ancestor”ofstatisticalarbitrage. If stocks P and Q are in the same industry or have similar characteristics (e.g. Exxon Mobile and Conoco Phillips), one expects the returns of the two stocks to track each other after controlling for beta. Accordingly, if P and Q denote t t the corresponding price time series, then we can model the system as ln(P /P )=α(t−t )+βln(Q /Q ) + X (1) t t0 0 t t0 t or, in its differential version, dP dQ t = αdt + β t +dX , (2) P Q t t t where X is a stationary, or mean-reverting, process. This process will be re- t ferred to as the cointegration residual, or residual, for short, in the rest of the paper. In many cases of interest, the drift α is small compared to the fluctua- tionsofX andcanthereforebeneglected. Thismeansthat,aftercontrollingfor t beta, the long-short portfolio oscillates near some statistical equilibrium. The modelsuggestsacontrarianinvestmentstrategyinwhichwegolong1dollarof stock P and short β dollars of stock Q if X is small and, conversely, go short P t andlongQifX islarge. Theportfolioisexpectedtoproduceapositivereturn t asvaluationsconverge(seePole(2007)foracomprehensivereviewonstatistical arbitrage and co-integration). The mean-reversion paradigm is typically asso- ciated with market over-reaction: assets are temporarily under- or over-priced with respect to one or several reference securities (Lo and MacKinley (1990)). Another possibility is to consider scenarios in which one of the stocks is expected to out-perform the other over a significant period of time. In this case the co-integration residual should not be stationary. This paper will be principally concerned with mean-reversion, so we don’t consider such scenarios. “Generalizedpairs-trading”,ortradinggroupsofstocksagainstothergroups of stocks, is a natural extension of pairs-trading. To explain the idea, we con- sider the sector of biotechnology stocks. We perform a regression/cointegration analysis, following (1) or (2), for each stock in the sector with respect to a benchmark sector index, e.g. the Biotechnology HOLDR (BBH). The role of the stock Q would be played by BBH and P would an arbitrary stock in the biotechnology sector. The analysis of the residuals, based of the magnitude of X , suggests typically that some stocks are cheap with respect to the sector, t others expensive and others fairly priced. A generalized pairs trading book, or statistical arbitrage book, consists of a collection of “pair trades” of stocks rel- ative to the ETF (or, more generally, factors that explain the systematic stock 2",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 47,
    "chunk_index": 1,
    "word_count": 503,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "that some stocks are cheap with respect to the sector, t others expensive and others fairly priced. A generalized pairs trading book, or statistical arbitrage book, consists of a collection of “pair trades” of stocks rel- ative to the ETF (or, more generally, factors that explain the systematic stock 2",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 47,
    "chunk_index": 2,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "returns). In some cases, an individual stock may be held long against a short position in ETF, and in others we would short the stock and go long the ETF. Due to netting of long and short positions, we expect that the net position in ETFs will represent a small fraction of the total holdings. The trading book will look therefore like a long/short portfolio of single stocks. This paper is concerned with the design and performance-evaluation of such strategies. The analysis of residuals will be our starting point. Signals will be based on relative-value pricing within a sector or a group of peers, by decomposing stock returnsintosystematicandidiosyncraticcomponentsandstatisticallymodeling the idiosyncratic part. The general decomposition may look like n dP t = αdt + X β F(j) + dX , (3) P j t t t j=1 wherethetermsF(j),j =1,...,nrepresentreturnsofrisk-factorsassociatedwith t the market under consideration. This leads to the interesting question of how to derive equation (3) in practice. The question also arises in classical portfolio theory, but in a slightly different way: there we ask what constitutes a “good” set of risk-factors from a risk-management point of view. Here, the emphasis is instead on the residual that remains after the decomposition is done. The maincontributionofourpaperwillbetostudyhowdifferentsetsofrisk-factors leadtodifferentresiduals andhence todifferentprofit-loss (PNL)forstatistical arbitrage strategies. Previousstudiesonmean-reversionandcontrarianstrategiesincludeLehmann (1990),LoandMacKinlay(1990)andPoterbaandSummers(1988). Inarecent paper, Khandani and Lo (2007) discuss the performance of the Lo-MacKinlay contrarian strategies in the context of the liquidity crisis of 2007 (see also refer- encestherein). Thelatterstrategieshaveseveralcommonfeatureswiththeones developed in this paper. Khandani and Lo (2007) market-neutrality is enforced by ranking stock returns by quantiles and trading “winners-versus-losers”, in a dollar-neutral fashion. Here, we use risk-factors to extract trading signals, i.e. todetectover-andunder-performers. Ourtradingfrequencyisvariablewhereas Khandani-Lotradeatfixedtime-intervals. Ontheparametricside,Poterbaand Summers (1988) study mean-reversion using auto-regressive models in the con- text of international equity markets. The models of this paper differ from the lattermostlyinthatweimmunizestocksagainstmarketfactors,i.e. weconsider mean-reversion of residuals (relative prices) and not of the prices themselves. The paper is organized as follows: in Section 2, we study market-neutrality using two different approaches. The first method consists in extracting risk- factorsusingPrincipalComponentAnalysis(Jolliffe(2002)). Thesecondmethod uses industry-sector ETFs as proxies for risk factors. Following other authors, we show that PCA of the correlation matrix for the broad equity market in the U.S. gives rise to risk-factors that have economic significance because they can be interpreted as long-short portfolios of industry sectors. Furthermore, the stocks that contribute the most to a particular factor are not necessarily the largest capitalization stocks in a given sector. This suggests that, unlike ETFs, 3",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 47,
    "chunk_index": 3,
    "word_count": 412,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "in the U.S. gives rise to risk-factors that have economic significance because they can be interpreted as long-short portfolios of industry sectors. Furthermore, the stocks that contribute the most to a particular factor are not necessarily the largest capitalization stocks in a given sector. This suggests that, unlike ETFs, 3",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 47,
    "chunk_index": 4,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "PCA-based risk factors are not biased towards large-capitalization stocks. We alsoobservethatthevarianceexplainedbyafixednumberofPCAeigenvectors varies significantly across time, leading us to conjecture that the number of ex- planatoryfactorsneededtodescribestockreturnsisvariableandthatthisvari- ability is linked with the investment cycle, or the changes in the risk-premium for investing in the equity market.1 In Section 3 and 4, we construct the trading signals. This involves the statisticalestimationoftheprocessX foreachstockatthecloseofeachtrading t day, using historical data prior to the close. Estimation is always done looking back at the historical record, thus simulating decisions which would take place in real automatic trading. Using daily end-of-day (EOD) data, we perform a fullcalculationofdailytradingsignals, goingbackto1996insomecasesandto 2002 in others, across the broad universe of stocks with market-capitalization of more than 1 billion USD at the trade date.2 The estimation and trading rules are kept simple to avoid data-mining. For each stock in the universe, the parameter estimation is done using a 60-day trailing estimation window, which corresponds roughly to one earnings cycle. The length of the window is fixed once and for all in the simulations and is not changed from one stock to another. We use the same fixed-length estimation window, we choose as entry point for trading any residual that deviates by 1.25 standard deviations from equilibrium, and we exit trades if the residual is less than 0.5 standard deviations from equilibrium, uniformly across all stocks. InSection5weback-testdifferentstrategieswhichusedifferentsetsoffactors togenerateresiduals, namely: syntheticETFsbasedoncapitalization-weighted indices, actual ETFs, a fixed number of factors generated by PCA, a variable number of factors generated by PCA. Due to the mechanism described aboive used to generate trading systems, the simulation is out-of-sample, in the sense that the estimation of the residual process at time t uses information available only before this time. In all cases, we assume a slippage/transaction cost of 0.05% or 5 basis points per trade (a round-trip transaction cost of 10 basis points). In Section 6, we consider a modification of the strategy in which signals are estimated in “trading time” as opposed to calendar time. In the statistical analysis, using trading time on EOD signals is effectively equivalent to multi- plying daily returns by a factor which is inversely proportional to the trading volumeforthepastday. Thismodificationaccentuates(i.e. tendstofavor)con- trarian price signals taking place on low volume and mitigates (i.e. tends not tofavor)contrarianpricesignalswhichtakeplaceonhighvolume. Itisasifwe “believemore”aprintthatoccursonhighvolumeandlessreadytobetagainst it. Back-testing the statistical arbitrage strategies using trading-time signals leads to improvements in most strategies, suggesting that volume information is valuable in the mean-reversion context, even at the EOD time-scale. 1See Scherer and Avellaneda (2002) for similar observations for Latin American debt se- curitiesinthe1990’s. 2The condition that the company must have a given capitalization at the trade date (as opposedtoatthetimethispaperwaswritten),avoidssurvivorshipbias. 4",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 47,
    "chunk_index": 5,
    "word_count": 434,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "improvements in most strategies, suggesting that volume information is valuable in the mean-reversion context, even at the EOD time-scale. 1See Scherer and Avellaneda (2002) for similar observations for Latin American debt se- curitiesinthe1990’s. 2The condition that the company must have a given capitalization at the trade date (as opposedtoatthetimethispaperwaswritten),avoidssurvivorshipbias. 4 In Section 7, we discuss the performance of statistical arbitrage in 2007, andparticularlyaroundtheinceptionoftheliquiditycrisisofAugust2007. We comparetheperformancesofthemean-reversionstrategieswiththeonesstudied in the recent work of Khandani and Lo (2007). Conclusions are presented in Section 8. 2 A quantitative view of risk-factors and market- neutrality Wedividetheworldschematicallyinto“indexers’and“market-neutralagents”. Indexersseekexposuretotheentiremarketortospecificindustrysectors. Their goal is generally to be long the market or sector with appropriate weightings in eachstock. Market-neutralagentsseekreturnswhichareuncorrelatedwiththe market. Let us denote by {R }N the returns of the different stocks in the trading i i=1 universeoveranarbitraryone-dayperiod(fromclosetoclose). LetF represent the return of the “market portfolio” over the same period, (e.g. the return on a capitalization-weighted index, such as the S&P 500). We can write, for each stock in the universe, R = β F + R˜ , (4) i i i which is a simple regression model decomposing stock returns into a systematic component β F and an (uncorrelated) idiosyncratic component R˜ . Alterna- i i tively, we consider multi-factor models of the form m R = X β F + R˜ . (5) i ij j i j=1 Heretherearemfactors,whichcanbethoughtofasthereturnsof“benchmark” portfolios representing systematic factors. A trading portfolio is said to be market-neutral if the dollar amounts {Q }N invested in each of the stocks are i i=1 such that N X β = β Q =0, j =1,2,...,m. (6) j ij i i=1 Thecoefficientsβ correspondtotheportfoliobetas, orprojectionsoftheport- j folio returns on the different factors. A market-neutral portfolio has vanishing portfoliobetas; itisuncorrelatedwiththemarketportfolioorfactorsthatdrive the market returns. It follows that the portfolio returns satisfy 5",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 47,
    "chunk_index": 6,
    "word_count": 291,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "of the stocks are i i=1 such that N X β = β Q =0, j =1,2,...,m. (6) j ij i i=1 Thecoefficientsβ correspondtotheportfoliobetas, orprojectionsoftheport- j folio returns on the different factors. A market-neutral portfolio has vanishing portfoliobetas; itisuncorrelatedwiththemarketportfolioorfactorsthatdrive the market returns. It follows that the portfolio returns satisfy 5",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 47,
    "chunk_index": 7,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "  N N m N X Q i R i = X Q i X β ij F j+ X Q i R˜ i i=1 i=1 j=1 i=1 m \" N # N = X X β Q F + X Q R˜ ij i j i i j=1 i=1 i=1 N = X Q R˜ (7) i i i=1 Thus, a market-neutral portfolio is affected only by idiosyncratic returns. We shall see below that, in G8 economies, stock returns are explained by approxi- mately m=15 factors (or between 10 and 20 factors), and that the the system- aticcomponentofstockreturnsexplainsapproximately50%ofthevariance(see Plerou et al. (2002) and Laloux et al. (2000)). The question is how to define “factors”. 2.1 The PCA approach: can you hear the shape of the market? AfirstapproachforextractingfactorsfromdataistousePrincipalComponents Analysis (Jolliffe (2002)). This approach uses historical share-price data on a cross-section of N stocks going back, say, M days in history. For simplicity of exposition, the cross-section is assumed to be identical to the investment universe, although this need not be the case in practice.3 Let us represent the stocks return data, on any given date t , going back M +1 days as a matrix 0 S −S R = i(t0−(k−1)∆t) i(t0−k∆t) , k =1,...,M, i=1,...,N, ik S i(t0−k∆t) whereS isthepriceofstockiattimetadjustedfordividendsand∆t=1/252. it Since some stocks are more volatile than others, it is convenient to work with standardized returns, R −R Y = ik i ik σ i where M 1 X R = R i M ik k=1 and M 1 X σ2 = (R −R )2 i M −1 ik i k=1 3For instance, the analysis can be restricted to the members of the S&P500 index in the US,theEurostoxx350inEurope,etc. 6",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 47,
    "chunk_index": 8,
    "word_count": 282,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "= ik i ik σ i where M 1 X R = R i M ik k=1 and M 1 X σ2 = (R −R )2 i M −1 ik i k=1 3For instance, the analysis can be restricted to the members of the S&P500 index in the US,theEurostoxx350inEurope,etc. 6",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 47,
    "chunk_index": 9,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "The empirical correlation matrix of the data is defined by M 1 X ρ = Y Y , (8) ij M −1 ik jk k=1 which is symmetric and non-negative definite. Notice that, for any index i, we have M P (R −R )2 M ik i ρ = 1 X (Y )2 = 1 k=1 =1. ii M −1 ik M −1 σ2 k=1 i The dimensions of ρ are typically 500 by 500, or 1000 by 1000, but the data is small relative to the number of parameters that need to be estimated. In fact, if we consider daily returns, we are faced with the problem that very long estimation windows M (cid:29) N don’t make sense because they take into account the distant past which is economically irrelevant. On the other hand, if we just considerthebehaviorofthemarketoverthepastyear,forexample,thenweare faced with the fact that there are considerably more entries in the correlation matrix than data points. The commonly used solution to extract meaningful information from the data is Principal Components Analysis.4 We consider the eigenvectors and eigenvalues of the empirical correlation matrix and rank the eigenvalues in de- creasing order: N ≥λ > λ ≥ λ ≥...≥ λ ≥0. 1 2 3 N We denote the corresponding eigenvectors by (cid:16) (cid:17) v(j) = v(j),....,v(j) , j =1,...,N. 1 N A cursory analysis of the eigenvalues shows that the spectrum contains a few large eigenvalues which are detached from the rest of the spectrum (see Figure 1). We can also look at the density of states {#of eigenvalues between x and y} D(x,y) = N (see Figure 2). For intervals (x,y) near zero, the function D(x,y) corresponds to the “bulk spectrum” or “noise spectrum” of the correlation matrix. The eigenvaluesatthetopofthespectrumwhichareisolatedfromthebulkspectrum are obviously significant. The problem that is immediately evident by looking at Figures 1 and 2 is that there are less “detached” eigenvalues than industry sectors. Therefore, we expect that the boundary between “significant” and “noise” eigenvalues to be somewhat blurred and to correspond to be at the 4We refer the reader to Laloux et al. (2000), and Plerou et al. (2002) who studied the correlationmatrixofthetop500stocksintheUSinthiscontext. 7",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 47,
    "chunk_index": 10,
    "word_count": 356,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "that there are less “detached” eigenvalues than industry sectors. Therefore, we expect that the boundary between “significant” and “noise” eigenvalues to be somewhat blurred and to correspond to be at the 4We refer the reader to Laloux et al. (2000), and Plerou et al. (2002) who studied the correlationmatrixofthetop500stocksintheUSinthiscontext. 7 Figure 1: Eigenvalues of the correlation matrix of market returns computed on May 1 2007 estimated using a 1-year window (measured as percentage of explained variance) Figure 2: The density of states for May 1-2007 estimated using a year window 8 edge of the “bulk spectrum”. This leads to two possibilities: (a) we take into accountafixednumberofeigenvaluestoextractthefactors(assuminganumber close to the number of industry sectors) or (b) we take a variable number of eigenvectors,dependingontheestimationdate,insuchawaythatasumofthe retained eigenvalues exceeds a given percentage of the trace of the correlation matrix. Thelatterconditionisequivalenttosayingthatthetruncationexplains a given percentage of the total variance of the system. Let λ ,...,λ , m<N be the significant eigenvalues in the above sense. For 1 m each index j, we consider a the corresponding “eigenportfolio”, which is such that the respective amounts invested in each of the stocks is defined as v(j) Q(j) = i . i σ i The eigenportfolio returns are therefore X N v(j) F = i R j =1,2,...,m. (9) jk σ ik i i=1 Itiseasyforthereadertocheckthattheeigenportfolioreturnsareuncorrelated inthesensethattheempiricalcorrelationofF andF vanishesforj 6=j0. The j j0 factors in the PCA approach are the eigenportofolio returns. Figure 3: Comparative evolution of the principal eigenportfolio and the capitalization-weighted portfolio from May 2006 to April 2007. Both portfo- lios exhibit similar behavior. Each stock return in the investment universe can be decomposed into its projection on the m factors and a residual, as in equation (4). Thus, the PCA 9",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8-9",
    "total_pages": 47,
    "chunk_index": 11,
    "word_count": 284,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8-9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "Comparative evolution of the principal eigenportfolio and the capitalization-weighted portfolio from May 2006 to April 2007. Both portfo- lios exhibit similar behavior. Each stock return in the investment universe can be decomposed into its projection on the m factors and a residual, as in equation (4). Thus, the PCA 9",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 47,
    "chunk_index": 12,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "approachdeliversanaturalsetofrisk-factorsthatcanbeusedtodecomposeour returns. It is not difficult to verify that this approach corresponds to modeling thecorrelationmatrixofstockreturnsasasumofarank-mmatrixcorrespond- ing to the significant spectrum and a diagonal matrix of full rank, m ρ = X λ v(k)v(k)+(cid:15)2δ , ij k i j ii ij k=0 where δ is the Kronecker delta and (cid:15)2 is given by ij ii m (cid:15)2 = 1− X λ v(k)v(k) ii k i i k=0 sothatρ =1. Thismeansthatwekeeponlythesignificanteigenvalues/eigenvectors ii of the correlation matrix and add a diagonal “noise” matrix for the purposes of conserving the total variance of the system. 2.2 Interpretation of the eigenvectors/eigenportfolios As pointed out by several authors (see for instance, Laloux et al.(2000)), the dominant eigenvector is associated with the “market portfolio”, in the sense that all the coefficients v(1), i = 1,2..,N are positive. Thus, the eigenport- i folio has positive weights Q(1) = v i (1) . We notice that these weights are in- i σi versely proportional to the stock’s volatility. This weighting is consistent with the capitalization-weighting, since larger capitalization companies tend to have smaller volatilities. The two portfolios are not identical but are good proxies for each other,5 as shown in Figure 3. Tointerprettheothereigenvectors, weobservethat(i)theremainingeigen- vectors must have components that are negative, in order to be orthogonal to v(i); (ii) given that there is no natural order in the stock universe, the “shape analysis” that is used to interpret the PCA of interest-rate curves (Litterman and Scheinkman (1991) or equity volatility surfaces (Cont and Da Fonseca (2002))doesnotapplyhere. TheanalysisthatweusehereisinspiredbyScherer and Avellaneda (2002), who analyzed the correlation of sovereign bond yields across different Latin American issuers (see also Plerou et. al.(2002) who made similar observations). We rank the coefficients of the eigenvectors in decreasing order: v(2) ≥ v(2) ≥ ... ≥ v(2), n1 n2 nN the sequence n representing a re-labeling of the companies. In this new order- i ing, we notice that the “neighbors” of a particular company tend to be in the 5The positivity of the coefficients of the first eigenvector of the correlation matrix in the casewhenallassetshavenon-negativecorrelationfollowsfromKrein’sTheorem. Inpractice, thepresenceofcommoditystocksandminingcompaniesimpliesthattherearealwaysafew negatively correlated stock pairs. In particular, this explains why there are a few negative weightsintheprincipaleigenportfolioinFigure4. 10",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 47,
    "chunk_index": 13,
    "word_count": 356,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "i ing, we notice that the “neighbors” of a particular company tend to be in the 5The positivity of the coefficients of the first eigenvector of the correlation matrix in the casewhenallassetshavenon-negativecorrelationfollowsfromKrein’sTheorem. Inpractice, thepresenceofcommoditystocksandminingcompaniesimpliesthattherearealwaysafew negatively correlated stock pairs. In particular, this explains why there are a few negative weightsintheprincipaleigenportfolioinFigure4. 10 sameindustrygroup. Thisproperty,whichwecallcoherence,holdstrueforv(2) andforotherhigh-rankingeigenvectors. Aswedescendinthespectrumtowards thenoiseeigenvectors,thepropertythatnearbycoefficientscorrespondtofirms in the same industry is less true and coherence will not hold for eigenvectors of the noise spectrum (almost by definition!). The eigenportfolios can therefore beinterpretedas“pairs-trading”or,moregenerally,long-shortpositions,atthe level of industries or sectors. Figure4: Firsteigenvectorsortedbycoefficientsize. Thex-axisshowstheETF corresponding to the industry sector of each stock. 2.3 The ETF approach: using the industries Another method consists in using the returns of sector ETFs as factors. In this approach, we select a sufficiently diverse set of ETFs and perform multiple regression analysis of stock returns on these factors. Unlike the case of eigen- portfolios, ETF returns are not uncorrelated, so there can be redundancies: strongly correlated ETFs may lead to large factor loadings with opposing signs forstocksthatbelongtoorarestronglycorrelatedtodifferentETFs. Toremedy this, we can perform a robust version of multiple regression analysis to obtain thecoefficientsβ . Forexample,thematchingpursuitalgorithm(Davis,Mallat ij & Avellaneda (1997)) which favors sparse representations is preferable to a full multiple regression. Another class of regression methods known as ridge regres- sion achieves the similar goal of sparse representations (see, for instance Jolliffe (2002)). Finally,asimpleapproach,whichweuseinourback-testingstrategies, associates to each stock a sector ETF (following the partition of the market in 11 Figure 5: Second eigenvector sorted by coefficient size. Labels as in Figure 4. Figure 6: Third eigenvector sorted by coefficient size. Labels as in Figure 4. 12",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11-12",
    "total_pages": 47,
    "chunk_index": 14,
    "word_count": 264,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11-12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "sparse representations (see, for instance Jolliffe (2002)). Finally,asimpleapproach,whichweuseinourback-testingstrategies, associates to each stock a sector ETF (following the partition of the market in 11 Figure 5: Second eigenvector sorted by coefficient size. Labels as in Figure 4. Figure 6: Third eigenvector sorted by coefficient size. Labels as in Figure 4. 12 Top 10 Stocks Bottom 10 Stocks Energy, oil and gas Real estate, financials, airlines Suncor Energy Inc. American Airlines Quicksilver Res. United Airlines XTO Energy Marshall & Isley Unit Corp. Fifth Third Bancorp Range Resources BBT Corp. Apache Corp. Continental Airlines Schlumberger M & T Bank Denbury Resources Inc. Colgate-Palmolive Company Marathon Oil Corp. Target Corporation Cabot Oil & Gas Corporation Alaska Air Group, Inc. Table 1: The top 10 stocks and bottom 10 stocks in second eigenvector. Top 10 Stocks Bottom 10 Stocks Utility Semiconductor Energy Corp. Arkansas Best Corp. FPL Group, Inc. National Semiconductor Corp. DTE Energy Company Lam Research Corp. Pinnacle West Capital Corp. Cymer, Inc. The Southern Company Intersil Corp. Consolidated Edison, Inc. KLA-Tencor Corp. Allegheny Energy, Inc. Fairchild Semiconductor International Progress Energy, Inc. Broadcom Corp. PG&E Corporation Cellcom Israel Ltd. FirstEnergy Corp. Leggett & Platt, Inc. Table 2: The top 10 stocks and bottom 10 stocks in third eigenvector. 13",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13-14",
    "total_pages": 47,
    "chunk_index": 15,
    "word_count": 205,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13-14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "Capital Corp. Cymer, Inc. The Southern Company Intersil Corp. Consolidated Edison, Inc. KLA-Tencor Corp. Allegheny Energy, Inc. Fairchild Semiconductor International Progress Energy, Inc. Broadcom Corp. PG&E Corporation Cellcom Israel Ltd. FirstEnergy Corp. Leggett & Platt, Inc. Table 2: The top 10 stocks and bottom 10 stocks in third eigenvector. 13 Figure 7) and performs a regression of the stock returns on the corresponding ETF returns. Let I ,I ,...,I represent a class of ETFs that span the main sectors in the 1 2 m economy,andletR denotethecorrespondingreturns. TheETFdecomposition Ij takes the form m R = X β R +R˜ . i ij Ij i j=1 The tradeoff between the ETF method and the PCA method is that in the formerweneedtohavesomepriorknowledgeoftheeconomytoknowwhatisa “good”setofETFstoexplainreturns. Theadvantageisthattheinterpretation ofthefactorloadingsismoreintuitivethanforPCA.Nevertheless,basedonthe notionofcoherencealludedtointheprevioussection,itcouldbearguedthatthe ETFandPCAmethodsconveysimilarinformation. Thereisacaveat,however: ETFholdingsgivemoreweighttolargecapitalizationcompanies,whereasPCA hasnoaprioricapitalizationbias. Asweshallsee,thesenuancesarereflectedin theperformanceofstatisticalarbitragestrategiesbasedondifferentrisk-factors. Figure 7 shows a sample of industry sectors number of stocks of companies withcapitalizationofmorethan1billionUSDatthebeginningofJanuary2007, classified by sectors. The table gives an idea of the dimensions of the trading universe and the distribution of stocks corresponding to each industry sector. We also include, for each industry, the ETF that can be used as a risk-factor for the stocks in the sector for the simplified model (11). 3 A relative-value model for equity pricing We propose a quantitative approach to stock pricing based on relative perfor- mance within industry sectors or PCA factors. In the last section, we present a modification of the signals which take into account the trading volume in the stocks as well, within a similar framework. This model is purely based on price data, although in principle it could be extended to include fundamental factors, such changes in analysts’ recommendations, earnings momentum, and other quantifiable factors. Weshallusecontinuous-timenotationanddenotestockpricesbyS (t),....,S (t), i N where t is time measured in years from some arbitrary starting date. Based on themulti-factormodelsintroducedintheprevioussection,weassumethatstock returns satisfy the system of stochastic differential equations N dS i (t) =α dt+ X β dI j (t) +dX (t), (10) S (t) i ij I (t) i i j j=1 where the term 14",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 47,
    "chunk_index": 16,
    "word_count": 333,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "t is time measured in years from some arbitrary starting date. Based on themulti-factormodelsintroducedintheprevioussection,weassumethatstock returns satisfy the system of stochastic differential equations N dS i (t) =α dt+ X β dI j (t) +dX (t), (10) S (t) i ij I (t) i i j j=1 where the term 14 Figure 7: Trading universe on January 1, 2007: breakdown by sectors. 15",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15-16",
    "total_pages": 47,
    "chunk_index": 17,
    "word_count": 62,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15-16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "on themulti-factormodelsintroducedintheprevioussection,weassumethatstock returns satisfy the system of stochastic differential equations N dS i (t) =α dt+ X β dI j (t) +dX (t), (10) S (t) i ij I (t) i i j j=1 where the term 14 Figure 7: Trading universe on January 1, 2007: breakdown by sectors. 15 N X β dI j (t) ij I (t) j j=1 represents the systematic component of returns (driven by the returns of the eigenportfoliosorETFs). Tofixideas,weplaceourselvesintheETFframework. In this context, I (t) represents the mid-market price of the jth ETF used to j span the market. The coefficients β are the corresponding loadings. ij Inpractice,onlyETFsthatareinthesameindustryasthestockinquestion will have significant loadings, so we could also work with the simplified model Cov(R ,R ) β = i Ij if stock #i is in industry #j ij Var(R ) Ij = 0 otherwise (11) where each stock is regressed to a single ETF representing its “peers”. The idiosyncratic component of the return is given by α dt+dX (t). i i Here, the α represents the drift of the idiosyncratic component, i.e. α dt is i i the excess rate of return of the stock in relation to market or industry sector over the relevant period. The term dX (t) is assumed to be the increment of a i stationary stochastic process which models price fluctuations corresponding to over-reactions or other idiosyncratic fluctuations in the stock price which are not reflected the industry sector. Ourmodelassumes(i)adriftwhichmeasuressystematicdeviationsfromthe sector and (ii) a price fluctuation that is mean-reverting to the overall industry level. Althoughthisisverysimplistic,themodelcanbetestedoncross-sectional data. Using statistical testing, we can accept or reject the model for each stock inagivenlistandthenconstructatradingstrategyforthosestocksthatappear to follow the model and yet for which significant deviations from equilibrium are observed. Based on these considerations, we introduce a parametric model for X (t) i which can be estimated easily, namely, the Ornstein-Uhlembeck process: dX (t)=κ (m −X (t))dt+σ dW (t), κ >0. (12) i i i i i i i This process is stationary and auto-regressive with lag 1 (AR-1 model). In particular, the increment dX (t) has unconditional mean zero and conditional i mean equal to E{dX (t)|X (s),s≤t} = κ (m −X (t))dt . i i i i i The conditional mean, or forecast of expected daily returns, is positive or neg- ative according to the sign of m −X (t). i i 16",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 47,
    "chunk_index": 18,
    "word_count": 387,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "(t) has unconditional mean zero and conditional i mean equal to E{dX (t)|X (s),s≤t} = κ (m −X (t))dt . i i i i i The conditional mean, or forecast of expected daily returns, is positive or neg- ative according to the sign of m −X (t). i i 16",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 47,
    "chunk_index": 19,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "The parameters of the stochastic differential equation, α ,κ ,m and σ ,are i i i i specifictoeachstock. TheyareassumedtovaryslowlyinrelationtotheBrown- ian motion increments dW (t), in the time-window of interest. We estimate the i statistics for the residual process on a window of length 60 days, assuming that the parameters are constant over the window. This hypothesis is tested for each stock in the universe, by goodness-of-fit of the model and, in particular, by analyzing the speed of mean-reversion. If we assume momentarily that the parameters of the model are constant, we can write t0Z +∆t X (t +∆t)=e−κi∆tX (t )+ (cid:0) 1−e−κi∆t(cid:1) m +σ e−κi(t0+∆t−s)dW (s) . i 0 i 0 i i i t0 (13) Letting ∆t tend to infinity, we see that equilibrium probability distribution for the process X (t) is normal with i σ2 E{X (t)}=m and Var{X (t)}= i . (14) i i i 2κ i AccordingtoEquation(10),investmentinamarket-neutrallong-shortportfolio in which the agent is long $1 in the stock and short β dollars in the jth ETF ij has an expected 1-day return α dt+ κ (m −X (t))dt . i i i i The second term corresponds to the model’s prediction for the return based on the position of the stationary process X (t): it forecasts a negative return if i X (t) is sufficiently high and a positive return if X (t) is sufficiently low. i i The parameter κ is called the speed of mean-reversion and i 1 τ = i κ i represents the characteristic time-scale for mean reversion. If κ (cid:29) 1 the stock reverts quickly to its mean and the effect of the drift is negligible. In our strategies,andtobeconsistentwiththeestimationprocedurethatusesconstant parameters, we are interested in stocks with fast mean-reversion, i.e. such that τ (cid:28)T . i 1 4 Signal generation Based on this simple model, we defined several trading signals. We considered an estimation window of 60 business days i.e. T = 60/252. This estimation 1 windowincorporatesatleastoneearningscycleforthecompany. Therefore, we 17",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 47,
    "chunk_index": 20,
    "word_count": 327,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "parameters, we are interested in stocks with fast mean-reversion, i.e. such that τ (cid:28)T . i 1 4 Signal generation Based on this simple model, we defined several trading signals. We considered an estimation window of 60 business days i.e. T = 60/252. This estimation 1 windowincorporatesatleastoneearningscycleforthecompany. Therefore, we 17 Figure 8: Empirical distribution of the characteristic time to mean-reversion τ i (in business days) for the year 2007, for the stock universe under consideration. The descriptive statistics are given below. Days Maximum 30 75% 11 Median 7.5 25% 4.9 Minimum 0.5 Fast days 36 % Table 3: Descriptive statistics on the mean-reversion time τ. 18 Figure 9: Statistical averages for the estimated OU parameters corresponding to all stocks over 2007. 19",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18-20",
    "total_pages": 47,
    "chunk_index": 21,
    "word_count": 122,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18-20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "universe under consideration. The descriptive statistics are given below. Days Maximum 30 75% 11 Median 7.5 25% 4.9 Minimum 0.5 Fast days 36 % Table 3: Descriptive statistics on the mean-reversion time τ. 18 Figure 9: Statistical averages for the estimated OU parameters corresponding to all stocks over 2007. 19 expect that it reflects so some extent fluctuations in the price which take place along the cycle. We selected stocks with mean-reversion times less than 1/2 period (κ > 252/30 = 8.4). Typical descriptive statistics for signal estimation are presented in Figure 9. For the details of the estimation of the O-U process and more statistical details on signal generation see the Appendix. 4.1 Pure mean-reversion We focus only on the process X (t), neglecting the drift α . We know that the i i equilibrium variance is r σ τ σ = √ i =σ i eq,i 2κ i 2 i Accordingly, we define the dimensionless variable X (t)−m s = i i . (15) i σ eq,i We call this variable the s-score.6 See Figure 11 for a graph showing the evo- lution of the s-score for residuals of JPM against the Financial SPDR, XLF. Thes-scoremeasures the distance toequilibriumofthecointegratedresidualin unitsstandarddeviations,i.e. howfarawayagivenstockisfromthetheoretical equilibrium value associated with our model. Our basic trading signal based on mean-reversion is buy to open if s < −s i bo sell to open if s > +s i so close short position if s < +s i bc close long position s > −s i sc (16) wherethecutoffvaluesaredeterminedempirically. Enteringatrade,e.g. buyto open, means buying one dollar of the corresponding stock and selling β dollars i of its sector ETF or, in the case of using multiple factors, β dollars of ETF i1 #1,β dollarsofETF#2,...,β dollarsofETF#m. Similarly,closingalong i2 im position means selling stock and buying ETFs. Since we expressed all quantities in dimensionless variables, we expect the cutoffs s ,s ,s ,s to be valid across the different stocks. We selected the bo bo bc sc cutoffsempirically, basedonsimulatingstrategiesfrom2000to2004inthecase of ETF factors. Based on this analysis, we found that a good choice of cutoffs is 6SeetheAppendixforpracticaldetailsonestimatingthes-score. 20",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 47,
    "chunk_index": 22,
    "word_count": 350,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "Since we expressed all quantities in dimensionless variables, we expect the cutoffs s ,s ,s ,s to be valid across the different stocks. We selected the bo bo bc sc cutoffsempirically, basedonsimulatingstrategiesfrom2000to2004inthecase of ETF factors. Based on this analysis, we found that a good choice of cutoffs is 6SeetheAppendixforpracticaldetailsonestimatingthes-score. 20 s = s = 1.25 bo so s = 0.75 and s =0.50 bc sc Thus, we enter trades when the s-score exceeds 1.25 in absolute value. Closing short trades sooner (at 0.75) gives slightly better results than 0.50. For closing long trades, we choose 0.50. (see Figure 10) Figure 10: Schematic evolution of the s-score and the associated signal, or trading rule. Therationaleforopeningtradesonlywhenthes-scores isfarfromequilib- i rium is to trade only when we think that we detected an anomalous excursion of the co-integration residual. We then need to consider when we close trades. Closing trades when the s-score is near zero also makes sense, since we expect most stocks to be near equilibrium most of the time. Thus, our trading rule detectsstockswithlarge“excursions”andtradesassumingtheseexcursionswill revert to the mean in a period of the order of the mean-reversion time τ . i 4.2 Mean-reversion with drift In the previous signal, the presence of the drift was ignored (implicity it was assumed that the effect of the drift was irrelevant in comparison with mean- reversion). We incorporate the drift by considering the conditional expectation of the residual return over a period of time dt, namely, 21",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21-22",
    "total_pages": 47,
    "chunk_index": 23,
    "word_count": 242,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21-22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "drift In the previous signal, the presence of the drift was ignored (implicity it was assumed that the effect of the drift was irrelevant in comparison with mean- reversion). We incorporate the drift by considering the conditional expectation of the residual return over a period of time dt, namely, 21 Figure 11: Evolution of the s-score of JPM ( vs. XLF ) from January 2006 to December 2007. (cid:18) (cid:19) α α dt + κ (m −X (t))dt = κ i +m −X (t) dt i i i i i κ i i i (cid:18) (cid:19) α = κ i −σ s dt. i κ eq,i i i This suggests that the dimensionless decision variable is the “modified s-score” (see Figure 12 ) α α τ s = s − i =s − i i. (17) mod,i i κ σ i σ i eq,i eq,i To make contact with the analysis of the pure mean-reversion strategy, con- sider for example the case of shorting stock. In the previous framework, we short stock if the s-score is large enough. The modified s-score is larger if α is i negative, and smaller if α is positive. Therefore, it will be harder to generate i a short signal if we think that the residual has an upward drift and easier to short if we think that the residual has a downward drift. If the s-score is zero, the signal reduces to buying when the drift is high enough and selling when the drift is low. Since the drift can be interpreted as the slope of a 60-day mov- ing average, we have therefore a “built-in” momentum strategy in this second signal. A calibration exercise using the training period 2000-2004 showed that 22",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 47,
    "chunk_index": 24,
    "word_count": 289,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "when the drift is high enough and selling when the drift is low. Since the drift can be interpreted as the slope of a 60-day mov- ing average, we have therefore a “built-in” momentum strategy in this second signal. A calibration exercise using the training period 2000-2004 showed that 22 Figure 12: Including the drift in signal generation the cutoffs defined in the previous strategy are also acceptable for this one. We notice, however, that the drift parameter has values of the order of 15 basis points and the average expected reversion time is 7 days, whereas the equilib- rium volatility of residuals is on the order of 300 bps. The expected average shift for the modified s-score is of the order of 0.15×7/300≈0.3. In practice, the effect of incorporating a drift in these time-scales is minor.7 5 Back-testing results Theback-testingexperimentsconsistedinrunningthesignalsthroughhistorical data,withtheestimationofparameters(betas,residuals),signalevaluationsand portfolio re-balancing performed daily. We assumed that all trades are done at theclosingpriceofthatday. Asmentionedpreviously,weassumedaround-trip transactioncostpertradeof10basispoints,toincorporateanestimateofprice slippage and other costs as a single friction coefficient. Let E represent the portfolio equity at time t. The basic PNL equation for t the strategy has the following form: 7Back-testing shows that this is indeed the case.We shall not present back-testing results withthemodifieds-scoresforthesakeofbrevity. 23",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 47,
    "chunk_index": 25,
    "word_count": 202,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "done at theclosingpriceofthatday. Asmentionedpreviously,weassumedaround-trip transactioncostpertradeof10basispoints,toincorporateanestimateofprice slippage and other costs as a single friction coefficient. Let E represent the portfolio equity at time t. The basic PNL equation for t the strategy has the following form: 7Back-testing shows that this is indeed the case.We shall not present back-testing results withthemodifieds-scoresforthesakeofbrevity. 23",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "N N !",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 47,
    "chunk_index": 26,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "N N ! (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "E = E +E r ∆t+ Q R − Q r∆t t+∆t t t it it it i=1 i=1 N N X X + Q D /S − |Q −Q |(cid:15), it it it i(t+∆t) it i=1 i=1 Q = E Λ , it t t whereQ isthedollarinvestmentinstockiattimet,R isthestockreturnfrom it it correspondingtotheperiod(t,t+∆t), r representstheinterestrate(assuming, for simplicity, no spread between long and short rates), ∆t=1/252, D is the it dividend payable to holders of stock i over the period (t,t+∆t)(when t=ex- dividend date), S is the price of stock i at time t, and (cid:15) = 0.0005 is the it slippage term alluded to above. The last line in the equation states that the moneyinvestedinstockiisproportionaltothetotalequityintheportfolio. The proportionalityfactor,Λ ,isstock-independentandchosensothattheportfolio t has a desired level of leverage on average. For example, if we have 100 stocks long and 100 short and we wish to have a ”2+2” leverage, then Λ = 2/100. t In practice this number is adjusted only for new positions, so as not to incur transaction costs for stock which are already held in the portfolio. 8 In other words, Λ controls the maximum fraction of the equity that can be invested t in any stock, and we take this bound to be equal for all stocks. In practice, especially when dealing with ETFs as risk-factors, we modulated the leverage coefficient on a sector-by-sector basis.9 Given the discrete nature of the signals, the investment strategy that we proposeis“bang-bang”: thereisnocontinuoustrading. Instead,thefullamount is invested on the stock once the signal is active (buy-to-open, short-to-open) and the position is unwound when the s-score indicates a closing signal. This all-or-nothingstrategy,whichmightseeminefficientatfirstglance,turnsoutto outperform making continuous portfolio adjustments. 5.1 Synthetic ETFs as factors Thefirstsetofexperimentsweredoneusing15synthetic capitalization-weighted industry-sector indices as risk-factors (see Figure 7). The reason for using syn- thetic ETFs was to be able to back-test strategies going back to 1996, when mostETFsdidnotexist. Aseriesofdailyreturnsforasyntheticindexiscalcu- latedforeachsectorandrecordedforthe60daysprecedingtheestimationdate. We performed a regression of stock returns on the corresponding sector index and extracted the corresponding residual series. To ensure market-neutrality, 8Hence,strictlyspeaking,theleveragefactorisweaklydependentontheavailablesignals. 9Otherrefinementsthatcanbemadehavetodowithusingdifferentleverageaccordingto thecompany’smarketcapitalizationorchoosingasector-dependentleveragethatisinversely proportionaltotheaveragevolatilityofthesector. 24",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "X X",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 47,
    "chunk_index": 27,
    "word_count": 333,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "X X (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "Figure 7). The reason for using syn- thetic ETFs was to be able to back-test strategies going back to 1996, when mostETFsdidnotexist. Aseriesofdailyreturnsforasyntheticindexiscalcu- latedforeachsectorandrecordedforthe60daysprecedingtheestimationdate. We performed a regression of stock returns on the corresponding sector index and extracted the corresponding residual series. To ensure market-neutrality, 8Hence,strictlyspeaking,theleveragefactorisweaklydependentontheavailablesignals. 9Otherrefinementsthatcanbemadehavetodowithusingdifferentleverageaccordingto thecompany’smarketcapitalizationorchoosingasector-dependentleveragethatisinversely proportionaltotheaveragevolatilityofthesector. 24 we added to the portfolio an S&P 500 index futures hedge which was adjusted daily and kept the overall portfolio beta-neutral. Since we expect that, in aggregate, stocks are correctly priced, we experi- mented with adjusting the means of the OU processes so that the total mean would be zero. In other words, we introduced the adjusted means for the resid- uals N 1 X m = m − m ,i=1,2,...,N. (18) i i N j j=1 Thismodificationhastheeffectofremoving“modelbias”andisconsistentwith market-neutrality. We obtained consistently better results in back-testing than whenusingtheestimatedm andadopteditforallotherstrategiesaswell. The i results of back-testing with synthetic ETFs are shown in Figure 13 and Table 14. Figure13: HistoricalPNLforthestrategyusingsyntheticETFsasfactorsfrom 1996-2007 5.2 Actual ETFs Back-testing with actual ETFs was possible only from 2002 onward, due to the fact that many ETFs did not exist previously. We simulated strategies going 25 Figure14: SharperatiosforthestrategyusingsyntheticETFsasfactors: 1996- 2007. The Sharpe Ratio is defined as µ−r/σ, where µ,r,σ are the annualized return, interest rate and standard deviation of the PNL. 26",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "X X",
    "page_number": 25,
    "page_range": "p.25-27",
    "total_pages": 47,
    "chunk_index": 28,
    "word_count": 213,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "X X (p.25-27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "actual ETFs was possible only from 2002 onward, due to the fact that many ETFs did not exist previously. We simulated strategies going 25 Figure14: SharperatiosforthestrategyusingsyntheticETFsasfactors: 1996- 2007. The Sharpe Ratio is defined as µ−r/σ, where µ,r,σ are the annualized return, interest rate and standard deviation of the PNL. 26 backto2002,usingregressiononasingleETFtogenerateresiduals. Theresults are displayed on Figure 15 and Table 16. Figure 15: Historical PNL for the strategy using actual ETFs as factors, com- pared with the one using synthetic ETFs : 2002-2007. Notice the strong out- performance by the strategy which uses actual ETFs. WeobservethatusingactualETFsimprovedperformanceconsiderably. An argumentthatmightexplainthisimprovementisthatETFsaretraded,whereas the synthetic ETFs are not, therefore providing better price information. 5.3 PCA with 15 eigenportfolios The back-testing results for signals generated with 15 PCA factors are shown in Figures 17 and 18 and Table 19. We observe that the 15-PCA strategy out-performs the actual ETF strategy after 2002. 5.4 Using a variable number of PCA factors We also tested strategies based on a variable number of factors, chosen so as to explain a given level of variance. In this approach, we retain a number of eigen-portfolios(factors)suchthatthesumofthecorrespondingeigenvectorsis equal to a set percentage. The number of eigenvalues (or eigenvectors) which are needed to explain 55% of the total variance of the correlation matrix varies 27 Figure16: Sharperatiosforactual15ETFsasfactors: 2002-2007. Weobserve, for the purpose of comparison, that the average Sharpe ratio from 2003 to 2007 was 0.6. 28",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "X X",
    "page_number": 27,
    "page_range": "p.27-29",
    "total_pages": 47,
    "chunk_index": 29,
    "word_count": 231,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "X X (p.27-29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "of eigen-portfolios(factors)suchthatthesumofthecorrespondingeigenvectorsis equal to a set percentage. The number of eigenvalues (or eigenvectors) which are needed to explain 55% of the total variance of the correlation matrix varies 27 Figure16: Sharperatiosforactual15ETFsasfactors: 2002-2007. Weobserve, for the purpose of comparison, that the average Sharpe ratio from 2003 to 2007 was 0.6. 28 Figure 17: PNL corresponding 15 PCA factors, compared with synthetic ETFs from 1997-2007 across time. This variability is displayed in Figure 20 and Figure 21. We also lookedatothercutoffsandreportsimilarresultsinFigure24. Theperiodsover which the number of eigenvectors needed to explain a given level of variance is small, appear to be those when the risk-premium for equities is relatively high. For instance, the latter parts of 2002 and 2007, which correspond respec- tively the aftermath of the Internet bubble and the bursting of the subprime bubble, are periods for which the variance is concentrated on a few top eigen- vectors/eigenvalues. In contrast, 2004-2006 is a period where the variance is distributed across a much larger set of modes. Back-testingthestrategywith55% explainedvariance shows that itis com- parable but slighly inferior to taking a fixed number of eigenvectors (see Figure 22andTable23). Inthesamevein,westudiedtheperformanceofotherstrate- gieswithavariablenumberofPCAeigenportfoliosexplainingdifferentlevelsof variance. In Table 27 and Figure 25, we display the performances of strategies using 45%, 55% and 65% compared with the PCA strategies with 1 eigen port- folio and with 15 eigenportfolios. The conclusion is that 55% PCA is the best performing among the three strategies and is comparable, but slightly inferior, tothe15PCAstrategy. Wealsoobservedthattakingahighcutoffsuchas75% ofexplainedvarianceleadstosteadylosses,probablyduetothefactthattrans- action costs dominate the small residual noise that remains in the system after ‘defactoring’ (see Figure 26). Similarly, on the opposite side of the spectrum, 29",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "X X",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 47,
    "chunk_index": 30,
    "word_count": 267,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "X X (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "eigenportfolios. The conclusion is that 55% PCA is the best performing among the three strategies and is comparable, but slightly inferior, tothe15PCAstrategy. Wealsoobservedthattakingahighcutoffsuchas75% ofexplainedvarianceleadstosteadylosses,probablyduetothefactthattrans- action costs dominate the small residual noise that remains in the system after ‘defactoring’ (see Figure 26). Similarly, on the opposite side of the spectrum, 29 Figure 18: Comparison of strategies with 15 PCA factors and the using ac- tual ETFs in the period 2002-2007. 15-PCA outperforms significantly the ETF strategy. 30 Figure 19: Sharpe ratios for 15 PCA factors : 2002-2007 31 Figure 20: Number of significant eigenvectors needed to explain the variance of the correlation matrix at the 55% level, from 2002 to February 2008. The estimation window for the correlation matrix is 252 days. The boundary of the shadedregionrepresentstheVIXCBOTVolatilityIndex(measuredinpercent- age points). Figure 21: Percentage of variance explained by the top 15 eigenvectors: 2002- February 2008. Notice the increase in the Summer of 2007. 32 Figure 22: Comparison of the PNLs for the fixed explained variance (55%) of PCA and the 15 PCA strategy: 2002-2007. The performance of the 15 PCA strategy is slightly superior. 33 Figure 23: Sharpe ratios for the fixed explained variance (55%) of PCA : 2002- 2007 34",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "X X",
    "page_number": 30,
    "page_range": "p.30-35",
    "total_pages": 47,
    "chunk_index": 31,
    "word_count": 198,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "X X (p.30-35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "of 2007. 32 Figure 22: Comparison of the PNLs for the fixed explained variance (55%) of PCA and the 15 PCA strategy: 2002-2007. The performance of the 15 PCA strategy is slightly superior. 33 Figure 23: Sharpe ratios for the fixed explained variance (55%) of PCA : 2002- 2007 34 using just one eigen-portfolio, as in the Capital Asset Pricing Model, gives rise low levels of mean-reversion, higher residual volatility and poor Sharpe ratios. (See Figure (25) ). Figure 24: Time-evolution of number of PCA factors for different levels of ex- plained variance: 2002-2007 6 Taking trading volume into account In this section, we add volume information to the mean-reversion signals. Let V represent the cumulative share volume transacted until time t starting from t anarbitraryreferencetimet (say,thedateatwhichthestockwasfirstissued). 0 This is an increasing function which can be viewed as a sum of daily trading volumes and approximated as an integral: t Z V = X δV ≈ V˙ ds. t k s t0 Historicalpricescanbeviewedonauniform“timegrid”oronauniform“volume grid” (i.e. the price evolution each time one share is traded). If we denote the latter prices by P , we have V S −S = P −P t+∆t t V(t+∆t) V(t) P −P V(t+∆t) V(t) = (V(t+∆t)−V(t)). (19) V(t+∆t)−V(t) 35 Figure 25: PNL for different variance truncation level:2002-2007 Figure 26: Truncation at 75 % of explained variance: 2007- Apr 2008 36",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "X X",
    "page_number": 35,
    "page_range": "p.35-37",
    "total_pages": 47,
    "chunk_index": 32,
    "word_count": 225,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "X X (p.35-37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "we denote the latter prices by P , we have V S −S = P −P t+∆t t V(t+∆t) V(t) P −P V(t+∆t) V(t) = (V(t+∆t)−V(t)). (19) V(t+∆t)−V(t) 35 Figure 25: PNL for different variance truncation level:2002-2007 Figure 26: Truncation at 75 % of explained variance: 2007- Apr 2008 36 Figure 27: Sharpe ratios for variable PCA strategies: 2002- 2007 Thus, the average price change per unit share over the period of interest is P −P S −S V(t+∆t) V(t) = t+∆t t . V(t+∆t)−V(t) V(t+∆t)−V(t) This suggests that, instead of the classical daily stock returns, we use the mod- ified returns (cid:18) (cid:19) S −S hδVi hδVi R = t+∆t t = R (20) t S V(t+∆t)−V(t) t V(t+∆t)−V(t) t where hδVi indicates the average, or typical, daily trading volume calculated over a given trailing window. Measuring mean-reversion in trading time is equivalent to using calendar time and ’weighting’ the stock returns as in (20). ThemodifiedreturnsR areequaltotheclassicalreturnsifthedailytrading t volume is typical. Notice that if the trading volume is low, the the factor on the right-hand side of the last equation is larger than unity and R > R . t t Similarly, if volume is high then R < R . The concrete effect of the trading- t t time modification is that mean-reversion strategies are sensitive to how much tradingwasdoneimmediatelybeforethesignalwastriggered. Ifthestockrallies onhighvolume,anopen-to-shortsignalusingclassicalreturnsmaybetriggered. However, if the volume is sufficiently large, then the modified return is much smaller so the residual will not necessarily indicate a shorting signal. Similarly, buying stocks that drop on high volume is discouraged by the trading-time approach. We back-tested the previous strategies using the trading time approach and foundthatthistechniqueincreasesthePNLandtheSharperatiosunequivocally forstategieswithETF-generatedsignals(seeFigure28andTable29). ForPCA- based strategies, we found that the trading time framework does not lead to a significant improvement. Finally, we find that the ETF strategy using trading timeiscomparableinperformancetothe15-PCA/55%PCAstrategies(withor 37",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "X X",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 47,
    "chunk_index": 33,
    "word_count": 303,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "X X (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "on high volume is discouraged by the trading-time approach. We back-tested the previous strategies using the trading time approach and foundthatthistechniqueincreasesthePNLandtheSharperatiosunequivocally forstategieswithETF-generatedsignals(seeFigure28andTable29). ForPCA- based strategies, we found that the trading time framework does not lead to a significant improvement. Finally, we find that the ETF strategy using trading timeiscomparableinperformancetothe15-PCA/55%PCAstrategies(withor 37 without trading time adjustments) (see Figure 30 and Table 31 and also Figure 32). Figure 28: Comparision of signals in trading time vs. actual time using actual ETFs as factors : 2002-2007 7 A closer look at 2007 It has been widely reported in the media that 2007 was very challenging for quantitativehedgefunds; seeKhandaniandLo(2007), Barr(2007), Associated Press (2007), Rusli (2007). This was particularly true of statistical arbitrage strategies, who experienced a large drawdown and subsequent partial recovery in the second week of August 2007. Unfortunately for many managers, the size ofthedrawdownwassuchthatmanyhadtode-leveragetheirportfoliosanddid not recover to pre-August levels. Our backtesting results are consistent with the real-world events of 2007 and show a strong drawdown in August 2007 (see below). This drawdown was first reproduced in back-testing by Khandani and Lo(2007) using contrarian strategies. Weanalyzedtheperformanceforourstategiesin2007usingETFswithand without trading time adjustment as well as the 15-PCA strategy (see Figure 33). First, we found that performance was flat or slightly negative in the first part of the year. In early August, we found that mean-reversion strategies ex- periencedalarge,suddendrawdownfollowedbyarecoveryinabout10days. In certain cases, our strategies tracked almost identically the Khandani-Lo (2007) 38 Figure29: SharperatiosforsignalsintradingtimeusingactualETFsasfactors : 2002-2007 Figure30: Comparisionofsignalsintradingtimevs. actualtimeusing15PCAs as factors : 2002-2007 39 Figure 31: Sharpe ratios for signals in trading time using 15 PCAs as factors : 2002-2007 40",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "X X",
    "page_number": 38,
    "page_range": "p.38-40",
    "total_pages": 47,
    "chunk_index": 34,
    "word_count": 263,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "X X (p.38-40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "early August, we found that mean-reversion strategies ex- periencedalarge,suddendrawdownfollowedbyarecoveryinabout10days. In certain cases, our strategies tracked almost identically the Khandani-Lo (2007) 38 Figure29: SharperatiosforsignalsintradingtimeusingactualETFsasfactors : 2002-2007 Figure30: Comparisionofsignalsintradingtimevs. actualtimeusing15PCAs as factors : 2002-2007 39 Figure 31: Sharpe ratios for signals in trading time using 15 PCAs as factors : 2002-2007 40 Figure 32: Comparison of ETF and PCA strategies using “trading time”. simulation after adjusting for leverage (KL used 4+4 leverage and we used 2+2 in this paper). The PCA-based strategies showed more resilience during the liquidity event, with a drawdown of 5% as opposed to 10% for the ETF-based strategies (see Figure 33). Khandani and Lo suggest that the events of 2007 could be due to a liquid- ity shock caused by funds unwinding their positions. As we have seen, these strategies result in levered portfolios with hundreds of long and short positions in stocks. While each position is small and has probably small impact, the aggregate effect of exiting simultaneously hundreds of positions may have pro- ducedthespikeshowninFigure34. AcloserlookatthePLfordifferentsectors shows, for example, that the Technology and Consumer Discretionary sectors were strongly affected by the shock – and more so than Financials and Real Estate; see Figure 36. This apparently paradoxical result – whereby sectors that are uncorrelated with Financials experience large volatility – is consistent with the unwinding theory of Khandani and Lo. A further breakdown of the performance of the different sectors in August 2007 is given in Figure 35. 8 Conclusions Wepresentedasystematicapproachtostatisticalarbitrageandforconstructing market-neutral portfolio strategies based on mean-reversion. The approach is 41",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "X X",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 47,
    "chunk_index": 35,
    "word_count": 254,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "X X (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "that are uncorrelated with Financials experience large volatility – is consistent with the unwinding theory of Khandani and Lo. A further breakdown of the performance of the different sectors in August 2007 is given in Figure 35. 8 Conclusions Wepresentedasystematicapproachtostatisticalarbitrageandforconstructing market-neutral portfolio strategies based on mean-reversion. The approach is 41 Figure 33: Zoom on 2007 of strategies of ETF factor with trading time, ETF factor with actual time and 15 PCA. Figure34: ComparisonwithKhandani&Lo:August2007,2+2leverageonboth strategies 42 Figure 35: Sector view in Aug 2007 Figure 36: Technology & Consumer vs. Financials & Real Estate : Aug 2007 43",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "X X",
    "page_number": 42,
    "page_range": "p.42-44",
    "total_pages": 47,
    "chunk_index": 36,
    "word_count": 96,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "X X (p.42-44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "The approach is 41 Figure 33: Zoom on 2007 of strategies of ETF factor with trading time, ETF factor with actual time and 15 PCA. Figure34: ComparisonwithKhandani&Lo:August2007,2+2leverageonboth strategies 42 Figure 35: Sector view in Aug 2007 Figure 36: Technology & Consumer vs. Financials & Real Estate : Aug 2007 43 based on decomposing stock returns into systematic and idyosincrating compo- nents. This is done using different definitions of risk-factors: ETFs as proxies forindustryfactorsoraPCA-basedapproachwhereweextractfactors,oreigen- portfolios from the eigenvectors of the empirical correlation matrix of returns. ItisinterestingtocomparetheETFandPCAmethods. IntheETFmethod, we essentially use 15 ETFs to representing the ’market’ fluctuations. It is not difficult to verify that, on average, the systematic component of returns in eq- uity markets, explains between 40% and 60% of the variance of stock returns. This suggests, on the PCA side, that the number of factors needed to explain stock returns should be equal to the number of eigenvalues needed to explain approximately50%ofthevarianceoftheempiricalcorrelationmatrix. Inprac- tice, wefoundthatthisnumbertovaryacrosstime, somehwerebetween10and 30. More precisely, we find that the number varies inversely to the value of the VIXOptionvolatiltyindex,suggestingmorefactorsareneededtoexplainstock returns when volatility is low, and less in times of crisis, or large cross-sectional volatility. On the performance side, we found that the best results across the entire period were obtained using 15 ETFs or the 15-PCA strategy, or a variable number of PCA factors explaining approximately 55% of the total variance. Trading-time estimation of signals, which is equivalent to weighting returns inversely to the traded volume, seems to benefit particularly the ETF strategy and make it competitive with PCA. We also note that the performance of mean-reversion strategies appear to benefit from market conditions in which the number of explanatory factors is relativelysmall. Thatis,mean-reversionstatisticalarbitrageworksbetterwhen we can explain 50% of the variance with a relatively small number of eigenval- ues/eigenvectors. The reason for this is that if the “true” number of factors is very large (> 25) then using 15 factors will not be enough to ‘defactor the returns’, soresiduals‘contain’marketinformationthatthemodelisnotableto detect. If, on the other hand, we use a large number of factors, the correspond- ing residuals have small variance, and thus the opportunity of making money, especially in the presence of transaction costs, is diminished. Finally, we have reproduced the results of Khandani and Lo (2007) and thus place our strategies in the same broad universality class as the contrarian strategiesoftheirpaper. Interestinglyenough, ananalysisofPNLatthesector level shows that the spike of August 2007 was more pronounced in sectors such asTechnologyandConsumerDiscrectionarythaninFinancialsandRealEstate, lending plausibility to the “unwinding theory” of Khandani and Lo. 9 Appendix: estimation of the residual process Wedescribeourapproachfortheestimatingco-integrationresidualsasOrstein- Uhlembeck processes and for the calculation of s-scores. We do not claim that this is the most sophisticated or efficient method for estimating the price processes, but simply one that can be readily used (and almost certainly im- 44",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "X X",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 47,
    "chunk_index": 37,
    "word_count": 459,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "X X (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "Khandani and Lo. 9 Appendix: estimation of the residual process Wedescribeourapproachfortheestimatingco-integrationresidualsasOrstein- Uhlembeck processes and for the calculation of s-scores. We do not claim that this is the most sophisticated or efficient method for estimating the price processes, but simply one that can be readily used (and almost certainly im- 44 proved) by industry researchers. Forsimplicity, wedescribetheestimationoftheOUparametersforthecase of ETF regressions, the case of PCA being similar. The first step is to estimate the regression RS =β +βRI + (cid:15) , n=1,2,...,60. n 0 n n relating stock returns to the corresponding ETF returns. Here we assume that returns are chronologically ordered, and RS is the last observed return, based 60 on the variation of the closing prices from yesterday to today. Recalling the model (10), we set α=β /∆t = β ∗252. 0 0 Next, we define auxiliary process k X X = (cid:15) k =1,2,...,60, k j j=1 which can viewed as a discrete version of X(t), the OU process that we are estimating. Noticethattheregression“forces”theresidualstohavemeanzero, so we have X =0. 60 The vanishing of X is an artifact of the regression, due to the fact that the 60 betas and the residuals are estimated using the same sample.10 TheestimationoftheOUparametersisdonebysolvingthe1-lagregression model X = a + bX +ζ , n=1,...,59. n+1 n n+1 According to (13), we have a = m (cid:0) 1−e−κ∆t(cid:1) b = e−κ∆t 1−e−2κ∆t Variance(ζ) = σ2 2κ 10This does not have to be the case. For instance, we can use 90 days to estimate the regressionand60daystoestimatetheprocess. 45",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "X X",
    "page_number": 45,
    "page_range": "p.45-46",
    "total_pages": 47,
    "chunk_index": 38,
    "word_count": 249,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "X X (p.45-46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "model X = a + bX +ζ , n=1,...,59. n+1 n n+1 According to (13), we have a = m (cid:0) 1−e−κ∆t(cid:1) b = e−κ∆t 1−e−2κ∆t Variance(ζ) = σ2 2κ 10This does not have to be the case. For instance, we can use 90 days to estimate the regressionand60daystoestimatetheprocess. 45 whence κ = −log(b)∗252 a m = 1−b r Variance(ζ)·2κ σ = 1−b2 r Variance(ζ) σ = (21) eq 1−b2 Fast mean-reversion (compared to the 60-day estimation window) requires that κ > 252/30, which corresponds to mean-reversion times of the order of 1.5 months at most. In this case, 0 < b < 0.9672 and the above formulas make sense. If b is too close to 1, the mean-reversion time is too long and the model is rejected for the stock under consideration. Notice that the s-score, which is defined theoretically as X(t)−m s = σ eq becomes, since X(t)=X =0, 60 √ −m −a· 1−b2 s = = . p σ eq (1−b)· Variance(ζ) The last caveat is that we found that centered means work better, so we set (cid:28) (cid:29) a a m = − 1−b 1−b where brackets denote averaging over different stocks. The s-score is therefore, √ s −m −a· 1−b2 (cid:28) a (cid:29) 1−b2 s= = + · (22) p σ eq (1−b)· Variance(ζ) 1−b Variance(ζ) References Associated Press, Quant funds endure August turmoil. The Motley Fool, De- cember 6, 2007. Barr, A., Quant quake shakes hedge-fund giants Goldman, Renaissance, AQR see losses, but also sense opportunity, Marketwatch, August 13, 2007. Cont, R., Da Fonseca, J., Dynamics of implied volatility surfaces. Quantita- tive Finance, 2002, Vol 2, No 1, 45-60. 46",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "X X",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 47,
    "chunk_index": 39,
    "word_count": 276,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "X X (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "endure August turmoil. The Motley Fool, De- cember 6, 2007. Barr, A., Quant quake shakes hedge-fund giants Goldman, Renaissance, AQR see losses, but also sense opportunity, Marketwatch, August 13, 2007. Cont, R., Da Fonseca, J., Dynamics of implied volatility surfaces. Quantita- tive Finance, 2002, Vol 2, No 1, 45-60. 46",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "X X",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 47,
    "chunk_index": 40,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "X X (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "Davis, G., Mallat, S. and Avellaneda, M., Adaptive greedy approximations. Constructive Approximations, 1997, Vol. 13, No. 1, 57-98. Jolliffe, I. T., Principal Components Analysis, Springer Series in Statistics, Springer-Verlag, Heidelberg, 2002. Khandani, A. E. and Lo, A. W., What happened to the quants in August 2007? SSRN, 2007. Laloux, L., Cizeau, P., Potters, M. and Bouchaud, J. P., Random matrix the- oryandfinancialcorrelations. International Journal of Theoretical and Applied Finance, 2000, Vol. 3, No. 3, 391-397. Lehmann, B., Fads, martingales, and market efficiency. Quarterly Journal of Economics, 1990, Vol. 105, No.1, 1-28. Litterman, R. and Scheinkman, J. A., Common factors affecting bond returns. Journal of Fixed Income, June 1991, 54-61. Lo, A. W. and MacKinlay, A. C., When are contrarian profits due to stock market overreaction? The Review of Financial Studies, 1990, Vol. 3, No. 2, 175-205. Plerou,V.,Gopikrishnan,P.,Rosenow,B.,Amaral,L.N.,Guhr,T.andStanley, H. E., Random matrix approach to cross correlations in financial data. Phys. Rev., 2002, E 65, 066126. Pole, A., Statistical arbitrage: Algorithmic trading insights and techniques, Wi- ley Finance, 2007. Poterba, J. M. and Summers, L. H., Mean reversion in stock prices: evidence and implications. Journal of Financial Economics, 1988, Vol. 22, 27-59. Potters, M., Bouchaud, J. P. and Laloux, L., Financial application of random matrix theory: old laces and new pieces. Acta Physica Polonica B, 2005, Vol. 36, No. 9, 2767. Rusli, E. M., Goldman Sachs Alpha to Fail?, Forbes.com, August 9, 2007. Scherer, K. P. and Avellaneda, M., All for one and one for all? A principal component analysis of Latin American brady bond debt from 1994 to 2000. In- ternational Journal of Theoretical and Applied Finance, 2002, Vol. 5, No. 1, 79-106. 47",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "X X",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 47,
    "chunk_index": 41,
    "word_count": 273,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "X X (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  },
  {
    "text": "Sachs Alpha to Fail?, Forbes.com, August 9, 2007. Scherer, K. P. and Avellaneda, M., All for one and one for all? A principal component analysis of Latin American brady bond debt from 1994 to 2000. In- ternational Journal of Theoretical and Applied Finance, 2002, Vol. 5, No. 1, 79-106. 47",
    "title": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee",
    "source_type": "pdf",
    "document_id": "0e22677873ca",
    "source_file": "Statistical Arbitrage in the U.S. Equities Market - Avellaneda, Lee.pdf",
    "section": "X X",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 47,
    "chunk_index": 42,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "X X (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080711125908-04'00'",
    "duration": null
  }
]