[
  {
    "text": "See discussions, stats, and author profiles for this publication at: https://www.researchgate.net/publication/4901422 Stock Markets, Banks, and Economic Growth Article in American Economic Review · February 1998 Source: RePEc CITATIONS READS 3,485 17,449 2 authors, including: Ross Levine University of California, Berkeley 281 PUBLICATIONS 77,393 CITATIONS SEE PROFILE All content following this page was uploaded by Ross Levine on 03 June 2014. The user has requested enhancement of the downloaded file. StockMarkets,Banks,and EconomicGrowth RossLevine;SaraZervos TheAmericanEconomic Review,Vol.88,No.3.(Jun.,1998),pp.537-558. StableURL: http://links.jstor.org/sici?sici=0002-8282%28199806%2988%3A3%3C537%3ASMBAEG%3E2.0.CO%3B2-9 TheAmericanEconomicReviewiscurrentlypublishedbyAmericanEconomicAssociation. YouruseoftheJSTORarchiveindicatesyouracceptanceofJSTOR'sTermsandConditionsofUse,availableat http://www.jstor.org/about/terms.html.JSTOR'sTermsandConditionsofUseprovides,inpart,thatunlessyouhaveobtained priorpermission,youmaynotdownloadanentireissueofajournalormultiplecopiesofarticles,andyoumayusecontentin theJSTORarchiveonlyforyourpersonal,non-commercialuse. Pleasecontactthepublisherregardinganyfurtheruseofthiswork.Publishercontactinformationmaybeobtainedat http://www.jstor.org/journals/aea.html. EachcopyofanypartofaJSTORtransmissionmustcontainthesamecopyrightnoticethatappearsonthescreenorprinted pageofsuchtransmission. TheJSTORArchiveisatrusteddigitalrepositoryprovidingforlong-termpreservationandaccesstoleadingacademic journalsandscholarlyliteraturefromaroundtheworld.TheArchiveissupportedbylibraries,scholarlysocieties,publishers, andfoundations.ItisaninitiativeofJSTOR,anot-for-profitorganizationwithamissiontohelpthescholarlycommunitytake advantageofadvancesintechnology.FormoreinformationregardingJSTOR,pleasecontactsupport@jstor.org. http://www.jstor.org TueFeb1903:43:102008",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-3",
    "total_pages": 30,
    "chunk_index": 0,
    "word_count": 91,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "PUBLICATIONS 77,393 CITATIONS SEE PROFILE All content following this page was uploaded by Ross Levine on 03 June 2014. The user has requested enhancement of the downloaded file. StockMarkets,Banks,and EconomicGrowth RossLevine;SaraZervos TheAmericanEconomic Review,Vol.88,No.3.(Jun.,1998),pp.537-558. StableURL: http://links.jstor.org/sici?sici=0002-8282%28199806%2988%3A3%3C537%3ASMBAEG%3E2.0.CO%3B2-9 TheAmericanEconomicReviewiscurrentlypublishedbyAmericanEconomicAssociation. YouruseoftheJSTORarchiveindicatesyouracceptanceofJSTOR'sTermsandConditionsofUse,availableat http://www.jstor.org/about/terms.html.JSTOR'sTermsandConditionsofUseprovides,inpart,thatunlessyouhaveobtained priorpermission,youmaynotdownloadanentireissueofajournalormultiplecopiesofarticles,andyoumayusecontentin theJSTORarchiveonlyforyourpersonal,non-commercialuse. Pleasecontactthepublisherregardinganyfurtheruseofthiswork.Publishercontactinformationmaybeobtainedat http://www.jstor.org/journals/aea.html. EachcopyofanypartofaJSTORtransmissionmustcontainthesamecopyrightnoticethatappearsonthescreenorprinted pageofsuchtransmission. TheJSTORArchiveisatrusteddigitalrepositoryprovidingforlong-termpreservationandaccesstoleadingacademic journalsandscholarlyliteraturefromaroundtheworld.TheArchiveissupportedbylibraries,scholarlysocieties,publishers, andfoundations.ItisaninitiativeofJSTOR,anot-for-profitorganizationwithamissiontohelpthescholarlycommunitytake advantageofadvancesintechnology.FormoreinformationregardingJSTOR,pleasecontactsupport@jstor.org. http://www.jstor.org TueFeb1903:43:102008 Stock Markets, Banks, and Economic Growth By Ross LEVINEAND SARAZERVO * S Do well-functioning stock markets and banks promote long-run economic growth? This paper shows that stock market liquidity and banking development both positively predict growth, capital accumulation, and productivity improve- ments when entered together in regressions, even after controlling for economic and political factors. The results are consistent with the views that Jinancial markets provide important services for growth, and that stock markets provide different services from banks. The paper also Jinds that stock market size, vola- tility, and international integration are not robustly linked with growth, and that none of the financial indicators is closely associated with private saving rates. (JEL GOO, 016, F36) Considerable debate exists on the relation- Besides the historical. focus on banking, ships between the financial system and eco- there is an expanding theoretical literature on nomic growth. Historically, economists have the links between stock markets and long-run focused on banks. Walter Bagehot (1873) and growth, but very little empirical evidence. Joseph A. Schumpeter (1912) emphasize the Levine (1991) and Valerie R. Bencivenga et critical importance of the banking system in al. ( 1995) derive models where more liquid economic growth and highlight circumstances stock markets-markets wliere it is less ex- when banks can actively spur innovation and pensive to trade equities-reduce the disin- future growth by identifying and funding pro- centives to investing in long-duration projects ductive investments. In contrast, Robert E. because investors can easily sell their stake in Lucas, Jr. ( 1988) states that economists the project if they need their savings before \"badly over-stress\" the role of the financial the project matures. Enhanced liquidity, there- system, and Joan Robinson (1952) argues that fore, facilitates investment in longer-run, banks respond passively to economic growth. higher-return projects that boost productivity Empirically, Robert G. King and Levine growth. Similarly, Michael B. Devereux and (1993a) show that the level of financial inter- Gregor W. Smith ( 1994) and Maurice mediation is a good predictor of long-run rates Obstfeld ( 1994) show that greater interna- of economic growth, capital accumulation, tional risk sharing through internationally in- and productivity improvements. tegrated stock markets induces a portfolio shift from safe, low-return investments to high- return investments, thereby accelerating pro- * Levine: Department of Economics, University of Vir- ductivity growth. ~h~~~ liquidity a,nd risk ginia, Charlottesville, VA 22903; Zewos: Barclay's Cap- models;, however, also imply that greater li- ital Wharf, London, U,K, We thank Mark Baird, quidity and international capital UIarket ink- Valerie Bencivenga, John Boyd, Jerry Caprio, Asli Demirgiiq-Kunt, Doug Diamond, Bill Easterly, Michael gration ambiguously affect saving rates. In Gavin, Bruce Smith, two anonymous referees, and semi- fact, higher returns and better risk sharing may nar participants at Arizona State University, Cornell Uni- induce saving rates to fall enough such that versity, Dartmouth College, Harvard Institute for International Development, the University of Virginia, growth with liquid and in- and the University of Washington for helpful comments. ternationally integrated financial markets. We received excellent research assistance from Michelle Moreover, theoretical debate exists about Barnes and Ti Caudron. Much of the work on this paper whethe:r greater stock liquidity actually was done while the authors were employed by the World Bank. Opinions expressed are those of the authors and do a shift to higher-return projects not necessarily reflect those of the World Bank, its staff, that stiK~ulate~ roductivigt~ro wth. Since more or member countries. liquidity makes it easier to sell shares, some 537",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 30,
    "chunk_index": 1,
    "word_count": 625,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "the authors were employed by the World Bank. Opinions expressed are those of the authors and do a shift to higher-return projects not necessarily reflect those of the World Bank, its staff, that stiK~ulate~ roductivigt~ro wth. Since more or member countries. liquidity makes it easier to sell shares, some 537",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 30,
    "chunk_index": 2,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "538 THE AMERICAN ECONOMIC REVIEW JUNE 1998 argue that more liquidity reduces the incen- value of trading relative to the size of the econ- tives of shareholders to undertake the costly omy -is positively and significantly cone- task of monitoring managers (Andrei Shleifer lated with current and future rates of economic and Robert W. Vishny, 1986; Amar Bhide, growth, capital accumulation, and productivity 1993). In turn, weaker corporate governance growth. Stock market liquidity is a robust pre- impedes effective resource allocation and dictor of real per capita gross domestic product slows productivity growth. Thus, theoretical (GDP) growth, physical capital growth, and debate persists over the links between eco- productivity growth after controlling for initial nomic growth and the functioning of stock income, initial investment in education, polit- markets.' ical stability, fiscal policy, openness to trade, This paper empirically investigates whether macroeconomic stability, and the forward- measures of stock market liquidity, size, vol- looking nature of stock prices. Moreover, the atility, and integration with world capital mar- level of banking development-as measured kets are robustly correlated with current and by bank loans to private enterprises divided by future rates of economic growth, capital ac- GDP-also enters these regressions signifi- cumulation, productivity improvements, and cantly. Banking development and stock mar- saving rates using data on 47 countries from ket liquidity are both good predictors of 1976 through 1993. This investigation pro- economic growth, capital accumulation, and vides empirical evidence on the major theo- productivity growth. The other stock market retical debates regarding the linkages between indicators do not have a robust link with long-. stock markets and long-run economic growth. run growth. Volatility is insignificantly come- Moreover, we integrate this study into recent lated with growth in most specifications. cross-country research on financial interme- Similarly, market size and international inte- diation and growth by extending the King and gration are not robustly linked with growth, Levine ( 1993a) analysis of banking and capital accumulation, and productivity im- growth to include measures of the functioning provements. Finally, none of the financial in- of stock markets. Specifically, we evaluate dicators is robustly related to private saving whether banking and stock market indicators rates. are both robustly correlated with current and The results have implications for a variety future rates of economic growth, capital ac- of theoretical models. The strong, positive cumulation, productivity growth, and private connections between stock market liquidity saving. If they are, then this suggests that both and faster rates of growth, productivity im- banks and stock markets have an independent provements, and capital accumulation confirm empirical connection with contemporaneous Eevine's ( 1991) and Bencivenga et al.'s and future long-run growth rates. ( 1995) theoretical predictions. We do not find We find that stock market liquidity-as any support, however, for theories that more measured both by the value of stock trading liquid or more internationally integrated cap- relative to the size of the market and by the ital markets negatively affect saving and growth rates or that greater liquidity retards productivity growth.' Further, the evidence ' does not support the belief that stock return In terms of banks, Douglas W. Diamond ( 1984),J ohn volatility hinders investment and resource al- H. Boyd and Edward C. Prescott (1986), and Stephen D. Williamson ( 1986) develop models where financial inter- mediaries-coalitions of agents-lower the costs of ob- taining information about firms from what those costs would be in atomistic capital markets where each investor See Bencivenga and Smith (1991) and Qbstfeld must acquire information individually. Based on these ( 1994) for parameter values that lead to lower saving and core models, King and Levine ( 1993b) show that, by low- growth rates with greater liquidity or risk sharing, respec- ering information costs, financial intermediaries foster tively. The data are inconsistent with these parameter val- more efficient resource allocation and thereby accelerate ues. Note, however, that these models have parameter technological innovation and long-run growth. Jeremy values that are consistent with our empirical findings that: Greenwood and Boyan Jovanovic ( 1990) develop a model (a) liquidity is positively associated with economic in which financial intermediaries affect, and are affected growth; and (b) neither liquidity nor international capital by, economic growth. See the review by Levine (1997). market integration is associated with private saving rates.",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 30,
    "chunk_index": 3,
    "word_count": 709,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "that: Greenwood and Boyan Jovanovic ( 1990) develop a model (a) liquidity is positively associated with economic in which financial intermediaries affect, and are affected growth; and (b) neither liquidity nor international capital by, economic growth. See the review by Levine (1997). market integration is associated with private saving rates.",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 30,
    "chunk_index": 4,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "VOL. 88 NO. 3 LEVINE AND ZERVOS: STOCK MARKETS, BANKS, AND GROWTH 539 location (J. Bradford DeLong et al., 1989). nally, this paper's aggregate cross-country Finally, the data also suggest that banks pro- analyses complement recent microeconomic vide different services from those of stock evidence. Asli Demirgiiq-Kunt and Qojislav markets. Measures of both banking develop- Maksimovic (1996) show that firms in coun- ment and stock market liquidity enter the tries with better-functioning banks and equity growth regression significantly. Thus, to un- markets grow faster than predicted by individ- derstand the relationship between financial ual firm characteristics, and Raghuram G. systems and economic growth, we need theo- Rajan and Luigi Zingales ( 1998) show that ries in which stock markets and banks arise industries that rely more on external finance simultaneously to provide different bundles of prosper more in countries with better- financial services. developed financial markets. A few points are worth emphasizing in in- Raymond Atje and Jovanovic (1993) pre- terpreting the results. First, since Levine and sent a cross-country study of stock markets David Renelt ( 1992) show that past research- and economic growth. They find a significant ers have been unable to identify empirical correlation between growth over the period links between growth and macroeconomic in- 1980-1988 and the value of stock market dicators that are robust to small changes in the trading divided by GDP for 40 countries. We conditioning information set, we check the make several contributions. Besides increasing sensitivity of the results to changes in a large the number of countries by almost 20 percent conditioning information set. Stock market li- and almost doubling the number of years in quidity and banking development are posi- the sample, we construct additional measures tively and robustly correlated with current and of stock market liquidity, a measure of stock future rates of economic growth even after return volatility, i d t wo measures of stock controlling for many other factors associated market integration in world capital markets with economic growth. Second, almost all pre- and incorporate these measures into our study vious cross-country studies of growth focus on of stock markets. banks. and economic data where both the dependent and explana- growth. Furthermork, we control for economic tory variables are averaged over the entire and political factors that may influence growth sample period. Besides examining this con- to gauge the sensitivity of the results to temporaneous relationship, we study whether changes in the conditioning information set. stock market and banking development mea- Moreover, we control for the potential sured at the beginning of the period robustly forward-looking nature of financial prices predict future rates of economic growth, cap- since we want to gauge whether the function- ital accumulation, productivity growth, and ing of stock markets and banks is tied to eco- private saving rates. We find that stock market nomic performance, not whether agents liquidity and banking development both pre- anticipate faster growth. Also, we use the-stan- dict long-run growth, capital accumulation, dard cross-country growth regression frame- and productivity improvements. Although this work of Robert J. Barro (1991) to make investigation does not establish the direction comparisons with other work easier, syste- of causality between financial-sector devel- matically test for the importance of influential opment and growth, the results show that the observations, and correct for heteroskedastic- strong link between financial development and ity. Finally, besides the direct link with growth does not merely reflect contempora- growth, we also study the empirical connec- neous shocks to both, that stock market and tions between stock market development and banking development do not simply follow physical capital accumulation, productivity economic growth, and that the predictive con- improvements, and private saving rates. tent of the financial development indicators The next section presents measures of stock does not just represent the forward-looking na- market and banking development, as well as ture of stock prices. This paper's results are four growth indicators-measures of the rate certainly consistent with the view that the ser- of economic growth, capital accumulation, vices provided by financial institutions and productivity growth, and private saving. Sec- markets are important for long-run growth. Fi- tion I1 examines the relationship between the",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 30,
    "chunk_index": 5,
    "word_count": 691,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "prices. This paper's results are four growth indicators-measures of the rate certainly consistent with the view that the ser- of economic growth, capital accumulation, vices provided by financial institutions and productivity growth, and private saving. Sec- markets are important for long-run growth. Fi- tion I1 examines the relationship between the",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 30,
    "chunk_index": 6,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "540 THE AMERICAN ECONOMIC REVIEW JUNE 1998 four growth indicators and stock market li- on domestic exchanges relative to the size of quidity, size, volatility, international capital the market. High Turnover is often used as an market integration, as well as the level of indicator of low transactions costs. Impor- banking development. Section I11 concludes. tantly, a large stock market is not necessarily a liquid market: a large but inactive market 1. Measuring Stock Market and Banking will have large Capitalization but small Development and the Growth Indicators Turnover. The second measure of market liquidity is To assess the relationship between eco- Value Traded, which equals the value of the nomic growth and both stock market and trades of domestic shares on domestic ex- banking development, we need: (1) empirical changes divided by GDP. While not a direct indicators of stock market liquidity, size, vol- measure of trading costs or the uncertainty as- atility, and integration with world capital mar- sociated with trading on a particular exchange, kets; (2) a measure of banking development; theoretical models of stock market liquidity and (3) measures of economic growth and its and economic growth directly motivate Value components. This section first defines six stock Traded (Levine, 1991; Bencivenga et al., market development indicators: one measure 1995). Value Traded measures trading vol- of stock market size, two measures of stock ume as a share of national output and should market liquidity, a measure of stock market therefore positively reflect liquidity on an volatility, and two measures of stock market economywide basis. Value Traded may be im- integration with world capital markets. Al- portantly different from Turnover as shown by though each of these indicators has shortcom- Demirgiig-Kunt and Levine ( 1996). While ings, using a variety of measures provides a Value Traded captures trading relative to the richer picture of the ties between stock market size of the economy, Turnover measures trad- development and economic growth than if we ing relative to the size of the stock market. used only a single indicator. Second, we de- Thus, a small, liquid market will have high scribe the empirical indicator of banking de- Turnover but small Value Traded. velopment. The third subsection defines the Since financial markets are forward looking, growth indicators: real per capita GDP growth, Value Traded has one potential pitfall. If mar- real per capita physical capital stock growth, kets anticipate large corporate profits, stock productivity growth, and the ratio of private prices will rise today. This price rise would savings to GDP. Finally, we present summary increase the value of stock transactions and statistics on these variables. The Appendix therefore raise Value Traded. Problematically, lists data sources, sample periods, and the liquidity indicator would rise without a rise countries. in the number of transactions or a fall in trans- action costs. This price effect plagues Capital- A. Stock Market Development Indicators ization too. One way to gauge the influence of the price effect is to look at Capitalization and 1. Size-Capitalization measures the size Value Traded together. The price effect influ- of the stock market and equals the value of ences both indicators, but only Value Traded listed domestic shares on domestic exchanges is directly related to trading. Therefore, we in- divided by GDP. Although large markets do clude both Capitalization and Value Traded in- not necessarily function effectively and taxes dicators together in our regressions. If Value may distort incentives to list on the exchange, Traded remains significantly correlated with many observers use Capitalization as an indi- growth while controlling for Capitalization, cator of market development. then the price effect is not dominating the re- 2. Liquidity indicators-We use two re- lationship between Value Traded and growth. lated measures of market liquidity. first, Turn- A second way to gauge the importance of the over equals the value of the trades of domestic price effect is to examine Turnover. The price shares on domestic exchanges divided by the effect does not influence Turnover because value of listed domestic shares. Turnover mea- stock prices enter the numerator and denomi- sures the volume of domestic equities traded nator of Turnover. If Turnover is positively",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 30,
    "chunk_index": 7,
    "word_count": 690,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "domestic price effect is to examine Turnover. The price shares on domestic exchanges divided by the effect does not influence Turnover because value of listed domestic shares. Turnover mea- stock prices enter the numerator and denomi- sures the volume of domestic equities traded nator of Turnover. If Turnover is positively",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 30,
    "chunk_index": 8,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "VOL. 88 NO. 3 LEVINE AND ZERVOS: STOCK MARKETS, BANKS, AND GROWTH 541 and robustly associated with economic Sf stock markets are perfectly integrated, then the growth, then this implies that the price effect intercept in a regression of any asset's excess is not dominating the relationship between li- return on the appropriate benchmark portfolio, quidity and long-run economic growth. P, should be zero: 3. International integration measures- Besides liquidity and size, we use two indi- cators of the degree of integration with world financial markets to provide evidence on the- Rejection of the restrictions defined by (2) ories that link market integration with eco- may be interpreted as rejection of the under- nomic growth. In perfectly integrated markets, lying asset pricing model or rejection of mar- capital flows across international borders to ket integration. equate the price of risk. If capital controls or Under the assumption that the CAPM and APT other barriers impede capital movements, then are reasonable models of asset pricing, we inter- the price of risk may differ internationally. To pret the monthly estimates o:f the absolute value compute measures of integration, we use the of the intercept term from the multivariate re- international capital asset pricing model gression ( 1) & measures of market integration. (CAPM) and international arbitrage pricing To compute monthly estimates of stock market theory (APT). integration for each national market, we compute Since these models are well known, we only the average of the absolute vdue of a;across all cursorily outline the estimation procedures. stocks Leach country each month. Then, we \" Both asset pricing models imply that the ex- multiply this final value by negative one. Thus, pected return on each asset is linearly related these CAPM Integration and APT Integration to a benchmark portfolio or linear combination measures are designed to be positively correlated of a group of benchmark portfolios. Following with integration. Moreover, Korajczyk ( 1996) Robert A. Korajczyk and Claude J. Viallet shows that international integration meaures will ( 1989 p. 562-64), let P denote the vector of be negatively correlated with higher official bar- excess returns on a benchmark portfolio. For riers and taxes to international asset trading, big- the CAPM, P is the excess return on a value- ger transaction costs, and larger impedments to weighted portfolio of common stocks. For the the flow of information about firms.\" APT, P represents the estimated common fac- 4. Volatility-We measure the volatility of tors based on the excess returns of an inter- stock returns, Volatility, as a 12-month rolling national portfolio of assets using the standard deviation estimate that is based on mar- asymptotic principal components technique of ket returns. We cleanse the return series of Gregory Connor and Korajczyk ( 1986). Firm- monthly means and 12 months of aut~ocorrela- level stock returns from 24 national markets tions using the procedure defined by G. William are used to form the value-weighted portfolio Schwert ( 1989). Specifically, we estimate a for the CAPM and to estimate the common 12th-order autoregression of monthly returns, R,, factors for the APT. Given m assets and T pe- including dummy variables, D,,to, allow for dif- riods, consider the following regression: ferent monthly mean returns: where is theexcess rem On asset in pried 'The CAPM and APT Integration measures rely on asset pricing models that the data frequently rejected as t, i.e.? the return above the return On a risk-free good representations of the pricing of risk. For this paper, asset or zero-beta asset (an asset with zero tor- however, we seek a numerical index of, for example, how relation with the benchmark portfolio ) . The much more the United States is integrated into world cap- R,,;~are based on monthly, &-level re- ital markets than is Nigeria. We &. not concerned with turns that have been adjusted for dividends whether the index is based at zero. Thus, even if the in- tegration measures include a constant bias, the CAPM and stock splits. For an average month, there are APT Integration measures still provide information on 6,851 fim~wsith return data from the 24 markets. cross-country differences in market integration.",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 30,
    "chunk_index": 9,
    "word_count": 686,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "dividends whether the index is based at zero. Thus, even if the in- tegration measures include a constant bias, the CAPM and stock splits. For an average month, there are APT Integration measures still provide information on 6,851 fim~wsith return data from the 24 markets. cross-country differences in market integration.",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 30,
    "chunk_index": 10,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "542 THE AMERICAN ECONOMIC REVIEW .TUNE 1998 We collect the absolute value of the residuals issued by the central bank or other interme- from equation (3), and then estimate a 12th- diaries, and by identifying credit to the private order autoregression of the absolute value of sector, as opposed to credit issued to govern- the residuals including dummy variables for ments. In our empirical work, we also used each month to allow far different monthly traditional measures of financial depth and dis- standard deviations of returns: cuss some of these results below. We focus almost exclusively on the results with Bank Credit, C. Channels to Growth The fitted values from this last equation give estimates of the conditional standard deviation Besides examining the relationship between of return^.^ We include this measure because these financial development indicators and of the intense interest in market volatility by long-run real per capita GDP growth, Output academics, practitioners, and policy makers. Growth, we also study two channels through which banks and stock markets may be linked B. Banking Development to growth: the rate of real per capita physical capital stock growth, Capital Stock Growth, An extensive theoretical literature examines and everything else, Productivity Growth. the ties between banks and economic activity. Specifically, let Output Growth equal + Ideally, researchers would construct cross- capital Stock Growth) Productivity country measures of how well banks identify Growth. 'To obtain empirical estimates, we: profitable activities, exert corporate gover- (a) obtain Output Growth from national ac- nance, mobilize resources, manage risk, and counts data; (b) use Capital Stock Growth facilitate transactions. Economists, however, from King and Eevine (1994); (c) select a have not been able to accurately measure these value for K (K = 0.3),and then compute Pro- financial services for a broad cross section of ductivity Growth as a residuaL5 If Capital countries. Consequently, researchers tradition- Stock Growth accurately reflects changes in ally use measures of the overall size of the physical capital and if capacity utilization re- banking sector to proxy for \"financial depth\" mains stable when averaged over 18 years, (e.g., Raymond W. Goldsmith, 1969; Ronald then Productivity Growth should provide a I. McKinnon, 197'3). Thus, researchers often reasonable conglomerate indicator of techno- divide the stock of broad money (M2) by GDP logical change, quality advances, and resource to measure financial depth. As noted by King allocation enhancements.\" and Eevine (1993a), however, this type of fi- The last growth indicator we consider, Sav- nancial depth indicator does not measure ings, equals gross private savings from Paul whether the liabilities are those of banks, the Masson et al. (1995). Measuring private sav- central bank, or other financial intermediaries, ing rates is subject to considerable measure- nor does this financial depth measure identify ment error, and data on gross private savings where the financial system allocates capital. 'Thus, we use the value of loans made by com- mercial banks and other deposit-taking banks To compute capital stocks, King and Levine (1994) to the private sector divided by GDP, and call estimate the capital-output ratio for over 100 countries in this measure Bank Credit. Bank Credit im- 1950, data permitting, and then iterate forward using proves upon traditional financial depth mea- Robert Summers and Alan Heston (1991) real investment data and a depreciation rate of 0.07. We update these es- sures of banking development by isolating timates through 1990 using Summers and Heston (1993) credit issued by banks, as opposed to credit data. Estimates of the capital share parameter, x, typically range between 0.25 and 0.40 (see King and Levine [I9941 for citations). We experimented with values in this range, and since the results do not importantly change, we repofl As in Schwert ( 1989), we use iterated weighted least- the results with K = 0.3. squares estimates, iterating three times between (3) and In the regressions, we include a term for investment (4), to obtain more efficient estimates. in human capital.",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 30,
    "chunk_index": 11,
    "word_count": 653,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "the results do not importantly change, we repofl As in Schwert ( 1989), we use iterated weighted least- the results with K = 0.3. squares estimates, iterating three times between (3) and In the regressions, we include a term for investment (4), to obtain more efficient estimates. in human capital.",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 30,
    "chunk_index": 12,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "VOL. 88 NO. 3 LEVINE AND ZERVOS: STOCK MARKETS, BANKS, AND GROWTH 543 are available for many fewer countries in our measure of bank credit to private enterprises sample (32) than, for example, Output Growth divided by GDP. Third, the liquidity measures data (47). Nevertheless, these data offer a are positively and significantly correlated with unique opportunity to shed some empirical Output Growth, Capital Stock Growth, and light on important theoretical issues: what is Productivity Growth at the 0.05-percent level. the relationship between private saving rates and stock market liquidity, international risk 11. Stock Markets, Banks, and Economic Growth sharing through integrated capital markets, and the level of banking development? This section evaluates whether measures of We term the four variables-Output banking development and stock market liquid- Growth, Capital Stock Growth, Productivity ity, size, volatility, and integration with world Growth, and Savings-growth indicators. capital markets are robustly correlated with Thus, this paper evaluates the empirical rela- economic growth, capital accumulation, pro- tionship between the four growth indicators ductivity growth, and private saving rates. The and the six stock market indicators (Turnover, first two subsections use least-squares regres- Value Traded, Capitalization, Volatility, sions to study the ties between the growth CAPM Integration, and APT Integration) plus indicators and measures of banking develop- the banking development indicator (Bank ment, stock market liquidity, market size, and Credit). stock return volatility. The next subsection uses instrumental variables to examine the D. Summary Statistics and Correlations links between the growth indicators, banking development, and measures of capital market Table 1 presents summary statistics on the integration. We use instrumental variables be- six stock market development indicators, the cause the international integration measures bank development indicator, and four growth are estimated regressors. The final subsection indicators. We have data for a maximum of 47 conducts a number of sensitivity checks on the countries over the 1976- 1993 period. Table 1 robustness of the results. shows substantial variance among the countries in the growth and financial development indi- A. Framework: Banking, Liquidity, Size, cators. For example, Korea averaged 9.7 per- and Volatility cent annual growth over the 1976- 1993 period and had a private savings rate of almost 30 per- This subsection uses cross-country regres- cent of GDP, while Cote d'Ivoire grew at -2.5 sions to gauge the strength of the partial cor- percent in real per capita terms over the same relation between each of the four growth period and Bangladesh's savings rate was 9 indicators and measures of banking and stock percent of GDP; Taiwan had Value Traded market development. The growth indicators equal to almost 1.2, while Nigeria's Value are averaged over the 1976--1 993 period. The Traded averaged 0.0002 from 1976- 1993. banking and stock market development indi- Table 2 presents correlations. Data permit- cators are computed at the beginning of the ting, we average the data over the 1976- 1993 period 1976 (data permitting). There is one period so that each country has one observa- observation per country. We organize the in- tion per variable. We compute the correlations vestigation around the four stock market de- for Capital Stock Growth and Productivity velopment indicators and always control for Growth using data averaged over the 1976- the level of banking development. Thus, we 1990 period. Three correlations are worth run 16 basic regressions, where the dependent highlighting. First, Bank Credit is highly cor- variable is either Output Growth, Capital related with the growth indicators and all of Stock Growth, Productivity Growth, or Sav- the stock market indicators. Second, Bank ings averaged over the 1976- 1993 period. Credit is very highly correlated with Capital- The four stock market variables are either ization (0.65), which suggests that it will be Turnover, Value Traded, Capitalization, or difficult to distinguish between measures of Volatility measured at the beginning of the the overall size of the equity market and the sample period.",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 30,
    "chunk_index": 13,
    "word_count": 644,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "is very highly correlated with Capital- The four stock market variables are either ization (0.65), which suggests that it will be Turnover, Value Traded, Capitalization, or difficult to distinguish between measures of Volatility measured at the beginning of the the overall size of the equity market and the sample period.",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 30,
    "chunk_index": 14,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "544 THE AMERICAN ECONOMIC REVIEW JUNE 1998 TABLE1-SUMMARYSTATISTICAS:N NUAALV ERAGE1S976-1993 Standard Mean Median Maximum Minimum deviation Observations - -. Output Growth 0.021 0.019 0.097 -0.025 0.0'22 47 Capital Stock Growth 0.028 0.024 0.095 .-0.023 0.026 46 Productivity Growth 0.016 0.014 0.079 -0.019 0.017 46 Savings 20.0 20.8 29.7 9.1 5.1 32 Capitalization 0.32 0.17 2.45 0.01 0.43 46 Value Traded 0.11 0.04 1.16 0.00 0.19 47 Turnover 0.30 0.23 2.05 0.01 0.33 46 Volatility 0.07 0.05 0.31 0.03 0.06 36 Bank Credit 0.80 0.75 2.27 0.12 0.50 47 APT Integration -4.30 -3.95 -2.19 -6.67 1.48 24 CAPM Integration -4.08 -3.65 -2.00 -9.98 1.86 24 Notes: Output Growth = real per capita GDP growth; Capital Stock Growth = real per capita capital stock growth; Productivity Growth = Output Growth-(0.3) (Capital Stock Growth); Savings = private savings as a percent of GDP; Capitalization = value of domestic shares as a share of GDP; Value Traded = value of the trades of domestic shares as a share of GDP; Turnover = value of the trades of domestic shares as a share of market capitalization; Volatility = measure of stock return volatility; Bank Credit = bank credit to the private sector as a share of GDP; APT Integra-- tion = the arbitrage pricing theory measure of stock market integration; CAPM Integration = the international capital asset pricing model measure of stock market integration. Traditionally, the growth literature uses both, and that stock market and banking de- growth and explanatory variables averaged velopment do not simply follow economic over long periods. This approach, however, is development. frequently criticized because: (i) a common To assess the strength of the independent shock to the dependent and explanatory vari- relationship between the initial levels of stock ables during the sample period may be driving market and banking development and the the empirical findings; and (ii) contempora- growth variables, we include a wide array of neous regressions-regressions using depen- control variables, X. Specifically, we include dent and explanatory variables averaged over the logarithm of initial real per capital GDP, the same period-do not account for the po- Initial Output, and the logarithm of the initial tential endogenous determination of growth secondary-school enrollment rate, Enrollment, and the explanatory variables. Besides con- because theory and evidence suggest an im ducting the contemporaneous regressions, we portant link between Isng-run growth and ini- focus on the \"initial value\" regressions, tial income and investment in human capital where we use the values of the banking and accumulation (Robert M. Solow, 1956; Lucas, stock market indicators in 1976. While this 1988; N. Gregory Mankiw et al., 1992; Bamo . analysis does not resolve the issue of causality, and Xavier Sala-i-Martin, 1995 ) The number the initial value regressions show that the of revolutions and coups, Revolutions and strong relationship between financial devel- Coups, is included since many authors find opment and the growth indicators does not that political instability is negatively associ-. merely reflect contemporaneous shocks to ated with economic growth (see Barn and",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 30,
    "chunk_index": 15,
    "word_count": 499,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "the initial value regressions show that the of revolutions and coups, Revolutions and strong relationship between financial devel- Coups, is included since many authors find opment and the growth indicators does not that political instability is negatively associ-. merely reflect contemporaneous shocks to ated with economic growth (see Barn and",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 30,
    "chunk_index": 16,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "VOL. 88 NO. 3 LEVINE AND ZERVOS: STOCK MARKETS, BANKS, AND GROWTH 545 Capital Stock Productivity Value CAPM APT Bank Growth Growth Savings Capitalization Traded Turnover Integration Integration Volatility Credit Output Growth Capital Stock Growth Productivity Growth Savings Capitalization Value Traded Turnover CAPM Integration ATP Integration Volatility - -- Notes: p-values in parentheses. Output Growth = real per capital GDP growth; Capital Stock Growth = real per capita capital stock growth; Productivity Growth = Output Growth-(0.3) (Capital Stock Growth); Savings = private savings divided by GDP; Capitalization = value of domestic shares as a share of GDP; Value Traded = value of the trades of domestic shares as a share of GDI'; Turnover = value of the trades of domestic shares as a share market capitalization; Volatility = measure of stock return volatility; Bank Credit = bank credit to the private sector as a share of GDP; APT Integration = the arbitrage pricing theory measure of stock market integration; CAPM Integra- tion = the international capital asset pricing model measure of stock market integration. Sala-i-Martin [I995 ] for evidence and indicator of policy, price, and trade distortions citations). We also include a variety of mac- and therefore is a useful variable to use in as- roeconomic indicators in the conditioning sessing the independent relationship between information set. The initial values of govern- the growth indicators and measures of finan- ment consumption expenditures to GDP, Gov- cial sector development. As discussed below, ernment, and the rate of inflation, Injution, are alternative control variables and combinations included because theory and some evidence of X variables do not materially affect the re- suggests a negative relationship between mac- sults on the relationship between financial de- roeconomic instability and economic activity velopment and economic growth. (William Easterly and Sergio Rebelo, 1993; Stanley Fischer, 1993; Michael Bruno and B,. Results: Banking, Liquidity, Size, Easterly, 1998). Similarly, the initial value of and Volatility the black market exchange rate premium, Black Market Premium, is part of the X vari- First, consider the results on stock market ables since international price distortions may liquidity and banking development. Table 3 impede efficient investment decisions and eco- presents four regressions, where the dependent nomic growth (David Dollar, 1992). More- variable is Output Growth, Capital Stock over, the black market premium is a general Growth, Productivity Grovvth, and Savings,",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 30,
    "chunk_index": 17,
    "word_count": 388,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "market ables since international price distortions may liquidity and banking development. Table 3 impede efficient investment decisions and eco- presents four regressions, where the dependent nomic growth (David Dollar, 1992). More- variable is Output Growth, Capital Stock over, the black market premium is a general Growth, Productivity Grovvth, and Savings,",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 30,
    "chunk_index": 18,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "Deoendent variables Independent Output Capital Stock Productivity variables Growth Growth Growth Savings Bank Credit 0.0131 0.0148 0.011 1 3.8376 (0.0055) (0.0063) (0.0046) (2.3069) Turnover 0.0269 0.0222 0.0201 7.7643 (0.0090) (0.0094) (0.0088) (5.6864) Observations 42 4 1 4 1 29 Notes: Heteroskedasticity-consistent standard errors in parentheses. Output Growth = real per capita GDP growth; Capital Stock Growth = real per capita capital stock growth; Productivity Growth = Output Growth-(0.3) (Capital Stock Growth); Savings = private savings divided by GDP; Bank Credit = initial bank credit to the private sector as a share of GDP; Turnover = initial value of the trades of domestic shares as a share of market capitalization. Other explanatory variables included in each of the regressions: Initial Out- put, Enrollment, Revolutions and Coups, Government, Inflation, and Black Market Premium. respectively, and the liquidity measure is ini- put Growth regression significantly, which tial Turnover. White's heteroskedasticity- confirms Levine and Renelt ( 1992). The consistent standard errors are reported in growth regression R2of 0.50 is consistent with parentheses. Both the stock market liquidity other cross-country growth studies (e.g., Barro . and banking development indicators enter the and Sala-i-Martin, 1995 ) Output Growth, Capital Stock Growth, and In sum, we find that both the initial level of Productivity Growth regressions significantly banking development and the initial level of at the 0.05-percent significance level. To econ- stock market liquidity have statistically signif- omize on space, we only present the coeffi- icant relationships with future values of Out- cient estimates for the stock market and bank put Growth, Capital Stock Growth, and indicators. The full regression results for Table Productivity Growth even after controlling for 3 are given in the Appendix [see Table All. many other factors associated with long-run The other explanatory variables generally en- economic performance. These results are con- ter the regressions as expected. Initial income sistent with the view that stock market liquid- enters with a significantly negative coefficient ity and banks facilitate long-run growth and the size of the convergence coefficient is (Levine, 1991; Bengt Holmstrom and Jean very similar to other studies (Bmo and Sala-i- Tirole, 1993; Bencivenga et al., 1995). The Martin, 1995). Secondary-school enrollment results are not supportive of models that em- enters the growth regression positively, while phasize the negative implications of stock political instability enters with a significantly market liquidity (Shleifer and Vishny, 1986; negative coefficient. Although the values of Shleifer and Lawrence Summers, 1988). government consumption expenditures di- We do not find a statistically significant link vided by GDP and inflation in 1976 enter the between private saving rates and either stock growth regression with negative coefficients, market liquidity or banking development. Al- they are statistically insignificant, though in- though the saving results should be viewed flation has a strong negative relationship with very skeptically because there are only 29 ob- capital accumulation and private saving rates. servations in the regressions, Catherine In this sample of countries and with the exten- Bonser-Neal and Kathryn Dewenter (1996) sive set of control variables, the black market find similar results using annual data with 174 exchange rate premium does not enter the Out- observations: there is not a systematic associ-",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "TABL3E-INITIAL.T URNOVEBRA, NKSA,N D GROWTH1,976-1993",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 30,
    "chunk_index": 19,
    "word_count": 525,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "TABL3E-INITIAL.T URNOVEBRA, NKSA,N D GROWTH1,976-1993 (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "servations in the regressions, Catherine In this sample of countries and with the exten- Bonser-Neal and Kathryn Dewenter (1996) sive set of control variables, the black market find similar results using annual data with 174 exchange rate premium does not enter the Out- observations: there is not a systematic associ-",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "TABL3E-INITIAL.T URNOVEBRA, NKSA,N D GROWTH1,976-1993",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 30,
    "chunk_index": 20,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "TABL3E-INITIAL.T URNOVEBRA, NKSA,N D GROWTH1,976-1993 (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "VOL. 88 NO. 3 LEVINE AND ZERVOS: STOCK MARKETS, BANKS, AND GROWTH 547 ation between stock market liquidity and pri- velopment and private savings has implica- vate saving rates. It is also worth noting that tions for Mankiw et al.'s (1992) evaluation of these results do not contradict Tullio Jappelli the neoclassical growth moclel. One weakness and Marco Pagano's (1994) findings that in their analysis is that savings rates may be countries wher; households are liquidity con- endogenous or proxying for some other strained tend to have higher saving rates. In country-specific factor. This paper's results Jappelli and Pagano ( 1994), \"liquidity con- suggest that saving rates arc: not proxying for strained\" means that households find it rela- financial-sector development. tively difficult to obtain mortgages or Besides being statistically significant, the consumer credit. In contrast, this paper uses estimated coefficients suggest that the relation- the term liquidity to refer to the ease with ships between financial-.sector development which agents can trade equities. Taken to- and future rates of long-run growth, capital ac- gether, the two sets of findings imply that cumulation, and productiviity improvements countries with large impediments to obtaining are economically large. For example, the es- mortgage and consumer credit tend to have timated coefficient implies that a one- higher saving rates, while the level of activity standard-deviation increase in initial stock on a country's stock exchange is unrelated to market liquidity (0.3) woultd increase per cap- saving rates.' Furthermore, our finding that ita growth by 0.8 percentage points per year * stock market liquidity is unrelated to private (0.027 0.3) over this period. Accumulating saving rates is not inconsistent with our find- over 18 years, this implies that real GDP per ing that stock market liquidity is positively re- capita would have been over 15 percent higher lated to physical capital accumulation: (a) by 1994 (exp { 18 * 0.008 } ). The e~tim~atecod- Capital Stock Growth is generated by private- efficient on Bank Credit also suggests a simi- sector, public-sector, and foreign investment, larly large economic relationship between while savings only measures-gross private banking development and growth. Specifi- savings of domestic residents; and (b) the sav- cally, a one-standard-deviation increase in ini- ings analysis is based on a much smaller sam- tial banking development (0.5) would ple of co~ntries.M~o reover, while financial increase Output Growth by 0.7 percentage development is significantly associated with points per year (0.013 *0.5). Taken together, future Capital Stock Growth, economically, the results imply that if a county had increased the major channel through which growth is both stock market and banking development linked to stock markets and banks is through in 1976 by one standard deviation, then by Productivity Growth, not Capital Stock 1994 real per capita GDP would have been 3 1 Growth, as we discuss below. Finally, the lack percent larger, the capital stock per person of a strong link between financial-sector de- would have been 29 percent higher, and pro- ductivity would have been 24 percent greater. These conceptual experiments do not consider the question of causality nor how to change ' More generally, Jappelli and Pagano (1994 p. 102) the financial sector. Nonetheless, the examples note that the finding that financial development is posi- illustrate the potentially large economic con- tively linked with economic growth does not contradict sequences of stock market liquidity and bank- their findings, because they focus on ...the effect of im- \" ing development and the potentially large perfections in the mortgage and consumer credit markets, which have no necessary correlation with the development economic costs of impediments to financial- of lending to firms.' ' sector development. It is also true that in the regression analyses, Savings The Value Traded measure of stock market is only available for about 70 percent of the countries for liquidity confirms these findings. Table 4 pre- which we have Capital Stock Growth data. However, the Bonser-Neal and Dewenter (1996) findings suggest that sents the same type of regressions as in Table this smaller sample is not driving the results. Moreover, 3 except we replace Turnover with Value we restricted the Capital Stock Growth regressions to Traded. Again, the initial liquidity and bank- those countries with Savings data. While the t-statistics on ing development indicators; are significantly the financial indicators fall, financial development gener- and robustly correlated with future rates of ally remains a significant predictor of Capital Stock Growth even in this smaller sample. economic growth, capital accumulati~on,a nd",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "TABL3E-INITIAL.T URNOVEBRA, NKSA,N D GROWTH1,976-1993",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 30,
    "chunk_index": 21,
    "word_count": 741,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "TABL3E-INITIAL.T URNOVEBRA, NKSA,N D GROWTH1,976-1993 (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "liquidity and bank- those countries with Savings data. While the t-statistics on ing development indicators; are significantly the financial indicators fall, financial development gener- and robustly correlated with future rates of ally remains a significant predictor of Capital Stock Growth even in this smaller sample. economic growth, capital accumulati~on,a nd",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "TABL3E-INITIAL.T URNOVEBRA, NKSA,N D GROWTH1,976-1993",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 30,
    "chunk_index": 22,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "TABL3E-INITIAL.T URNOVEBRA, NKSA,N D GROWTH1,976-1993 (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "TABL&EINITIALV ALUET RADEDB,A NKSA,N D GR~wTI1-9~74, - 1993 -- Deoendent variables Independent Output Capital Stock Productivity variables Growth Growth Growth Savings Bank Credit 0.0146 0.0148 0.0125 3.4917 (0.0056) (0.0061) (0.0047) (2.1920) Value Traded 0.0954 0.0927 0.0735 15.8456 (0.03 15) (0.0324) (0.0220) (14.0757) Observations 43 42 42 29 Notes: Ileteroskedasticity-consistentstandard erro - rs in parentheses. Output Growth = real per capita GDP growth; Capital Stock Growth real per capita capital stock growth; Productivity Growth = Output Growth-(0.3) (Capital Stock Growth); Savings =: private savings divided by GDP; Bank Credit = initial bank credit to the private sector as a share of GDP; Value Traded = initial value of the trades of domestic shares as a share of GDP. Other explanatory variables included in each of the regressions: Initial Output, Enrollment, Revolutions and Coups, Government, Inflation, and Black Market Premium. productivity growth. Again, the estimated co- points per year. Since growth accounting ex- efficients suggest an economically large rela- ercises generally give Productivity Growth a tionship between initial financial development weight that is about two times the weight on and future long-run growth rates. For example, physical capital accumulation (i.e., 1c = 1/3), the results imply that if in 1976 Mexico had this implies that Productivity Growth accounts had the sample mean value of Value Traded for about 1.3 percentage points ( 1.9 - (0.046) instead of its actual value of (0.004), ( 113)* 1.9) of the 1.9-percentage-point in- annual per capita growth would have crease in Output Growth generated by the in- been almost 0.4 percentage points faster crease in Value Traded. Thus, the main (0.095*0.04) over the sample period, such channel linking financial development with that GDP per capita would have been 7.5 per- growth runs through Productivity Growth cent higher by 1994 (exp { 18*0.004 } ). The rather than Capital Stock Growth, which economic implications of a symmetric change is consistent with the findings in Jose in banking are even larger. If Mexico had had DeGregodo and Pablo B. Guidotti ( I. 995).%s the sample mean value of banking develop- noted above, the estimated coefficients should ment in 1936 (0.65) instead of its actual value not be viewed as exploitable elasticities. of (0.13), growth would have been 0.8 per- Rather, these conceptual experiments are * centage points faster per year (0.015 0.52). meant to illustrate the economic size of the Combined, these improvements in stock mar- coefficients. ket liquidity and banking development in 1976 The forward-looking nature of stockprices - are consistent with Mexico enjoying almost the \"p~ce-effect\"-is not driving the strong 23-percent higher GDP per capita by 1994. link between market Biqmdity and the growth The findings in Tables 3 and 4 also provide indicators. This can be deduced from two re- some information on the relative importance sults. First, the pdce effect does not influence of the Capital Stock Growth and Productivity Turnover, and Turnover is robustly linked Growth channels. For example, the estimated parameter values imply that a one-standard- deviation increase in Value Traded in 1976 The Productivity Growth channel is also the main link (0.2) would increase Output Growth and Cap- between Bank Credit Output Growth in the Table 3 and 4 ital Stock Growth by about 1.9 percentage results.",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "THE AMERICAN ECONOMIC REVIEW JUNE 1998",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 30,
    "chunk_index": 23,
    "word_count": 536,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THE AMERICAN ECONOMIC REVIEW JUNE 1998 (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "the estimated parameter values imply that a one-standard- deviation increase in Value Traded in 1976 The Productivity Growth channel is also the main link (0.2) would increase Output Growth and Cap- between Bank Credit Output Growth in the Table 3 and 4 ital Stock Growth by about 1.9 percentage results.",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "THE AMERICAN ECONOMIC REVIEW JUNE 1998",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 30,
    "chunk_index": 24,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THE AMERICAN ECONOMIC REVIEW JUNE 1998 (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "VOL. 88 NO. 3 LEVINE AND ZERVOS: STOCK MARKETS, BANKS, AhrD GROWTB TABLE5-INITIAL VALUET RADEDC,A PITALI~ATBIAONNK, SA,N D GROWTH1,976.- 1993 Dependent variables Independent Output Capital Stock Productivity variables Growth Growth Growth Savings Bank Credit 0.0083 0.01 11 0.0086 2.9614 (0.0054) (0.0055) (0.0046) (2.0960) Capitalization 0.0148 0.0088 0.0070 -7.5606 (0.0068) (0.0092) (0.0056) (7.0266) Value Traded 0.0700 0.0780 0.0592 23.5929 (0.0322) (0.0382) (0.0227) (15.7283) Observations 42 41 41 29 Notes: Heteroskedasticity-consistentstandard errors in parentheses. Output Growth = real per capita GDP growth; Capital Stock Growth = real per capita capital stock growth; Productivity Growth = Output Growth-(0.3) (Capital Stock Growth); Savings = private savings divided by GDP; Bank Credit = initial bank credit to the private sector as a share of GDP; Value Traded = initial value of the trades of domestic shares as a share of GDP; Capitalization = initial value of domestic shares as a share of GDP. Other explanatory variables included in each of the regressions: Initial Output, Enrollment, Revolutions and Coups, Government, Inflation, and Black Market Premium. with future rates of economic growth, capital an economy's productive technologies easily accumulation, and productivity growth. Sec- promotes more efficient resource allocation, ond, we include Capitalization and Value capital formation, and faster growth.'' Traded together in the same regression to test Importantly, initial stock market size and whether the price-effect is producing the stock return volatility are not generally robust strong empirical links between Value Traded predictors of the growth indicators. Although and the growth indicators. The price-effect in- the coefficients presented in Table 6 andicate fluences both Capitalization and Value a positive association between Capitalization Traded. If the price-effect is driving the em- and both Output Growth and Capital Stock pirical association between Value Traded and Growth, this relationship is strongly influ- the growth indicators reported in Table 4, then enced by a few countries. Specifically, if Ja- Value Traded should not remain significantly maica, Korea, and Singapore are removed correlated with the growth indicators when we from the regression, Capitalization no longer simultaneously include Capitalization and Value Traded. This is not the case. As reported in Table 5, Value Traded in 1976remains sig- nificantly correlated with future rates of eco- lo The strong link between liquidity and capital accu- nomic growth, capital accumulation, and mulation suggests an area for future research. Specifically, productivity growth even when controlling for three empirical findings need to be reconciled: ( 1) stock market capitalization (with little change in the market liquidity is positively tied to capital formation, but (2) equity sales do not finance much of this capital for- estimated coefficients). Thus, the evidence is mation (Colin Mayer, 1988), and (3) stock market li- inconsistent with the view that expectations of quidity is positively associated with corporate debt-equity future growth, which are reflected in current ratios in developing countries (Demirgup-Kunt and stock prices, are driving the strong empirical Maksimovic, 1996). These findings imply interactions be- tween stock markets. banks, corporate finance, and cor- relationship between stock market liquidity porate investment decisions that many existing theories do and growth. The evidence is consistent with not fully capture (though, see Boyd and Smith [I9961 and the view that the ability to trade ownership of Elisabeth Huybens and Smith 119981).",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "THE AMERICAN ECONOMIC REVIEW JUNE 1998",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 30,
    "chunk_index": 25,
    "word_count": 534,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THE AMERICAN ECONOMIC REVIEW JUNE 1998 (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "markets. banks, corporate finance, and cor- relationship between stock market liquidity porate investment decisions that many existing theories do and growth. The evidence is consistent with not fully capture (though, see Boyd and Smith [I9961 and the view that the ability to trade ownership of Elisabeth Huybens and Smith 119981).",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "THE AMERICAN ECONOMIC REVIEW JUNE 1998",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 30,
    "chunk_index": 26,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THE AMERICAN ECONOMIC REVIEW JUNE 1998 (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "TABL6E-- I NITIAI.CAPITAI.IZABTA.NIOKSN A,, N D GIIOWTH1,976- 1993 ---- - --- up- Dependent variables independent Output Capital Stock Productivity variables Growth Growth Growth Savings Bank Crcdit 0.0089 0.0090 0.0094 5.1226 (0.0061) (0.0078) (0.0050) (2.0927) Observations 45 44 44 31 Notes: Heteroskedasticity-consistent standard errors in parentheses. Output Growth = real per capita GDP growth; Capital Stock Growth = real per capita capital stock growth; Productivity Growth = Output Growth-(0.3) (Capital Stock Growth); Savings = private savings divided by GDP; Bank Credit = initial bank credit to the private sector as a share of GDP; Capitalization = initial value of domestic shares as a share of GDP. Other ex- planatory variables included in each of the regressions: Initial Output, Enrollment, Revo- lutions and Coups, Government, Infation, and Black Market Premium. enters the regression significantly. Similarly, series data averaged over the periods 1976- l' the results oar market volatility do not suggest 1985 and 1984- 1993, so that each country has a reliable link to the growth indicators. As potentially two observations for a maximum of shown in Table 7, stock return volatility is not 48 observations.12 Second, CAPM Integration closely linked with future growth, productivity and APT Integration are estimated regressors. improvements, or private saving rates, and Therefore, we use two-stage least squares to de- Volatility is positively correlated with capital rive consistent standard errors as suggested by accumulation, As discussed below, the results Adrian Pagan ( 3984).I1 on market liquidity are much more robust to Tables 8 and 9 report the results on capital the removal of outliers. More importantly, the market integration. The CAPM and APT In- relationship between stock market size and the tegration measures enter the growth equations growth indicators vanishes when controlling with a positive coefficient suggesting that for stock market liquidity ('Table 5). Thus, it greater capital market integration is positively is not just listing securities on an exchange; it related to economic performance. Further- is the ability to trade those securities that is more, the point estimates imply a potentially closely tied to economic performance. large effect. For example, a one-standard- C. Bfiterizational Capital Market Dategralio~1, Banking, and the Growth Indicators \"We choose this asymmebic dividing point because the data for some countries start in 1978. 'Ro investigate the relationship between the \"FOP instruments, we use Initial Output, Enrollment, growth indicators and international capital mar- Revolutions and Coups, initial Capitalization, initial Value ket integration, we slightly revise the analytical Traded, initial Turnover, initial Inflation, initial ratio of framework in two ways. First, we only have international trade to GDP (Trade),initial Government, and initial Black Market Premium. The first-stage R2's are data on capital market integration for 24 coun- 0.73 for the CAPM Integration measure and 0.52 for the tries. Thus, we use pooled cross-section time- APT Integration measure and the F-statistic for both re- jects the null hypothesis that none of the cross-sectional variation in capital market integration is explained by the explanatory variables. Furthermore, the simple OLS re- '' That 1s. the p-value on the coefficient on Capitali- gressions yield virtually identical results to the instrumen- zation lises above 0 10. tal variable results presented in Tables 8 and 9.",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "THE AMERICAN ECONOMIC REVIEW",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 30,
    "chunk_index": 27,
    "word_count": 526,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THE AMERICAN ECONOMIC REVIEW (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "the cross-sectional variation in capital market integration is explained by the explanatory variables. Furthermore, the simple OLS re- '' That 1s. the p-value on the coefficient on Capitali- gressions yield virtually identical results to the instrumen- zation lises above 0 10. tal variable results presented in Tables 8 and 9.",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "THE AMERICAN ECONOMIC REVIEW",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 30,
    "chunk_index": 28,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THE AMERICAN ECONOMIC REVIEW (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "VOL. 88 NO. 3 LEVINE AND ZERVOS: STOCK MARKETS, BANKS, AND GROWTH TABLE7-INlTlAL VOLATILITBYA,N KSA, ND GROWTH1,9 76- 1993 Dependent variables Independent Output Capital Stock Productivity variables Growth Growth Growth Savings Bank Credit 0.0150 0.0140 0.0130 3.5945 (0.0074) (0.0085) (0.0066) (1.9631) Volatility 0.0150 0.4998 0.021 1 115.0991 (0.0074) (0.1580) (0.2146) (99.4063) Observations 32 32 32 23 Notes: Heteroskedasticity-consistent standard errors in parentheses. Output Growth = real per capita GDP growth; Capital Stock Growth = real per capita capital stock growth; Productivity Growth = Output Growth-(0.3) (Capital Stock Growth); Savings = private savings divided by GDP; Bank Credit = initial bank credit to the private sector as a share of GDP; Volatility = initial measure of stock return volatility. Other explanatory variables included in each of the regressions: Initial Output, Enrollment, Revolutions and Coups, Government, Inflation, and Black Market Premium. deviation increase in CAPM Integration values of the dependent and explanatory vari- ( 1.86) would increase Output Growth by ables averaged over the entire sample period about 1.2 percentage points per year yield similar results. Furthermore, changing * ( 1.86 0.0065). Nonetheless, the data do not the conditioning information set did not ma- suggest a statistically strong link between cap- terially affect our result^.'^ For example, alter- ital market integration and the growth indica- ing the set of explanatory variables included tors. The CAPM and APT Integration in the regression, adding measures of legal ef- measures are not significantly correlated with ficiency or institutional development, as de- Output Growth at the 0.10 level. Moreover, the fined in Paulo Mauro ( 19951, or using the reported regressions exclude Inflation, which King and Levine (1993a) measure of financial is very highly correlated with stock market in- depth did not affect the strong link between tegration. With inflation included, the t- stock market liquidity and growth.'' We also statistics on CAPM Integration and APT experimented with an alternative measure of Integration become even smaller. While the stock rnarket liquidity that gauges trading rel- very small sample may lower confidence in ative to stock price movements. Specifically, these results, the findings do not support the we divide Value Traded by Volatility. All hypothesis that greater risk sharing through in- things equal, more liquid markets should be ternationally integrated markets affect growth, able to support more trading with less price capital accumulation, productivity growth, or volatility. This alternative rneasure produced private saving rates. similar results. We test for the potential influence of outliers D. Sensitivity Analyse,r in two ways. First, we use the procedure for We conducted a wide array of sensitivity analyses to check the robustnkss of these ri- \"Furthermore, we used Summers and Heston (1993) sults.~4 mentioned above, regressions using data, instead of own currency ppices, to compute Govern- ment and Output Growth. This did not affect the results. \"When the legal efficiency and institutional develop- ment indicators are included with enough additional ex- l4 Unpublished appendices with numerous additional planatory variables, the sample size falls dramatically, sensitivity analyses are available at http:llwww.worldbank. such that the Bank Credit becomes insignificant at the orglhtmllprdmg1grthwebIgrowth~t.htm. 0.09-percent level in some specifications.",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "THE AMERICAN ECONOMIC REVIEW",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 30,
    "chunk_index": 29,
    "word_count": 514,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THE AMERICAN ECONOMIC REVIEW (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "results. \"When the legal efficiency and institutional develop- ment indicators are included with enough additional ex- l4 Unpublished appendices with numerous additional planatory variables, the sample size falls dramatically, sensitivity analyses are available at http:llwww.worldbank. such that the Bank Credit becomes insignificant at the orglhtmllprdmg1grthwebIgrowth~t.htm. 0.09-percent level in some specifications.",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "THE AMERICAN ECONOMIC REVIEW",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 30,
    "chunk_index": 30,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THE AMERICAN ECONOMIC REVIEW (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "TABLE8-STOCK MARKEITN TEGRATI(OCANP M), BANKSA, ND GROWTH1,9 76-1993, POOLEDI,NSTRUMENTVAALRIABLES Dependent variables Independent Output Capital Stock Productivity variables Growth Growth Growth Savings Bank Credit 0.0096 0.0143 0.0032 -4.3598 (0.0134) (0.0172) (0.0136) (2.9495) CAPM Integration 0.0065 0.0014 0.0085 2.0167 (0.0043) (0.0045) (0.0048) (2.0609) Notes: First-stage RZfor CAPM Integration: 0.73. Heteroskedasticity-consistent standard errors in parentheses. Output Growth = real per capita GDP growth; Capital Stock Growth = real per capita capital stock growth; Productivity Growth = Output Growth-(0.3) (Capital Stock Growth); Savings = private savings divided by GDP; Bank Credit = initial bank credit to the private sector as a share of GDP; CAPM Integration = the international capital asset pricing model measure of stock market integration. Instruments: a constant, Initial Output, Enrollment, Revolutions and Coups, and initial values of Government, Black Mar- ket Premium, Trade, Capitalization, Value Traded, Turnover, and Bank Credit. TABLE9-STOCK MARKEITN TEGRAT~(AOPNT ), BANKSA, ND GROWTI1:,9 76-1993, POOLEDIN, STRUMENTVAALRIABLES -- - -- Dependent variables Independent Output Capital Stock Productivity variables Growth Growth Growth Savings Bank Credit 0.0148 0.0186 0.01 17 -3.8182 (0.0143) (0.0166) (0.0150) (2.3952) APT Integration 0.0075 -0.0008 0.0086 2.8466 (0.0074) (0.0076) (0.0073) (1.7108) Observations 38 38 38 25 Notes: First-stage RZ for APT Integration: 0.52. Heteroskedasticity-consistent standard errors in parentheses. Output Growth = real per capita GDP growth; Capital Stock Growth = real per capita capital stock growth; Productivity Growth = Output Growth-(0.3) (Capital Stock Growth); Savings = private savings divided by GDP; Bank Credit = initial bank credit to the private sector as a share of GDP; AFT Integration = the arbitrage pricing theory measure of stock market integration. Instruments: a constant, Initial Output, En- rollment, Revolutions and Coups, and initial values of Government, Black Market Pre- mium, Trade, Capitalization, Value Traded, Turnover, and Bank Credit. analyzing the influence of particular observa- indicators and the individual stock market indi- tions described in William Greene (2993 pp. cators to identify outliers that may be exces- 287-88). This procedure identifies countries sively influencing the slope and significance of that exert a large effect on each equation's re- the estimated regression line.I7 Removing influ- siduals. Using a critical value of 2.5, we find that removing particularly influential observations does not affect our conclusions. Second, we use a more subjective method for identifying influ- \" Specifically, in the multivariate regression of G(i) on X, Bank Credit, and S(k), where S(k) represents each ential observations; we use scatterplots of the particular stock market indicator taken in turn, the partial partial relationship between each of the growth scatterplot is computed as follows: regress G(i) on X and",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "THE AMERICAN ECONOMIC REVIEW JUNE 1998",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 30,
    "chunk_index": 31,
    "word_count": 425,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THE AMERICAN ECONOMIC REVIEW JUNE 1998 (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "Specifically, in the multivariate regression of G(i) on X, Bank Credit, and S(k), where S(k) represents each ential observations; we use scatterplots of the particular stock market indicator taken in turn, the partial partial relationship between each of the growth scatterplot is computed as follows: regress G(i) on X and",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "THE AMERICAN ECONOMIC REVIEW JUNE 1998",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 30,
    "chunk_index": 32,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THE AMERICAN ECONOMIC REVIEW JUNE 1998 (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "VOL. 88 NO. 3 LEVINE AND ZERVOS: SrOCK MARKETS, BANKS, AND GROWTH TABLEINITIAL STOCKMARKETD EVELOPMENBTA,N KSA, ND GROWTH~, ~-~OUNTRY SAMPLE Dependent variable: Output Growth 78-country sample Original sample -- Stock market indicator (SMII: Bank Credit SMI Bank Credit SMI Turnover Value Traded Capitalization Notes: Heteroskedasticity-consistent !-statistics in parentheses. Output Growth = real per capita GDP growth; Bank Credit = initial bank credit to the private sector as a share of GDP; Turnover = initial value of trades of domestic shares as a share of market capitali- zation; Capitalization = initial value of domestic shares as a share of GDP; Value Traded = initial value of trades of domestic shares as a share of GDP; Other explanatony variables included in each of the regressions: Initial Output, Enrollment, Revolutions and Coups, Government, Inflation, and Black Market Premium. ential observations importantly weakens the re- over.18 Zero is not an extreme guess. Recall lationship between the growth indicators and from Table 1 that the minimum values for market size, as noted above. The other results do Capitalization, Value Traded, and Turnover not change. In particular, stock market liquidity are 0.01, 0.0002, and 0.006 with standard de- remains robustly correlated with growth, capital viations of 0.43, 0.19, and 0.33, respectively. accumulation, and productivity growth after re- As shown in Table 10, the link between eco- moving potential outliers. nomic growth and the initial levels of both We were also concerned about a potential stock market liquidity and banking develop- sample selection problem: we only include ment remains strong even when including data countries with sufficient stock market activity on these additional 31 countries.'\" to warrant inclusion in data bases. We have data on all the non-stock market data for an 111. Conclusion additional 31 countries. Although we do not have explicit observations on stock transac- This paper studied the e:mpirical relation- tions in these economies, anecdotal informa- ship between various measures of stock mar- tion and a review of official documents ket development, banking development, and suggest that stock market activity in these long-run economic growth. We find that, countries was inconsequential in 1976. Thus, for these 3 1countries, we enter values of zero for Capitalization, Value Traded, and Turn- In These 31 countries are Bolivia, Botswana, Came- roon, Central African Republic, Costa Rica, Dominican Republic, Ecuador, Ethiopia, Ghana, Guatemala, Guyana, Haiti, Kenya, Lesotho, Liberia, Madagascar, Malawi, Mali, Mauritania, Mauritius, Nicaragua, Niger Paraguay, Bank Credit and collect the residuals, U(G(i)).Regress Rwanda, Senegal, Somalia, Sri Lanka, Tunisia, Uruguay, S(k) on X and Bank Credit and collect the residuals, Zai:~, and Zambia. U(S(k))T.hen plot U(G(i))against U(S(k))T.his gives Using these additional 31 countries does not alter the a two-dimensional graph of the relationship between G(i) conclusions about the robust links between the financial and S(k) controlling for X and Bank Credit. This helps indicators and Capital Stock Growth and Productivity identify particularly influential observations. Growth.",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "THE AMERICAN ECONOMIC REVIEW JUNE 1998",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 30,
    "chunk_index": 33,
    "word_count": 477,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THE AMERICAN ECONOMIC REVIEW JUNE 1998 (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "U(G(i))against U(S(k))T.his gives Using these additional 31 countries does not alter the a two-dimensional graph of the relationship between G(i) conclusions about the robust links between the financial and S(k) controlling for X and Bank Credit. This helps indicators and Capital Stock Growth and Productivity identify particularly influential observations. Growth.",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "THE AMERICAN ECONOMIC REVIEW JUNE 1998",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 30,
    "chunk_index": 34,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THE AMERICAN ECONOMIC REVIEW JUNE 1998 (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "554 THE AMERICAN ECONOMIC REVIEW JUNE 1998 even after controlling for many factors as- rency Yearbook through 1989 and World Cur- sociated with growth, stock market liquidity rency Yearbook. ) and banking development are both positively Capital Stock Growth: Growth rate in capital and robustly correlated with contemporane- stock per person, available through 1990. ous and future rates of economic growth, (Sources: King and Levine, 1994.) capital accumulation, and productivity Capitalization: Average value of listed do growth. This result is consistent with the mestic shares on domestic exchanges in a year view that a greater ability to trade ownership divided by GDP that grear~( Sources: Interna- of an economy's productive tech~iologiesf a- tional Finance Corporation's (IIFC's) Ernerg- cilitates efficient resource allocation, physi- ing Markets Data Base (electronic version) cal capital formation, and faster economic and the IMF's International Financial growth. Furthermore, since measures of Statistics. ) stock market liquidity and banking devel- Government: Government consumption share opment both enter the growth regressions of GDP. (Sources: IIMF's International Fi- significantly, the findings suggest that banks nancial Statistics and World Bank's World provided different financial services from Development Indicators. ) those provided by stock markets. Thus, to Inflation: Rate of change in the GDP deflator: understand the relationship between the fi- if unavailable, consumer price index is used. nancial system and long-run growth more (Sources: IMF's International Financial Sh- comprehensively, we need theories in which tistics and World Bank's World Development both stock markets and banks arise and de- Indicators. ) velop simultaneously while providing dif- Initial Output: 1,ogarithm of real per capita ferent bundles of financial services to the GDP in 1976. (Source: IMF's Inter~ational economy. We find no support for the conten- Financial Statistics.) tions that stock market liquidity, interna- Enrollment: Logarithm of the secondary- tional capital market integration, or stock school enrollment rate in 1976. (Sources: return volatility reduce private saving rates IMF's International Financial Statistics or hinder long-run growth. This paper finds and World Bank's World Development a strong, positive link between financial de- Indicators. ) velopment and economic growth and the re- Output Growth: Growth of real per capita sults suggest that financial factors are an gross domestic product. (Source: IMF's Inter- integral part of the growth process. national Financial Statistics. ) Productivity Growth: Output Growth minus 0.3 times Capital Stock Growth, available through 1990. (Source: King and Levine, A. Variables and Sources 1994.) Revolutions and Coups: Number of revolu- Data are available at the web site http:// tions and coups per year, averaged over the www.worldbank.org/html/prdmg/grthwe/ b 1980's. (Source: Arthur S. Banks, 1994.) growth-t.htm. Savings: Cross private saving as a percent of CAPM Integration and APT Integration: GDP, available from 1982 onward for coun- Measure of each stock market's integration with tries classified as \"developing\" by the IMF world equity markets based on the capital asset and for the entire sample period for industrial p,cing model and arbitrage pricing theory, re- countries. (Source: Masson et al., 1995.) spectively. (Sources: Korajczyk, 1994, 1996.) Trade: Exports plus imports divided by GDP. Bank Credit: Stock of credit by commercial (Sources: IMF' s International Financial Sta- and deposit-taking banks to the private sector tistics and World Bank's World Development divided by GDP. (Source: International Mon- Indicators. ) etary Fund's (IMF's) International Financial Turnover: Value of the trades of domestic Statistics. ) shares on domestic exchanges over the year Black Market Premium: Black market divided by the average value of domestic exchange rate premium. (Sources: Picks Cur- shares listed on domestic exchanges in that",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "THE AMERICAN ECONOMIC REVIEW JUNE 1998",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 30,
    "chunk_index": 35,
    "word_count": 583,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THE AMERICAN ECONOMIC REVIEW JUNE 1998 (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "International Mon- Indicators. ) etary Fund's (IMF's) International Financial Turnover: Value of the trades of domestic Statistics. ) shares on domestic exchanges over the year Black Market Premium: Black market divided by the average value of domestic exchange rate premium. (Sources: Picks Cur- shares listed on domestic exchanges in that",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "THE AMERICAN ECONOMIC REVIEW JUNE 1998",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 30,
    "chunk_index": 36,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THE AMERICAN ECONOMIC REVIEW JUNE 1998 (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "VOL. 88 NO. 3 LEVINE AND ZERVOS: STOCK MARKETS, BANKS, AND GROWTH 555 year. (Sources: IFC's Emerging Markets Hong Kong, Indonesia (i ,s),India (i,s ,v), Data Base (electronic version) and the Israel (v), Italy (i, s, v). Jamaica (s), Jor- IMF's International Financial Statistics. ) dan (i, v), Japan (i, s, v), Korea (i, s, v), Value Traded: Value of the trades of domestic Luxembourg, Mexico (i ,v),Malaysia (i ,s, shares on domestic exchanges over the year v), Morocco (s), Nigeria (i, s), Tlhe Neth- divided by GDP. (Sources: LFC's Emerging erlands (s, v), Norway (s, v), New Zealand Markets Data Base (electronic version) and (s, v), Pakistan (i, v), Peru, Philippines (i, the IMF's International Financial Statistics.) v) ,Portugal (i, s, v) ,Singapore, Sweden (s , Volatility: Measure of the volatility of stock v), Thailand (i, v), Turkey (s, v), Taiwan returns, based on the stock market index value. (i, v), United States (i, s, v), Venezuela (i, (Sources: LFC's Emerging Markets Data Base v), and Zimbabwe (i, s, IT). (electronic version) and the IMF's Interna- The \"v\" in parentheses indicates that tiovtal Financial Statistics.) this country is one of the 36 countries for which we computed Volatility from B. Countries Coverage and Sample Period monthly stock returns. The \"i\" in paren- theses indicates that this country is one of The following countries were used in the the 24 with CAPM and APT Integration analyses: Argentina (i, v), Australia (i, s, data in Korajczyk (1994, 1996). 'The \"s\" v ),Austria (s,v),Bangladesh (s),Belgium in parentheses indicates that this country is (s, v), Brazil (i, v), Canada (s, v), Chile one of the 32 countries with private savings (i, s, v) ,Colombia (i, s, v) ,Cote d'Ivoire, data in Masson et al. (1995). Unless indi- Germany (s,v) ,Denmark (s, v) ,Egypt (s), cated otherwise, the data are averages over Spain (s, v), Finland (s, v), France (s, v), the period 1976- 1993. United Kingdom (i, s ,v) ,Greece (i, s, v) , Table A1 follows. TABLEA1--COMPLETTEA BLE3 RESULTS-INITIATLU RNOVEBRA,N KSA,ND GROWTH1,976-1993 -- -- Dependent variables Capital Output Stock Productivity Independent variables Growth Growth Growth Savings - Constant 0.0464 0.1049 0.0324 29.2948 (0.0246) (0.0341) (0.0150) (6.0756) Initial Output Enrollment Revolutions and Coups -0.0346 -0.0306 -0.0227 -13.0141 (0.0108) (0.0113) (0.0083) (4.3871) Government Inflation Black Market Premium 0.000 -0.0002 0.0000 -0.0036 (0.oo'Jo) (0.0001) (0.0000) (0.0204) Bank Credit",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "THE AMERICAN ECONOMIC REVIEW JUNE 1998",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 30,
    "chunk_index": 37,
    "word_count": 393,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THE AMERICAN ECONOMIC REVIEW JUNE 1998 (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "variables Capital Output Stock Productivity Independent variables Growth Growth Growth Savings - Constant 0.0464 0.1049 0.0324 29.2948 (0.0246) (0.0341) (0.0150) (6.0756) Initial Output Enrollment Revolutions and Coups -0.0346 -0.0306 -0.0227 -13.0141 (0.0108) (0.0113) (0.0083) (4.3871) Government Inflation Black Market Premium 0.000 -0.0002 0.0000 -0.0036 (0.oo'Jo) (0.0001) (0.0000) (0.0204) Bank Credit",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "THE AMERICAN ECONOMIC REVIEW JUNE 1998",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 30,
    "chunk_index": 38,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THE AMERICAN ECONOMIC REVIEW JUNE 1998 (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "-- -- -- - Ueoendent variables Capital Output Stock Productiviry Independent variables Growth Growth Growth Savings Turnover Observations 42 41 4 1 29 -- --- -- - . Notes: Weteroskedasticity-consistent standard errors in parenth - eses. Output Growth = seal per capita GDP growth; Capital Stock Growth = real per capita capital stock growth; Productivity Growth = Output Growth-(0.3) (Capital Stock Growth); Savings = private savings divided by GDP; Initial Output logarithm of initial real per capita GDP; Enrollrrxen? = logarithm of initial secondary school enrollment; Revolutions and Coups = number of revolutions and coups per year; Government = initial government consurnption expenditures divided by GDP; Inflation = : initial inflation rate; Blacii Market Premium = initial black market exchange rate premium; Bank Credit = initial bank credit to the private sector as a share of GDP; Turnover = initial value of the trades of domestic shares as a share of market capitalization. WFERENCES ing Market Stock Markets.\" Mimeo, Uni- versity of Indiana, 4996. Atje, Raymond and Jovanavlc, Boyan. \"Stock Boyd, John H. and Prescott, Edward C, \"Finan- Markets and Development.\" European cial Intermediary-Coalitions.\" Journal qc Economic Review, April 1993, 37(2/3), Economics Theory, Ap~il1 986, 38(2),pp. pp. 632-40. 211-32. Bagehok, Walter. Lombard Street. Homewood, Boyd, John H. and Smith, Bruce D, \"The CO- IL: h i n , 1873. evolution of the Real and Financial Sectors Banks, Arthur S. \"Cross-National Time Series in the Growth Process.\" World Bank Eco. Data Archive.\" Center for Social Analysis, nornic Review, May 3 996, d8(2),pp. 371-. State BJniversity of New York, Binghamton, 96. 1994. Bruno, Michael and Easterly, William, \"\"Lflation Barro, Robert J, \"Economic Growth in a Cross Crises and Long-.Run Growth.\" Journal qf Section of Countries.\" Quarterly Journal of Monetary Economics, March 1998, 46 ( B ), Economics, May 1991,56(2), pp. 407-43. pp. 3-26. Barro, Robed J, and Sala-i-Martin, Xavier. Eco- Connor, Gregory and Korajjbrzyk, Robert A. \"kr nomic growth. New York: McGraw-Hill, fonnance Measarrenlent with the Arbitrage 1995. Pricing Theory: A New Framework for Bencivenga, Valerie R. and Smith, Bruce D. \"'Fi- Analysis.\" 4burnwF of l~inancialE conorn- nancial Intermediation and Endogenous ics, March 1986, %5(3)p, p. 373-94. Growth.' ' Review of Economic Studies, DeGregorio, Jose and Gnidotti, Pablo E, \"Fina~)~ April 1991,58(2), pp. 195-209. cia1 Development and Economic Growth.\" Bencivenga, Valerie R.; Smith, Bruce D. and Starr, World Developmene, March 1995, 2.3 (31, Ross M. \"Transactions Costs, Technological pg. 433-48. Choice, and Endogenous Growth.\" Journal De Long, J. Bradford; Shleifer, Andrrei; Summers, of Economic Theory, October 1895, 57( 1) , H,awrence H. and Waldmann, Robert 4. \"\"The pp. 53- 177. Size and Incidence of the Losses from Noise Bhide, Amar. \"The Hidden Costs of Stock Trading.\" Journal of Finance, July 1989, Market Liquidity.\" Journal of Financial 44(3),pp. 68 1-96. Economics, August 1993, 34(2), pp. 31- DemirepKunt, Asli and Levine, ROSS. ''Stock 5 1. Market Development and Financial Inter- Bonser-Neal, Catherine and Dewenter, Kathryn. mediaries: Stylized Facts.\" World Bank \"Does Financial Market Development Economic Revie~jM, ay 1996,19(2),2 91 --- Stimulate Savings? Evidence From Emerg- 332.",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "5.76 THE AMERICAN ECONOMIC REVIEW JrJNE 1998",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 30,
    "chunk_index": 39,
    "word_count": 502,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.76 THE AMERICAN ECONOMIC REVIEW JrJNE 1998 (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "of Financial 44(3),pp. 68 1-96. Economics, August 1993, 34(2), pp. 31- DemirepKunt, Asli and Levine, ROSS. ''Stock 5 1. Market Development and Financial Inter- Bonser-Neal, Catherine and Dewenter, Kathryn. mediaries: Stylized Facts.\" World Bank \"Does Financial Market Development Economic Revie~jM, ay 1996,19(2),2 91 --- Stimulate Savings? Evidence From Emerg- 332.",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "5.76 THE AMERICAN ECONOMIC REVIEW JrJNE 1998",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 30,
    "chunk_index": 40,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.76 THE AMERICAN ECONOMIC REVIEW JrJNE 1998 (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "VOL. 88 NO. 3 LEVINE AND ZERVOS: STOCK MARKETS, BANKS, AND GROWTH 557 DemirgiigKunt, Asli and Maksimovic, Vojislav. Jappelli, Tullio and Pagano, Marco. \"Saving, \"Financial Constraints, Uses of Funds, and Growth, and Liquidity Constraints.\" Quar- Firm Growth: An International Compari- terly Journal of Economics, February 1994, son.\" Mimeo, World Bank, 1996. 109(1), pp. 93-109. Devereux, Michael B. and Smith, Gregor W. \"In- King, Robert G. and Levine, Ross. \"Finance and ternational Risk Sharing and Economic Growth: Schumpeter Might Be Right.\" Growth.\" International Economic Review, Quarterly Journal of Economics, August August 1994,35(4), pp. 535-50. 1993a, 108(3), pp. 717-38. . Diamond, Douglas W. \"Financial Intermedia- -- \"Finance, Entrepreneurship, and tion and Delegated Monitoring.\" Review of Growth: Theory and Evidence.\" Journal of Economic Studies, July 1984, 51(3), pp. Monetary Economics, December 1993b, 393-414. 32(3), pp. 513-42. . Dollar, David. ' 'Outward-Oriented Developing -- \"Capital Fundamentalism, Economic Economies Really Do Grow More Rapidly: Development, and Economic Growth.\" Evidence from 95 LDCs, 1976- 1985.\" Carnegie-Rochester Series on Public Pol- Economic Development and Cultural icy, June 1994, 40, pp. 259-92. Change, April 1992,40(3), pp. 523-44. Korajczyk, Robert A. \"Measuring Integra- Easterly, William and Rebelo, Sergio. \"Fiscal tion of Developed and Emerging Mar- Policy and Economic Growth: An Empirical kets.\" Mimeo, Northwestern University, Investigation.\" Journal of Monetary Eco- 1994. - . nomics, December 1 993, 32 ( 3 ) , pp. 417- \"A Measure of Stock Market Inte- 58. gration for Developed and Emerging Mar- Fischer, Stanley. \"The Role of Macroeconomic kets.\" World Bank Economic Review, May Factors in Growth.\" Journal of Monetary 1996, l0(2), pp. 267-89. Economics, December 1993, 32 (3) , pp. Korajczyk, Robert A. and Viallet, Claude J. \"An 485-511. Empirical Investigation of International As- Goldsmith, Raymond W. Financial structure set Pricing.\" Review of Financial Studies, and development. New Haven, CT: Yale September 1989, 2(4), pp. 553-85. University Press, 1969. Levine, Ross. \"Stock Markets, Growth, and Greene, William H. Economic analysis. Engle- Tax Policy.\" Journal of Finance, Septem- wood Cliffs, NJ: Prentice Hall, 1993. ber 1991,46(4), pp. 1445-65. - . Greenwood, Jeremy and Jovanovic, Boyan. \"Fi- \"Financial Development and Eco- nancial Development, Growth, and the Dis- nomic Growth: Views and Agenda.\" Jour- tribution of Income.\" Journal of Political nal of Economic Literature, June 1997, Economy, October 1990, Pt. 1, 98(5), pp. 35(2), pp. 688-726. 1076- 107. Levinc, Ross and Renelt, David. \"A Sensitivity Holmstrom, Bengk and Tirole, Jean. \"Market Li- Analysis of Cross-Country Growth Regres- quidity and Performance Monitoring.\" sions.\" American Economic Review, Sep- Journal of Political Economy, August tember 1992,82(4), pp. 942-63. 1993, 101( 4), pp. 678-709. Lucas, Robert E., Jr. \"On the Mechanics of Huybens, Elisabeth and Smith, Bruce D. \"Infla- Economic Develoument.\" Journal ofM on- tion, Financial Markets, and Long-Run etary ~conomicsj,u ly 1988, 22 ( 1) ,\"pp. 3- Growth.\" Journal of Monetary Economics, 42. 1998 (forthcoming). Mankiw, N. Gregory; Romer, David and Weil, International Finance Corporation. Emerging David. \"A Contribution to the Empirics of markets data base. Washington, DC: Tnter- Economic Growth.\" Quarterly Journal of national Finance Corporation, various Economics, May 1992, 107(2), pp. 407- issues. 37. International Monetary Fund. International Masson, Paul; Bayoumi, Tamim and Samiei, jinancial statistics. Washington, DC: In- Hossein. \"Saving Behavior in Industrial ternational Monetary Fund, various and Developing Countries.\" International issues. Monetary Fund Staff Studies for the",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "5.76 THE AMERICAN ECONOMIC REVIEW JrJNE 1998",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 30,
    "chunk_index": 41,
    "word_count": 542,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.76 THE AMERICAN ECONOMIC REVIEW JrJNE 1998 (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "Quarterly Journal of national Finance Corporation, various Economics, May 1992, 107(2), pp. 407- issues. 37. International Monetary Fund. International Masson, Paul; Bayoumi, Tamim and Samiei, jinancial statistics. Washington, DC: In- Hossein. \"Saving Behavior in Industrial ternational Monetary Fund, various and Developing Countries.\" International issues. Monetary Fund Staff Studies for the",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "5.76 THE AMERICAN ECONOMIC REVIEW JrJNE 1998",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 30,
    "chunk_index": 42,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.76 THE AMERICAN ECONOMIC REVIEW JrJNE 1998 (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "558 THE AMERICAN ECONOMIC REVIEW JUNE I998 World Econonlic Outlook, September Shleifer, Andsei and Sumsners, Lawrence, 1995. \"Breach of Trust in Hostile Takeovers,\" Mauro, Paula. \"Corruption and Growth.\" in A. Auerbach, ed., Corporate takeo- Quarterly Journal of Economics, August vers: Causes and consequence.$. Chi- 1995, 1P0(3), pp. 681-712. cago: University of Chicago Press, 1988, Mayes, Colin. \"New Issues in Corporate Fi- pp. 33-56. nance.\" European Economic Review, June Shleifer, Andaei and VisHny, Robert W. \"'Large 1988,32(5), pp. 1167-88. Shareholders and Corporate Control.\" McWnnon, Ronald 1. Money and capital in eco- Journal of Political Economy, June 1986, nomic development. Washington, DC: 96(3),pp 461-88. Brookings Institution, 1973. Sdow, Robert M. \"A Contribution to the The- Obstfeld, Maurice. ' \"Risk-Taking, Global Di- ory of Economic Growth.\" Quarlerly Jour- versification, and Growth.\" American Eco- nal of Economics, February 1956, 30( 1 ) , nomic Review, December 1994,84( 5 ) , pp. pp. 65-94. 1310-29. Summers, Robert and Westow, Allan. \"The Perm Pagan, Adrian. \"'Econometric Issues in the World Table (Mark 5): An Expanded Set Analysis of Regressions with Generated Re- of International Cornnparisons, 1950-- gressors.\" Pnte?nationalE conomic Review, 1988.\" Quarterly Journal of Economics, February 1984,25( I), pp. 221 -47. May B 991, 606(2),pp. 327--48. Picks Currency Yearbook. New York: Picks, -- \"Renn Wodd Tables, Version 5.5,\" various issues. available on diskette from the National Bu- G. a dZ mgdes, Luigi. \"Financial reau of Economic Research, Cambridge Dependence and Growth.\"American Eco- MA, 1993. nomic Review, June 1998,88(3), pp. 559-86. Williamson, Stephen D. \"'6osdy Monitoring, Fi . Robinson, Joan. \"The Generalization of the nancial Intermecliation, and Equilibrium General Theory.\" The rate of interest and Credit Rationing.\" Journ~rlo f Monetary other essays. London: Macmillan, 1952, pp. Economics, September 1986, 18(2), pp. 67-146. 159-79. Schompeter, Joseph A. l'heorie der wirt- World Bank. World development indicafor..~ . schaftlichen entwicklung Leipzig, Ger- Washington, DC: World Bank, various many: Dunker & Humblot, 1912. issues. Scknwe* G Warn. \"Why Does Stock Market World arrency Yearbook. New York: 1intema.- Volatility Change Over Time?\" Journal ofdoi- tional Currency Analysis, Inc., various nance, December 1989,49(5), pp. 111 5-53, issues.",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "5.76 THE AMERICAN ECONOMIC REVIEW JrJNE 1998",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 30,
    "chunk_index": 43,
    "word_count": 344,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.76 THE AMERICAN ECONOMIC REVIEW JrJNE 1998 (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "World development indicafor..~ . schaftlichen entwicklung Leipzig, Ger- Washington, DC: World Bank, various many: Dunker & Humblot, 1912. issues. Scknwe* G Warn. \"Why Does Stock Market World arrency Yearbook. New York: 1intema.- Volatility Change Over Time?\" Journal ofdoi- tional Currency Analysis, Inc., various nance, December 1989,49(5), pp. 111 5-53, issues. http://www.jstor.org LINKED CITATIONS -Page1of6- Youhaveprintedthefollowingarticle: StockMarkets,Banks,and EconomicGrowth RossLevine;SaraZervos TheAmericanEconomic Review,Vol.88,No.3.(Jun.,1998),pp.537-558. StableURL: http://links.jstor.org/sici?sici=0002-8282%28199806%2988%3A3%3C537%3ASMBAEG%3E2.0.CO%3B2-9 Thisarticlereferencesthe followinglinkedcitations.Ifyouaretryingtoaccessarticlesfroman off-campuslocation,youmay berequiredtofirstlogonviayourlibrarywebsitetoaccessJSTOR.Please visityourlibrary's websiteorcontactalibrariantolearnaboutoptionsforremoteaccesstoJSTOR. [Footnotes] 1FinancialIntermediation and DelegatedMonitoring DouglasW.Diamond TheReviewofEconomicStudies,Vol.51,No.3.(Jul.,1984),pp.393-414. StableURL: http://links.jstor.org/sici?sici=0034-6527%28198407%2951%3A3%3C393%3AFIADM%3E2.0.CO%3B2-1 1FinancialDevelopment,Growth,andtheDistributionofIncome JeremyGreenwood;Boyan Jovanovic TheJournal ofPoliticalEconomy,Vol.98,No.5,Part1.(Oct.,1990),pp.1076-1107. StableURL: http://links.jstor.org/sici?sici=0022-3808%28199010%2998%3A5%3C1076%3AFDGATD%3E2.0.CO%3B2-D 1FinancialDevelopmentandEconomic Growth: ViewsandAgenda RossLevine JournalofEconomicLiterature,Vol.35,No.2.(Jun.,1997),pp.688-726. StableURL: http://links.jstor.org/sici?sici=0022-0515%28199706%2935%3A2%3C688%3AFDAEGV%3E2.0.CO%3B2-X 2FinancialIntermediation and EndogenousGrowth ValerieR.Bencivenga;BruceD.Smith TheReviewofEconomicStudies,Vol.58,No.2.(Apr.,1991),pp.195-209. StableURL: http://links.jstor.org/sici?sici=0034-6527%28199104%2958%3A2%3C195%3AFIAEG%3E2.0.CO%3B2-3 NOTE: Thereferencenumberingfromtheoriginalhasbeenmaintainedinthiscitationlist. http://www.jstor.org LINKED CITATIONS -Page2of6- 2Risk-Taking,GlobalDiversification,andGrowth MauriceObstfeld TheAmericanEconomic Review,Vol.84,No.5.(Dec.,1994),pp.1310-1329. StableURL: http://links.jstor.org/sici?sici=0002-8282%28199412%2984%3A5%3C1310%3ARGDAG%3E2.0.CO%3B2-8 4WhyDoesStockMarketVolatilityChange Over Time? G.WilliamSchwert TheJournal ofFinance,Vol.44,No.5.(Dec.,1989),pp.1115-1153. StableURL: http://links.jstor.org/sici?sici=0022-1082%28198912%2944%3A5%3C1115%3AWDSMVC%3E2.0.CO%3B2-C 5ThePennWorldTable (Mark5):AnExpandedSetofInternationalComparisons,1950-1988 RobertSummers;AlanHeston TheQuarterlyJournalofEconomics,Vol.106,No.2.(May,1991),pp.327-368. StableURL: http://links.jstor.org/sici?sici=0033-5533%28199105%29106%3A2%3C327%3ATPWT%285%3E2.0.CO%3B2-D 7Saving,Growth,andLiquidityConstraints TullioJappelli;MarcoPagano TheQuarterlyJournalofEconomics,Vol.109,No.1.(Feb.,1994),pp.83-109. StableURL: http://links.jstor.org/sici?sici=0033-5533%28199402%29109%3A1%3C83%3ASGALC%3E2.0.CO%3B2-L References EconomicGrowthinaCrossSection ofCountries RobertJ.Barro TheQuarterlyJournalofEconomics,Vol.106,No.2.(May,1991),pp.407-443. StableURL: http://links.jstor.org/sici?sici=0033-5533%28199105%29106%3A2%3C407%3AEGIACS%3E2.0.CO%3B2-C NOTE: Thereferencenumberingfromtheoriginalhasbeenmaintainedinthiscitationlist. http://www.jstor.org LINKED CITATIONS -Page3of6- FinancialIntermediationandEndogenousGrowth ValerieR.Bencivenga;BruceD.Smith TheReviewofEconomicStudies,Vol.58,No.2.(Apr.,1991),pp.195-209. StableURL: http://links.jstor.org/sici?sici=0034-6527%28199104%2958%3A2%3C195%3AFIAEG%3E2.0.CO%3B2-3 TheSizeandIncidenceofthe LossesfromNoise Trading J.BradfordDeLong;AndreiShleifer;LawrenceH.Summers;RobertJ.Waldmann TheJournal ofFinance,Vol.44,No.3,PapersandProceedingsof the Forty-EighthAnnualMeeting oftheAmericanFinanceAssociation,NewYork,New York,December28-30,1988.(Jul.,1989), pp.681-696. StableURL: http://links.jstor.org/sici?sici=0022-1082%28198907%2944%3A3%3C681%3ATSAIOT%3E2.0.CO%3B2-E InternationalRiskSharingand EconomicGrowth MichaelB.Devereux;GregorW.Smith InternationalEconomicReview,Vol.35,No.3.(Aug.,1994),pp.535-550. StableURL: http://links.jstor.org/sici?sici=0020-6598%28199408%2935%3A3%3C535%3AIRSAEG%3E2.0.CO%3B2-B FinancialIntermediationandDelegatedMonitoring DouglasW.Diamond TheReviewofEconomicStudies,Vol.51,No.3.(Jul.,1984),pp.393-414. StableURL: http://links.jstor.org/sici?sici=0034-6527%28198407%2951%3A3%3C393%3AFIADM%3E2.0.CO%3B2-1 Outward-OrientedDevelopingEconomiesReallyDoGrowMoreRapidly:Evidencefrom95 LDCs,1976-1985 DavidDollar EconomicDevelopmentandCulturalChange,Vol.40,No.3.(Apr.,1992),pp.523-544. StableURL: http://links.jstor.org/sici?sici=0013-0079%28199204%2940%3A3%3C523%3AODERDG%3E2.0.CO%3B2-J FinancialDevelopment,Growth,andthe DistributionofIncome JeremyGreenwood;Boyan Jovanovic TheJournal ofPoliticalEconomy,Vol.98,No.5,Part1.(Oct.,1990),pp.1076-1107. StableURL: http://links.jstor.org/sici?sici=0022-3808%28199010%2998%3A5%3C1076%3AFDGATD%3E2.0.CO%3B2-D NOTE: Thereferencenumberingfromtheoriginalhasbeenmaintainedinthiscitationlist. http://www.jstor.org LINKED CITATIONS -Page4of6- MarketLiquidityand Performance Monitoring BengtHolmström;JeanTirole TheJournal ofPoliticalEconomy,Vol.101,No.4.(Aug.,1993),pp.678-709. StableURL: http://links.jstor.org/sici?sici=0022-3808%28199308%29101%3A4%3C678%3AMLAPM%3E2.0.CO%3B2-F Saving,Growth,andLiquidityConstraints TullioJappelli;MarcoPagano TheQuarterlyJournalofEconomics,Vol.109,No.1.(Feb.,1994),pp.83-109. StableURL: http://links.jstor.org/sici?sici=0033-5533%28199402%29109%3A1%3C83%3ASGALC%3E2.0.CO%3B2-L FinanceandGrowth:SchumpeterMight be Right RobertG.King;RossLevine TheQuarterlyJournalofEconomics,Vol.108,No.3.(Aug.,1993),pp.717-737. StableURL: http://links.jstor.org/sici?sici=0033-5533%28199308%29108%3A3%3C717%3AFAGSMB%3E2.0.CO%3B2-4 AnEmpiricalInvestigation ofInternationalAsset Pricing RobertA.Korajczyk;ClaudeJ.Viallet TheReviewofFinancialStudies,Vol.2,No.4.(1989),pp.553-585. StableURL: http://links.jstor.org/sici?sici=0893-9454%281989%292%3A4%3C553%3AAEIOIA%3E2.0.CO%3B2-O StockMarkets,Growth,andTaxPolicy RossLevine TheJournal ofFinance,Vol.46,No.4.(Sep.,1991),pp.1445-1465. StableURL: http://links.jstor.org/sici?sici=0022-1082%28199109%2946%3A4%3C1445%3ASMGATP%3E2.0.CO%3B2-N FinancialDevelopmentand EconomicGrowth:ViewsandAgenda RossLevine JournalofEconomicLiterature,Vol.35,No.2.(Jun.,1997),pp.688-726. StableURL: http://links.jstor.org/sici?sici=0022-0515%28199706%2935%3A2%3C688%3AFDAEGV%3E2.0.CO%3B2-X NOTE: Thereferencenumberingfromtheoriginalhasbeenmaintainedinthiscitationlist. http://www.jstor.org LINKED CITATIONS -Page5of6- ASensitivityAnalysisofCross-CountryGrowthRegressions RossLevine;DavidRenelt TheAmericanEconomic Review,Vol.82,No.4.(Sep.,1992),pp.942-963. StableURL: http://links.jstor.org/sici?sici=0002-8282%28199209%2982%3A4%3C942%3AASAOCG%3E2.0.CO%3B2-J AContributiontothe Empiricsof EconomicGrowth N.GregoryMankiw;DavidRomer;DavidN.Weil TheQuarterlyJournalofEconomics,Vol.107,No.2.(May,1992),pp.407-437. StableURL: http://links.jstor.org/sici?sici=0033-5533%28199205%29107%3A2%3C407%3AACTTEO%3E2.0.CO%3B2-5 Corruption and Growth PaoloMauro TheQuarterlyJournalofEconomics,Vol.110,No.3.(Aug.,1995),pp.681-712. StableURL: http://links.jstor.org/sici?sici=0033-5533%28199508%29110%3A3%3C681%3ACAG%3E2.0.CO%3B2-Q Risk-Taking,GlobalDiversification,andGrowth MauriceObstfeld TheAmericanEconomic Review,Vol.84,No.5.(Dec.,1994),pp.1310-1329. StableURL: http://links.jstor.org/sici?sici=0002-8282%28199412%2984%3A5%3C1310%3ARGDAG%3E2.0.CO%3B2-8 EconometricIssuesinthe AnalysisofRegressionswithGeneratedRegressors AdrianPagan InternationalEconomicReview,Vol.25,No.1.(Feb.,1984),pp.221-247. StableURL: http://links.jstor.org/sici?sici=0020-6598%28198402%2925%3A1%3C221%3AEIITAO%3E2.0.CO%3B2-9 FinancialDependenceand Growth RaghuramG.Rajan;LuigiZingales TheAmericanEconomic Review,Vol.88,No.3.(Jun.,1998),pp.559-586. StableURL: http://links.jstor.org/sici?sici=0002-8282%28199806%2988%3A3%3C559%3AFDAG%3E2.0.CO%3B2-C NOTE: Thereferencenumberingfromtheoriginalhasbeenmaintainedinthiscitationlist.",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "5.76 THE AMERICAN ECONOMIC REVIEW JrJNE 1998",
    "page_number": 25,
    "page_range": "p.25-29",
    "total_pages": 30,
    "chunk_index": 44,
    "word_count": 276,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.76 THE AMERICAN ECONOMIC REVIEW JrJNE 1998 (p.25-29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  },
  {
    "text": "JournalofEconomicLiterature,Vol.35,No.2.(Jun.,1997),pp.688-726. StableURL: http://links.jstor.org/sici?sici=0022-0515%28199706%2935%3A2%3C688%3AFDAEGV%3E2.0.CO%3B2-X NOTE: Thereferencenumberingfromtheoriginalhasbeenmaintainedinthiscitationlist. http://www.jstor.org LINKED CITATIONS -Page5of6- ASensitivityAnalysisofCross-CountryGrowthRegressions RossLevine;DavidRenelt TheAmericanEconomic Review,Vol.82,No.4.(Sep.,1992),pp.942-963. StableURL: http://links.jstor.org/sici?sici=0002-8282%28199209%2982%3A4%3C942%3AASAOCG%3E2.0.CO%3B2-J AContributiontothe Empiricsof EconomicGrowth N.GregoryMankiw;DavidRomer;DavidN.Weil TheQuarterlyJournalofEconomics,Vol.107,No.2.(May,1992),pp.407-437. StableURL: http://links.jstor.org/sici?sici=0033-5533%28199205%29107%3A2%3C407%3AACTTEO%3E2.0.CO%3B2-5 Corruption and Growth PaoloMauro TheQuarterlyJournalofEconomics,Vol.110,No.3.(Aug.,1995),pp.681-712. StableURL: http://links.jstor.org/sici?sici=0033-5533%28199508%29110%3A3%3C681%3ACAG%3E2.0.CO%3B2-Q Risk-Taking,GlobalDiversification,andGrowth MauriceObstfeld TheAmericanEconomic Review,Vol.84,No.5.(Dec.,1994),pp.1310-1329. StableURL: http://links.jstor.org/sici?sici=0002-8282%28199412%2984%3A5%3C1310%3ARGDAG%3E2.0.CO%3B2-8 EconometricIssuesinthe AnalysisofRegressionswithGeneratedRegressors AdrianPagan InternationalEconomicReview,Vol.25,No.1.(Feb.,1984),pp.221-247. StableURL: http://links.jstor.org/sici?sici=0020-6598%28198402%2925%3A1%3C221%3AEIITAO%3E2.0.CO%3B2-9 FinancialDependenceand Growth RaghuramG.Rajan;LuigiZingales TheAmericanEconomic Review,Vol.88,No.3.(Jun.,1998),pp.559-586. StableURL: http://links.jstor.org/sici?sici=0002-8282%28199806%2988%3A3%3C559%3AFDAG%3E2.0.CO%3B2-C NOTE: Thereferencenumberingfromtheoriginalhasbeenmaintainedinthiscitationlist. http://www.jstor.org LINKED CITATIONS -Page6of6- WhyDoesStock MarketVolatilityChangeOverTime? G.WilliamSchwert TheJournal ofFinance,Vol.44,No.5.(Dec.,1989),pp.1115-1153. StableURL: http://links.jstor.org/sici?sici=0022-1082%28198912%2944%3A5%3C1115%3AWDSMVC%3E2.0.CO%3B2-C TheEfficiencyofInvestment inthe Presence ofAggregateDemandSpillovers AndreiShleifer;RobertW.Vishny TheJournal ofPoliticalEconomy,Vol.96,No.6.(Dec.,1988),pp.1221-1231. StableURL: http://links.jstor.org/sici?sici=0022-3808%28198812%2996%3A6%3C1221%3ATEOIIT%3E2.0.CO%3B2-F AContributiontothe Theoryof EconomicGrowth RobertM.Solow TheQuarterlyJournalofEconomics,Vol.70,No.1.(Feb.,1956),pp.65-94. StableURL: http://links.jstor.org/sici?sici=0033-5533%28195602%2970%3A1%3C65%3AACTTTO%3E2.0.CO%3B2-M ThePennWorld Table(Mark 5): AnExpandedSetofInternationalComparisons,1950-1988 RobertSummers;AlanHeston TheQuarterlyJournalofEconomics,Vol.106,No.2.(May,1991),pp.327-368. StableURL: http://links.jstor.org/sici?sici=0033-5533%28199105%29106%3A2%3C327%3ATPWT%285%3E2.0.CO%3B2-D NOTE: Thereferencenumberingfromtheoriginalhasbeenmaintainedinthiscitationlist. VViieeww ppuubblliiccaattiioonn ssttaattss",
    "title": "Stock Markets Banks and Economic Growth",
    "source_type": "pdf",
    "document_id": "5cb274a36fb4",
    "source_file": "Stock_Markets_Banks_and_Economic_Growth.pdf",
    "section": "5.76 THE AMERICAN ECONOMIC REVIEW JrJNE 1998",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 30,
    "chunk_index": 45,
    "word_count": 90,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.76 THE AMERICAN ECONOMIC REVIEW JrJNE 1998 (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20080219034315-05'00'",
    "duration": null
  }
]