[
  {
    "text": "∗ The Skew Risk Premium in the Equity Index Market Roman Kozhan † Anthony Neuberger† Paul Schneider† November 27, 2012 Abstract We measure the skew risk premium in the equity index market through the skew swap. We argue that just as variance swaps can be used to explore the relationship between the implied variance in option prices and realized variance, so too can skew swaps be used to explore the relationship between the skew in implied volatility and realized skew. Like the variance swap, the skew swap corresponds to a trading strategy, necessary to assess risk premia in a model-free way. We find that almost half of the implied volatility skew can be explained by the skew risk premium. We provide evidence that skew and variance premia are manifestations of the same underlying risk factor in the sense that strategies designed to exploit one of the risk premia but to hedge out the other make zero excess returns. ∗We are thankful to Mark Britten-Jones, Peter Carr, Fousseni Chabi-Yo, Bjørn Eraker, Gordon Gemmill, Stewart Hodges, Ciara Rogerson, Thomas Ruf, Mark Salmon, Lucio Sarno, Christian Schlag, Anders Trolle, Andrea Vedolin, Pierre de Vos, Christian Wagner, Liuren Wu and to participants at EFA 2010, AFA 2011, seminarsatCassBusinessSchool,EssexUniversity,LancasterUniversity,Queen’sUniversityBelfast,Warwick Business School, Wisconsin Business School, Zurich University, and the WBS conference on Derivatives, Volatility, and Correlation for valuable comments. †Warwick Business School, University of Warwick, Scarman Road, Coventry, CV4 7AL, UK; e-mail: {roman.kozhan,anthony.neuberger,paul.schneider}@wbs.ac.uk 1 EEleleccttrroonnicic ccooppyy aavvaailialabblele aatt:: hhttttpps::////ssssrrnn..ccoomm//aabbssttrraacctt==11557711770000",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 34,
    "chunk_index": 0,
    "word_count": 243,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "Liuren Wu and to participants at EFA 2010, AFA 2011, seminarsatCassBusinessSchool,EssexUniversity,LancasterUniversity,Queen’sUniversityBelfast,Warwick Business School, Wisconsin Business School, Zurich University, and the WBS conference on Derivatives, Volatility, and Correlation for valuable comments. †Warwick Business School, University of Warwick, Scarman Road, Coventry, CV4 7AL, UK; e-mail: {roman.kozhan,anthony.neuberger,paul.schneider}@wbs.ac.uk 1 EEleleccttrroonnicic ccooppyy aavvaailialabblele aatt:: hhttttpps::////ssssrrnn..ccoomm//aabbssttrraacctt==11557711770000 1 Introduction The implied volatility skew has been a well-recognized feature of the equity index market ever since the crash of 1987. The skew is due to the asymmetric distribution of index returns and to a skew risk premium. This paper seeks to quantify the relative importance of these two factors. It does so by looking at the profitability of a skew swap, a contract that pays the difference between the implied skew and the realized skew, which can be synthesized from standard options and forward contracts. We show that the risk premium accounts for about half the implied skew. We also find that the skew risk premium and the variance risk premium compensate for the same risk. Risk premia cannot be measured directly because the conditional physical density is not observable; all that can be observed is a particular realization of the distribution. Researchers commonly estimate risk premia by repeating a trading strategy over a number of periods and testing the trading profits for predictability. Coval and Shumway (2001) and Bakshi and Kapadia (2003) look at holding returns on option positions – typically at-the-money (ATM) – that are delta neutral, and show that the average return is significantly negative. Since the principal risk to which delta-hedged options are exposed is volatility risk, this can be seen as evidence for the existence of a volatility risk premium. Bollen and Whaley (2004), and Driessen and Maenhout (2007) have documented the high negative returns earned by the buyers of out-of-the-money (OTM) index puts. This can be interpreted as evidence of a specific premium for crash risk. Bakshi et al. (2010) show that there are also negative returns fromholdinghighstrikecallsanddigitals, andinterpretthisasevidenceforaU-shapedpricing kernel. These buy-and-hold strategies face a generic problem. As options age, their risk charac- teristics change. Their exposure to particular risk factors depends not only on the passage of time but also on the evolution of the price level and of the volatility surface. An ATM index straddle may start with zero market exposure and high volatility exposure, but if the market moves far from its initial value, the position will have high market exposure and little volatility exposure. It is hard to draw inferences from the profitability of an option strategy to the pricing of risk factors in the economy when the strategy’s exposure to those factors is itself stochastic. Nor is it easy to tell whether two profitable strategies are manifestations of the same or different priced risks. In the case of the negative OTM put returns for example, Bondarenko (2003) and Broadie et al. (2009) question the statistical significance of the trading profits (since they are so highly skewed) and also argue that the negative buy-and-hold OTM put returns could be explained by other risk factors including market and volatility risk. 2 EEleleccttrroonnicic ccooppyy aavvaailialabblele aatt:: hhttttpps::////ssssrrnn..ccoomm//aabbssttrraacctt==11557711770000",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 34,
    "chunk_index": 1,
    "word_count": 517,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "example, Bondarenko (2003) and Broadie et al. (2009) question the statistical significance of the trading profits (since they are so highly skewed) and also argue that the negative buy-and-hold OTM put returns could be explained by other risk factors including market and volatility risk. 2 EEleleccttrroonnicic ccooppyy aavvaailialabblele aatt:: hhttttpps::////ssssrrnn..ccoomm//aabbssttrraacctt==11557711770000",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 34,
    "chunk_index": 2,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "The obvious solution to the ageing problem is to rebalance the portfolio so that its risk exposure remains constant. The challenge is to do so in a way that is not model-dependent. As Anderson et al. (2000) have noted, use of a misspecified model can generate spurious risk premia. Within a given model, implementation of a dynamic hedging strategy requires the choice of hedging securities, and the profits from the strategy may well be sensitive to the particular securities chosen, making the interpretations of profitability still more difficult. In the case of variance risk, Carr and Wu (2009) solve the problem by using a variance swap which can be synthesized from vanilla options. The key feature of the swap is that innovations in its mark-to-market value are perfectly correlated with innovations in the implied variance of the market - in other words, it is a pure play on variance. In this paper we use an analogous trading strategy, which we call a skew swap, that is a pure play on skew. It involves holding a portfolio of long OTM calls and short OTM puts. Risk characteristics of the portfolio are maintained by subsequently trading the options. This is done in a way that is effectively model-free. The fixed leg of the skew swap is dependent on the implied skew at inception; if the implied volatility smile is symmetric, the value is identically zero. The floating leg turns out to equal the covariation between the returns on the index and changes in its implied variance. Following Neuberger (2012), we argue that it is natural to call this covariation the realized skew. The skew swap has a simple interpretation: the fixed leg is the implied skew and the floating leg is the realized skew. The expected difference between the implied skew and the realized skew, the expected payoff from the skew swap, is the skew risk premium. The implied skew measure we develop differs from that of Bakshi et al. (2003). The reason for departing from the standard definition is that we want to use the difference between the implied skew and the physical skew as an estimate of the skew risk premium. With the standard definition, the two can differ in expectation even when there is no risk premium.1 With our definition, the difference between the physical and implied quantities has a mean of zero in the absence of risk premia. We apply the skew swap technology to S&P 500 option data, and provide evidence that there does indeed exist a skew risk premium in the US equity index market. We show that almost half of the implied skew in index option prices with one month to maturity can be explained by the risk premium, with the other half reflecting the negative correlation between returns and volatility. Skew risk turns out to be closely related to variance risk. The excess return on skew swaps is highly correlated to the excess return on variance swaps (in our data 1This claim is supported by an example in Appendix A. 3 EEleleccttrroonnicic ccooppyy aavvaailialabblele aatt:: hhttttpps::////ssssrrnn..ccoomm//aabbssttrraacctt==11557711770000",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 34,
    "chunk_index": 3,
    "word_count": 512,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "between returns and volatility. Skew risk turns out to be closely related to variance risk. The excess return on skew swaps is highly correlated to the excess return on variance swaps (in our data 1This claim is supported by an example in Appendix A. 3 EEleleccttrroonnicic ccooppyy aavvaailialabblele aatt:: hhttttpps::////ssssrrnn..ccoomm//aabbssttrraacctt==11557711770000",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 34,
    "chunk_index": 4,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "the correlation is nearly 0.9). The profitability of betting on the slope of implied volatility is thus highly correlated with the strategy of betting on its level. But this high correlation depends on continual rebalancing to ensure that the two strategies remain pure bets on skew and variance, and do not pick up other exposures. Under the corresponding buy-and-hold strategies the correlation between the excess returns on skew and variance drops to 0.3. We also show that that the risk premia associated with variance and skew have a common source. When one type of swap is hedged with the other, the expected profit is indistinguish- able from zero. Furthermore, there is consistent evidence that the risk premium on both skew swaps and variance swaps is time-varying, and that a common factor drives both premia. This finding is important for asset pricing. It suggests that models of equity market returns, while they need to take account of the clear evidence for the existence of both variance and skew premia, do not need to allow for separate channels to generate them. Our results are related to a growing literature uncovering spurious risk factors. In par- ticular, Ferson and Harvey (1999) and Ferson et al. (1999) show that the failure to account properly for time variation in market exposure may lead to spurious evidence of additional priced risk factors in cross-section of stock returns. In examining hedge fund performance, Bollen and Whaley (2009, Abstract) note that “The standard measure of performance is the abnormal return defined by a hedge fund’s exposure to risk factors. If exposures are assumed constantwhen, infact, theyvarythroughtime, estimatedabnormalreturnsmaybeincorrect.” The remainder of the paper is organized as follows: Section 2 sets out the model-free approach to constructing the skew swap and shows how to quantify the skew risk premium. Section 3 describes the data. Section 4 presents the empirical results, and Section 5 concludes. SectionAoftheAppendixdiscussestheuseofcentralmomentsinriskpremiummeasurement, SectionBcontainsproofsofpropositionsnotincludedinthemaintext, andSectionCcontains robustness checks. 2 Trading Variance and Skew This section sets out our approach to defining and estimating the risk premia associated with moments of returns. We show how to construct a trading strategy which is exposed to the desired return moment alone. The risk premium is the expected profit from such a strategy. The estimation of the variance risk premium as the expected profit from a variance swap (Carr and Wu 2009) is a special case of our general approach. Previous work on risk premia, whether in equity, bond, currency or other asset markets, 4 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 34,
    "chunk_index": 5,
    "word_count": 417,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "such a strategy. The estimation of the variance risk premium as the expected profit from a variance swap (Carr and Wu 2009) is a special case of our general approach. Previous work on risk premia, whether in equity, bond, currency or other asset markets, 4 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 34,
    "chunk_index": 6,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "has largely been concerned with the first moment of returns. Researchers examine the pre- dictability of excess returns in order to estimate the asset risk premium. An excess return can be interpreted as the profit from a trading strategy. In this case the strategy is to enter into a forward contract on the asset at time t, and hold it until expiry at time T. In a market free from frictions and other imperfections, the expected excess return is interpreted as a premium for risk bearing. Weextendthisapproachtoestimateriskpremiaassociatedwithothermomentsofreturns. To do this, one must be able to trade options on the underlying asset as well as forward contracts as we will show below. We take a world with a single risky asset with a forward contract traded on it with fixed maturity T. The forward price of the asset at time t is F , the log forward price is f and the log return from t to T is r ≡ f −f . With t,T t,T t,T T,T t,T calls and puts available for all strikes, one can create a portfolio of options that has any desired payoff using the results from Bakshi and Madan (2000) and Carr and Madan (2001). In particular, one can buy a portfolio at time t that has payoff at time T of g(r ) for an t,T arbitrary (twice-differentiable) function g. There is also a bond in the market with price B , t,T where B = 1. T,T Denoting the physical measure by P and the forward pricing measure for a maturity T by Q, the forward price of the payoff g is G ≡ EQ [g(r )]. (1) t,T t t,T The net profit at time T from the buy-and-hold strategy is g(r )−EQ [g(r )], (2) t,T t t,T and the risk premium associated with this strategy is EP [g(r )]−EQ [g(r )]. (3) t t,T t t,T As a way of measuring the risk premium associated with the function g over the period [t,T], this buy-and-hold strategy has two defects: it is in general exposed to directional risk, so the estimated risk premium is contaminated by any risk premium that is associated with a position in the underlying asset. The second defect is that the risk characteristics of the strategy change over time. At a future time τ the investor is holding a contract that pays g(r ) and not g(r ), meaning that the risk exposure at time τ depends on the essentially t,T τ,T 5 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 34,
    "chunk_index": 7,
    "word_count": 422,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "is that the risk characteristics of the strategy change over time. At a future time τ the investor is holding a contract that pays g(r ) and not g(r ), meaning that the risk exposure at time τ depends on the essentially t,T τ,T 5 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 34,
    "chunk_index": 8,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "arbitrary choice of the point of inception of the strategy. To formalize the notion of a strategy that is a pure bet on g-risk we normalize g(0) = 0, which implies that G = 0. Given a self-financing trading strategy, we introduce the wealth T,T process W as the profit from the strategy to date. More specifically, we define W as the value t t of the portfolio at time T if the portfolio were liquidated at time t and the proceeds were invested in the risk-free bond until time T. We normalize W = 0. All transactions take place 0 in the forward market, and no cash flows occur prior to time T. Define the residual process as Y ≡ W −G . (4) t,T t,T t,T If a trading strategy has a residual process that is predictable, so the stochastic components of the increments in G and W are the same, we call a trading strategy a perfect hedge for g. If such a trading strategy exists (and we show below that it does, and how to construct it) then the expected change in W can be interpreted as the risk premium associated with g. To remove the exposure to the market we introduce delta hedging. We define the delta of g as ∆ ≡ EQ [g(cid:48)(r )]/F . (5) t,T t t,T t,T It can be computed at time t from the prices of options, and does not depend on a specific model. A delta-hedged g-swap is the payoff to a dynamic trading strategy where at each time t when the portfolio is rebalanced, the portfolio is invested in the claim with payoff of g(r ), a t,T holding of −∆ forward contracts, and the rest of the portfolio is invested in risk-free bonds. t,T Note that with g(r ) changing over time, this strategy involves trading in the options market t,T as well as in the forward market. Our main result is Proposition 1. If the price of the underlying asset and options on it follow a joint diffusion process, the continuously rebalanced delta-hedged g-swap is a perfect hedge for g. Proof. First consider a discretely rebalanced delta-hedged g-swap. If it is rebalanced succes- sively at times t and t+δt, the change of the value of the position is δW ≡ W −W = EQ [g(r )]−EQ [g(r )]−∆ (F −F ) = δG +δY , (6) t,T t+δt,T t,T t+δt t,T t t,T t,T t+δt,T t,T t,T t,T 6 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 34,
    "chunk_index": 9,
    "word_count": 419,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "at times t and t+δt, the change of the value of the position is δW ≡ W −W = EQ [g(r )]−EQ [g(r )]−∆ (F −F ) = δG +δY , (6) t,T t+δt,T t,T t+δt t,T t t,T t,T t+δt,T t,T t,T t,T 6 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 34,
    "chunk_index": 10,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "where δY = EQ (cid:2) g(r +δf )−g(r )− (cid:0) eδft,T −1 (cid:1)EQ [g(cid:48)(r )] (cid:3) , and t,T t+δt t+δt,T t,T t+δt,T t t,T (7) δf = f −f = r −r . t,T t+δt,T t,T t,T t+δt,T Summing over the wealth gains (6), and recalling that W = G = 0, we get that2 W = 0 T,T T (cid:80) δY −G . This justifies the description of the strategy as a swap, since it synthesizes t,T 0,T (cid:80) a contract where the investor receives the floating leg δY and pays the fixed leg G . t,T 0,T Importantly, the fixed leg is independent of the rebalancing frequency. As shown in Appendix B.1, if prices follow a diffusion and if the hedge is rebalanced continuously, the residual process Y satisfies the stochastic differential equation t,T 1 dY = dG(cid:48) df + (cid:0) G(cid:48)(cid:48) −G(cid:48) (cid:1) (df )2, (8) t,T t,T t,T 2 t,T t,T t,T where G(cid:48) ≡ EQ [g(cid:48)(r )] and G(cid:48)(cid:48) ≡ EQ [g(cid:48)(cid:48)(r )]. From (8) it can be seen that Y is t,T t t,T t,T t t,T t,T predictable, as there are no Brownian increments on the right-hand side, and the delta-hedged g-swap is therefore a perfect hedge for g. With the continuously rebalanced g-swap being a perfect hedge for g, it is reasonable to regard the expected profit under the P measure from a g-swap as the risk premium associated with g. In practice it is only possible to rebalance discretely, and the discretely rebalanced swap only approximates a perfect hedge. In our empirical work we use the average profit from a g-swap that is rebalanced daily as an estimate of the risk premium associated with g. 2.1 A Variance Swap To create a variance swap, consider the g-function gV(r) = −2r. The fixed leg of the gV-swap is, from the Bakshi and Madan (2000) formula (cid:40) (cid:41) (cid:20) F (cid:21) 2 (cid:90) Ft,T P (K) (cid:90) ∞ C (K) vL ≡ GV = −2EQ ln T,T = t,T dK + t,T dK , (9) t,T t,T t F B K2 K2 t,T t,T 0 Ft,T where P (K) and C (K) are prices of European put and call options at time t on the spot t,T t,T underlying with strike K and maturity T. GV is increasing in the price of options of all strikes. It can readily be shown that in a Black-Scholes world with constant volatility σ, the 2The portfolio adjustments take place at discrete times, not necessarily equidistant, between time t and (cid:80) T. To avoid excessive subscripting we write to denote the sum taken over all adjustment times. 7 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 34,
    "chunk_index": 11,
    "word_count": 447,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "be shown that in a Black-Scholes world with constant volatility σ, the 2The portfolio adjustments take place at discrete times, not necessarily equidistant, between time t and (cid:80) T. To avoid excessive subscripting we write to denote the sum taken over all adjustment times. 7 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 34,
    "chunk_index": 12,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "fixed leg GV = σ2(T − t). So vL is the implied Black-Scholes variance at time t of a Log t,T t,T Contract that matures at time T and pays ln(F ). It is the same as the model-free implied T,T variance (MFIV) from Britten-Jones and Neuberger (2002) and corresponds to the square of the popular VIX implied variance contract scaled with time. It is therefore reasonable to follow established usage and regard gV as a measure of variance. Proposition 1 shows that the continuously rebalanced delta-hedged gV-swap is a perfect hedge for variance (at least in a diffusion world). From (8) the floating leg of the variance swap can be seen to be dYV = (df )2. (10) t,T t,T This is identical to the definition of quadratic variation used in Andersen et al. (2003). Where the gV swap differs slightly from the literature is in the discretely rebalanced case (or when there are jumps), where (7) shows that (cid:0) (cid:1) δYV = 2 eδft,T −1−δf . (11) t,T t,T Andersen et al. (2003) however measure the realized volatility in discrete time as δf2 , and t,T it is this definition that is used in practice to compute the floating leg of a variance swap. The formulation in (11) has previously been proposed by Bondarenko (2010). The difference between the two floating legs is locally cubic in the log return, which is why it vanishes in the diffusion world. The gV-swap where the fixed leg is vL and the floating leg is given by (11) can be replicated perfectly at zero cost for any data-generating process. This is not true for the standard variance swap. 2.2 A Skew Swap Now consider gS(r) = 6r(1+er). We show in Proposition 2 below that in this case the gS-swap captures skewness. To see this note first that (cid:20) (cid:18) (cid:19) (cid:21) F F s ≡ GS = EQ 6 1+ T,T ln T,T . (12) t,T t,T t F F t,T t,T Using the Bakshi and Madan (2000) formula again, the fixed leg can be replicated from puts and calls 8 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 34,
    "chunk_index": 13,
    "word_count": 354,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "that (cid:20) (cid:18) (cid:19) (cid:21) F F s ≡ GS = EQ 6 1+ T,T ln T,T . (12) t,T t,T t F F t,T t,T Using the Bakshi and Madan (2000) formula again, the fixed leg can be replicated from puts and calls 8 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 34,
    "chunk_index": 14,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "(cid:40) (cid:41) 6 (cid:90) ∞ K −F (cid:90) Ft,T F −K t,T t,T s = C (K)dK − P (K)dK . (13) t,T B K2F t,T K2F t,T t,T Ft,T t,T 0 t,T The fixed leg s is the value of a position that is long OTM calls and short OTM puts. In a Black-Scholes world, its value is zero. The level of s therefore depends on the skew of implied volatility, and the gS-swap in this case can be regarded as a hedge for skewness. From (12), s can be written as the difference between the implied Black-Scholes variances of two contracts: the Log Contract from Section 2.1, and the Entropy Contract that has payoff F ln(F ). T,T T,T s = 3(vE −vL ), where t,T t,T t,T (cid:20) (cid:21) (14) F F vE ≡ 2EQ T,T ln T,T . t,T t F F t,T t,T In a diffusion world, the floating leg of the skew swap is given by (8), and equals dYS = 3dvE df . (15) t,T t,T t,T With discrete rebalancing or with jumps, the floating leg is given by (7) as (cid:104) (cid:105) δYS = EQ gS(r +δf )−gS(r )−(eδft,T −1)GS(cid:48) t,T t+δt t+δt,T t,T t+δt,T t,T = 3δvE (eδft,T −1)+h(δf ), where (16) t,T t,T h(x) = 6(2−2ex +x+xex) = x3 +O(x4). As we show below, s locally approximates the third moment of returns. To make it closer to the conventional coefficient of skewness we scale the gS-swap entered into at time t by dividing both the fixed and the floating legs by (cid:0) vL (cid:1)3/2 which gives a fixed leg of t,T vE −vL t,T t,T skew ≡ 3 (17) t,T (vL )3/2 t,T We summarize the properties of the skew swap in the following Proposition 2. The scaled difference skew between the entropy implied variance and the t,T log implied variance has the following properties: 1. if implied volatility across strikes is symmetric about the forward price, skew = 0; t,T 2. holding vL constant, skew is increasing in the implied volatility of high strike (strike t,T t,T 9 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 34,
    "chunk_index": 15,
    "word_count": 354,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "variance and the t,T log implied variance has the following properties: 1. if implied volatility across strikes is symmetric about the forward price, skew = 0; t,T 2. holding vL constant, skew is increasing in the implied volatility of high strike (strike t,T t,T 9 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 34,
    "chunk_index": 16,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "above the forward price) options and decreasing in the implied volatility of low strike options; 3. to first order, skew is equal to the skew of the distribution of log returns on the asset t,T (under the pricing measure); 4. with continuous trading in a diffusion world (cid:20)(cid:90) (cid:21) s = EQ 3dvE df , (18) t,T t s,T s,T s∈[t,T] and measures the covariation between index returns and changes in index variance (the leverage effect). Proof. In Appendix B.2. The skew swap, in a diffusion world, hedges changes in the implied skew perfectly. In our empirical work we use the average profit from a daily rebalanced scaled skew swap, expressed as a percentage of the initial implied skew, as an estimate of the skew risk premium. 2.3 Alternative Formulations We now explain why we have chosen our measures of variance and skew over perhaps more obvious ones, and why we use raw rather than central moments. The natural choice for g-functions for second and third moments might appear to be g(r) = r2 and g(r) = r3, respectively. As we will show, while it is indeed possible to design feasiblevarianceandskewswapsusingthesefunctions, themathematicsaremorecomplicated, and the corresponding definitions of implied variance and implied skew lack some of the appealing properties of our preferred definitions. In our empirical work we show that changing the definitions would have no significant impact on the measurement of variance and skew risk premia. The fixed leg of a variance swap under this alternative formulation (a quadratic swap) is (cid:34) (cid:35) (cid:18) F (cid:19)2 vQ ≡ EQ ln T,T t,T t F t,T (19) (cid:90) Ft,T (cid:32) 1+ln Ft,T (cid:33) (cid:90) ∞ (cid:32) 1−ln K (cid:33) = 2 K P (K)dK +2 Ft,T C (K)dK. B K2 t,T B K2 t,T 0 t,T Ft,T t,T 10 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 34,
    "chunk_index": 17,
    "word_count": 303,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "(cid:18) F (cid:19)2 vQ ≡ EQ ln T,T t,T t F t,T (19) (cid:90) Ft,T (cid:32) 1+ln Ft,T (cid:33) (cid:90) ∞ (cid:32) 1−ln K (cid:33) = 2 K P (K)dK +2 Ft,T C (K)dK. B K2 t,T B K2 t,T 0 t,T Ft,T t,T 10 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 34,
    "chunk_index": 18,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "Similarly, the fixed leg of a cubic swap is given by (cid:34) (cid:35) (cid:18) F (cid:19)3 sC ≡ EQ ln T,T t,T t F t,T (cid:16) (cid:17) (cid:16) (cid:17) (20) = 3 (cid:90) ∞ ln F K t,T 2−ln F K t,T C (K)dK −3 (cid:90) Ft,T ln F K t,T 2+ln F K t,T P (K)dK. B K2 t,T B K2 t,T Ft,T t,T 0 t,T The expression for vQ is not only more complex than its counterpart equation (9), but t,T also vQ is actually declining in C(K) for very high strikes. Similarly, in a cubic swap the replicating portfolio for the fixed leg is generally short OTM puts and long OTM calls, like the skew swap, but is actually short OTM calls for very high strikes. In the diffusion case the floating legs are given by dYQ = −dvL df + (cid:0) 1+vL /2 (cid:1) (df )2, and (21) t,T t,T t,T t,T t,T 3 (cid:16) (cid:17) dYC = 3dvQ df − vQ +vL (df )2. (22) t,T t,T t,T 2 t,T t,T t,T These expressions are much more complicated than their counterparts, equations (10) and (15). As we demonstrate below, the payoffs to the quadratic swap and to the variance swap are highly correlated, and similarly for the cubic and skew swaps. But in view of the substantially greater simplicity of the variance and skew swaps we prefer them to their quadratic and cubic counterparts. The other aspect of our definitions that is worthy of comment is that we do not demean or center our statistics. The reason is that central moments cannot be perfectly hedged. Proposition 1 does not help us since it only applies to expectations of functions of the return on the asset; central moments cannot be expressed in this way. The implied central moment can of course be computed readily. The problem is with the realized leg. It is not possible to design a trading strategy whose payoff is (r −EP[r ])n unless EP[r ] is known and this t,T t t,T t t,T is generally not the case. 3 Data and Methodology For the empirical analysis of the skew risk premium, we use European options written on the S&P 500 spot index traded on the CBOE. The options mature every month. The data 11 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 34,
    "chunk_index": 19,
    "word_count": 388,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "t t,T t t,T is generally not the case. 3 Data and Methodology For the empirical analysis of the skew risk premium, we use European options written on the S&P 500 spot index traded on the CBOE. The options mature every month. The data 11 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 34,
    "chunk_index": 20,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "are from OptionMetrics, and cover the period January 1996 to January 2012. The data set includes closing bid and ask quotes for each option contract along with the corresponding strike prices, Black-Scholes implied volatilities, the zero-yield curve, and closing spot prices of the underlying. From the data we filter out all entries with non-standard settlements. Suppose that at time t call and put options that mature at the end of month T are traded at N +1 different strike prices K which are ordered from K to K . Given the set of option i 0 N prices C (K ) and P (K ) for different strike prices taken as the average of the bid and ask t,T i t,T i quotes we compute the implied variances of the log and entropy contracts, vL and vE , and t,T t,T the implied third moment s in the following way. Define the function t,T (cid:40) Ki+1−Ki−1, for 0 ≤ i ≤ N (with K ≡ 2K −K , K ≡ 2K −K ) ∆I(K ) ≡ 2 −1 0 1 N+1 N N−1 i 0, otherwise. Then according to formulae (9) and (14) we compute3 (cid:88) P (K ) (cid:88) C (K ) vL = 2 t,T i ∆I(K )+2 t,T i ∆I(K ) (23) t,T B K2 i B K2 i Ki≤Ft,T t,T i Ki>Ft,T t,T i (cid:88) P (K ) (cid:88) C (K ) vE = 2 t,T i ∆I(K )+2 t,T i ∆I(K ). (24) t,T B K F i B K F i t,T i t,T t,T i t,T Ki≤Ft,T Ki>Ft,T The implied third moment is s = 3(vE −vL ) and the implied skew skew is computed t,T t,T t,T t,T using (17). We compute the fixed legs of the quadratic and cubic swaps in a similar fashion. The floating legs for the variance and skew swaps (realized second and third moments) assume daily rebalancing4 and are computed using (11) and (16) T (cid:88) rv = [2(eri,i+1 −1−r )] (25) t,T i,i+1 i=t T (cid:88)(cid:2) (cid:3) rs = δvE (eri,i+1 −1)+6(2−2eri,i+1 +r +r eri,i+1) . (26) t,T i,T i,i+1 i,i+1 i=t We define the realized skew as rskew ≡ rs / (cid:0) vL (cid:1)3/2 . (27) t,T t,T t,T 3The way we compute implied variances is standard (e.g., see Bollerslev et al. (2009). Some papers however extrapolate volatilities outside the minimum and maximum strike prices (e.g. Carr and Wu (2009)). We perform extrapolation-interpolation procedure for robusness check and present the results in Appendix C. 4We consider strategies with less frequent adjustments to decrease transaction costs in Appendix C. 12 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 34,
    "chunk_index": 21,
    "word_count": 439,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "papers however extrapolate volatilities outside the minimum and maximum strike prices (e.g. Carr and Wu (2009)). We perform extrapolation-interpolation procedure for robusness check and present the results in Appendix C. 4We consider strategies with less frequent adjustments to decrease transaction costs in Appendix C. 12 Electronic copy available at: https://ssrn.com/abstract=1571700 Figure 1: Excess returns from trading skew and variance swaps The figure shows the time series of the realized excess returns on monthly skew and variance swaps, xs and t xv . The data ranges from January 1996 to January 2012. t 1000 % xs xv 800 % 600 % 400 % 200 % 0 % -200 % 1996 1998 2000 2002 2004 2006 2008 2010 2012 Finally, we define the excess return (profit per $1 investment in the fixed leg) as xs ≡ rskew /skew −1 (28) t,T t t xv ≡ rv /vL −1. (29) t,T t,T t,T Our empirical analysis concentrates on trading strategies that run for a month, from the first trading day after one option expires to the next month’s expiration date. To simplify notation we use a single subscript t to relate to the trading month. So skew is the implied t skew at the beginning of month t and rskew is the realized skew over month t. t 3.1 Descriptive Statistics Figure 1 plots the time series for variance and skew swap excess returns. We can see that there is substantial common variation between the two. Panel A of Table 1 contains summary statistics of implied variance, realized variance, implied and realized skew coefficients of the S&P 500 index options and variance and skew premia. The average realized variance is 13 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 34,
    "chunk_index": 22,
    "word_count": 283,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "see that there is substantial common variation between the two. Panel A of Table 1 contains summary statistics of implied variance, realized variance, implied and realized skew coefficients of the S&P 500 index options and variance and skew premia. The average realized variance is 13 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 34,
    "chunk_index": 23,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "Table 1: Descriptive statistics This table presents descriptive statistics for the variables used in the analysis. vL denotes monthly implied variance of the Log contract on the S&P 500 index options, rv is realized variance and xv denotes the excess returnfromthevarianceswapdefinedasxv ≡(rv /vL−1),skewistheimpliedskewdefinedasthefixedlegof t t t theskewcontractscaledby(vL)3/2,rskew istherealizedskewdefinedasthefloatinglegoftheskewcontracts scaledby(vL)3/2 andxsistheexcessreturnfromtheskewswapdefinedasxs ≡(rskew /skew −1). InPanel t t t A, columns under Mean, Std. Dev., Min, Median and Max report the sample average, standard deviation, minimum value, median and maximum value, respectively. Panel B presents the correlations among the variables. Bold values are significant at the 1% level. The data are for non-overlapping monthly periods from January 1996 to January 2012. Panel A: Descriptive Statistics Variable Mean Std. Dev Q1 Median Q3 vL×100 0.475 0.508 0.223 0.358 0.523 rv×100 0.382 0.612 0.113 0.219 0.415 xv -22.25% 66.06% -56.29% -36.83% -18.53% skew -1.808 0.722 -2.225 -1.748 -1.243 rskew -1.001 2.241 -0.853 -0.532 -0.323 xs -42.09% 117.55% -83.30% -68.20% -44.79% Panel B: Correlations rv xv skew rskew xs vL 0.731 0.037 0.283 0.025 0.039 rv 1.000 0.574 0.235 -0.345 0.497 xv 1.000 0.048 -0.843 0.897 skew 1.000 0.128 0.054 rskew 1.000 -0.922 substantially lower than the implied variance. Also, average realized skew is substantially smaller (in absolute terms) than average implied skew, pointing to the existence of a skew risk premium. Implied skew is negative throughout the sample period and realized skew is on average negative. So the writer of a skew swap who receives fixed and pays floating generally receives and pays negative amounts, and on average loses money. Almost half (42.09%) of the implied skew in index option prices can be explained by the risk premium, with the other half reflecting the negative correlation between returns and volatility. The variance risk premium is smaller, accounting for less than a quarter (22.25%) of the implied variance. The sample averages of the excess return of skew and variance swap strategies (estimates of skew and variance risk premia) are negative. The negative variance risk premium is consistent with the literature (see, for example, Bakshi and Kapadia 2003, Carr and Wu 2009, Egloff et al. 2010). Writing variance swaps, receiving fixed and paying floating, is on average profitable. The negative return on skew swaps is consistent with Bakshi et al. (2003), who show theoretically that, within a power- 14 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 34,
    "chunk_index": 24,
    "word_count": 388,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "Bakshi and Kapadia 2003, Carr and Wu 2009, Egloff et al. 2010). Writing variance swaps, receiving fixed and paying floating, is on average profitable. The negative return on skew swaps is consistent with Bakshi et al. (2003), who show theoretically that, within a power- 14 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 34,
    "chunk_index": 25,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "Table 2: Correlations: variance and skew swaps vs. quadratic and cubic swaps This table presents correlations between the implied moments and premia computed using different method- ologies. Panel A contains correlations between the following variables: vL and vE (monthly implied variances of the Log and Entropy contracts, respectively), skew (the implied skew defined as the fixed leg of the skew swap scaled by (vL)3/2), vQ (fixed leg of the quadratic swap), sC (fixed leg of the cubic swap), vcent and skewcent (implied second and third central moments defined as in Bakshi et al. (2003)). Panel B presents pairwise correlations between excess returns from variance and skew swaps and excess returns from quadratic and cubic swaps defined as in equation (5) of Bakshi et al. (2003) respectively. Bold values are statistically significant at the 1% level. The data are for non-overlapping monthly periods from January 1996 to January 2012. Panel A: Correlations of Implied Moments vE vQ vcent skew skewC skewcent vL 0.999 0.999 0.999 0.283 0.240 0.272 vE 1.000 0.998 0.998 0.299 0.255 0.287 vQ 1.000 0.999 0.264 0.221 0.253 vcent 1.000 0.265 0.222 0.254 skew 1.000 0.984 0.985 skewcent 1.000 0.999 Panel B: Correlations of Risk Premia xv xvQ xs xsC xv 1.000 0.999 0.897 0.874 xvQ 1.000 0.909 0.808 xs 1.000 0.991 utility economy where returns are leptokurtic, the implied skew is greater in magnitude than the physical skew. Panel B of Table 1 reports pair-wise correlations between variables. Implied variance is negativelycorrelatedwithskew,sowhenimpliedvariancegoesup,theabsolutesizeoftheskew also increases. Realized variance is positively correlated with implied variance, as is realized skew with implied skew. Realized variance and realized skew are negatively correlated with each other. Variance and skew swaps excess returns are highly positively correlated. In the rest of the paper, we report excess returns computed from variance and skew swaps. Table 2 shows that the use of alternative measures of variance and skew based on quadratic and skew swaps, described in Section 2, would make little practical difference. Panel A records that the different measures of implied variance have pairwise correlations in excess of 0.998, while the correlations for implied skew are in excess of 0.98. Panel B shows similar correlations between the corresponding excess returns estimates. 15 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 34,
    "chunk_index": 26,
    "word_count": 372,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "would make little practical difference. Panel A records that the different measures of implied variance have pairwise correlations in excess of 0.998, while the correlations for implied skew are in excess of 0.98. Panel B shows similar correlations between the corresponding excess returns estimates. 15 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 34,
    "chunk_index": 27,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "4 Empirical Results We use the technology developed in this paper to deepen our understanding of the relation between implied and realized skew in the equity index market. In the absence of risk premia, one would expect variations in implied skew to predict variations in realized skew, and we examine whether this is the case. We go on to see whether the excess returns on skew swaps can be explained by a simple one-factor model. Bakshi et al. (2003) have shown theoretically that the size of the skew risk premium should also depend on the higher moments of the conditional distribution of log returns, and in particular on the excess kurtosis. So we use predictive models of the skew risk premium using proxies for the moments as well as for macro-economic factors. Given the high correlation we have observed between skew and variance swap excess re- turns, we analyze variance swap returns in parallel with the skew swap returns, and test whether they are driven by the same combination of priced risk factors. 4.1 Predictive Power of Implied Skew Implied skew, with a mean of -1.81 and a standard deviation of 0.72, varies significantly over time. We run a standard expectations hypothesis regression to test whether the variations in implied skew reflect changes in the expected realized skew, rskew = α +α skew +u . (30) t 0 1 t t To provide a comparison, we also estimate the corresponding variance regression rv = α +α vL +u . (31) t 0 1 t t These are predictive regressions; the implied quantities are known at the beginning of month t, while the realized quantities are only known at the end of the month. Table 3 shows that implied skew does forecast realized skew and implied variance does forecast realized variance. The slopes are both highly significant, and the two intercepts are insignificantly different from zero. Given the existence of statistically significant skew and variance risk premia, it is not surprising that we strongly reject the expectations hypothesis that α = 0 and α = 1 for 0 1 both regressions. We also reject the simple hypothesis that α = 1 in both regressions, 1 suggesting that there is a significant variation in the risk premia. 16 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 34,
    "chunk_index": 28,
    "word_count": 381,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "we strongly reject the expectations hypothesis that α = 0 and α = 1 for 0 1 both regressions. We also reject the simple hypothesis that α = 1 in both regressions, 1 suggesting that there is a significant variation in the risk premia. 16 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 34,
    "chunk_index": 29,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "Table 3: Realized skew vs. implied skew Thistablepresentstheestimationresultsofregressionsrskew =α +α skew +u ,andrv =α +α vL+w t 0 1 t t t 0 1 t t based on one month S&P 500 index options. Standard t-statistics are given in parentheses. “F (α =0,α = 0 1 1)” column provides values of the F-statistic and the corresponding p-values for a Wald test with H : α =0 0 0 and α =1. The “F (α =1)” column provides values of the F-statistic and the corresponding p-values for a 1 1 Wald test with H : α =1. Standard errors use the Newey and West (1987) correction. The sample period 0 1 is from January 1996 to January 2012. Const skew vL R¯2 F(α0=0,α1=1) F(α1=1) -0.282 0.398 rskew 1.11% 12.07 (0.000) 6.46 (0.012) (-0.75) (2.59) -0.001 0.880 rv 53.28% 5.27 (0.006) 3.99 (0.047) (-1.52) (10.1) 4.2 The Relation between Skew and Variance Risk To better understand the source of the skew and variance risk premia we next ask whether they can be explained by the Capital Asset Pricing Model. To answer this we estimate xs = α +α xm +u , (32) t 0 1 t t xv = β +β xm +w , (33) t 0 1 t t wherexm denotestheexcessmarketreturnovermontht. Theestimationresultsareprovided t in Table 4. In both models the market beta is negative and highly significant, suggesting that buyers of variance and skew swaps are exposed to the market. However, the intercepts in both equationsremainstatisticallysignificant, andtheydonotdiffergreatlyfromtheunconditional average excess returns from both swap strategies. Our findings, so far as the variance risk premium is concerned, are consistent with Carr and Wu (2009, Table 4). Thus, we conclude that the simple market model cannot fully explain variance and skew risk premia. We now seek to establish whether the skew risk premium reflects an independent risk factor from the variance risk premium, or whether the profitability of buying skew swaps can be explained by exposure to both equity and variance risk. To do this, we regress the skew swap excess returns on the variance swap and market excess returns xs = α +α xv +α xm +u . (34) t 0 1 t 2 t t We also estimate a similar regression for the variance risk premium to verify if it can be 17 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 34,
    "chunk_index": 30,
    "word_count": 386,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "excess returns on the variance swap and market excess returns xs = α +α xv +α xm +u . (34) t 0 1 t 2 t t We also estimate a similar regression for the variance risk premium to verify if it can be 17 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 34,
    "chunk_index": 31,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "Table 4: Skew and variance excess returns vs. the market return This table presents OLS estimation results of the skew and variance risk premia regressions: xs = α + t 0 α xm +u and xv = β +β xm +w . Variables xs and xv denote excess returns from skew and variance 1 t t t 0 1 t t swaps, xm denotes the market excess return. Newey and West (1987) t-statistics are given in parentheses. The data are monthly, from January 1996 to January 2012. Const xm R¯2 -0.193 -8.531 xv 34.68% (-4.66) (-4.69) -0.382 -11.217 xs 18.69% (-4.46) (-3.43) explained by the skew risk premium5 xv = β +β xs +β xm +w . (35) t 0 1 t 2 t t The high correlation between skew and variance swap returns makes it hard to find ev- idence of separate risk premia through contemporaneous regressions. To improve efficiency we estimate the two equations as a system using the Seemingly Unrelated Regression (SUR) approach.6 The estimation results are in Panel A of Table 5. They highlight the close rela- tionship between variance and skew swaps. Table 1 shows that the buyer of a skew swap on average earns a risk premium equal to 42.09% of the implied skew. But in doing so, the buyer takes on significant variance risk. Once that is hedged by buying variance swaps, and market risk is also hedged, most of the premium is lost, and the buyer of the skew swap earns a return of 0.216% that is both economically small and statistically insignificant. Similarly the writer of a variance swap is exposed to skew risk (the connection of the variance risk premium and the well-known leverage effect, has been highlighted in the literature (Carr and Wu 2009, Bollerslev et al. 2009, Driessen and Maenhout 2007, Jones 2003)), and once that is hedged away the profit from writing variance swaps also vanishes. The other striking feature about Table 5 is the very high R2 for all the regressions. Around 80% (84%) of the risk of a skew (variance) swap can be hedged using variance (skew) swaps, and index forwards. We do not observe the expected profit (risk premia) from the skew and variance swaps but only the actual realization. This creates an errors-in-variables problem. Moreover, the 5Chabi-Yo (2009) finds that Fama-French factors also explain variation in index options returns. We have estimated the above specification but including Fama-French and momentum factors and the results remain unchanged. We report them in Appendix C. 6The results of OLS estimations of each equation separately are qualitatively similar. 18 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 34,
    "chunk_index": 32,
    "word_count": 437,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "Fama-French factors also explain variation in index options returns. We have estimated the above specification but including Fama-French and momentum factors and the results remain unchanged. We report them in Appendix C. 6The results of OLS estimations of each equation separately are qualitatively similar. 18 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 34,
    "chunk_index": 33,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "Table 5: Skew vs. variance risk premia This table presents results for the skew and variance risk premia regressions: xs =α +α xv +α xm +u t 0 1 t 2 t t andxv =β +β xs +β xm +w . Variablesxsandxv denoteexcessreturnsfromskewandvarianceswaps, t 0 1 t 2 t t xm denotes the market excess return. Panel A presents Seemingly Unrelated Regression estimation results. Panel B shows results using three-stage least squares, where we use the following predetermined instrumental variables: ted , the TED spread defined as the difference between 3 month LIBOR and the 3 month U.S. t T-bill rate at the beginning of month t; ks , the implied normalized excess kurtosis as defined in equation t (36); and s , the implied third moment. Newey and West (1987) t-statistics are given in parentheses. The t data are monthly, from January 1996 to January 2012. Panel A: Seemingly Unrelated Regressions Dep.Var. Const xv xs xm R¯2 xv -0.002 (-0.11) 0.500 (38.4) -2.927 (-6.88) 84.41% xs -0.002 (-0.06) 1.969 (38.4) 5.584 (6.16) 80.59% Panel B: Three-Stage LS Regressions First Stage Regressions Const ks ted s ×100 R¯2 F t t t xv -0.366 (-2.47) 0.144 (0.70) 0.500 (1.99) 1.197 (1.70) 12.62% 10.10 xs -0.474 (-1.89) 0.712 (1.80) 0.770 (2.13) 1.659 (1.58) 10.71% 8.56 Third Stage Regressions Const xv xs xm R¯2 xv 0.003 (0.17) 0.514 (25.0) -2.768 (-5.84) 83.94% xs -0.007 (-0.16) 1.946 (25.1) 5.386 (5.16) 80.80% estimators based on the SUR approach might suffer from simultaneity bias. To deal with this, we use instrumental variables and estimate the system of equations by three-stage least squares. As candidates for instrumental variables we use predetermined variables which are theo- retically motivated and can predict excess returns of the two swap strategies. Bakshi et al. (2003) and Bakshi and Madan (2006) show that skew and variance risk premia can be ex- plained by higher moments of the distribution of log returns. So we include as candidates implied variance, implied skew and implied kurtosis, realized variance and skew, and variance of variance (defined as monthly variance of daily levels of VIX index). Theorem 2 of Bakshi et al. (2003) has an explicit expression for the skew risk premium in terms of the kurtosis of returns, so we include as a candidate instrumental variable (cid:112) (kurtcent −3) vcent ks = t t , (36) t skewcent t 19 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 34,
    "chunk_index": 34,
    "word_count": 400,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "Theorem 2 of Bakshi et al. (2003) has an explicit expression for the skew risk premium in terms of the kurtosis of returns, so we include as a candidate instrumental variable (cid:112) (kurtcent −3) vcent ks = t t , (36) t skewcent t 19 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 34,
    "chunk_index": 35,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "where kurtcent is the implied excess kurtosis defined in Equation (6) of Bakshi et al. (2003). t We use implied moments rather than physical moments, because the conditional physical moments are not directly observable, and we divide by skew since the dependent variable is the swap return rather than the difference between implied and realized skew. Other candidates we consider as instrumental variables include lagged macroeconomic variables (the levels and changes in price-earnings, price-dividend and consumption-wealth ratios, TED, term and default spreads, and the excess market return), and market variables (put-call trading volume ratio, and option open interest). There are only three variables which have power to predict excess returns (are significant at the 10% level in the first stage regressions): ted , the spread between 3 month LIBOR and t the 3 month U.S. T-bill rate at the beginning of month t; ks , defined in equation (36); and t s , the beginning of the month implied third moment. We drop the other variables to avoid t multicollinearity issues and the loss of efficiency of our estimators. Estimation results are given in Panel B of Table 5. In the first stage, we regress the risk premia on the chosen instruments. The F-statistics from the first-stage regressions are signifi- cant at the 1% level, firmly rejecting the hypothesis that our chosen instrumental variables are weak. The third-stage estimation results are qualitatively the same as in the SUR estimation confirming our earlier conclusions. In Appendix C we demonstrate that the empirical results are robust to the choice of time period, the method of computing the implied moments, the omission of illiquid options and the presence of transaction costs. 4.3 Common Time Variation in Two Premia Series Intheprevioussectionwehaveshownthatunconditionallyonecannotmakesignificantprofits by buying a skew swap and simultaneously hedging against variance and market risk. We can go further and test whether the same result holds conditionally. Given that there is significant time variation in premia, we can ask whether the time variation is the same for the two types of risk. Following Cochrane and Piazzesi (2005) we test the specification (cid:0) (cid:1) xs = λ γ +γ z1 +...+γ zn +u , (37) t 0 0 1 t−1 n t−1 t (cid:0) (cid:1) xv = λ γ +γ z1 +...+γ zn +w , (38) t 1 0 1 t−1 n t−1 t for predetermined predictors zi, i = 1,...,n. Here, we use the same predictive variables as in t 20 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 34,
    "chunk_index": 36,
    "word_count": 411,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "0 1 t−1 n t−1 t (cid:0) (cid:1) xv = λ γ +γ z1 +...+γ zn +w , (38) t 1 0 1 t−1 n t−1 t for predetermined predictors zi, i = 1,...,n. Here, we use the same predictive variables as in t 20 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 34,
    "chunk_index": 37,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "Table 6: Skew and Variance Risk Premia This table presents the estimation results of the following two predictive regressions (columns xs-unrestr and xv-unrestr) xs =α +α ks +α s +α ted +u , t 0 1 t 2 t 3 t t xv =β +β ks +β s +β ted +w . t 0 1 t 2 t 3 t t xsandxv denoteexcessreturnsfromskewandvarianceswapstrategies,ksisthevariabledefinedinequation (36), s denotes the implied third moment and ted is the TED spread (the difference between 3 month LIBOR and the 3 month U.S. T-bill rate) at the beginning of month t. Columns xs-restr and xv-restr present the corresponding coefficients from the following system of restricted regressions xs =λ (γ +γ ks +γ s +γ ted )+u , t 0 0 1 t 2 t 3 t t xv =λ (γ +γ ks +γ s +γ ted )+w , t 1 0 1 t 2 t 3 t t where the coefficients γ , ..., γ are estimated from the model (xs +xv )/2=γ +γ ks +γ s +γ ted +ε . 0 3 t t 0 1 t 2 t 3 t t t-statcolumn presentsthe values oft-statistics for testingthe individual coefficientsinthe unrestrictedmodel beingequaltothevalueofthecorrespondingcoefficientsintherestrictedmodel. F-statrawreportsthevalues of the Wald test statistics that the above restrictions are not binding. xs-unrestr xs-restr t-stat xv-unrestr xv-restr t-stat Const -0.474 (-1.89) -0.544 0.28 -0.366 (-2.47) -0.296 -0.47 ks 0.712 (1.79) 0.534 0.45 0.144 (0.69) 0.321 -0.86 t s ×100 1.659 (1.59) 1.783 -0.12 1.197 (1.70) 1.073 0.17 t ted 0.770 (2.14) 0.793 -0.06 0.500 (1.99) 0.477 0.18 t R2 12.13% 12.07% 14.01% 13.83% F-stat 0.03 0.10 Table5. AsnotedbyCochraneandPiazzesi(2005),thecoefficientsλ andγ arenotseparately i i identified by (37) and (38), and we impose the additional constraint that (λ +λ )/2 = 1. 0 1 We estimate the model in two steps. First, we estimate the γ’s by running a regression of the average of the two risk premia on all the z’s, (xs +xv )/2 = γ +γ z1 +...+γ zn +ε . (39) t t 0 1 t−1 n t−1 t Then we estimate the λ’s by running the two regressions xs = λ z +u (40) t 0 t−1 t xv = λ z +w , (41) t 1 t−1 t where z = γˆ +γˆ z1 +...+γˆ zn. The single-factor model is a restricted model and we can t 0 1 t n t test for these restrictions using a Wald test. ConsistentwiththeresultsinTable3, Table6confirmsthatthereissignificantpredictabil- ity in both risk premia. Both risk premia decline in absolute value after the stock market 21 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 34,
    "chunk_index": 38,
    "word_count": 424,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "+...+γˆ zn. The single-factor model is a restricted model and we can t 0 1 t n t test for these restrictions using a Wald test. ConsistentwiththeresultsinTable3, Table6confirmsthatthereissignificantpredictabil- ity in both risk premia. Both risk premia decline in absolute value after the stock market 21 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 34,
    "chunk_index": 39,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "Table 7: Correlations: dynamic vs. static strategies This table presents pair-wise correlations among excess returns from dynamically hedged variance (xv) and skew swaps (xs) and excess returns from delta-hedged buy-an-hold variance (xvstat) and skew (xsstat) swaps. Bold values are statistically significant at the 1% level. The data are for non-overlapping monthly periods from January 1996 to January 2012. xv xvstat xs xsstat xv 1.000 0.643 0.897 0.003 xvstat 1.000 0.487 0.311 xs 1.000 0.032 declines, when the implied distribution is less negatively skewed, and when the TED spread is high. The Wald test results show that one cannot reject the null that both risk premia are driven by a single factor. Moreover, none of the individual coefficients in the unrestricted model is statistically different from its counterpart in the restricted model. So, both the con- ditional and unconditional evidence is consistent with the hypothesis that skew and variance risk premia are driven by a common factor. 4.4 Static Strategies We have argued for the importance of rebalancing to ensure that the risk characteristics of the strategy remain constant over time. In this section we compare the performance of the daily rebalanced skew swap with its static counterpart. At the beginning of the month, the writer of the skew swap buys OTM calls and writes OTM puts, and goes short forward contracts so as to have a delta-neutral position. The position is a pure bet on the slope of the implied volatility surface. Suppose now that the index rises substantially. With no rebalancing, the OTM puts would become deep out-of-the-money, and the portfolio would be dominated by the long call position, so the position would be long volatility. The delta would also become positive. To maintain a pure exposure to skew, the swap writer sells options at all strikes and also sells forward contracts. Under the static strategy the portfolio is not rebalanced, and the skew swap picks up exposure to implied volatility (positive or negative exposure depending on whether the index is above or below its initial level) and also exposure to the underlying (with the exposure always being positive and increasing as the price moves further away from its initial level). Similarly, the static variance swap picks up delta exposure, with the direction of the exposure depending on whether the price is above or below the initial level. So both swaps pick up risks 22 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 34,
    "chunk_index": 40,
    "word_count": 401,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "increasing as the price moves further away from its initial level). Similarly, the static variance swap picks up delta exposure, with the direction of the exposure depending on whether the price is above or below the initial level. So both swaps pick up risks 22 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 34,
    "chunk_index": 41,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "Table 8: Skew vs. variance risk premia: static strategies This table presents estimation results of the following skew and variance risk premia regressions: xsstat = t α +α xvstat+α xm +u andxvstat =β +β xsstat+β xm +w . Variablesxsstat andxvstat denoteexcess 0 1 t 2 t t t 0 1 t 2 t t returns from static buy-and-hold skew and variance swap strategies, xm denotes the market excess return. PanelApresentsSeeminglyUnrelatedRegressionestimationresults,PanelBcontainsestimationresultsusing three-stage least squares. For the latter method we use the following predetermined instrumental variables: ted , the TED spread defined as the difference between 3 month LIBOR and the 3 month U.S. T-bill rate at t the beginning of month t; ks , the implied normalized excess kurtosis as defined in equation (36), and s , the t t beginning of the month third moment. T-statistics are given in parentheses. Standard errors use the Newey and West (1987) correction. The data are monthly, from January 1996 to January 2012. Panel A: Seemingly Unrelated Regressions Dep.Var. Const xvstat xsstat xm R¯2 xvstat 0.139 (2.47) 0.746 (17.3) -14.19 (-13.6) 38.86% xsstat -0.331 (-5.65) 1.023 (17.3) 16.59 (13.6) 38.36% Panel B: Three-Stage LS Regressions First Stage Regressions Const ks ted s ×100 R¯2 F t t t xvstat -0.591 (-3.35) 0.105 (0.36) 0.479 (1.65) 1.806 (2.72) 7.29% 5.96 xsstat -0.749 (-3.86) 0.469 (0.96) 0.384 (1.37) 0.874 (0.90) 3.26% 3.12 Third Stage Regressions Const xvstat xsstat xm R¯2 xvstat -0.010 (0.17) 0.560 (13.4) -12.56 (-12.2) 45.84% xsstat 0.017 (0.16) 1.784 (12.6) 22.41 (11.1) -26.76% other than skew and variance, and this masks the strong relationship we have seen between varianceandskewrisk. Thecorrelationbetweenexcessreturnsonthevarianceandskewswaps drops from 0.897 (Table 1) when rebalanced daily to 0.311 (Table 7) when not rebalanced at all.7 Table 8 is similar to Table 5 except that it uses excess returns from static rather than dynamic strategies. It shows that if the excess returns of the skew and variance swaps are regressed on each other and the market, the R2’s drop from over 80% with daily rebalancing to under 40%. More importantly, the intercepts now become both highly significant, and large in absolute terms. The estimated skew risk premium, after hedging variance and market risk, is -33%, while the hedged variance risk premium is +14%. The static results, taken in 7We define the realized leg of the static buy-an-hold variance and skew swaps according to formulae (11) and (16), but using monthly forward return and monthly change in the entropy variance rather than daily rebalancing. 23 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 34,
    "chunk_index": 42,
    "word_count": 417,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "risk premium is +14%. The static results, taken in 7We define the realized leg of the static buy-an-hold variance and skew swaps according to formulae (11) and (16), but using monthly forward return and monthly change in the entropy variance rather than daily rebalancing. 23 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 34,
    "chunk_index": 43,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "isolation, could be interpreted as evidence that the skew and variance risk premia are rewards for taking distinct risks. But the fact that the intercepts from the daily rebalanced strategies are both small and insignificant shows that these intercepts are driven by the random risk exposures generated by not rebalancing rather than by skew and variance. Panel B of Table 8 supports this conclusion. When we use instrumental variables with the same set of instruments as before, the intercepts in both equations become insignificant. This confirms that the significant intercepts in the SUR model were attributable to an errors- in-variables problem. Even though the instrumental variable method deals well with the endogeneity problem, there is a substantial decline in the first-stage F-statistics, showing that the instruments are weaker in predicting static rather than dynamic excess returns, and this leads to higher standard errors. 5 Conclusions We have developed a trading strategy for investigating the skew risk premium in the equity index market. The strategy involves buying low-strike puts and writing high-strike calls, and subsequently trading options and forwards on the underlying. The strategy has a number of advantages over a simple buy-and-hold strategy. It has a risk profile that is stable over time. It has a simple interpretation that is independent of any assumptions about asset price dynamics; it replicates a skew swap which pays the difference between the implied skew in option prices and the realized skew as determined by the covariance between returns and variance shocks. We apply the technology to options on the US S&P 500 index, which exhibit a pronounced and consistent skew. We show that the skew is only partly accounted for by the negative cor- relation between returns and volatility (the leverage effect). We find that there is a substantial skew premium. The finding is robust to the presence of transactions costs. The absolute size of the skew is highly correlated with the level of volatility and the profit from buying skew swaps is highly correlated with the profit from writing variance swaps. When implied variance rises unexpectedly, the writer of the variance swap loses money (on a mark-to-market basis); but the rise in implied variance tends to be associated with an increase in the covariation between variance and returns, thereby causing the buyer of the skew swap to lose money. This suggests that variance swaps and skew swaps create similar kinds of risk exposure. A strategy of buying skew swaps and hedging out variance risk by buying variance swaps generates no significant excess return. 24 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 34,
    "chunk_index": 44,
    "word_count": 427,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "causing the buyer of the skew swap to lose money. This suggests that variance swaps and skew swaps create similar kinds of risk exposure. A strategy of buying skew swaps and hedging out variance risk by buying variance swaps generates no significant excess return. 24 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 34,
    "chunk_index": 45,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "Further evidence for the close connection between variance and skew risk comes in the time series. Both, skew and variance risk premia exhibit time variation. We present evidence that the same combination of priced risk factors drives both risk premia. These results depend heavily on the use of dynamic hedging to maintain a constant risk ex- posure. Staticstrategiestoexploittheskewandvarianceriskpremiaareexposedtostochastic risk exposures that give the spurious appearance that the two premia are rewarding different risks. The problem of identifying priced risk factors when the trading strategy’s loading on the factors is time-varying is not unique to option trading. It has been much discussed in hedge fund performance analysis (Bollen and Whaley (2009)). In option trading however it is somewhat easier to allow for since we can design dynamic strategies to have constant risk exposures. We conclude that there is powerful evidence for the existence both of variance and skew risk premia in the equity index market. The magnitudes are sufficiently large that one would expect them to be reflected in an asset pricing model. They do not appear to be explained by the equity risk premium, but the evidence presented here suggests that a single channel is sufficient to explain both premia. There is no need to provide separate channels for volatility and skew risk premia. References Andersen, T., Bollerslev, T., Diebold, F. and Labys, P.: 2003, Modeling and forecasting realized volatility, Econometrica 71(2), 579–625. Anderson, E. W., Hansen, L. P. and Sargent, T. J.: 2000, Robustness, detection and the price of risk. Working paper, UNC, Standford, and Chicago. Bakshi, G. and Kapadia, N.: 2003, Delta-hedged gains and the negative market volatility premium, Review of Financial Studies 16, 527–566. Bakshi, G., Kapadia, N.andMadan, D.: 2003, Stockreturncharacteristics, skewlaws, andthe differential pricing of individual equity options, Review of Financial Studies 16, 101–143. Bakshi, G. and Madan, D.: 2000, Spanning and derivative-security valuation, Journal of Financial Economics 55, 205–238. Bakshi, G. and Madan, D.: 2006, A theory of volatility spreads, Management Science 52, 1945–1956. 25 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 34,
    "chunk_index": 46,
    "word_count": 335,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "andthe differential pricing of individual equity options, Review of Financial Studies 16, 101–143. Bakshi, G. and Madan, D.: 2000, Spanning and derivative-security valuation, Journal of Financial Economics 55, 205–238. Bakshi, G. and Madan, D.: 2006, A theory of volatility spreads, Management Science 52, 1945–1956. 25 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 34,
    "chunk_index": 47,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "Bakshi, G., Madan, D. and Panayotov, G.: 2010, Returns of claims on the upside and the viability of u-shaped pricing kernels, Journal of Financial Economics 97, 130–154. Bollen, N. P. B. and Whaley, R. E.: 2009, Hedge fund risk dynamics: Implications for perfor- mance appraisal, Journal of Finance 64, 985–1035. Bollen,N.andWhaley,R.: 2004,Doesnetbuyingpressureaffecttheshapeofimpliedvolatility functions?, Journal of Finance 59, 711–753. Bollerslev, T., Tauchen, G. and Zhou, H.: 2009, Expected stock returns and variance risk premia, Review of Financial Studies 22, 4463–4492. Bondarenko, O.: 2003, Why are put options so expensive?, Technical report, University of Illinois at Chicago. Bondarenko, O.: 2010, Variance trading and market price of variance risk. Working Paper, University of Illinois. Britten-Jones, M. and Neuberger, A.: 2002, Option prices, implied price processes, and stochastic volatility, Journal of Finance 55, 839–866. Broadie, M., Chernov, M. and Johannes, M.: 2009, Understanding index options returns, Review of Financial Studies 22, 4493–4529. Carr, P., Ellis, K. and Gupta, V.: 1998, Static hedging of exotic options, Journal of Finance 53, 1165–1190. Carr, P. and Madan, D.: 2001, Towards a theory of volatility trading, in E. Jouini, J. Cvitanic and M. Musiela (eds), Option Pricing, Interest Rates and Risk Management, Handbooks in Mathematical Finance, Cambridge University Press, pp. 458–476. Carr, P. and Wu, L.: 2009, Variance risk premiums, Review of Financial Studies 22, 1311– 1341. Chabi-Yo, F.: 2009, Expected returns and volatility of fama-french factors. Working paper, Fisher College of Business. Cochrane, J. and Piazzesi, M.: 2005, Bond risk premia, American Economic Review 94(1), 138–160. Coval, J. and Shumway, T.: 2001, Expected option returns, Journal of Finance 56, 983–1009. 26 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 34,
    "chunk_index": 48,
    "word_count": 269,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "Chabi-Yo, F.: 2009, Expected returns and volatility of fama-french factors. Working paper, Fisher College of Business. Cochrane, J. and Piazzesi, M.: 2005, Bond risk premia, American Economic Review 94(1), 138–160. Coval, J. and Shumway, T.: 2001, Expected option returns, Journal of Finance 56, 983–1009. 26 Electronic copy available at: https://ssrn.com/abstract=1571700 Driessen, J. and Maenhout, P.: 2007, An empirical portfolio perspective on option pricing anomalies, Review of Finance 11, 561–603. Egloff, D., Leippold, M. and Wu, L.: 2010, The term structure of variance swap rates and op- timal variance swap investments, Journal of Financial and Quantitative Analysis 45, 1279– 1310. Ferson, W. E. and Harvey, C. R.: 1999, Conditioning variables and the cross section of stock returns, Journal of Finance 54, 1325–1360. Ferson, W. E., Sarkissian, S. and Simin, T.: 1999, The alpha factor asset pricing model: A parable, Journal of Financial Markets 2, 49–68. Jiang, G. J. and Tian, Y. S.: 2005, The model-free implied volatility and its information content, Review of Financial Studies 18, 1305–1342. Jones, C. S.: 2003, The dynamics of stochastic volatility: evidence from underlying and options markets, Journal of Econometrics 116, 181–224. Neuberger, A.: 2012, Realized skewness, Review of Financial Studies . forthcoming. Newey, W. and West, K.: 1987, A simple positive semi-definite, heteroscedasticity and auto- correlation consistent covariance matrix, Econometrica 55, 703–708. 27 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "Document",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 34,
    "chunk_index": 49,
    "word_count": 223,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "stochastic volatility: evidence from underlying and options markets, Journal of Econometrics 116, 181–224. Neuberger, A.: 2012, Realized skewness, Review of Financial Studies . forthcoming. Newey, W. and West, K.: 1987, A simple positive semi-definite, heteroscedasticity and auto- correlation consistent covariance matrix, Econometrica 55, 703–708. 27 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "APPENDIX",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 34,
    "chunk_index": 50,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "APPENDIX (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "A Implied Central vs. Observed Population Moments The conditional distribution of returns under P is not directly observable. In practice, it is common to make inferences about the P distribution by looking at returns over many periods. The question then arises about the relation between the P moments estimated from a long series of returns, and the average conditional Q moments computed over the same period from option prices. To analyze this, assume a world with no risk premia. In that case EP(cid:2) rn (cid:3) = EP(cid:2)EQ(cid:2) rn (cid:3)(cid:3) , (42) t,T t t,T so that mean option-implied moments converge to the (unconditional) population moment. The conclusion does not apply to central moments, however, since equation (42) does not hold due to the centering conditional P expectation. Indeed it is easy to think of examples where there are no risk premia and population moments differ from average implied moments. Take for instance the discrete-time model 1 √ r = − v + v ε , (43) t,T t t t,T 2 where v is known at time t and ε is standard normal. In the absence of risk premia, the t T implied variance in period [t,T] is v , so the mean implied variance is v¯ (the unconditional t mean variance). The population variance is EP(cid:2) (r −E[r ])2(cid:3) = v¯+var(v )/4. (44) t,T t,T t This example shows that significant differences between average implied central moments and population central moments do not themselves show the presence of risk premia. B Proofs B.1 Trading Strategy with Diffusions Start from (7) 28 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "APPENDIX",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 34,
    "chunk_index": 51,
    "word_count": 267,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "APPENDIX (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "(r −E[r ])2(cid:3) = v¯+var(v )/4. (44) t,T t,T t This example shows that significant differences between average implied central moments and population central moments do not themselves show the presence of risk premia. B Proofs B.1 Trading Strategy with Diffusions Start from (7) 28 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "APPENDIX",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 34,
    "chunk_index": 52,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "APPENDIX (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "δY = EQ (cid:2) g(r +δf )−g(r )− (cid:0) eδft,T −1 (cid:1)EQ [g(cid:48)(r )] (cid:3) . t,T t+δt t+δt,T t,T t+δt,T t t,T Expanding we obtain (cid:20) (cid:21) 1 δY = EQ δf g(cid:48)(r )+ δf2 g(cid:48)(cid:48)(r )+O(δf3 ) t,T t+δt t,T t+δt,T 2 t,T t+δt,T t,T (45) (cid:18) (cid:19) 1 − δf + δf2 +O(δf3 ) EQ [g(cid:48)(r )]. t,T 2 t,T t,T t t,T With δf known at time t+δt, and using the definitions of G(cid:48) and G(cid:48)(cid:48) gives t,T 1 1 δY = δf G(cid:48) + δf2 G(cid:48)(cid:48) −δf G(cid:48) − δf2 G(cid:48) +O(δf3 ) (46) t,T t,T t+δt,T 2 t,T t+δt,T t,T t,T 2 t,T t,T t,T Rearranging we obtain 1 (cid:0) (cid:1) δY = δf δG(cid:48) + δG(cid:48)(cid:48) −G(cid:48) +G(cid:48)(cid:48) δf2 +O(δf3 ). (47) t,T t,T t,T 2 t,T t,T t,T t,T t,T Finally, taking the limit as δt → 0 under the diffusion assumption we obtain 1 (cid:0) (cid:1) dY = df dG(cid:48) + G(cid:48)(cid:48) −G(cid:48) df2 (48) t,T t,T t,T 2 t,T t,T t,T B.2 Proof of Proposition 2 Part 1. Through a change of variables (13) can be written as 6 (cid:18)(cid:90) ∞(cid:18) a−1 (cid:19) (cid:19) s = {C (aF )−aP (F /a)}da . (49) t,T F B a2 t t,T t t,T t,T t,T 1 If there is put-call symmetry8 in the sense of Carr et al. (1998), so that the implied volatility plotted against log strike is symmetrical about the forward price, then the risk reversal term in curly brackets in the second line costs nothing. This means that in the presence of put-call 8Carr et al. (1998) define put-call symmetry to mean that prices of out-of-the-money puts and calls are related C (αF )=αP (F /α), all α>0. t t,T t t,T Put-call symmetry is equivalent to requiring that σI(k), the Black-Scholes implied volatility of a call or put t option with strike k and maturity T at time t, is symmetrical about the forward price σI(αF )=σI(F /α). t t,T t t,T 29 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "APPENDIX",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 34,
    "chunk_index": 53,
    "word_count": 340,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "APPENDIX (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "t,T t t,T Put-call symmetry is equivalent to requiring that σI(k), the Black-Scholes implied volatility of a call or put t option with strike k and maturity T at time t, is symmetrical about the forward price σI(αF )=σI(F /α). t t,T t t,T 29 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "APPENDIX",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 34,
    "chunk_index": 54,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "APPENDIX (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "symmetry s = 0. t,T Part 2. The claim follows from the positivity of the integrands in (13). Part 3. From the definition of the Log and the Entropy Contract (cid:20) (cid:21) F vL = −2EQ [lnF −lnF ], and vE = 2EQ T,T (lnF −lnF ) . (50) t,T t T,T t,T t,T t F T,T t,T t,T Writing x for the return ln FT,T we have t Ft,T vL = −2EQ [x ] = −2EQ [x −ext +1], and vE = 2EQ [x ext] = 2EQ [x ext −ext +1]. (51) t,T t t t t t,T t t t t Using a Taylor series expansion vL = EQ(cid:2) x2 +x3/3+··· (cid:3) , vE = 2EQ(cid:2) x2 +2x3/3+··· (cid:3) , (52) t,T t t t t,T t t t and therefore s = 3(vE −vL ) = EQ(cid:2) x3 +O(x )4 (cid:3) . (53) t,T t,T t,T t t t Part 4. With a self-financing portfolio strategy, starting from zero wealth, we have absence of arbitrage EQ [W −W ] = 0 and as a consequence 0 T 0   (cid:90) (cid:26) 1 (cid:27)  G = EQ dG(cid:48) df + (G(cid:48)(cid:48) −G(cid:48) )(df )2 . (54) 0,T 0  t,T t,T 2 t,T t,T t,T  (cid:124)(cid:123)(cid:122)(cid:125)  t∈[0,T]  fixedleg (cid:124) (cid:123)(cid:122) (cid:125) realizedleg This is the payoff to a swap contract in continuous time. Using g = gS gives the desired result. C Robustness Checks In this section we check whether the results are driven by the the choice of risk factors, specific sample selection, discreteness of strike prices, and whether the results disappear once account is taken of transaction costs. 30 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "APPENDIX",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 34,
    "chunk_index": 55,
    "word_count": 283,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "APPENDIX (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "gS gives the desired result. C Robustness Checks In this section we check whether the results are driven by the the choice of risk factors, specific sample selection, discreteness of strike prices, and whether the results disappear once account is taken of transaction costs. 30 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "APPENDIX",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 34,
    "chunk_index": 56,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "APPENDIX (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "Table 9: Skew vs. variance risk premia: Fama-French and momentum factors This table presents estimation results of the following skew and variance risk premia regressions: xs =α +α xv +α xm +α smb +α hml +α umd +u t 0 1 t 2 t 3 t 4 t 5 t t xv =β +β xs +β xm +β smb +β hml +β umd +w . t 0 1 t 2 t 3 t 4 t 5 t t xs and xv denote excess returns from skew and variance swaps, xm denotes the market excess return, smb and hml denote Fama-French factors and umd is the momentum risk factor. The system is estimated using three-stage OLS. The instrumental variables used for the estimations are ks , s and ted . Market excess t t t return, Fama-French and momentum factors are treated as exogenous. Newey-West t-statistics are given in parentheses. The data are monthly, from January 1996 to January 2012. Const xv xs xm smb hml umd R¯2 0.011 0.526 -2.947 0.231 0.187 -0.581 xv 83.47% (0.60) (22.3) (-5.28) (0.36) (0.32) (-1.49) -0.021 1.901 5.602 -0.439 -0.355 1.104 xs 81.14% (-0.53) (22.4) (4.63) (-0.36) (-0.31) (1.46) C.1 Fama-French and Momentum Factors We start by checking whether the inclusion of Fama-French and momentum risk factors into equations (34) and (35) changes our conclusions. Specifically, we re-estimate the following system of equations using three-stage OLS xs = α +α xv +α xm +α smb +α hml +α umd +u (55) t 0 1 t 2 t 3 t 4 t 5 t t xv = β +β xs +β xm +β smb +β hml +β umd +w , (56) t 0 1 t 2 t 3 t 4 t 5 t t where smb and hml denote Fama-French factors and umd is the momentum risk factor. As before, we use the three instrumental variables: ks , s and ted . The market excess return, t t t Fama-French and momentum factors are treated as exogenous. The estimation results are given in Table 9. As before, excess returns from skew and variance swaps and the market returns remain significant in both equations, while Fama-French and momentum factors do not. The intercepts in both equations remain economically and statistically insignificant. C.2 Subsample Analysis We look separately at the first and the second half of our dataset: from January 1996 to December 2003 and from January 2004 to January 2012. For each sub-period we estimate equations (34) and (35) using three-stage OLS. The estimation results are given in Table 10. The strong correlation between skew and variance risk premia is manifest in both sub-periods, 31 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "APPENDIX",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 34,
    "chunk_index": 57,
    "word_count": 444,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "APPENDIX (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "to December 2003 and from January 2004 to January 2012. For each sub-period we estimate equations (34) and (35) using three-stage OLS. The estimation results are given in Table 10. The strong correlation between skew and variance risk premia is manifest in both sub-periods, 31 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "APPENDIX",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 34,
    "chunk_index": 58,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "APPENDIX (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "Table 10: Skew and variance risk premia: sub-samples This table presents estimation results of the skew and variance risk premia regressions xs = α +α xv + t 0 1 t α xm +u , and xv = β +β xs +β xm +w across two periods: January 1996 – December 2003 and 2 t t t 0 1 t 2 t t January 2004 – January 2012. xs and xv denote excess returns from skew and variance swaps, xm denotes the market excess return. The system is estimated using three-stage OLS. The instrumental variables used for the estimations are ks , s and ted . Newey-West t-statistics are given in parentheses. t t t January 1996 – December 2003 Const xv xs xm R¯2 xv -0.010 (-0.20) 0.512 (5.86) -2.107 (-2.80) 62.27% xs 0.007 (0.07) 1.900 (6.01) 3.871 (1.98) 63.94% January 2004 – January 2012 Const xv xs xm R¯2 xv 0.016 (0.59) 0.507 (10.0) -3.507 (-3.53) 91.48% xs -0.032 (-0.62) 1.969 (10.0) 6.876 (2.67) 88.45% with the relationship being stronger in the second half. In both sub-samples the intercepts are economically small and statistically insignificant. C.3 Robustness in Computation of Implied Moments Exact computation of implied skew and implied variance requires a continuum of option prices at all strikes. To check whether the results are sensitive to the methodology used to compute moments we use a different approach. We generate 1,500 option prices for strikes from $10 to $3,000, withstep$5, fromtheavailableoptionquotes. Ateachmaturityweinterpolateimplied volatilitiesacrossallavailablestrikepricesusingacubicsplinemethod. Forstrikepricesbelow and above the lowest and the highest available strikes we use the implied volatilities at the lowest and the highest strike price respectively; this is the same procedure as in Jiang and Tian (2005) and Carr and Wu (2009). Having recomputed the skew and variance risk premia, we estimate equations (34) and (35). The regression results are in Panel A of Table 11, which are similar to those in Table 5. Our results rely on the accuracy of prices in the database. Option prices for contracts having no open interest and zero trading volume may be inaccurate or stale. We replicate our results using only options with non-zero open interest and trading volume. Panel B of Table 11 contains the estimation results. Coefficient estimates remain qualitatively similar. Both intercepts are statistically insignificant and R2’s remain high suggesting that our results are not driven by the prices of illiquid options. 32 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "APPENDIX",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 34,
    "chunk_index": 59,
    "word_count": 401,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "APPENDIX (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "options with non-zero open interest and trading volume. Panel B of Table 11 contains the estimation results. Coefficient estimates remain qualitatively similar. Both intercepts are statistically insignificant and R2’s remain high suggesting that our results are not driven by the prices of illiquid options. 32 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "APPENDIX",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 34,
    "chunk_index": 60,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "APPENDIX (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "Table 11: Skew and variance risk premia: robustness in computations This table presents estimation results of the skew and variance risk premia regressions xs = α +α xv + t 0 1 t α xm +u andxv =β +β xs +β xm +w . xsandxv denoteexcessreturnsfromskewandvarianceswap 2 t t t 0 1 t 2 t t strategies,xmdenotesthemarketexcessreturn. PanelAusestheinterpolation-extrapolationtechniquesfrom Jiang and Tian (2005) and Carr and Wu (2009) and Panel B computes implied moments using options with non-zeroopeninterestandtradingvolume. Thesystemisestimatedusingthree-stageOLS.Theinstrumental variables used for the estimations are ks , s and ted . Newey-West t-statistics are given in parentheses. The t t t data are monthly, from January 1996 to January 2012. Const xv xs xm R¯2 Panel A: Interpolation-Extrapolation xv 0.012 (0.60) 0.505 (31.0) -2.871 (-6.00) 82.04% xs -0.025 (-0.61) 1.981 (31.0) 5.688 (5.51) 77.92% Panel B: Non-zero Interest xv 0.008 (0.39) 0.527 (23.6) -2.731 (-5.59) 83.35% xs -0.016 (-0.39) 1.899 (23.7) 5.184 (4.92) 80.68% C.4 Transaction Costs Replication of the variance swap involves setting up an option position at inception and then dynamically trading the underlying asset. By contrast, replication of the skew swap requires dynamic option trading as well as dynamic trading in the underlying asset. With significant bid-ask spreads in the options market, the question naturally arises as to whether the results obtained previously, which assume that options can be traded at the mid-price between the bid and the ask, go away once transaction costs are taken into account. Since transaction costs in the spot index market are very much lower than in the options market we continue to assume they are zero. Consider the case of an agent replicating a long position in a skew swap. At inception, the agent buys high-strike options and writes low-strike options. With the negative skew in option prices, this is cash-flow positive. The position is delta-hedged in the forward market. As the underlying rises, the agents sells entropy contracts - by selling conventional options at all strikes; conversely when the underlying falls, the agent buys conventional options. In the presence of transaction costs, the agent buys options at the ask and sells at the bid. The transaction costs reduce the profits from the strategy. The agent could reduce the impact of transaction costs by rebalancing less frequently, but this would make the replication noisier. Rather than solving for the optimal hedging strategy under transaction costs, we assume that the agent rebalances at the end of a day only when the index has moved by more than somethresholdofκ%fromthelasttimetheportfoliowasrebalanced. Theskewswapcontinues 33 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "APPENDIX",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 34,
    "chunk_index": 61,
    "word_count": 422,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "APPENDIX (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "rebalancing less frequently, but this would make the replication noisier. Rather than solving for the optimal hedging strategy under transaction costs, we assume that the agent rebalances at the end of a day only when the index has moved by more than somethresholdofκ%fromthelasttimetheportfoliowasrebalanced. Theskewswapcontinues 33 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "APPENDIX",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 34,
    "chunk_index": 62,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "APPENDIX (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "Figure 2: Returns and standard deviations of skew swap strategy under transaction costs vs. no transaction costs Thefigurepresentsaverageexcessreturnsandtheirstandarddeviationsforalongpositioninone-monthskew swap under different rebalancing frequencies. std(xs) and xs correspond to standard deviation and excess returns for the case of no transaction costs (options traded at the mid-quotes) while std(xs tc) and xs tc denote standard deviation and returns under transaction costs (options traded at bid and ask prices). The x-axis is the filter which controls the rebalancing frequency. The trader rebalances the portfolio only when the index prices changes more than κ%. The sample period is January 1996 to January 2012. 250% xs xs tc std(xs) 200% std(xs tc) 150% 100% 50% 0% 0% 2% 4% 6% 8% 10% κ% to be a self-financing strategy after transaction costs subject to the interpretation that vE is t the bid entropy variance (computed using the bid prices of all options) at time t if the index has risen since the portfolio was last rebalanced, and the ask if the index has fallen. The fixed leg s is computed from the bid price of low strike puts and the ask price of high strike calls. t Ifthethresholdissetlowenough,theportfolioisrebalanceddaily. Theeffectoftransaction costs is then substantial. The average monthly return9 drops to 4.78%. If the threshold κ is raised, the portfolio is rebalanced less frequently, leading to smaller transaction costs but more noise. Figure 2 presents the means and standard deviations of monthly returns for different values of κ. The variation of the excess returns increases as the rebalancing frequency decreases. The results suggest that the skew risk premium is a real phenomenon that remains even after accounting for transaction costs. 9We compute returns as profit net of transaction costs divided by the absolute value of the mid-quote implied skew. 34 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "APPENDIX",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 34,
    "chunk_index": 63,
    "word_count": 297,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "APPENDIX (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  },
  {
    "text": "as the rebalancing frequency decreases. The results suggest that the skew risk premium is a real phenomenon that remains even after accounting for transaction costs. 9We compute returns as profit net of transaction costs divided by the absolute value of the mid-quote implied skew. 34 Electronic copy available at: https://ssrn.com/abstract=1571700",
    "title": "The Skew Risk Premium in the Equity Index Market",
    "source_type": "pdf",
    "document_id": "389e6bc43afc",
    "source_file": "The Skew Risk Premium in the Equity Index Market.pdf",
    "section": "APPENDIX",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 34,
    "chunk_index": 64,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "APPENDIX (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20121127104946Z",
    "duration": null
  }
]