[
  {
    "text": "The Cross-Section of Speculator Skill Evidence from Day Trading Brad M. Barber Graduate School of Management University of California, Davis Yi-Tsung Lee Guanghua School of Management Peking University Yu-Jane Liu Guanghua School of Management Peking University Terrance Odean Haas School of Business University of California, Berkeley May 2011 _________________________________ We are grateful to the Taiwan Stock Exchange for providing the data used in this study. Barber appreciates the National Science Council of Taiwan for underwriting a visit to Taipei, where Timothy Lin (Yuanta Core Pacific Securities) and Keh Hsiao Lin (Taiwan Securities) organized excellent overviews of their trading operations. We have benefited from the comments of seminar participants at Oregon, Utah, Virginia, Santa Clara, Texas, Texas A&M, Washington University, Peking University, and HKUST. The Cross-Section of Speculator Skill Evidence from Day Trading Abstract We document economically large differences in the before- and after-fee returns earned by speculative traders. We establish this result by focusing on day traders in Taiwan from 1992 to 2006. We argue that these traders are almost certainly speculative traders given their short holding period. We sort day traders based on their returns in year y and analyze their subsequent day trading performance in year y+1; the 500 top-ranked day traders go on to earn daily before-fee (after-fee) returns of 49.5 (28.1) bps per day; bottom-ranked day traders go on to earn daily before-fee (after-fee) returns of -17.5 (-34.2) bps per day. The spread in returns between top-ranked and bottom-ranked speculators exceeds 60 bps per day. Our results contribute to the evidence that cross- sectional variation in investor skill is an important feature of financial markets.",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 38,
    "chunk_index": 0,
    "word_count": 269,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "day traders go on to earn daily before-fee (after-fee) returns of -17.5 (-34.2) bps per day. The spread in returns between top-ranked and bottom-ranked speculators exceeds 60 bps per day. Our results contribute to the evidence that cross- sectional variation in investor skill is an important feature of financial markets.",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 38,
    "chunk_index": 1,
    "word_count": 50,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "On average, individual investors lose money from trading. Barber and Odean (2000) document that the majority of losses incurred at one large discount broker in the United States can be traced to trading costs. However, trading costs are not the whole story. On average, individual investors have perverse security selection abilities; they buy stocks that earn subpar returns and sell stocks that earn strong returns (Odean (1999)). In aggregate, the losses of individuals are material. Barber, Lee, Liu, and Odean (BLLO, 2009), using complete transaction data for the Taiwan market from 1995 to 1999, document that the aggregate losses of individual investors exceed two percent of annual Gross Domestic Product in Taiwan. Recent research documents that a host of variables (e.g., IQ, cognitive abilities, geography, portfolio concentration, age, and past performance) reliably predict cross- sectional variation in performance.1 But even the most skilled stock pickers in these studies are unable to deliver a return that covers a reasonable accounting for transaction costs. Thus, it remains an open question whether some individual investors can profit from speculative trading. Prior studies almost certainly underestimate the economic significance of cross- sectional variation in the skill of individual investors. Virtually all prior studies of ability have analyzed the general population of individual investors, who tend to be infrequent traders. This underestimates the variation in cross-sectional ability of investors, since a large proportion of trades by infrequent traders will have nonspeculative motives (e.g., diversification, rebalancing, tax, or liquidity motivations). In addition, most prior studies of cross-sectional variation in skill have relied on data from a single broker (see footnote one). We are able to enrich this prior evidence by analyzing the returns earned by all speculators in an entire market over a 15-year period. As in Barber, Lee, Liu, and Odean 1 See Coval, Hirshleifer, and Shumway (2008), Grinblatt, Keloharju, and Linnainmaa (2010), Korniotis and Kumar (2009, 2010), Kumar (2009), Ivkovich and Weisbenner (2005), and Ivkovich, Sialm, and Weisbenner (2008). All of these studies use data from a large discount broker with the exception of Grinblatt et al. Grinblatt and Keloharju (2000) also document poor performance by individual investors. 1",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 38,
    "chunk_index": 2,
    "word_count": 355,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "and Linnainmaa (2010), Korniotis and Kumar (2009, 2010), Kumar (2009), Ivkovich and Weisbenner (2005), and Ivkovich, Sialm, and Weisbenner (2008). All of these studies use data from a large discount broker with the exception of Grinblatt et al. Grinblatt and Keloharju (2000) also document poor performance by individual investors. 1",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 38,
    "chunk_index": 3,
    "word_count": 50,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "(2009), we use complete transaction data for the Taiwan Stock Market, but use a much longer sample period of 1992 to 2006. We focus on day trading for two reasons. First, we are interested in analyzing the cross-section of speculator skill, and day traders, given their short holding period, are almost certainly speculators. Second, the signal-to-noise ratio regarding investor skill arguably is greater for day traders than for investors with longer holding periods. Several prior studies document that the lion’s share of abnormal returns earned around an informed trade occurs immediately following the trade (e.g., Coval, Hirhsleifer and Shumway (2005); Grinblatt, Keloharju, and Linnainmaa (2010); Barber, Lee, Liu, and Odean (2009)). Thus, with a large number of trades for an investor, we obtain a more precise estimate of the investor’s skill. Finally, day traders incur substantial trading costs and receive quick feedback about their trading ability. It is among this group that we are most likely to identify persistently good traders. We define day trading as the purchase and sale of the same stock by the same investor on the same day. We analyze the performance of day traders in two parts: (1) the intraday returns earned on trades (i.e., the day trading return), and (2) the return on the remaining portfolio (or open positions). The day trading return includes both round-trip and one-sided trades (i.e., trades that result in an open position at the close of trading). The remaining portfolio return includes the returns to all positions that remain open after the day of trade. Thus, we completely and accurately account for all gains and losses earned by day traders. Consistent with prior work on the performance of individual investors, the vast majority of day traders lose money. In the average year, about 360,000 Taiwanese individuals engage in day trading and about 15% of these day traders earn abnormal returns net of fees (commissions and transaction taxes). Of course, some outperformance would be expected by sheer luck. But luck is not the whole story. Our main result documents the presence of statistically and economically large cross-sectional variation in trader ability. In the average year, about 1,000 day traders are able to predictably outperform. Specifically, we 2",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 38,
    "chunk_index": 4,
    "word_count": 367,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "taxes). Of course, some outperformance would be expected by sheer luck. But luck is not the whole story. Our main result documents the presence of statistically and economically large cross-sectional variation in trader ability. In the average year, about 1,000 day traders are able to predictably outperform. Specifically, we 2",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 38,
    "chunk_index": 5,
    "word_count": 50,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "sort investors into groups based on their day trading returns in year y and analyze the performance of each group in the year y+1. We document that only the 1,000 most profitable day traders (less than 1 percent of the total population of day traders) from the prior year go on to earn reliably positive abnormal returns net of trading costs in the subsequent year. But, the stock picking ability of these investors is remarkable. Top day traders (based on prior year ranking) earn gross (net) abnormal returns of 49.5 (28.1) bps per day on their day trading portfolio, while the tens of thousands of day traders with a history of losses in the prior year go on to earn gross abnormal returns of -17.5 (-34.2) bps per day. Two points are worth emphasizing in these results. First, the spread in returns between the top and bottom performing investors at 67 bps per day is enormous when compared to most other studies of cross-sectional ability in investor performance. For example, using data from Finland, Grinblatt, Keloharju, and Linnainmaa (2010) document that the buys of high IQ investors outperform those of low IQ investors by 4.4 bps per day in the days immediately following the purchase. Using data from a large U.S. discount broker, Coval, Hirshleifer, and Shumway (2005) document a strategy that is long firms purchased by previously successful investors and short firms purchased by previously unsuccessful investors earns a daily abnormal return of 5 bps (assuming a holding period of 1 day). We believe that the much larger returns that we document are a result of our focus on frequent traders, who are almost certainly speculators and among whom we are better able to identify skilled investors. Second, to our knowledge, we provide the only study of individual investor performance that documents that savvy investors are able to cover a reasonable estimate of trading costs. The top day traders are able to cover rather large transaction costs (on top of commissions and spreads, Taiwan charges a 30 bps tax on sales) and earn an impressive net return of 28.1 bps per day on the day of trade. When combined with their remaining portfolio, the total portfolio of day traders earns an impressive daily abnormal return of 2 bps per day net of transaction costs. 3",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 38,
    "chunk_index": 6,
    "word_count": 386,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "a 30 bps tax on sales) and earn an impressive net return of 28.1 bps per day on the day of trade. When combined with their remaining portfolio, the total portfolio of day traders earns an impressive daily abnormal return of 2 bps per day net of transaction costs. 3",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 38,
    "chunk_index": 7,
    "word_count": 50,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "In auxiliary analyses, we explore factors that might explain the remarkable profitability of select group of day traders. Perhaps day traders profit by serving as liquidity providers on the Taiwan Stock Exchange, which is a pure electronic limit order market. From this view, day traders are compensated for serving as the counterparty to uninformed traders who demand immediacy. Using the orders underlying executed trades, we document that day traders place aggressive orders that demand immediacy at a higher rate than the general population of investors. Even the select group of profitable day traders place more aggressive orders than the general population of investors. Furthermore, the aggressiveness of orders underlying trades is, at best, a weak predictor of future day trader profitability. These empirical observations are not consistent with the hypothesis that day traders profit by providing liquidity to uninformed investors. We also investigate whether profitable day traders systematically use inside information to profit. Specifically, we analyze whether the profits of day traders are more concentrated around earnings announcements than other periods. We find little evidence that this is the case. The returns during these announcement periods are in line with the returns earned during non-announcement periods. In combination, these results indicate that day traders are forecasting short-term price movements and take advantage of these forecasts by placing aggressive orders. Finally, we investigate the characteristics of profitable day traders. Past performance (either returns or dollar profits) is, by a large margin, the best predictor of future performance. In addition, experience, past day trading volume, the willingness to short, and the concentration of trading in a few stocks all predict future profitability of day traders. In addition to providing insights on the cross-sectional variation in investor performance, ours also is among the first studies of day trading in financial markets, an activity that appears to be an important equilibrium feature of many emerging markets— most notably mainland China. In Taiwan, 17% of all trading volume can be traced to round-trip day trades made by individual investors. This trading activity is remarkably 4",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 38,
    "chunk_index": 8,
    "word_count": 340,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "first studies of day trading in financial markets, an activity that appears to be an important equilibrium feature of many emerging markets— most notably mainland China. In Taiwan, 17% of all trading volume can be traced to round-trip day trades made by individual investors. This trading activity is remarkably 4",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 38,
    "chunk_index": 9,
    "word_count": 50,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "stable over the 15-year period that we analyze, despite the poor performance profile of day traders. Day trading is clearly an equilibrium feature of the Taiwan stock exchange. The rest of this paper is organized as follows. We survey related research in section I. We discuss Taiwan market rules, our dataset, and methods in Section II. We present results in Section III, followed by a discussion and concluding remarks. I. Background and Related Research Our study is the first large-scale study of day trading for an entire market. However, we are not the first to study day trading. Three small-scale academic studies of day trading provide evidence that day trading can be profitable. Harris and Schultz (1998) analyze the day trading of Small Order Execution System (SOES) bandits using trading records from two brokers. To do so, they analyze roughly 20,000 trades over a three- week period. Though the SOES traders lose money almost as frequently as they make money, they earn a small average profit per trade. Similarly, Garvey and Murphy (2005a) analyze the trading of 96,000 trades made by fifteen proprietary day traders—traders who use a firm’s capital, pay no commissions, and profit share with the firm—at a direct access broker during three months in 2000. They too find these 15 day traders are able to make money on their day trading activities primarily by placing limit orders on electronic crossing networks (ECNs) that are inside the current best quotes offered by NASDAQ dealers. Garvey and Murphy (2005b) find similar results in a follow-up study of 1,386 day traders over two months. Both of the studies by Garvey and Murphy analyze only round-trip trades, which is likely to bias performance measurement as traders are more likely to close out winning positions. Seasholes and Wu (2007) examine the trades of ten extremely active traders on the Shanghai Stock Exchange. These traders earn substantial profits through buying shares on days that stocks hit their upper price limits and quickly selling those shares the following day. Linnainmaa (2003) analyzes 7,686 investors who complete at least one roundtrip intraday transaction. These investors are far less active than those studied by Harris and Schultz (1998) and Garvey and Murphy (2005a). The majority of these investors day trade on only one or two occasions and, in aggregate, these investors complete only 5",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 38,
    "chunk_index": 10,
    "word_count": 388,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "7,686 investors who complete at least one roundtrip intraday transaction. These investors are far less active than those studied by Harris and Schultz (1998) and Garvey and Murphy (2005a). The majority of these investors day trade on only one or two occasions and, in aggregate, these investors complete only 5",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 38,
    "chunk_index": 11,
    "word_count": 50,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "185,000 day trading related trades over a two and a half year period (November 1998 through May 2000). Linnainmaa (2003) reports that the net returns of these investors are similar to those of a control sample. In a follow-up paper, Linnainmaa (2010) uses a sample of frequent traders in Finland to test learning models of speculative trading. He concludes “… investors trade to learn even if they are pessimistic about their ability.” In our analysis, we focus on cross-sectional differences in ability and do not address the question of whether investors rationally learn. In contrast to the small-scale studies of day trading, we provide a comprehensive analysis of the profitability of all day trading in Taiwan over a 15-year period. To do so, we use a unique and remarkably complete dataset, which contains the entire transaction data, underlying order data, and the identity of each trader on the Taiwan Stock Exchange (TSE). In total, the dataset contains 3.7 billion purchase (or sale) transactions with a value of $NT 310 trillion (approximately $10 trillion US).2 With these data, we provide a comprehensive accounting of the profitability of day traders during the period 1992 through 2006. Taiwan provides a particularly appropriate setting to analyze the profitability of day trading. By most accounts, day trading has been a fixture on the TSE for decades. In the average year of our sample, 360,000 individual investors engage in day trading and their day trading accounts for 17% of all volume on the Taiwan Stock Exchange (see Figure 1). Virtually all day trading can be traced to individual investors in Taiwan. In the typical month, 15% of individual investors who trade on the TSE engage in at least one day trade. II. The Taiwan Market, Data, and Methods II.A. Taiwan Market Rules Before proceeding, it is useful to describe the Taiwan Stock Exchange (TSE). The TSE operates in a consolidated limit order book environment in which only limit orders 2 The mean TWD/USD exchange rate from 1992 to 2006 was 30.54 with a low of 24.65 and a high of 35.01. 6",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 38,
    "chunk_index": 12,
    "word_count": 346,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "Before proceeding, it is useful to describe the Taiwan Stock Exchange (TSE). The TSE operates in a consolidated limit order book environment in which only limit orders 2 The mean TWD/USD exchange rate from 1992 to 2006 was 30.54 with a low of 24.65 and a high of 35.01. 6",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 38,
    "chunk_index": 13,
    "word_count": 50,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "are accepted. During the regular trading session, from 9 a.m. to noon (or 1:30 after 2001), buy and sell orders can interact to determine the executed price subject to applicable automatching rules.3 Minimum tick sizes are set by the TSE and vary depending on the price of the security. Generally, orders are cleared using automatching rules one to two times every 90 seconds throughout the trading day. Orders are executed in strict price and time priority. An order entered into the system at an earlier time must be executed in full before an order at the same price entered at a later time is executed. Although market orders are not permitted, traders can submit aggressive price-limit orders to obtain matching priority. Prior to 2002, there is a daily price limit of seven percent in each direction and a trade-by-trade intraday price limit of two ticks from the previous trade price.4 After 2002, there is a temporary trading halt when the current price deviates by more than 3.5% from the last traded price. Since our analysis focuses on day trading, an important consideration is transaction costs. The TSE caps commissions at 0.1425 percent of the value of a trade. Some brokers offer lower commissions for larger traders—an issue that we discuss in greater detail later in the paper. Officials at brokerage firms and the TSE indicated to us that the largest commission discount offered is 50 percent (i.e., a commission of roughly seven basis points); these same officials estimated the trade-weighted commission paid by market participants to be about 10 basis points. Taiwan also imposes a transaction tax on stock sales of 0.3 percent. II.B. Trades Data and Descriptive Statistics We have acquired the complete transaction history of all traders on the TSE from 1992 to 2006. The trade data include the date and time of the transaction, a stock identifier, order type (buy or sell—cash or margin), transaction price, number of shares, a broker code, and the identity of the trader. The trader code allows us to broadly categorize traders as individuals, corporations, dealers, foreign investors, and mutual 3 Trading also occurred on Saturdays during most of our sample period. Before December 1997, Saturday trading occurred from 9 a.m. –11 a.m. From January to March, 1998, stocks were traded only on the first and the third Saturday in each month. From April 1998 to December 2000, Saturday trading occurred from 9 a.m. to noon. From 2001 on, there has been no trading on Saturday. 4 From 2002 on, intraday price limit has been replaced by a temporarily trading interruption when the current price falls out of a specified range (+/-3.5 percent) of the last traded price 7",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 38,
    "chunk_index": 14,
    "word_count": 447,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "trading occurred from 9 a.m. to noon. From 2001 on, there has been no trading on Saturday. 4 From 2002 on, intraday price limit has been replaced by a temporarily trading interruption when the current price falls out of a specified range (+/-3.5 percent) of the last traded price 7",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 38,
    "chunk_index": 15,
    "word_count": 50,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "funds. The majority of investors (by value and number) are individual investors. Corporations include Taiwan corporations and government-owned firms (e.g., the government-owned Post, Banking, and Insurance Services). Dealers include Taiwanese financial institutions such as Fubon Securities, Yuanta Core Pacific Securities, and Polaris Securities. Foreign investors are primarily foreign banks, insurance companies, securities firms, and mutual funds. During our sample period, the largest foreign investors are Fidelity Investments, Scudder Kemper, and Schroder Investment Management. Mutual funds are domestic mutual funds, the largest of which is ING Asset Management with $NT163 billion invested in Taiwanese stocks in December 2006. We define day trading as the purchase and sale, in any order, of the same stock on the same day by an investor. Specifically, if an investor buys and sells the same stock on the same day, we calculate the number of shares bought (S ), the number of shares sold b (S ), the average purchase price (P ), and the average sales price (P ). The value of day s b s trading is defined as half of the total value of sales and purchases (½*P *min(S ,S )+ b b s ½*P *min(S ,S )). Over our sample period, day trading accounted for more than 17 s b s percent of the total dollar value of trading volume. Most day trading (about two-thirds) involves the purchase and sale of the same number of shares in a stock over the course of one day (i.e., most day trades yield no net change in ownership at the close of the day). In Figure 1, we plot day trading (black) and other trading (grey). There is clear variation in the volume of day trading and other trading over time, though the two are correlated (91% correlation at the monthly level). Though not the focus of our investigation, it is natural to wonder whether wide fluctuations in day trading (and total volume) can be explained by past market performance. Perhaps surprisingly, this does not appear to be the case; we regress changes in day trading on past returns (alternatively at monthly, quarterly, or annual horizons) and find past returns have no ability to predict changes in day trading. Virtually all day trading can be traced to individual investors. In the average month, individual investors account for 95 percent of day trading. Individuals and 8",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 38,
    "chunk_index": 16,
    "word_count": 390,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "trading on past returns (alternatively at monthly, quarterly, or annual horizons) and find past returns have no ability to predict changes in day trading. Virtually all day trading can be traced to individual investors. In the average month, individual investors account for 95 percent of day trading. Individuals and 8",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 38,
    "chunk_index": 17,
    "word_count": 50,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "corporations are free to short sell, though dealers, mutual funds, and foreigners are prohibited from doing so on the TSE. These short sale restrictions might partially explain the tendency for day trading to concentrate among individual investors and corporations. In contrast to U.S. dealers, dealers in Taiwan are not active providers of liquidity. Though dealers are required to “efficiently adjust the demand and supply in the market depending on the market situation, and ensure that the formation of fair price and its sound operation are not harmed,” dealers face no specific penalties for failing to meet this requirement. Dealer trades emanate from their proprietary trading activity. Based on our discussions with dealers in the TSE, the majority of this proprietary trading is not necessarily intended to provide liquidity. Chae and Wang (2009) also report that TSE dealers are not net providers of liquidity. In the remainder of the paper, we restrict our analysis to individual investors. II.C. Performance Measurement Our performance measurement focuses primarily on the intraday profits of all trades made by day traders and on trade-weighted intraday returns. We separately analyze the long-run (interday) profitability of positions generated by these trades to ensure the inferences we draw from the analysis of intraday profits are accurate. We first calculate the intraday returns to day trading. To do so, we identify all trades made by day traders. We calculate the profits on round-trip day trades and other trades that remain open at the close of the trading day. The other trades are either purchases to open a long position or sales that open a short position. The profits for trades that lead to an open position are calculated relative to closing prices on the date of the trade (i.e., mark-to-market at the day’s closing price). To calculate the daily return earned by a day trader, we sum the proceeds from stocks sold to close long positions and bought to close short positions (or their mark-to-market equivalent at the close of the trading day) and divide by the cost of initiating the position (i.e., the value of stocks bought or sold short at the time of the purchase or sale). We refer to this return as the gross return from day trading. To calculate the net return to day trading, we assume a 10 bps round- trip commission and a 30 bps transaction tax on sales. Since we use realized transaction prices, we capture any price impact from trade. Based on our discussion of trading costs 9",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 38,
    "chunk_index": 18,
    "word_count": 416,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "gross return from day trading. To calculate the net return to day trading, we assume a 10 bps round- trip commission and a 30 bps transaction tax on sales. Since we use realized transaction prices, we capture any price impact from trade. Based on our discussion of trading costs 9",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 38,
    "chunk_index": 19,
    "word_count": 50,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "with TSE officials, our assumption regarding round-trip commissions of 10 bps is reasonable. Our qualitative results are similar if we run our analysis using the commission maximum of 14.25 bps or assume a larger discount and use 7 bps; Essentially, the size of the group of profitable day traders that we describe later expands or contracts a bit depending on our assumptions regarding trading costs, but a small profitable group of day traders always emerges. We settle on 10 bps as we believe it is the best approximation of actual costs faced by regular day traders. (See appendix for details regarding our return calculations.) It is important to include both round-trip and one-sided trades to measure the performance of day trading. Focusing only on round-trip trades would yield a biased measure of performance if investors sell winners and hold losers (i.e., exhibit the disposition effect). For example, assume some day traders randomly buy and sell (random traders), while others close only winning investments while riding losers (disposition traders). Were we to analyze only the profits of round-trip trades, it is clear that the disposition traders would have better round-trip returns than the random traders merely because they have a rule regarding when to close a position. Since the disposition effect is prevalent among Taiwanese investors and among day traders elsewhere,5 it is important to include both round-trip and other trades when analyzing performance. Finally, we calculate the long-run (interday) returns to open positions. Positions for each investor are built from their prior trades.6 This return on the remaining portfolio includes the returns earned on trades that close positions and the transaction costs associated with those trades. We calculate the total returns earned by day traders by taking a weighted average of the returns on day trades and the remaining portfolio; the weights assigned to the two portfolios are the total value of day trading (i.e., the value of long buys plus the value of short sells on that day) and the total value of open positions at the close of the prior trading day, respectively. 5 Barber, Lee, Liu, and Odean (2007) and Linnainmaa (2005) document, respectively, that individual Taiwanese investors and Finnish day traders exhibit the disposition effect. 6 Some errors inevitably occur in building positions since we do not know positions at the beginning of the dataset (in January 1992). While short sales are identified by their order type, buys to cover short positions are not. Thus, we may erroneously build a long position for purchases early on in the dataset. 10",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 38,
    "chunk_index": 20,
    "word_count": 424,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "in building positions since we do not know positions at the beginning of the dataset (in January 1992). While short sales are identified by their order type, buys to cover short positions are not. Thus, we may erroneously build a long position for purchases early on in the dataset. 10",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 38,
    "chunk_index": 21,
    "word_count": 50,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "In Figure 2, we present an example of four trades by a day trader. The red lines represent short positions, while the black lines represent long positions. The solid lines are the portion of returns that are included in our day trading profits, while the dashed lines are included in the analysis of long-run returns. It’s clear from this graph that, by combining the two analyses, we capture the full experience of a trader. To evaluate the performance of day traders, we estimate abnormal returns by regressing the portfolio excess return (portfolio return less risk-free rate) on the excess return on a value-weighted market index. We construct our own market index using market capitalization from the Taiwan Economic Journal (TEJ) and individual stock returns calculated from the TSE data. The intercept of this regression is our measure of abnormal returns. III. Results In our main results, we sort day traders into groups based on a characteristic in year y and analyze the aggregate performance of each group in year y+1. We consider sorts based on past day trading activity and past performance. We conjecture that heavy day traders are more likely to be profitable speculators than occasional day traders, who might be trading for entertainment or thrill-seeking (e.g., Kumar (2009) or Grinblatt and Keloharjus (2009)). We then turn to sorts based on prior performance. III.A. Active Day Traders In Table 1, we present the gross and net performance of day traders based on prior day trading activity. We analyze the day trades and other trades of these investors in the months in which they day trade. In each year from 1992 to 2005, we rank day traders based on the dollar volume of day trading. We create nine groups based on prior activity—starting with the top 500 day traders and going on down to those with no prior day trading experience. We analyze the performance of each group in the year subsequent to ranking. 11",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 38,
    "chunk_index": 22,
    "word_count": 325,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "day traders based on the dollar volume of day trading. We create nine groups based on prior activity—starting with the top 500 day traders and going on down to those with no prior day trading experience. We analyze the performance of each group in the year subsequent to ranking. 11",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 38,
    "chunk_index": 23,
    "word_count": 50,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "Consider the top 500 day traders (first row of Table 1). These investors account for 10% of all day trading (last column of Table 1) and 43% of their trades are round-trip day trades (penultimate column of Table 1). In aggregate, they earn positive gross returns on their day trading of 13.1 basis points per day (t=17.28), but these profits do not survive costs, and active day traders lose about 6.8 basis points per day net of fees (t=- 9.02). The active traders also earn positive (albeit unreliably so) alphas of 1 bps per day on the remainder of their portfolio. However, the total portfolio earns a reliably negative alpha (2.2 bps per day, t=-3.11). It is clear from Table 1 that active day traders, despite failing to make money net of costs, earn higher returns than occasional day traders. The performance of day trading, the remaining portfolio, and the total portfolio is nearly monotonically decreasing as one moves from the most active day traders (top row of Table 1) to the least active day traders (bottom row of Table 1). In their analysis of the performance of individual and institutional investors in Taiwan from 1995 to 1999, Barber, Lee, Liu, and Odean (2009) document that, in aggregate, the trades of all individual investors lose money before transaction costs and that these losses grow at longer horizons. Thus, before transaction costs, the trades of both less active day traders and individual investors in aggregate lose money, while the trades of heavy day traders earn gross profits. In summary, active traders perform better than occasional day traders but are still unable to cover trading costs. Nonetheless, the security selection ability of active day traders, which generates gross daily alphas of 13 basis points, is impressive. III.B. Performance Persistence In Table 2, we present the performance of day traders sorted on the basis of prior profitability. We rank past profitability based solely on day trading returns. To measure profitability, we use the Sharpe ratio of past daily returns net of transaction costs (i.e., the mean net day trading return divided by the standard deviation of day trading returns). We require a minimum of 10 days of day trading within the ranking year to rank an investor. Most of the gains (and losses) from trade tend to occur immediately following a trade (see Barber, Lee, Liu, and Odean (2009), Coval, Hirshleiffer, and Shumway (2005), 12",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 38,
    "chunk_index": 24,
    "word_count": 402,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "of day trading returns). We require a minimum of 10 days of day trading within the ranking year to rank an investor. Most of the gains (and losses) from trade tend to occur immediately following a trade (see Barber, Lee, Liu, and Odean (2009), Coval, Hirshleiffer, and Shumway (2005), 12",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 38,
    "chunk_index": 25,
    "word_count": 50,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "Grinblatt, Keloharju, and Linnainmaa (2010)). So, by focusing on frequent traders and the returns earned on the day of trade, we obtain a more precise measure of investor skill. The returns on the remaining portfolio will contain many old positions that are no longer generating abnormal returns, thus creating noise that might limit our ability to measure investor skill. We create nine groups based on prior day trading profitability—starting with the top 500 day traders and going on down to those with no prior day trading experience. The top 500 traders have a mean Sharpe ratio of 0.21. Each of the top six groups (through 8,000 traders) has a mean Sharpe ratio greater than zero in the ranking period. There is clear performance persistence. The top-ranked profit group (1 to 500) earns impressive alphas on their day trading, open positions, and total portfolio in the post-ranking year. The top three groups (or 2,000 traders) earn reliably positive alphas on their day trading portfolio net of fees, but only the two groups (or 1,000 traders) earn reliably positive alphas when we consider their overall portfolio returns. In contrast, poor performers from prior years or those with insufficient history to be ranked earn reliably negative returns on their day trading and total portfolio—both before and after fees. In the average year, 360,000 individuals engage in day trading. While about 13% earn profits net of fees in the typical year, the results of our analysis suggest that less than 1% of day traders (1,000 out of 360,000) are able to outperform consistently. It is worth emphasizing the outsized alphas earned by the top 500 day traders. They pick up 49.5 basis points on their day trading portfolio before costs and 28.1 basis points after costs per day. Their total portfolio earns a daily alpha of 2.0 basis points per day. Given a trading year of 266 days (with occasional Saturday trading), this translates into an annual alpha of over 5 percentage points. In contrast, day traders ranked below the top 10,000 are giving up 5.7 basis points per day or over 15 percentage points annually. The magnitude of the total portfolio returns is consistent with our day trading results (nearly monotonic in past performance ranking), but is not as impressive as the 13",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 38,
    "chunk_index": 26,
    "word_count": 380,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "contrast, day traders ranked below the top 10,000 are giving up 5.7 basis points per day or over 15 percentage points annually. The magnitude of the total portfolio returns is consistent with our day trading results (nearly monotonic in past performance ranking), but is not as impressive as the 13",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 38,
    "chunk_index": 27,
    "word_count": 50,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "day trading alphas. This is because day trading represents only 6% of total capital at risk for the top performance group (other groups have similar proportions). The remaining portfolio represents long-term positions that are traded relatively infrequently and earn less impressive alphas. This is what we would expect from a day trader who also invests in the stock market as a long-term investment. If day traders spot short-term price changes but have no ability to predict long-term returns, the long-term investments mask the profitability of day trading. IV. Sources of Profits How are successful day traders able to earn such strong returns before fees? Obviously, day traders are able to profit from short-term price movements. What is unclear is how they are able to forecast these movements. On one hand, day traders may provide liquidity to market participants by placing passive limit orders that provide depth to an otherwise thin market. This strategy would be profitable as long as uninformed traders are willing to pay for this liquidity and the providers of liquidity are able to avoid excessive trading with investors who possess superior information. On the other hand, day traders could earn gross profits by placing aggressive orders in anticipation of future price movements. This strategy would be profitable if day traders possessed superior information (or superior ability to process publicly available information) or were able to otherwise identify short-term trends in prices. In this section, we consider these possibilities by analyzing the orders underlying day trades and trading around earnings announcements. We conclude that day traders, on average, are demanding, rather than supplying, liquidity. By default, this suggests that day traders profit by anticipating short-term price movements and aggressively trading in anticipation of the moves. However, we find limited evidence that day trading is based on superior (or inside) information. While day traders trade more and are somewhat more profitable during earnings announcement periods, the concentration of profits during these periods is quite modest. 14",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 38,
    "chunk_index": 28,
    "word_count": 327,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "price movements and aggressively trading in anticipation of the moves. However, we find limited evidence that day trading is based on superior (or inside) information. While day traders trade more and are somewhat more profitable during earnings announcement periods, the concentration of profits during these periods is quite modest. 14",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 38,
    "chunk_index": 29,
    "word_count": 50,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "IV.A. Are Day Traders Suppliers or Demanders of Liquidity? A natural place to look for profitable day trading is in the provision of liquidity. As groundwork for this analysis, we calculate the closing effective percentage spread for stocks trading on the TSE. This analysis gives us a sense for the size of the spread and potential profits from liquidity provision in Taiwan. In each year, we using closing prices (P) and the midpoint of the last unfilled buy and sell orders (M) and calculate the effective percentage spread for each stock-day combination as 2|P-M|/M. We then average spreads across stocks on a particular day and then across days within a year to generate an annual estimate of the percentage effective spread for 1992 to 2006. Across the 15 years, the average percentage effective spread for stocks trading on the TSE is 64 bps with no particularly strong time trend in the average spread; it ranges from a low of 52 bps in 1996 to a high of 78 bps in 2002. The size of these spreads makes it plausible that liquidity provision by day traders would be a profitable trading strategy. To determine whether day traders are earning gross profits by providing liquidity or spotting short-term trends in prices, we analyze orders underlying their trades. In addition to trade data, we have all orders (both filled and unfilled) that underlie these trades. Using these order data, we categorize each trade as aggressive or passive based on the order underlying the trade. This categorization involves three steps. First, for each stock, we construct a time series of clearing prices, the lowest unfilled sell limit order price, and the highest unfilled buy limit order price. These data are compiled by the TSE (the market display data) and are presented to market participants in real time. Second, we categorize all orders as aggressive or passive by comparing order prices to the most recent unfilled limit order prices at the time of the order. Orders to buy with prices at or in excess of the most recent unfilled sell limit order are categorized as aggressive; those with prices at, or below, the most recent unfilled buy limit order are categorized as passive; those with an order price between the two unfilled limit order prices are categorized as indeterminate. There is an analogous algorithm for sells. Third, we match all orders to trades. This matching allows us to determine whether a trade emanated from 15",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 38,
    "chunk_index": 30,
    "word_count": 410,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "unfilled buy limit order are categorized as passive; those with an order price between the two unfilled limit order prices are categorized as indeterminate. There is an analogous algorithm for sells. Third, we match all orders to trades. This matching allows us to determine whether a trade emanated from 15",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 38,
    "chunk_index": 31,
    "word_count": 50,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "a passive or aggressive order. Using this algorithm, we are able to categorize over 90 percent of all trades as passive or aggressive.7 Overall, about two-thirds of individual investors’ trades can be traced to aggressive limit orders. (These proportions are calculated as the total number of aggressive trades divided by the sum of passive and aggressive trades.) The proportion is similar for institutional investors, though corporations tend to be more passive than foreigners and dealers. Even if investors placed similar numbers of aggressive and passive limit orders, we would expect a higher percent of trades to originate from aggressive limit orders, since aggressive limit orders are more likely to be executed. In Figure 3, we present the proportion of trades that emanate from aggressive limit orders for groups formed on the basis of past profitability, where profit groups are formed as described in Table 2. In brief, we rank traders based on profitability in year y and analyze the aggressiveness of their trades in year y+1. We sum the total value of aggressive and passive trades for each profit group and then calculate the proportion that are aggressive on each day. The figure presents the mean proportion across all days for a particular profit group. In general, day traders place trades that are more aggressive than the average individual. Among day traders, the proportion of trades that originate from aggressive orders ranges from 71 to 75%, while the proportion for all individual investors is 67%. The 500 most profitable day traders are somewhat less aggressive than other day traders (71% of their trades emanate from aggressive orders), but even they are more aggressive than the average individual. We further explore this issue by ranking day traders by the aggressiveness of their orders in year y and analyzing their performance in year y+1. We create ten “aggressiveness” deciles ranging from one (most passive) to ten (most aggressive) based 7 The indeterminate category also includes trades that we are unable to match to an order. We discussed this issue with the TSE, and they suspect data that entry errors in the order records is the source of the problem. Though annoying, this type of data error should not introduce any bias into our results. 16",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 38,
    "chunk_index": 32,
    "word_count": 373,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "trades that we are unable to match to an order. We discussed this issue with the TSE, and they suspect data that entry errors in the order records is the source of the problem. Though annoying, this type of data error should not introduce any bias into our results. 16",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 38,
    "chunk_index": 33,
    "word_count": 50,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "on the proportion of an investor’s trades that emanate from aggressive limit orders. We further partition the top and bottom deciles in half to analyze the extremes more closely. We require that an investor make 100 trades that we classify as passive or aggressive to be included in the rankings. The most passive group (1a) has only 20% aggressive trades in the ranking year (and 28% in the following year), while the most aggressive group (10a) has 99% aggressive trades in the ranking year (and 97% in the following year). In Table 3, we present the profitability of day trading based on the aggressiveness partitions. Focus first on the returns to day trading (columns two through seven of Table 3). All partitions lose money both before and after costs. The losses tend to be higher for the most aggressive partitions. The pattern of alphas for the remaining portfolio is consistent with those for the day trading return. It is also interesting to note that the passive day traders engage in less day trading (12% of trades are day trades) than their aggressive counterparts (29% of trades are day trades). In summary, day traders are not profiting from providing liquidity. Day traders, even the most profitable day traders, place orders that are more aggressive than other individual investors. In addition, the aggressiveness of a trader’s order strategy does not predict profitability. We confirm these results at the end of this section where, in a multivariate setting, we document that the aggressiveness of orders does not reliably predict the profitability of day traders. IV.B. Are Day Traders Informed? Are the strong returns of profitable day traders a result of better information about a firm’s fundamentals? This is a difficult question to address definitively, but we attempt to provide some information on this issue by analyzing the returns to day trading around earnings announcements. Earnings announcements are economically important and closely watched; as a result, earnings announcements are a logical place to look to determine if day traders are capitalizing on superior (or perhaps inside) information. Using the TSE databank, we identify all earnings announcements for TSE stocks. We then identify trades that occur within a five-day window that begins three days prior 17",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 38,
    "chunk_index": 34,
    "word_count": 371,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "result, earnings announcements are a logical place to look to determine if day traders are capitalizing on superior (or perhaps inside) information. Using the TSE databank, we identify all earnings announcements for TSE stocks. We then identify trades that occur within a five-day window that begins three days prior 17",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 38,
    "chunk_index": 35,
    "word_count": 50,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "to the announcement and ends the day after the announcement. We separately analyze the trading of day traders sorted on the basis of their past profitability. If day traders have superior information during these announcement windows, we would expect their trading and returns to be concentrated heavily within these periods. The results of this analysis are presented in Table 4. The gross alphas for the most profitable traders are slightly higher than, but roughly in line with, the overall profits we present in Table 2 (51.9 bps during announcement periods and 49.5 bps overall). However, all groups tend to do better during announcement periods (though the worst traders continue to lose money).8 Moreover, there is not a strong concentration of trading during the announcement periods. In the last column of Table 4, we present the percentage of dollar volume within the announcement window for each day trader group. These percentages range from 10 to 12% across groups, with little clear variation across the profit partitions. If trading were randomly spread across days, we would expect roughly 7.5% of trading to occur during these windows (four quarterly five-day announcement periods per year (20 days) divided by the mean number of trading days in a year (266)). Thus, trading is indeed concentrated during earnings announcements (consistent with the general increase in volume around earnings announcements), but the concentration is not so dramatic as to indicate that the lion’s share of profits can be traced to advance access regarding earnings surprises. IV.C. Forecasting Profitability Our analysis indicates that several crude univariate sorts are able to forecast differences in the profitability of day traders. In this section, we employ a richer model to forecast the probability that a particular investor will be profitable. We would like to better understand the characteristics of profitable day traders. 8 The generally high returns within the earnings announcement window are consistent with the U.S. evidence of an earnings announcement premium (i.e., returns tend to be high around earnings announcements. Ball and Kothari (1991)). 18",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 38,
    "chunk_index": 36,
    "word_count": 336,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "will be profitable. We would like to better understand the characteristics of profitable day traders. 8 The generally high returns within the earnings announcement window are consistent with the U.S. evidence of an earnings announcement premium (i.e., returns tend to be high around earnings announcements. Ball and Kothari (1991)). 18",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 38,
    "chunk_index": 37,
    "word_count": 50,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "We estimate a logistic regression in which the dependent variable is a dummy variable that takes on a value of one if the net profits on a trader’s day trading portfolio are positive in year y. We choose to use the dummy variable as a dependent variable in lieu of a trader’s return or Sharpe ratio for two reasons. First, the estimation strategy allows us to say something about the probability of earning a positive net return. Indeed, we will find it takes a truly remarkable profile to garner an even 50-50 chance of being profitable. Second, we are interested in identifying the characteristics of profitable day traders rather than (for example) characteristics that predict variation in the losses of day traders. The logistic regression is well suited to this task. Nonetheless, our results are qualitatively similar when we use the Sharpe ratio of returns as the dependent variable in our analyses. To reduce the impact of occasional day trading, which may be motivated by social or entertainment values of trading, we require that an investor engage in a minimum of $NT 600,000 in day trading during the year. (We explore the use of higher and lower cutoff values and find generally similar results to those reported here.) Among this group, 13% of day traders earn profits net of costs in the average year. We include a range of independent variables designed to capture the experience, sophistication, and the skill of day traders. All independent variables are measured cumulatively through year y-1, while the dummy variable for profits is based on profitability net of fees on an investor’s day trading portfolio in year y. We include two measures of past success (profits): Sharpe Profit and Sharpe Return. These Sharpe ratios are calculated as the mean net daily return (or profit) from day trading divided by the daily standard deviation. We include dollar profits to capture investors who might consistently earn low returns on a large capital base. We also test for any gains from specialization on two dimensions. We include the concentration of an investor’s trades in the five most traded stocks (Percent Top Five Stocks). This variable is designed to capture any gains from specializing in the trading of 19",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 38,
    "chunk_index": 38,
    "word_count": 371,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "returns on a large capital base. We also test for any gains from specialization on two dimensions. We include the concentration of an investor’s trades in the five most traded stocks (Percent Top Five Stocks). This variable is designed to capture any gains from specializing in the trading of 19",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 38,
    "chunk_index": 39,
    "word_count": 50,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "a small group of stocks. To capture whether there are gains to specializing in day trading, we measure the fraction of an investor's trades that are round-trip day trades (Fraction Day Trades). Short selling is a reasonable proxy for investor sophistication. Thus, we include the proportion of a day traders round-trip day trades that were short sales, including buys to cover a short position (Percent Short). The proportion of trades that emanate from aggressive orders measures whether a day trader is a liquidity demander or provider (Fraction Agg. Trades). Finally, we include two measures of experience: Log Experience is the log of the number of days since the trader began day trading as of the beginning of year y, while Log Volume is the log of the dollar volume of prior trading. We estimate logistic regressions for each year from 1994 to 2006. We begin in 1994 so as to allow some build-up in the history for the more experienced day traders. In Table 5, we present the annual coefficient estimates, the mean coefficient estimate across the year, and the standard error of the mean. In the first two rows of the table, we present the mean for each variable in the regression and the probability impact of each variable. The mean values are calculated weighting each year equally (i.e., calculate a mean for each year and then average across years). The probability impact is the change in the probability of being profitable that results when one moves from 25th to 75th percentile of the distribution of the independent variable under consideration while all remaining variables are set to their mean. As we discuss these results, it’s useful to recall the baseline probabilities of earning a profit on one’s day trading return is about 13% (i.e., 87% of day traders lose money unconditionally). Consistent with our univariate results, profitability measures are strong predictors of trading success. Both Sharpe ratios on returns and profits predict 20",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 38,
    "chunk_index": 40,
    "word_count": 325,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "results, it’s useful to recall the baseline probabilities of earning a profit on one’s day trading return is about 13% (i.e., 87% of day traders lose money unconditionally). Consistent with our univariate results, profitability measures are strong predictors of trading success. Both Sharpe ratios on returns and profits predict 20",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 38,
    "chunk_index": 41,
    "word_count": 50,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "future success. Moving from the 25th to the 75th percentile on this variable improves the chances of being profitable by 6.7 percentage points for profits and 2.6 percentage points for returns. By a large margin, these profitability measures are the best predictors of the probability of future profits. Experienced and heavy day traders are more likely to be successful. Consistent with our prior results, the log of volume is a reliable predictor of success; heavy day traders perform better than occasional day traders. Experience also is predictive of success. However, both volume and experience are modest predictors relative to past profits. Measures of sophistication and specialization also predict success. Traders who short and those who concentrate in a few stocks are more likely to be successful. Again, these effects, though statistically significant, are economically modest. Finally, consistent with our prior results, we do not find that order aggressiveness is able to reliably forecast profitability. Overall, the results indicate that heavy traders with past success and experience, who are willing to short sell and concentrate in a few stocks have the greatest probability of turning a profit. However, only day traders with extremely rare characteristics would have a even odds of turning a profit net of fees. For example, relative to a baseline probability of being profitable, a day trader who is in the 75th percentile on each of the independent variables that we analyze in Table 5 would have a 25% probability of earning positive returns net of fees. V. Discussion Though the vast majority of day traders lose money, we find that the trades of heavy day traders are profitable before deducting transactions costs and that the trades of previously successful traders are profitable even after accounting for costs. How do day traders identify profitable trades and who is on the other side of these trades? The likely counterparties to profitable trades by heavy and previously successful day traders are less active day traders (see Table 2) and individual investors in general (see Barber, Lee, Liu, 21",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 38,
    "chunk_index": 42,
    "word_count": 338,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "for costs. How do day traders identify profitable trades and who is on the other side of these trades? The likely counterparties to profitable trades by heavy and previously successful day traders are less active day traders (see Table 2) and individual investors in general (see Barber, Lee, Liu, 21",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 38,
    "chunk_index": 43,
    "word_count": 50,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "and Odean (2009)). The trades of both of these groups earn losses even before deducting transaction costs. One way in which day traders could be earning profits is by supplying liquidity through passive limit orders to uninformed investors who are too eager to pay for quick execution. While some day traders may focus on supplying liquidity, over 70% of the trades executed by heavy and previously successful day traders are aggressive limit orders; a similar proportion of their profits also can be traced to aggressive orders. Such orders will lead to day trading profits when traders are able to anticipate short-term price changes. Day traders also may profit from superior (or even inside) information that allows them to forecast short-term price trends. Insider trading laws in Taiwan are similar to those in the United States. For example, directors and officers of a firm cannot trade on the basis of material private information; anyone acquiring private information also is precluded from trading. Penalties include fines and jail time. During our sample period, 35 cases were brought (about two to three per year) and about half (17) resulted in guilty verdict (11 resulted in jail time). While it is difficult to assess the deterrent effect of these laws, our empirical analyses indicate day trading profits are not heavily concentrated around earnings announcements where inside information regarding a firm’s prospects is likely to be quite valuable. Harris and Shultz (1998) document that SOES bandits are able to profit from trading with market makers who ostensibly are better informed and better financed. Harris and Shultz write that SOES bandits appear to profit by paying close attention to the market and reacting more quickly than most market makers to changing market conditions. The day traders studied by Garvey and Ryan (2005a) also appear to profit from reacting to market changes more quickly than most market makers. We speculate that the successful day traders who we observe profit by reacting more quickly than other investors to changing market conditions, just as SOES bandits and the fifteen day traders studied by Garvey and Murphy profit from vigilance and quick reactions. 22",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 38,
    "chunk_index": 44,
    "word_count": 354,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "changes more quickly than most market makers. We speculate that the successful day traders who we observe profit by reacting more quickly than other investors to changing market conditions, just as SOES bandits and the fifteen day traders studied by Garvey and Murphy profit from vigilance and quick reactions. 22",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 38,
    "chunk_index": 45,
    "word_count": 50,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "Day trading is an equilibrium feature of trading on the Taiwan Stock Exchange— accounting for almost 17% of total trading volume during our sample period. Individual investors account for virtually all day trading (over 99% of day traders and 95% of day trading volume). In an average year, 360,000 individual investors day trade, but only about 15% of this population is able to profit after a reasonable accounting for trading costs. We document strongly persistent cross-sectional variation in day trading skill. The 500 most successful day traders from year y go on to outperform the least successful day traders by over 60 basis points per day in year y+1. The top day traders earn gross returns of 49.5 basis points per day—more than enough to cover commissions and a hefty transaction tax on sales of 30 bps. Our auxiliary analyses indicate that the most profitable day traders are not liquidity providers, as they tend to place aggressive orders in anticipation of price moves. The most successful are heavy day traders with a history of profits who are willing to short and who concentrate in a few stocks. Cross-sectional variation in investor ability is statistically and economically large. This observation runs counter to the classic efficient markets view (e.g., Fama (1991)) in which private information is rare and investors are protected by market prices that fully reflect all information. In aggregate and on average, trading is hazardous to one’s wealth. However, the performance penalty associated with trading is not borne equally by all and is not confined to trading costs. Some traders are consistently dismal stock pickers; for a select few, trading proves to be a profitable endeavor. 23",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "VI. Conclusion",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 38,
    "chunk_index": 46,
    "word_count": 278,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "VI. Conclusion (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "In aggregate and on average, trading is hazardous to one’s wealth. However, the performance penalty associated with trading is not borne equally by all and is not confined to trading costs. Some traders are consistently dismal stock pickers; for a select few, trading proves to be a profitable endeavor. 23",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "VI. Conclusion",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 38,
    "chunk_index": 47,
    "word_count": 50,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "VI. Conclusion (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "Ball, R., Kothari, S.P. “Security returns around earnings announcements.” Accounting Review 66, No. 4 (1991), 718-738. Barber, B. M., Lee, Y. T., Liu, Y. J., Odean, T. “Just how much do individual investors lose by trading?” Review of Financial Studies 22, No 2 (2009), 609-632. Barber, B. M., Lee, Y. T., Liu, Y. J., Odean, T. “Is the aggregate investor reluctant to realise losses? evidence from Taiwan.” European Financial Management 13 (2007), 423-447. Barber, B.M., Odean,T. “Trading is hazardous to your wealth: the common stock investment performance of individual investors.” Journal of Finance 55 (2000), No. 2, 773-806. Chae, J., Wang, A. “Determinants of trading profits: the liquidity provision decision.” Emerging Markets Finance and Trade 45 (2009), 33-56. Coval, Joshua D., Hirshleifer, D. A., Shumway, T. “Can individual investors beat the market?” HBS finance working paper No. 04-025; Harvard NOM Working Paper No. 02-45. (2005) available at SSRN: http://ssrn.com/abstract=364000 or doi:10.2139/ssrn.364000 Fama, E.F. “Efficient markets II.” Journal of Finance 4, 5 (1991), 1575-1617. Garvey, R., Murphy, A.“Entry, exit and trading profits: a look at the trading strategies of a proprietary trading team.” Journal of Empirical Finance 12 (2005a), 629-649. Garvey, R.,Murphy, A.“The profitability of active stock traders.” Journal of Applied Finance, (2005b) 93-100. Grinblatt, M., Keloharju, M.“The investment behavior and performance of various investor types: a study of Finland’s unique data set.” Journal of Financial Economics 55 (2000), 43-67. Grinblatt, M., Keloharju, M.“Sensation seeking, overconfidence, and trading activity.” Journal of Finance 64, 2 (2009), 549-578. Grinblatt, Mark, Keloharju, M., Linnainmaa, J. T.“Do smart investors outperform dumb investors?” CRSP working paper; EFA 2010 Frankfurt Meetings Paper; Chicago Booth Research Paper No. 09-33. available at SSRN: http://ssrn.com/abstract=1364014 24",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "References",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 38,
    "chunk_index": 48,
    "word_count": 276,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "55 (2000), 43-67. Grinblatt, M., Keloharju, M.“Sensation seeking, overconfidence, and trading activity.” Journal of Finance 64, 2 (2009), 549-578. Grinblatt, Mark, Keloharju, M., Linnainmaa, J. T.“Do smart investors outperform dumb investors?” CRSP working paper; EFA 2010 Frankfurt Meetings Paper; Chicago Booth Research Paper No. 09-33. available at SSRN: http://ssrn.com/abstract=1364014 24 Harris, J.H., Schultz, P.H.“The trading profits of SOES Bandits.” Journal of Financial Economics 50 (1998), 39-62. Ivkovich, Z. Weisbenner, S.“Local does as local is: information content of the geography of individual investors’ common stock investments.” Journal of Finance 60 (2005), 267-306. Ivkovich, Z., Sialm, C., Weisbenner, S.“Portfolio concentration and the performance of individual investors.” Journal of Financial and Quantitative Analysis 43 (2008), 613-655. Korniotis, G., Kumar, A.“Do older investors make better investment decisions.” Review of Economics and Statistics, (2010) forthcoming. Korniotis, G.,Kumar, A.“Do portfolio distortions reflect superior information or psychological biases.” available at SSRN: http://ssrn.com/abstract=1018668 (2009) Kumar, A.“Who gambles in the stock market?” Journal of Finance 64, 4 (2009), 1889- 1933. Linnainmaa, J.T.“The anatomy of day traders.” AFA 2004 San Diego Meetings. available at SSRN: http://ssrn.com/abstract=472182 Linnainmaa, J.T.“The individual day trader.” 2005 UCLA working paper. Linnainmaa, J.T.“Why Do (Some) Households Trade So Much?” Available at SSRN: http://ssrn.com/abstract=972807 (2010). Odean, T.“Do investors trade too much?” American Economic Review 89 (1999), 1279- 1298. Seasholes, M., Wu, G.“Predictable behavior, profits, and attention.” Journal of Empirical Finance 14 (2007), 590-610. 25",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "References",
    "page_number": 27,
    "page_range": "p.27-28",
    "total_pages": 38,
    "chunk_index": 49,
    "word_count": 227,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.27-28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "J.T.“The individual day trader.” 2005 UCLA working paper. Linnainmaa, J.T.“Why Do (Some) Households Trade So Much?” Available at SSRN: http://ssrn.com/abstract=972807 (2010). Odean, T.“Do investors trade too much?” American Economic Review 89 (1999), 1279- 1298. Seasholes, M., Wu, G.“Predictable behavior, profits, and attention.” Journal of Empirical Finance 14 (2007), 590-610. 25 APPENDIX: Details of Return Calculations We calculate the intraday return from day trading on day t for a particular group (g) of investors weighted by the value of investors’ trades: (A1) where B and S denote the value of buys and sells (with superscripts L and S for long and short transactions, respectively) on day t in stock i by investor j. For long positions, the sales price is the actual transaction price or the closing price if the long position is not closed out prior to the end of trading. For short positions, the purchase price is the actual transaction price or the closing price if the short position is not closed out prior to the end of trading. Consider a concrete example where an investor buys a stock for $100 and sells later in the day for $102. On the same day, the investor shorts a stock (the same stock or a different stock) for $100 and later covers the short with a purchase at $97. The investor makes profits of $5 = (102-100) + (100-97). We scale the dollar profits by the total value of the opening positions, $200 = $100 + $100. Thus, we assume the investor put $200 of capital at risk and earned an intraday return of $5/$200 = 2.5%. This is an accurate representation of the returns if the investor trades in parallel (i.e., both positions are open at the same time). For investors who trade sequentially, we correctly calculate dollar profits of $5, but the capital at risk would be $100 rather than $200 as the $100 would be deployed sequentially. Thus, we always estimate the correct sign of returns, but for day traders who trade sequentially our return estimates are biased toward zero. In addition, we do not know the extent to which traders use leverage, which would increase the magnitude of returns for both gains and losses, but again the sign of the gains and losses would be the same as those in our calculations. In summary, the sign of the day trading returns that we calculate is accurate, though the magnitudes may differ because of sequential trading or the use of leverage. 26",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "References",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 38,
    "chunk_index": 50,
    "word_count": 414,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "gains and losses, but again the sign of the gains and losses would be the same as those in our calculations. In summary, the sign of the day trading returns that we calculate is accurate, though the magnitudes may differ because of sequential trading or the use of leverage. 26",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "References",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 38,
    "chunk_index": 51,
    "word_count": 50,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "When we calculate net returns, we deduct a 5 bps commission for all trades (10 bps round-trip commission) and a 30 bps transaction tax for sales. Put differently, buys cost 5 bps (C ) and sells cost 35 bps (C ). We also increase the capital requirements to b s reflect the total cost of the opening positions: (A2) Continuing our example from above, the net return for the trader would be: . Note the net return (2.09%) is roughly 40 bps (the total round-trip trading costs of 10bps in commissions and 30 bps in transaction tax) less than the gross return (2.50%). The shortfall is slightly greater than 50 bps because we also increase the capital required to open the positions. There is an analogous calculation for the return on the remaining portfolio. Define V as the value of the end-of-day open position in a stock with superscripts for L and S for long and short positions, respectively. We calculate the return to the remaining portfolio (rp) as the daily profits to long and short positions scaled by the position value entering the day: (A3) Stocks still held at the end of day t are marked to market at the end-of-day closing price for the stock. For long positions, stocks sold on day t are valued at the sales price less an assumed transaction cost of 35 basis points. For short positions, stocks bought to cover shorts on day are valued at the purchase price less an assumed transaction cost of 5 basis points. 27",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "References",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 38,
    "chunk_index": 52,
    "word_count": 256,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "stock. For long positions, stocks sold on day t are valued at the sales price less an assumed transaction cost of 35 basis points. For short positions, stocks bought to cover shorts on day are valued at the purchase price less an assumed transaction cost of 5 basis points. 27 Finally, the total portfolio return on day t for group g is calculated as the weighted average of the intraday return net of fees and the remaining portfolio return, where the weights are determined by the denominators in equations A2 and A3. 28",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "References",
    "page_number": 30,
    "page_range": "p.30-31",
    "total_pages": 38,
    "chunk_index": 53,
    "word_count": 93,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.30-31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "transaction cost of 5 basis points. 27 Finally, the total portfolio return on day t for group g is calculated as the weighted average of the intraday return net of fees and the remaining portfolio return, where the weights are determined by the denominators in equations A2 and A3. 28 Table 1: Performance for Sorts based on Prior Year Day Trading Activity: 1993 to 2006 Day Traders are grouped based on prior year trading activity (e.g., \"1 to 500\" are the most active 500 day traders from year y). The table presents the aggregate performance for each group in the year following ranking (y+1). The alphas are estimated using the following regression of daily returns: (R -R )=α +β (R -R )+ε , where R , R , and R are the portfolio return, market return, and risk-free return pt ft p p mt ft pt pt mt ft (respectively). The gross day trading return is calculated from daily round-trip trades plus the intraday returns on open trades; an open trade is a trade made during the day that results in an outstanding position at the close of the day. The net day trading return assumes a 10 bps round-trip commission and a 30 bps transaction tax on sales. The remaining portfolio return is the return earned on positions that remain open at the market close. \"Day Trade / All Trade\" is the fraction of the groups trading that is round-trip day trades. The total net portfolio return combines the net day trading return and the remaining portfolio net return; alphas are calculated relative to the close-to- close market return. The last two columns present the percentage of all trades by each group that are round-trip day trades and the percentage of all day trading attributable to each group. 29",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "References",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 38,
    "chunk_index": 54,
    "word_count": 300,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "net day trading return and the remaining portfolio net return; alphas are calculated relative to the close-to- close market return. The last two columns present the percentage of all trades by each group that are round-trip day trades and the percentage of all day trading attributable to each group. 29",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "References",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 38,
    "chunk_index": 55,
    "word_count": 50,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "Table 2: Performance for Sorts based on Past Day Trading Profits: 1993 to 2006 Day Traders are grouped based on prior year daily Sharpe ratio for day trading only (e.g., \"1 to 500\" are the 500 day traders from year y with highest daily Sharpe ratio). The table presents the aggregate performance for each group in the year following ranking (y+1). The alphas are estimated using the following regression of daily returns: (R -R )=α +β (R -R )+ε , where R , R , and R are the portfolio pt ft p p mt ft pt pt mt ft return, market return, and risk-free return (respectively). The gross day trading return is calculated from daily round-trip trades plus the intraday returns on open trades; an open trade is a trade made during the day that results in an outstanding position at the close of the day. The net day trading return assumes a 10 bps round-trip commission and a 30 bps transaction tax on sales. The remaining portfolio return is the return earned on positions that remain open at the market close. \"Day Trade / All Trade\" is the fraction of the groups trading in round-trip day trades. The total net portfolio return combines the net day trading return and the remaining portfolio net return; alphas are calculated relative to the close-to-close market return. The last two columns present the percentage of all trades by each group that are round-trip day trades and the percentage of all day trading attributable to each group. 30",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "References",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 38,
    "chunk_index": 56,
    "word_count": 255,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "the net day trading return and the remaining portfolio net return; alphas are calculated relative to the close-to-close market return. The last two columns present the percentage of all trades by each group that are round-trip day trades and the percentage of all day trading attributable to each group. 30 Table 3: Performance for Sorts based on Prior Year Order Type: 1993 to 2006 Day Traders are grouped into deciles based on the aggressiveness of prior year orders. The extreme deciles are further split in two. The table presents the aggregate performance for each group in the year following ranking (y+1). The alphas are estimated using the following regression of daily returns: (R -R )=α +β (R -R )+ε , where R , R , and R are the portfolio return, market return, and risk- pt ft p p mt ft pt pt mt ft free return (respectively). The gross day trading return is calculated from daily round-trip trades plus the intraday returns on open trades; an open trade is a trade made during the day that results in an outstanding position at the close of the day. The net day trading return assumes a 10 bps round-trip commission and a 30 bps transaction tax on sales. The remaining portfolio return is the return earned on positions that remain open at the market close. \"Day Trade / All Trade\" is the fraction of the groups trading in round-trip day trades. The total net portfolio return combines the net day trading return and the remaining portfolio net return; alphas are calculated relative to the close-to-close market return. The last two columns present the percentage of all trades by each group that are round-trip day trades and the percentage of all day trading attributable to each group. 31",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "References",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 38,
    "chunk_index": 57,
    "word_count": 296,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "the net day trading return and the remaining portfolio net return; alphas are calculated relative to the close-to-close market return. The last two columns present the percentage of all trades by each group that are round-trip day trades and the percentage of all day trading attributable to each group. 31 Table 4: Day Trading Performance Around Earnings Announcements for Day Traders Sorted on Past Day Trading Profits: 1993 to 2006 The table presents mean daily returns to day trading only for stocks that are trading in an event window from t=-3,+1 relative to an earnings announcement day (t=0). Day Traders are grouped based on prior year daily Sharpe ratio for only day trading (e.g., \"1 to 500\" are the top 500 day traders from year y). The table presents the aggregate performance for each group in the year following ranking (y+1). The alphas are estimated using the following regression of daily returns: (R -R )=α +β (R -R )+ε , where R , R , and R are pt ft p p mt ft pt pt mt ft the portfolio return, market return, and risk-free return (respectively). The gross day trading return is calculated from daily round-trip trades plus the intraday returns on open trades; an open trade is a trade made during the day that results in an outstanding position at the close of the day. The last column (% of All Trades) is the proportion of trades for the group that occur in the five-day earnings announcement window. 32",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "References",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 38,
    "chunk_index": 58,
    "word_count": 251,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "returns on open trades; an open trade is a trade made during the day that results in an outstanding position at the close of the day. The last column (% of All Trades) is the proportion of trades for the group that occur in the five-day earnings announcement window. 32 Table 5: Logistic Regressions of Positive Profit Probability A profit dummy takes a value of one if the net profits from day trading for an investor are positive in year y. The probability of a positive profit is estimated using a logistic regression in which the dependent variable is the profit dummy. Independent variables for each investor include the Sharpe ratio of past day trading profits (Sharpe Profit) and day trading returns (Sharpe Return), the percent of trading concentrated in the top five stocks (Percent Top Five Stocks), the percent of trades that were short sales (Percent Short), the percent of trading devoted to day trading (Percent Day Trade), the log of the number of days since a trader's first day trade as of the beginning of year y (Log Experience), and the log of the dollar volume of prior trading (Log Volume). The regression is limited to day traders with a minimum total value of trade $NT 600,000 in the year that profitability is measured. The probability impact is based on the change in the probability of being profitable when the independent variable under consideration is changed from the 25th to 75th percentile of the distribution of the independent variable while remaining variables are set to their mean values. 33",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "References",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 38,
    "chunk_index": 59,
    "word_count": 261,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "year that profitability is measured. The probability impact is based on the change in the probability of being profitable when the independent variable under consideration is changed from the 25th to 75th percentile of the distribution of the independent variable while remaining variables are set to their mean values. 33 Figure 1: Total Trading and Day Trading in Taiwan: 1992 to 2006 Day trading is defined as the purchase and sale of the same stock on the same day by the same investor. 34",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "References",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 38,
    "chunk_index": 60,
    "word_count": 84,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  },
  {
    "text": "the distribution of the independent variable while remaining variables are set to their mean values. 33 Figure 1: Total Trading and Day Trading in Taiwan: 1992 to 2006 Day trading is defined as the purchase and sale of the same stock on the same day by the same investor. 34 ▬ ♦ ▬ Long Buy Day Trading (Intraday) Returns ▬ ● --- Short Sell Long-Run (Interday) Returns Figure 2: Example of Trading Activity for a Day Trader 35 1 to 500 501 to 1,000 1,001 to 2,000 2,001 to 4,000 4,001 to 6,000 6,001 to 8,000 8,001 to 10,000 > 10,000 No Prior Yr Rank All Individuals 60% 62% 64% 66% 68% 70% 72% 74% 76% 78% 80% Percent Aggressive Figure 3: Order Aggressiveness for Profit Groups Profit groups are formed in year y; aggressiveness of trades is analyzed in year y+1. The figure presents the mean daily proportion of trades that emanate from aggressive orders for each profit group. 36 puorG ti.orP",
    "title": "Day Trading Skill 110523",
    "source_type": "pdf",
    "document_id": "db06de44bc74",
    "source_file": "The Cross-Section of Speculator Skill Evidence from Day Trading.pdf",
    "section": "Monday Tuesday Wednesday",
    "page_number": 37,
    "page_range": "p.37-38",
    "total_pages": 38,
    "chunk_index": 61,
    "word_count": 163,
    "author": "Terrance Odean",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Monday Tuesday Wednesday (p.37-38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20110525233845Z",
    "duration": null
  }
]