[
  {
    "text": "The Post-Earnings Announcement Drift – A Pre-Earnings Announcement Effect? A Multi-Period Analysis A. William Richardson* DeGroote School of Business McMaster University awrich@mcmaster.ca Kevin Veenstra DeGroote School of Business McMaster University veenstk@mcmaster.ca May 25, 2020 * Corresponding Author. We gratefully acknowledge helpful comments from Jeff Callen, Darren Henderson, Stuart Mestelman, Mohamed Shehata, conference participants at the British Accounting and Finance (BAFA) 2019 and the Canadian Academic Accounting Association (CAAA) 2019 annual conferences and seminar participants at Wilfrid Laurier University. All errors are our own. Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 46,
    "chunk_index": 0,
    "word_count": 88,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "gratefully acknowledge helpful comments from Jeff Callen, Darren Henderson, Stuart Mestelman, Mohamed Shehata, conference participants at the British Accounting and Finance (BAFA) 2019 and the Canadian Academic Accounting Association (CAAA) 2019 annual conferences and seminar participants at Wilfrid Laurier University. All errors are our own. Electronic copy available at: https://ssrn.com/abstract=3360686 The Post-Earnings Announcement Drift – A Pre-Earnings Announcement Effect? A Multi-Period Analysis ABSTRACT For many years, the post-earnings announcement drift (PEAD) has been accepted as an anomaly to the efficient markets hypothesis. This drift subsequent to earnings announcements has been ascribed to the incomplete incorporation by the market of the information in these earnings announcements. Interestingly, over the past five decades of extensive research, no rational economic explanation of the PEAD has been found. However, there has been no specific consideration of the effect of economic information subsequent to the earnings announcements. Our multi-year examination of the cumulative abnormal return (CAR) incorporates the effect of economic information subsequent to the earnings announcement of traditional PEAD studies. Our analysis shows that a PEAD can arise without recourse to invoking market inefficiency. Our results are consistent for three samples covering the period 1973 to 2016. We do not assert that we prove that there is no component of the PEAD due to market inefficiency. Rather, our results show that studies to determine whether there is a market inefficiency component of the PEAD should use a multi-period approach in order to account for the effect of economic information subsequent to the earnings announcements and thereby focus more precisely upon the cause of the PEAD reported in previous research studies. Keywords: Post-earnings announcement drift, pre-earnings announcement effect, multi-period. 2 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 46,
    "chunk_index": 1,
    "word_count": 280,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "should use a multi-period approach in order to account for the effect of economic information subsequent to the earnings announcements and thereby focus more precisely upon the cause of the PEAD reported in previous research studies. Keywords: Post-earnings announcement drift, pre-earnings announcement effect, multi-period. 2 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 46,
    "chunk_index": 2,
    "word_count": 50,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "The Post-Earnings Announcement Drift – A Pre-Earnings Announcement Effect? A Multi-Period Analysis I. INTRODUCTION The post-earnings announcement drift (PEAD), first reported in the seminal paper of Ball and Brown (1968), was labelled as an efficient market anomaly and is still so characterized some 50 years later. PEAD is defined as a drift in the plot of the cumulative abnormal return versus time for a period of months subsequent to the announcement of accounting earnings. More specifically, past studies have shown that cumulative abnormal return tends to drift up for good news (GN) firms (firms for which actual earnings exceed expected earnings) and down for bad news (BN) firms (firms for which expected earnings exceed actual earnings) after an earnings announcement (EA). This characterization exists in both the academic and professional literatures. In the academic literature, Ball (1992) noted: “the apparent predictability of abnormal returns after earnings announcements has become one of the most significant anomalies in financial markets research…” Fama (1998) referred to PEAD as “….the granddaddy of under-reaction events….” and stated that “the post-earnings announcement drift first reported by Ball and Brown (1968) has survived many robustness checks….” More recently, Kothari (2001) noted that “the PEAD anomaly poses a serious challenge to the efficient market hypothesis. It has survived a battery of tests and many attempts to explain it away.” In the more recent professional literature, Zhou and Zhu (2012) stated that “the post-earnings announcement drift has been one of the more robust and persistent anomalies challenging the efficient market paradigm.” 3 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 46,
    "chunk_index": 3,
    "word_count": 258,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "has survived a battery of tests and many attempts to explain it away.” In the more recent professional literature, Zhou and Zhu (2012) stated that “the post-earnings announcement drift has been one of the more robust and persistent anomalies challenging the efficient market paradigm.” 3 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 46,
    "chunk_index": 4,
    "word_count": 50,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "There have been a number of potential explanations for the PEAD; yet, the anomaly continues. In this study we extend the original analysis of Ball and Brown (1968) to a multi- year context. We do not use complex models and analyses, given that their use in past studies has not changed the basic conclusion about the PEAD observed in the simpler analysis used by Ball and Brown (1968). Prior papers in the literature have a number of characteristics in common. They have accumulated data for many companies into a single sample and so averaged any effect of industry differences. They have accumulated data for many years into a single sample and so averaged the effect of changes in the economic environment over the time of the sample. They have considered only one information event, the unexpected earnings at the end of this constructed common period. They have conveyed the erroneous impression that earnings announcements convey substantial new information to the market (Smith Bamber et al. 2000; Ball and Brown 2014). In a study of serial correlation of unexpected earnings, Rendleman, Jones and Latane (1987) suggest that the PEAD has a component due to what they labelled a pre-announcement earnings effect.1 This suggestion informs our proposed approach. We assert that new economic information, i.e. economic information subsequent to the earnings announcement considered in previous studies, should be taken into account in an analysis of the PEAD. To do this, we classify the sample data into three adjacent yearlong periods rather than a single period. This allows us to investigate the effect of economic information during these two additional years in addition to the effect of the information during a single common year as in Ball and Brown (1968). 1 The earnings event referred to is the end of the period subsequent to the EA considered in past PEAD studies. 4 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 46,
    "chunk_index": 5,
    "word_count": 314,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "these two additional years in addition to the effect of the information during a single common year as in Ball and Brown (1968). 1 The earnings event referred to is the end of the period subsequent to the EA considered in past PEAD studies. 4 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 46,
    "chunk_index": 6,
    "word_count": 50,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "This approach requires us to devise a proxy for the effect of the new economic information in these two subsequent years. As explained in more detail later, we use the unexpected earnings at the end of each of these two additional years as our proxy. We repeat these analyses for three samples - 1974 to 1987, 1988 to 2002 and 2003 to 2016. Our analysis shows a consistency of behavior for GN and BN announcements in the three years for the three samples, which provides strong support for the validity of our analysis. We do not address whether there remains a PEAD after incorporating the effect of the additional information. Rather, the goal of our study is to encourage future researchers to make use of a multi-period approach together with a proxy for new economic information to improve the investigation of the determinants of the PEAD. II. LITERATURE REVIEW AND HYPOTHESIS DEVELOPMENT 2.1 Background and Related Literature Figure 1 (taken from Ball and Brown (1968)) is a plot of cumulative abnormal returns (CAR) versus month using annual earnings announcements (EA) and monthly returns for 261 firms over the years 1957 to 1965. It shows separately the plots of CAR versus month for firms that were classified as good news (GN) or bad news (BN) based upon a dichotomous categorization of unexpected earnings (UE) at the end of the year2. The non-zero slope of the plots of CAR versus month after the EA at year-end constitutes what is popularly known as the PEAD. Ball and Brown (1968) did not make a hypothesis of market inefficiency. Rather they observed that the CAR versus time plots subsequent to the EA for the GN and BN subsamples 2 Ball and Brown show plots for three variables, all of which show similar behavior. Variable 1 is based on an income expectation model using regression with an emphasis on net income. Variable 2 is based on an income expectation model using regression with an emphasis on earnings per share. Variable 3 is based on a naïve income expectation model with an emphasis on earnings per share. 5 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 46,
    "chunk_index": 7,
    "word_count": 356,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "model using regression with an emphasis on net income. Variable 2 is based on an income expectation model using regression with an emphasis on earnings per share. Variable 3 is based on a naïve income expectation model with an emphasis on earnings per share. 5 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 46,
    "chunk_index": 8,
    "word_count": 50,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "did not behave as expected based on the efficient market hypothesis (EMH). They inferred that a potential explanation for the non-zero slopes was market inefficiency, i.e. the incomplete recognition of the information in the EAs. Since Ball and Brown (1968), there have been many studies using data from different sources with consistent results. Foster, Olsen and Shevlin (1984) extended the Ball and Brown (1968) study in several ways (see Figure 2). First, they used quarterly EAs and daily returns in place of annual EAs and monthly returns, and more complex expectations models to calculate abnormal returns and unexpected earnings. Second, they used a more recent sample period, namely the years 1974 to 1981. Finally, given that they had a much larger sample, they classified firms into deciles based upon standardized unexpected earnings (SUE) rather than simple dichotomous good news/bad news categories. Consistent with expectations, the plots show a more positive (negative) PEAD the more positive (negative) the SUE. Their results are fundamentally consistent with those of Ball and Brown (1968). Rendleman, Jones and Latane (1987) have several studies related to SUE. For a 1971 Q3 to 1980 Q4 sample, they show that SUEs are correlated over time, which led them to the conclusion that “what may appear as a post-announcement response to current quarter earnings may actually be a pre-announcement adjustment to next quarter’s earnings.” More specifically, these authors suggest that only approximately half of the observed PEAD is a “real” PEAD in the proper sense of the word and is consistent with serial correlation in SUEs. They posit that the remaining 50% is likely a pre-announcement adjustment to next quarter’s earnings. Their suggestion was recognized in the early literature (e.g. Bernard and Thomas (1990), Ball (1992)) but their hypothesized explanation for a part of the observed drift has not been specifically followed up in subsequent studies. 6 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 46,
    "chunk_index": 9,
    "word_count": 313,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "is likely a pre-announcement adjustment to next quarter’s earnings. Their suggestion was recognized in the early literature (e.g. Bernard and Thomas (1990), Ball (1992)) but their hypothesized explanation for a part of the observed drift has not been specifically followed up in subsequent studies. 6 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 46,
    "chunk_index": 10,
    "word_count": 50,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "Bernard and Thomas (1989, 1990) used the same basic approach as Foster, Olsen and Shevlin (1984), extending the sample to the period 1974 to 1986. They investigated possible explanations for the PEAD and found results that are consistent with a delayed price response. In other words, given that a firm announces positive (negative) unexpected earnings for quarter t, the market tends to be positively (negatively) surprised in the days surrounding the announcement for quarter t+1. They concluded that the results imply that investors on average do not understand the implications of current quarterly earnings for future earnings and instead rely on a simple random walk model with a drift to form earnings expectations. They found no evidence to support the hypothesis that the effects are due to problems with risk adjustment or the impact of transaction costs. However, they did not consider any effect of economic information subsequent to the earnings announcement. Nichols and Wahlen (2004) replicated the Ball and Brown (1968) and Bernard and Thomas (1989, 1990) studies, using a sample for the years 1988 to 2002, and obtained consistent results. A significant amount of research from the 1990s and early 2000s posits that the drift is affected by the extent to which sophisticated investors can limit the mispricing, consistent with a transaction cost explanation for at least part of the persistence of the drift. This “limit to arbitrage” explanation suggests that the largest mispricing occurs in those stocks which are costly to arbitrage. This means that when transaction costs are low, we might see little mispricing because any mispricing is quickly arbitraged away. In contrast, when the transaction costs are high, arbitrageurs abstain from trading until the mispricing becomes large enough to make a profit. Supporting this assertion, Bhushan (1994) finds the drift to be higher for firms with low share prices and low trading volumes, and Bartov et al. (2000) find the drift to be higher for firms with low institutional ownership. Some studies (e.g. Lee, 1992) have examined 7 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 46,
    "chunk_index": 11,
    "word_count": 338,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "this assertion, Bhushan (1994) finds the drift to be higher for firms with low share prices and low trading volumes, and Bartov et al. (2000) find the drift to be higher for firms with low institutional ownership. Some studies (e.g. Lee, 1992) have examined 7 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 46,
    "chunk_index": 12,
    "word_count": 50,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "the trades of different categories of investors around earnings announcements to provide additional evidence of this conjecture. More recently, and consistent with this previous research, Mikhail, Walther, and Willis (2003) find that the PEAD associated with firms with a more experienced analyst following is 18% less than that for firms with a less experienced analyst following. Chordia et al. (2009) find, using a multitude of estimates, that transaction costs account for 70% to 100% of the paper profits from a long-short strategy designed to exploit the earnings momentum anomaly. Contradicting the limits to arbitrage explanation, Brav et al. (2010) provide evidence that abnormal returns to firms with positive earnings surprises are strongest when limits to arbitrage are lowest. They conclude that theories resting on limits to arbitrage are not empirically valid, at least not in all situations. Extending this line of research, Francis et al. (2007), Kimbrough (2005), Mendenhall (2004), Zhang (2006), Garfinkel and Sokobin (2006), and Zhang, Cai and Keasey (2013) argue that information uncertainty is a fundamental contributor to why arbitrage fails to eliminate PEAD. That is, information uncertainty is a primitive variable in explaining why arbitrage could not, indeed should not, instantaneously close the drift. Another explanation that has gained much attention in recent years is investor sentiment (Livnat and Petrovitis (2009), Mian and Sankaraguruswamy (2012)). The underlying proposition is that sentiment at the time of the information release impacts the market reaction at that time, with the PEAD representing the subsequent market correction to the initial mispricing. For example, high uncertainty or low sentiment will result in an initial under-reaction to good news with the subsequent upward drift (i.e. PEAD) representing the market correction to this initial under-reaction. 8 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 46,
    "chunk_index": 13,
    "word_count": 288,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "time, with the PEAD representing the subsequent market correction to the initial mispricing. For example, high uncertainty or low sentiment will result in an initial under-reaction to good news with the subsequent upward drift (i.e. PEAD) representing the market correction to this initial under-reaction. 8 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 46,
    "chunk_index": 14,
    "word_count": 50,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "In summary, there is an extensive PEAD literature, with multiple interpretations which include: (1) investors’ under-reaction to earnings surprises; (2) transaction costs; (3) information uncertainty; and (4) investor sentiment. Interestingly, however, the anomaly remains. In the sections that follow, our objective is to show the reader that if one is to properly test for market inefficiency, the influence of subsequent economic news in a multi-year context should be taken into account. 2.2 Hypothesis Development Previous studies of the PEAD have considered a single earnings announcement (EA – annual/quarterly) and examined the behavior of the cumulative abnormal return (CAR) versus time (months/days) for periods before and after the EA. Typically, the number of months/trading days is 12/60 before and up to 12/60 after for annual/quarterly EAs3. For annual EAs, CAR is calculated for each of the 12 months in the year preceding the EAs at year end and the months after the EAs. These calculations are done independently of the subsequent classification of firms as good news (GN) or bad news (BN) based on the sign of the unexpected earnings (UE) calculated at the time of the annual earnings release. Average CARs for each month are then calculated for the firms in each of the GN and BN classifications and used to prepare a plot of CAR versus months from 12 months before the EAs to typically 6 months after the EAs. The finding of positive/negative slopes for a plot of CAR versus month during the 12 months before the EA for GN/BN firms can be explained, at least in part, as the effect of economic information during the year, which affects the market price of the shares of the firm. This economic information also affects the operational results of the firm, which are reflected in the end of year accounting earnings, and so the UE used to classify the firms as GN or BN. The 3 The length of time after the EA should be noted. 9 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 46,
    "chunk_index": 15,
    "word_count": 332,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "information also affects the operational results of the firm, which are reflected in the end of year accounting earnings, and so the UE used to classify the firms as GN or BN. The 3 The length of time after the EA should be noted. 9 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 46,
    "chunk_index": 16,
    "word_count": 50,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "continuing slope of the CAR observed in the months after the EA constitutes the PEAD and the standard interpretation is that not all information in the EA has been incorporated into price, and so return, at the date of the EA. There is an important point that is repeated here as it is fundamental for the hypothesis developed below. The UEs used to classify the CARs (beginning at time t-12 months) in the original study by Ball and Brown (1968) and in this study are not known at the time that the CARs start to accumulate and so cannot cause the CARs. But, clearly something causes changes in share prices. During the post earnings announcement period, there may be an effect of incomplete incorporation of the information in the UE. We hypothesize that there is also an effect of new economic information. The effect of new economic information on share price and changes in expectations of earnings is seen commonly in the financial press. A very significant current example is the impact of the spread of the coronavirus (COVID-19) on share price and earnings expectations. Clearly, share price and earnings are both affected by the new economic information. This leads us to use UE in the EAs as a proxy for the new economic information. We do not assert that there is no delayed reaction to the EA, i.e. market inefficiency. But, other economic information arising during the subsequent period must also have an effect.4 We refer to the causal factor not in terms of specific events but rather as economic information during the period. Our assertion that the economic information causing the CARs also impacts 4 This assertion is consistent with the notion made by Ball (2013, p. 848) that “there is abundant evidence that accounting reports do not provide a relatively large proportion of the new information used by the equity market.” In this paper, Ball emphasizes the feedback role of accounting, useful in contractual arrangements between parties i.e. licensing, debt, compensation. 10 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 46,
    "chunk_index": 17,
    "word_count": 340,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "that “there is abundant evidence that accounting reports do not provide a relatively large proportion of the new information used by the equity market.” In this paper, Ball emphasizes the feedback role of accounting, useful in contractual arrangements between parties i.e. licensing, debt, compensation. 10 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 46,
    "chunk_index": 18,
    "word_count": 50,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "the firms’ performance as reflected in accounting earnings seems reasonable.5 We argue that, over the relatively long period for which the PEAD has been reported (typically at least 6 months for annual EA and 60 trading days for quarterly EA), the effect of the EA used in previous PEAD studies does not dominate the effect of new economic information during the subsequent time period. We use UE at the end of a period as a proxy to incorporate the effect of new economic information during the period. This approach is consistent with examining the pre- earnings announcement effect suggested by Rendleman, Jones and Latane (1987). In our analysis and discussion, we consider annual EAs and monthly CARs. We summarize a typical past analysis schematically in Figure 3. (Note that the slopes of the plots of CAR versus month in the year after the EA are exaggerated.) The fact that the observed slopes after the EA (solid lines) are not zero (dotted lines) is interpreted as being the result of market inefficiency. We feel that the simple model underlying Figure 3 is incomplete. Our hypothesis is that the observed behavior of CAR in year two after the EA at the end of year one (solid lines in Figure 3) reflects, to at least some extent, economic information observed in year two (i.e. after the EA at the end of year one) that is ultimately reflected in the EA at the end of year two. Thus, a formal statement of our hypothesis is: Hypothesis: The slope of the plot of CAR versus time observed after an earnings release is related to economic information subsequent to the earnings announcement. That is, the slope of the plot of CAR versus time after a GN/BN earnings announcement is associated with the GN/BN earnings announcement in the subsequent period. More formally: 5 In fact, Ball and Brown (2014) demonstrate that earnings per share captures about 50% of the market-adjusted pricing effects of all information revealed over the 12 months leading up to the release of the annual income number. 11 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 46,
    "chunk_index": 19,
    "word_count": 349,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "in the subsequent period. More formally: 5 In fact, Ball and Brown (2014) demonstrate that earnings per share captures about 50% of the market-adjusted pricing effects of all information revealed over the 12 months leading up to the release of the annual income number. 11 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 46,
    "chunk_index": 20,
    "word_count": 50,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "H : slope = 0 for GNGN, GNBN, BNGN, BNBN UE 0 H : slope > 0 for GNGN, BNGN UE and slope < 0 for GNBN, BNBN a UE Note that this hypothesis does not imply that the drift is entirely due to the subsequent economic information. This hypothesis is to be tested by a formal statistical test as well as by examination of a graphical representation of the data as was done in Ball and Brown (1968). To repeat, we make the fundamental but reasonable assumption that the price change of a firm’s shares during a year is, to a significant extent, due to economic information during the year, which impacts the performance of the firm and its reported earnings, which in turn affects the end of year UE. Obviously, the UE at the end of year two can be GN or BN, regardless of whether the UE at the end of year one is GN or BN. Therefore, we implement our analysis by using the UE at the end of year two to further classify the GN and BN firms as GNGN or GNBN and BNGN or BNBN in order to prepare the plots of CAR versus month in year two (see Figure 4). This procedure is analogous to that used in prior research but in a two period setting. That is, the UE for year two reflects the economic information observed during year two that is incorporated into share price during year two in the same way that the UE for year one reflects the economic information observed during year one that is incorporated into share price during year one. Given the classification as GN or BN in year one, there are four classifications of firms in year two, specifically GNGN, GNBN, BNGN and BNBN. Consider the model in Figure 4, which shows schematically a plot of CAR versus month for two years. The behavior of CAR versus month in year one reflects the behavior reported in past studies, with separate lines for the firms classified as GN and BN depending upon the sign of the UE at the end of year one. This 12 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 46,
    "chunk_index": 21,
    "word_count": 364,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "for two years. The behavior of CAR versus month in year one reflects the behavior reported in past studies, with separate lines for the firms classified as GN and BN depending upon the sign of the UE at the end of year one. This 12 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 46,
    "chunk_index": 22,
    "word_count": 50,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "traditional graphical reporting is extended by recognizing that, at the end of year two, the GN firms of year one will have either positive or negative UEs, i.e. will be classified as GN or BN at the end of year two, depending upon the sign of the UE then. These are designated as GNGN and GNBN. In the same way, the BN firms at the end of year one will have GN or BN at the end of year two, depending upon the sign of the UE then, and are designated as BNGN and BNBN at the end of year two. This simple extension of the traditional graphical reporting gives rise to four plots of CAR versus month (solid lines) in year two. In a later part of this paper, we extend this approach to year three by using the UE at the end of year three in the same way. If the simple classification of firms as GN or BN based only upon the UE at the end of year one is continued into year two, then there will be a single line of CAR versus month observed in year two for each of these GN and BN firm groups. It is the slopes of these two lines that have been the focus of prior PEAD studies. The observed slope of the CAR versus month plot in year two for the GN firms will be a weighted average of the CAR slopes for the GNGN and GNBN lines illustrated in Figure 4. Similarly, the observed slope of this CAR versus month plot for the BN firms will be a weighted average of the CAR slopes for the BNGN and BNBN firms. The dotted lines in Figure 4 show these weighted averages, which are drawn with slopes of zero for convenience of exposition. III. SAMPLE SELECTION AND VARIABLES 3.1 Sample Selection We obtain our data from the annual Compustat and monthly CRSP data files available on WRDS. We limit our analysis to those firms with a December 31 year end to be consistent with previous studies used for comparison in later parts of this paper. We obtain earnings information from Compustat (annual earnings per share, excluding extraordinary items) and monthly return 13 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 46,
    "chunk_index": 23,
    "word_count": 377,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "We limit our analysis to those firms with a December 31 year end to be consistent with previous studies used for comparison in later parts of this paper. We obtain earnings information from Compustat (annual earnings per share, excluding extraordinary items) and monthly return 13 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 46,
    "chunk_index": 24,
    "word_count": 50,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "measures from CRSP (raw returns and value-weighted index returns for NYSE/AMEX/Nasdaq indices including all distributions). We exclude extraordinary items from our definition of earnings as prior studies have shown that investors and analysts do not include special items when they form their earnings expectations (Jegadeesh and Livnat, 2006). Inclusion of the special items, therefore, would introduce noise in the estimates of unexpected earnings. Our initial analysis is for a sample of firms in the period 1988 to 2002. We chose this period so that we could compare our results with those of Nichols and Wahlen (2004) as a check on the reasonableness of our results. We extend our analysis subsequently to samples for the periods 1974 to 1987 and 2003 to 2016. We do this in order to investigate whether our initial results are consistent over time and to see whether there are any effects due to changing GAAP, the increasing presence of analyst forecasts, etc. over the years. We merge the data from Compustat and CRSP to create data sets for the three periods: 1974 to 1987, 1988 to 2002 and 2003 to 2016. The numbers of firms in the three merged data sets are 3,671, 4,104 and 5,871, respectively. Within each period, the number of firm years for years two and three are lower than for year one because of first differencing and the increased number of categories – two in year one, four in year two and eight in year three.6 3.2 Methodology We calculate unexpected earnings (UE) by a simple random walk model. Our use of a simple random walk model is consistent with Bradshaw et al. (2012), who confirmed that random walk EPS forecasts are more accurate than analysts’ forecasts over long horizons and comparable with analysts’ forecasts over shorter time horizons. As in past studies, we classify 6 There is also survivorship bias, which reduces the sample size in years 2 and 3. However, Foster, Olsen and Shevlin (1984) showed that the post-announcement drift is not sensitive to this form of bias. 14 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 46,
    "chunk_index": 25,
    "word_count": 344,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "shorter time horizons. As in past studies, we classify 6 There is also survivorship bias, which reduces the sample size in years 2 and 3. However, Foster, Olsen and Shevlin (1984) showed that the post-announcement drift is not sensitive to this form of bias. 14 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 46,
    "chunk_index": 26,
    "word_count": 50,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "firms as GN if UE >= 0 and BN if UE < 0 in each year, where UE is defined as current year earnings less prior year earnings. Abnormal return (AR) is defined as the difference between raw returns and value-weighted index returns.7 We use these simple methods of estimation because the objective here is not to find subtle effects but rather to see whether the data is consistent with our hypothesis and so is an explanation of at least part of the PEAD. As explained above, we classify firms that are GN in year one as either GNGN or GNBN in year two and those that are BN in year one as BNGN or BNBN in year two, depending upon the sign of the UE in year two. As noted earlier, UE is a proxy for the accumulated effect of economic information of the period that leads to a change in share price during the year. In order to extend our analysis into a third year, we further classify firms as GNGNGN, GNGNBN, etc. in year three depending upon the sign of UE in year three. (Please refer to Figure 5 for details.) With this classification, we can select subsets of firms that are homogeneous as to the sequence of UEs in the three years. For each subsample of firms i.e. GN and BN for year 1, GNGN, GNBN, BNGN and BNBN for year 2, and GNGNGN, GNGNBN, GNBNGN, GNBNBN, BNGNGN, BNGNBN, BNBNGN and BNBNBN for year 3, we use the values of AR to calculate CAR for each firm over the 12 months of each year. For each classification of each sub-sample, we calculate the average CARs for each month in each year. We use these average values to prepare plots of CAR versus month for the 36 months. We also use these average CARs to calculate the slopes of the CAR versus month plots for each classification for the three 12 month periods. This 7 Other PEAD papers have used a variety of methods to estimate expected returns, including equally weighted market index returns, equally weighted mean return on the index firm size decile, 3 factor model returns, and 4 factor model returns as well as analyst forecasts. Study results are generally insensitive to the use of alternative model specifications. 15 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 46,
    "chunk_index": 27,
    "word_count": 389,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "expected returns, including equally weighted market index returns, equally weighted mean return on the index firm size decile, 3 factor model returns, and 4 factor model returns as well as analyst forecasts. Study results are generally insensitive to the use of alternative model specifications. 15 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 46,
    "chunk_index": 28,
    "word_count": 50,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "results in 14 calculated slopes (2 for year 1, 4 for year 2, 8 for year 3) for each of the 1974 to 1987, 1988 to 2002 and 2003 to 2016 samples. It is important to note that our calculation of CAR starts at the beginning of each firm’s fiscal year.8 The choice of this methodology is to better match the accumulation of economic news for a given year (i.e. stock returns) with the accounting earnings for that year. Many researchers have shown that their PEAD results are relatively insensitive to the CAR calculation start date (e.g. Rendleman, Jones and Latane 1987). IV. RESULTS 4.1 1988 to 2002 Period 4.1.1 Examination of Hypothesis Our first analysis is for the 1988 to 2002 sample. We show in Figure 6 a plot of the cumulative CARs versus month over 36 months for the classifications in Figure 5. This plot shows a branching from 2 to 4 to 8 lines over the 36 months of the three year period.9 In each of the 3 years, end of year GN EAs are preceded by a CAR with a positive slope whereas end of year BN EAs are preceded by a CAR with a negative slope. This plot shows clearly that the behavior of the cumulative CAR plots is consistent with our hypothesis. The behavior seen in Figure 6 is consistent with our hypothesis. We calculate the slopes for each 12 month period of the 14 classifications in Figure 5 and report the values of the slope, p-values, and adjusted R squared plus the number of observations for each of the 14 calculations 8 We repeat our analyses using CAR calculations for periods of 11 months (one month time delay after year-end) and for periods of 10 months (two month time delay after year-end). These analyses are performed to recognize the fact that there is a time delay between a firm’s year-end and the EA date. Our results are robust to these alternative model specifications. 9 This plot exemplifies the following quotation from John W. Tukey, who is considered the father of exploratory data analysis. “The greatest value of a picture is when it forces us to notice what we never expected to see.” 16 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 46,
    "chunk_index": 29,
    "word_count": 375,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "to these alternative model specifications. 9 This plot exemplifies the following quotation from John W. Tukey, who is considered the father of exploratory data analysis. “The greatest value of a picture is when it forces us to notice what we never expected to see.” 16 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 46,
    "chunk_index": 30,
    "word_count": 50,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "in Figure 710. All slopes are positive after GN UE and negative after BN UE and all p-values are less than 0.01. Thus, we reject the null hypothesis. All the slopes (CAR per month) are close to 0.01 in absolute magnitude. The adjusted R-squared values for the calculations are all quite high, with eleven of the 14 being above 0.9 and the remaining three being between 0.8 and 0.9. This very high consistency of results supports rejection of the null hypothesis. . The above results are consistent with our hypothesis that the CARs in each year are related to economic information during the year, proxied here by the UE at the end of the year. This is not to say that there is no delayed reaction to the UE at the beginning of the year, i.e. the traditional explanation of the PEAD first observed by Ball and Brown (1968). 4.1.2 Further Consideration of the CARs in a Period For purposes of our next analysis, we present in Figure 8 the plot of CAR versus month for months 1-24. This Figure shows the doubling of lines for CAR in months 13-24 for each of the GN and BN UE at the end of year 1 seen in Figure 6. (Ignore for the moment the two lines labelled “WA line”.) Recall that the doubling is a result of classifying the extensions of both the GN and BN lines in months 1-12 into months 13-24 using the UE at the end of the second year, resulting in GNGN, GNBN, BNGB and BNBN lines. It is clear that if the additional classifications were not used, then only two lines, one for the GN and one for the BN of year 1, would be seen in year 2. A logical question is how these hypothesized lines would appear. To pursue this, we calculate the weighted average of the 10 The results for the 3 samples (1974 to 1987, 1988 to 2002 and 2003 to 2016) are given in Figure 7. The results for the 1988 to 2002 sample are in the middle columns. 17 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 46,
    "chunk_index": 31,
    "word_count": 354,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "pursue this, we calculate the weighted average of the 10 The results for the 3 samples (1974 to 1987, 1988 to 2002 and 2003 to 2016) are given in Figure 7. The results for the 1988 to 2002 sample are in the middle columns. 17 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 46,
    "chunk_index": 32,
    "word_count": 50,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "CARs for the GNGN and GNBN and for the BNGN and BNBN classifications 11 using the slopes calculated above and the number of firms in each category. We plot these results for months 13-24 to give the lines labelled “WA line” in Figure 8. This figure shows that there is a drift of these lines with positive and negative slopes consistent with the observations in Ball and Brown (1968) and later studies. To pursue this analysis more rigorously, we determine the slopes of the two weighted average CAR lines of the GNGN and GNBN observations and of the BNGN and BNBN observations by simple linear regression, and report them, together with the t statistics and p- values, in Table 2. The former slope estimate is positive (0.00260) and the latter slope estimate is negative (-0.00119), i.e positive and negative as observed by Ball and Brown (1968), with p- values of 0.024 and 0.082, respectively. These results are compared in Table 2 to those calculated by simple linear regression from the data of Nichols and Wahlen,12 which were calculated in the traditional way. The quite reasonable consistency of the results provides support for our explanation of the results found by Ball and Brown (1968) as a simplification of analysis. Differences are likely due to some extent to the fact Nichols and Wahlen (2004) used a slightly different sample and a more complicated model to calculate AR.13 11 If the probability of GN in year 2 following GN in year 1 is P , then the slope of the GN drift in year 2 is 1 P *S + (1 – P )*S , where S is the slope of the indicated line. (see Figure 4) The slope of the BN drift is 1 GNGN 1 GNBN calculated in the same way, using P , the probability of GN following BN. 2 12 The values obtained for the 1974-1987 and 2003-2016 samples, discussed below, are also given in Table 3. The results for the years 1988-2002 are consistent with those calculated from the data of Nichols and Wahlen, although it should be noted that the significance of the results is lower. The lower significance may be due to: 1) the number of months used in the calculation; 2) the timing as to when the earnings announcement was released; and 3) the use of a different earnings expectation model. 13 Results for the 1974-1987 and 2003-2016 samples, discussed below, are also calculated. In all cases, there is a consistency of results. 18 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 46,
    "chunk_index": 33,
    "word_count": 424,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "calculation; 2) the timing as to when the earnings announcement was released; and 3) the use of a different earnings expectation model. 13 Results for the 1974-1987 and 2003-2016 samples, discussed below, are also calculated. In all cases, there is a consistency of results. 18 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 46,
    "chunk_index": 34,
    "word_count": 50,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "Next, we extend our analysis to months 25-36. Specifically, we determine the slopes of the weighted average CARs of the GNGNGN and GNGNBN samples (denoted as GNGN PEAD), the GNBNGN and GNBNBN samples (denoted as GNBN PEAD), the BNGNGN and BNGNBN samples (denoted as BNGN PEAD), and the BNBNGN and BNBNBN samples (denoted as BNBN PEAD). We plot the CAR versus month lines, including these weighted averages, in Figure 8. The slopes of the weighted average lines are 0.00273 (p-value 0.021), 0.00140 (p-value 0.070), 0.00470 (p-value 0.001) and -0.00122 (p-value 0.0097) respectively, as summarized in Table 3. These are supportive of our conclusions. We use the actual numbers of GN and BN observations (e.g. GN/BN in year one, GNGN/GNBN, etc. in year two and GNGNGN/GNGNBN etc. in year three) from Figure 5 to calculate the proportions of GN and BN observations for the various possibilities. We report these values in Figure 10 (middle columns). Interestingly, these results show that the probability of GN generally dominates the probability of BN and that this is particularly true following a previous BN EA. This seems intuitively reasonable. 4.2 2003 to 2016 Period We repeat the calculation of the slopes for the 14 classifications for the 2003 to 2016 sample and report the results in Figure 7 (right hand columns). The results are consistent with those previously reported for the 1988 to 2002 sample. That is, all the slopes have the expected positive and negative signs, are in the order of 0.01 in absolute magnitude, and are similar in magnitude to those for the 1988 to 2002 sample. The adjusted R squared values are quite good with eleven greater than 0.9 and three between 0.8 and 0.9. The weighted average slopes in Figure 7, calculated as described above, have the correct sign. Figure 11 shows the plot of CAR versus month, including the “WA lines”, for months 1-36. As for the 1988 to 2002 period, the 19 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 46,
    "chunk_index": 35,
    "word_count": 328,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "three between 0.8 and 0.9. The weighted average slopes in Figure 7, calculated as described above, have the correct sign. Figure 11 shows the plot of CAR versus month, including the “WA lines”, for months 1-36. As for the 1988 to 2002 period, the 19 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 46,
    "chunk_index": 36,
    "word_count": 50,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "cumulative CARs are behaving in the way that we hypothesize. The “post-earnings announcement drift” here appears to be insignificant, which is confirmed by the calculated slopes in Table 2 in Figure 7. Figure 10 (right hand columns) reports the proportions of GN and BN observations for the various possibilities. These results are consistent with those observed for the 1988 to 2002 sample period. 4.3 1974 to 1987 Period The results for the 1974 to 1987 sample period, also reported in Figure 7 (left hand columns) are more mixed. All have the expected sign and all but one of the slopes is in the range of 0.01 in absolute magnitude. The adjusted R squared values vary, with five above 0.9, two between 0.8 and 0.9, four between 0.7 and 0.8, one between 0.6 and 0.7 and two between 0.3 and 0.4. Possible explanations for these less significant results in this earlier time period may be due to a smaller sample size, variations in GAAP, and less accurate and complete data as this was early days in the large scale collection of data in electronic format. Figure 12 shows this same data over months 1-36. There is evidence of a PEAD as seen for the 1988 to 2002 sample. This observation is confirmed by the calculated slopes reported in Table 2, as well as Figure 7. Figure 10 (left hand columns) reports the proportions of GN and BN observations for the various combinations and these results are consistent with those for the 1988 to 2002 and 2003 to 2016 sample periods. Closer examination of the results in Figure 10 shows a consistency of results after each of the three EAs. The proportion of GN events is always greater than the proportion of BN events. This is consistent with management’s preference for GN. Another interesting qualitative observation, consistent with expected behavior, is that the proportion of GN is higher after a BN event and particularly so after subsequent BN events. 20 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 46,
    "chunk_index": 37,
    "word_count": 333,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "is always greater than the proportion of BN events. This is consistent with management’s preference for GN. Another interesting qualitative observation, consistent with expected behavior, is that the proportion of GN is higher after a BN event and particularly so after subsequent BN events. 20 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 46,
    "chunk_index": 38,
    "word_count": 50,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "Using annual earnings data and monthly stock return data, we show that, in an analysis of CAR versus time, a multi-year approach provides new insights in the study of the PEAD. This simple extension incorporates the market reaction to new economic information (proxied by the subsequent UE, i.e. the pre-announcement effect proposed by Rendleman, Jones and Latane (1987)), in addition to reaction to old news (the UE considered in earlier studies of the PEAD). We show that a drift of a plot of CAR versus month after GN/BN UEs (PEAD) follows naturally from the slopes of the GNGN/GNBN and BNGN/BNBN plots and the relative numbers of firms in each classification after the initial UEs. The actual values of the drift depend upon the number of firms and the average market reaction in each classification after the UE. It seems clear that small changes in the average market reaction and the relative number of firms in each EA category could have a marked influence on the observed PEAD. There could also be an effect due to changes in the quality of reported earnings caused by changes in GAAP and audit requirements over time. Overall, our analyses for all three periods reveal that much if not all of the observed stock price movement after an earnings release can be explained by the economic information subsequent to the EA, consistent with our hypothesis. While most studies to date have limited their analysis to 5 to 10 years of data, we use a large sample of historical data for the years 1974 to 2016. The split into three distinct time periods is beneficial in that it provides more homogeneous samples while still maintaining a large sample size. Second, it provides a basis to examine whether there is a temporal variation in behavior. This is not to say that there is not any effect of incomplete recognition of an EA, i.e. market inefficiency, as hypothesized in the Ball and Brown (1968) and subsequent studies. Our 21 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "V. CONCLUSION",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 46,
    "chunk_index": 39,
    "word_count": 336,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "V. CONCLUSION (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "a basis to examine whether there is a temporal variation in behavior. This is not to say that there is not any effect of incomplete recognition of an EA, i.e. market inefficiency, as hypothesized in the Ball and Brown (1968) and subsequent studies. Our 21 Electronic copy available at: https://ssrn.com/abstract=3360686 analysis does not allow such an inference. Rather, in order to study whether there is market inefficiency, it is necessary to parcel out the portion of the drift identified here. We have used a simple model with the subsequent unexpected earnings as a proxy for the effect of new economic information to show that our hypothesis explains at least part of the observed PEAD. Future research would require use of quarterly EAs and daily share prices to focus more closely on a delayed reaction to EAs. It would also be necessary to employ a more sophisticated model to segregate the effect of subsequent economic information from delayed reaction to an EA. This would allow a clearer determination of the role of market inefficiency. We suggest a possible general approach in the Appendix, but detailed analysis is beyond the scope of the current research. 22 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "V. CONCLUSION",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 46,
    "chunk_index": 40,
    "word_count": 199,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "V. CONCLUSION (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "the effect of subsequent economic information from delayed reaction to an EA. This would allow a clearer determination of the role of market inefficiency. We suggest a possible general approach in the Appendix, but detailed analysis is beyond the scope of the current research. 22 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "APPENDIX",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 46,
    "chunk_index": 41,
    "word_count": 50,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "APPENDIX (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "Our study suggests that a careful examination of whether the PEAD has a component due to delayed reaction to the EAs, i.e. market inefficiency, should take into account the effect of new economic information subsequent to the EA. A possible approach to do this is as follows. Many studies, including this one, have shown that a PEAD occurs over a considerable time frame: 6 - 12 months for annual earnings and monthly share price data and 60 days for quarterly earnings and daily share price data. It seems likely that any delayed reaction to EAs would be concentrated in a period shortly after the EA. Therefore, quarterly earnings, the date of the earnings release, and daily share price data are required for an appropriate analysis. Most quarterly/daily studies have broken the CAR into deciles, probably because of the large amount of data available and the desire to show the detailed behavior of the effect. A simple dichotomous breakdown would seem adequate for the suggestion we make below. Based upon our findings presented above, we suggest using the subsequent EA as a proxy for the new economic information during the subsequent quarter. We suggest that the data set be subdivided into a training sample and a test sample, as is common in many analyses14. The training sample would be examined over the full 60 trading days of the quarter after the EA in order to obtain a measure of the effect of new economic information during the quarter. The test sample would be examined over a shorter period of say 14 The “training” and “testing” commands within R can be used to readily implement this suggested approach. The percentages of observations typically allocated to the training/testing subsamples are 80%/20% or 75%/25%. 23 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "APPENDIX",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 46,
    "chunk_index": 42,
    "word_count": 296,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "APPENDIX (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "quarter. The test sample would be examined over a shorter period of say 14 The “training” and “testing” commands within R can be used to readily implement this suggested approach. The percentages of observations typically allocated to the training/testing subsamples are 80%/20% or 75%/25%. 23 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "APPENDIX",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 46,
    "chunk_index": 43,
    "word_count": 50,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "APPENDIX (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "20 days15 after the EA to test whether there is a residual PEAD after accounting for the effect of new economic information. The suggested method of analysis is outlined below. In our model, there are four possible branches after the initial EA, namely good news/good news (GNGN), good news/bad news (GNBN), bad news/good news (BNGN) and bad news/bad news (BNBN). We use the good news/good news (GNGN) branch for illustration below. Figure 13 illustrates the hypothesized GNGN behavior. Panel A shows the aggregate effect of the hypothesized market reaction to PEAD and new economic news. Panel B shows the hypothesized stock market reaction to new economic news during the quarter, as proxied by the subsequent quarter’s EA. Panel C shows the hypothesized PEAD, concentrated around the first 20 days after the current quarter EA. It is important to note that Figure 13 is for graphical illustrative purposes only; it may not represent the actual market reaction. The analyses proposed below provide the actual calculations. The data for the training sample subsequent to the EA is analyzed using the following model to determine the coefficients A and B for the training sample. GG GG CAR = A + B * d GG GG GG where CAR is the observed CAR subsequent to the EA for the training sample GG d is the day number subsequent to the initial EA and 1 <= d <= 60 15 Prior research shows that the magnitude of the drift is most pronounced in the first few days after the EA. We somewhat arbitrarily suggest 20 days as a first attempt. Sensitivity analyses, using different test periods, should be considered. 24 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "APPENDIX",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 46,
    "chunk_index": 44,
    "word_count": 280,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "APPENDIX (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "<= d <= 60 15 Prior research shows that the magnitude of the drift is most pronounced in the first few days after the EA. We somewhat arbitrarily suggest 20 days as a first attempt. Sensitivity analyses, using different test periods, should be considered. 24 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "APPENDIX",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 46,
    "chunk_index": 45,
    "word_count": 50,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "APPENDIX (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "B is the average effect of GN over the quarter (1<=d<= 60), and is determined primarily by GG new news.16 We expect that B will be greater than zero consistent with the findings reported in GG the body of the paper.17 Next, the data for the test sample is analyzed as follows to determine A’ and B’ , the GG GG coefficients for the test sample. CAR’ – [A + B * d] = A’ + B’ * d18 GG GG GG GG GG where CAR’ is the observed CAR subsequent to the current quarter EA for the test GG sample A is the calculated intercept from the training sample regression noted above GG B is the calculated slope from the training sample regression noted above GG d is the day number subsequent to the current quarter EA and 1 <= d <= 2019 The hypothesis to test the findings is: H : B’ = 0 0 GG H : B’ /= 0 a GG 16 As a robustness check, B could also be measured as the average effect of GN over a smaller number of days GG (21<=d<= 60), to avoid the potential “contamination” associated with the effect of both PEAD and new news for days 1<=d<=20. 17 One A (intercept) and one B (slope) is calculated for the cumulative 60 day period. The implied assumption GG GG is that economic news is cumulative and disseminated equally throughout the 60 day period. While this will not hold for individual securities, it is a reasonable assumption for a large sample of firms, as is the case with our training sample. 18 The implicit assumption here is that the training sample and the test sample are, on average, subject to the same economic events. Since R randomly assigns observations to the training and test sample, this is a reasonable assumption; assuming a sufficiently large sample size. 19 One A’ (intercept) and one B’ (slope) is calculated for the cumulative 20 day period. GG GG 25 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "APPENDIX",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 46,
    "chunk_index": 46,
    "word_count": 339,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "APPENDIX (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "the same economic events. Since R randomly assigns observations to the training and test sample, this is a reasonable assumption; assuming a sufficiently large sample size. 19 One A’ (intercept) and one B’ (slope) is calculated for the cumulative 20 day period. GG GG 25 Electronic copy available at: https://ssrn.com/abstract=3360686 Rejection or not of H would lead to a conclusion about the delayed reaction to the initial 0 (current quarter) EA. More specifically, rejection of the null hypothesis would support the existence of a delayed reaction to the initial earnings announcement, i.e. a true PEAD.20 The same analyses would be done for the GNBN, BNGN and BNBN data sets. Figure 14 presents the illustrative graphs for the GNBN scenario. 20 Bootstrapping is an alternative technique that could be used to test the robustness of the results. 26 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "APPENDIX",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 46,
    "chunk_index": 47,
    "word_count": 142,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "APPENDIX (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "a true PEAD.20 The same analyses would be done for the GNBN, BNGN and BNBN data sets. Figure 14 presents the illustrative graphs for the GNBN scenario. 20 Bootstrapping is an alternative technique that could be used to test the robustness of the results. 26 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "REFERENCES",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 46,
    "chunk_index": 48,
    "word_count": 50,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "Ball, R., and P. Brown. 1968. An Empirical Evaluation of Accounting Income Numbers. Journal of Accounting Research, Autumn: 159-178. Ball, R. 1992. The earnings-price anomaly. Journal of Accounting and Economics, 15: 319-345. Ball, R. 2013. Accounting Informs Investors and Earnings Management is Rife: Two Questionable Beliefs. Accounting Horizons, Vol. 27, No. 4: 847-853. Ball, R., and P. Brown. 2014. Ball and Brown (1968): A Retrospective. The Accounting Review, 89(1): 1-26. Bartov, E., Krinsky, I., and S. Radhakrishnan. 2000. Investor sophistication and patterns in stock returns after earnings announcements. The Accounting Review, 75: 43–63. Basu, S. 1997. Conservatism and the Asymmetric Timeliness of Earnings. Journal of Accounting & Economics, 24: 3–37. Bernard, V., and J.Thomas.1989. Post-Earnings Announcement Drift: Delayed Price Response or Risk Premium. Journal of Accounting Research, 27 (Suppl.): 1-36. Bernard, V., and J. Thomas. 1990. Evidence that Stock Prices Do Not Fully Reflect the Implications of Current Earnings for Future Earnings. Journal of Accounting and Economics, 13: 105-340. Bernard, V., Thomas, J., and J. Wahlen. 1997. Accounting-Based Stock Price Anomalies: Separating Market Inefficiencies from Risk. Contemporary Accounting Research, 14(2): 89-136. Bhushan, R. 1994. An Informational Efficiency Perspective on the Post-Earnings Announcement Drift. Journal of Accounting and Economics, 18: 45-65. Bradshaw, M., M. Drake, J. Myers, and L. Myers. 2012. A Re-examination of Analysts’ Superiority over Time-Series Forecasts of Annual Earnings. Review of Accounting Studies, 17(4): 944-968. Brav, A., Heaton, J., and S. Li. 2010. The Limits of the Limits of Arbitrage. Review of Finance, 14(1):157-187. Chordia, T., Goyal, A., Sadka, G., and L. Shivakumar. 2009. Liquidity and the Post-Earnings- Announcement Drift. Financial Analysts Journal, 65(4): 18-32. Fama, E. 1998. Market Efficiency, Long-Term Returns and Behavioral Finance. Journal of Financial Economics, 49(3): 283-306. Foster, G., Olsen, C., and T. Shevlin. 1984. Earnings Releases, Anomalies and the Behavior of Security Returns. The Accounting Review, LIX(4): 574-603. Francis, J., Lafond, R., Olsson, P., and K. Schipper. 2007. Information Uncertainty and Post- Earnings-Announcement-Drift. Journal of Business Finance & Accounting, 34(3): 403- 433. 27 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "REFERENCES",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 46,
    "chunk_index": 49,
    "word_count": 335,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "Olsen, C., and T. Shevlin. 1984. Earnings Releases, Anomalies and the Behavior of Security Returns. The Accounting Review, LIX(4): 574-603. Francis, J., Lafond, R., Olsson, P., and K. Schipper. 2007. Information Uncertainty and Post- Earnings-Announcement-Drift. Journal of Business Finance & Accounting, 34(3): 403- 433. 27 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "REFERENCES",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 46,
    "chunk_index": 50,
    "word_count": 50,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "Garfinkel, J., and J. Sokobin. 2006. Volume, Opinion Divergence, and Returns: A Study of Post- Earnings Announcement Drift. Journal of Accounting Research, 44(1): 85-112. Kimbrough, M. 2005. The effect of conference calls on analyst and market under-reaction to earnings announcements. The Accounting Review, 80: 189–219. Kothari, S. 2001. Capital research and research in accounting. Journal of Accounting and Economics, 31: 105-231. Lee, C. 1992. Earnings News and Small Traders, An Intraday Analysis. Journal of Accounting and Economics, 15: 265–302. Livnat, J., and C. Petrovits. 2009. Investor Sentiment, Post-Earnings Announcement Drift, and Accruals. AAA 2009 Financial Accounting and Reporting Section (FARS) Paper. Available at SSRN: https://ssrn.com/abstract=1262757 or http://dx.doi.org/10.2139/ssrn.1262757 Mendenhall, R. 2004. Arbitrage Risk and Post-Earnings-Announcement Drift. The Journal of Business, 77(4): 875-894. Mian, M., and S. Sankaraguruswamy. 2012. Investor Sentiment and Stock Market Response to Earnings News. The Accounting Review, 87(4): 1357-1384. Mikhail, M., Walther, B., and R. Willis. 2003. Security Analyst Experience and Post-Earnings- Announcement Drift. Journal of Accounting, Auditing and Finance, 18(4): 529-550. Nichols, D., and J. Wahlen. 2004. How Do Earnings Numbers Relate to Stock Returns A Review of Classic Accounting Research with Updated Evidence. Accounting Horizons, 18(4): 263-286. Rendleman, R., Jones, C., and H. Latane. 1982. Empirical anomalies based on unexpected earnings and the importance of risk adjustments. Journal of Financial Economics, 10: 269-287. Rendleman, R., Jones, C., and H. Latane. 1987. Further insight into the standardized unexpected earnings anomaly: Size and serial correlation effects. The Financial Review, 22:131-144. Smith Bamber, L., T. Christensen, and K. Gaver. 2000. Do we really “know” what we think we know? A case study of seminal research and its subsequent overgeneralization. Accounting, Organizations and Society, 25(2): 103-129. Zhang, Q., Cai, C., and K. Keasey. 2013. Market reaction to earnings news: A unified test of information risk and transaction costs. Journal of Accounting and Economics, 56: 251- 266. Zhang, X. 2006. Information uncertainty and stock returns. Journal of Finance, 61: 105-136. Zhou, H., and J. Zhu. 2012. Jump on the Post-Earnings Announcement Drift. Financial Analysts Journal, 68(3): 63-80. 28 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "REFERENCES",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 46,
    "chunk_index": 51,
    "word_count": 342,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "of information risk and transaction costs. Journal of Accounting and Economics, 56: 251- 266. Zhang, X. 2006. Information uncertainty and stock returns. Journal of Finance, 61: 105-136. Zhou, H., and J. Zhu. 2012. Jump on the Post-Earnings Announcement Drift. Financial Analysts Journal, 68(3): 63-80. 28 Electronic copy available at: https://ssrn.com/abstract=3360686 Table 1 - List of Abbreviations Abbreviation Meaning AR Abnormal return = actual return – expected return BN Bad news, when UE < 0 CAR Cumulative abnormal return EA Earnings announcement GN Good news, when UE >= 0 SUE Standardized unexpected earnings = UE/standardizing factor UE Unexpected earnings WA Weighted average 29 Electronic copy available at: https://ssrn.com/abstract=3360686 Table 2 - Comparison of Results post-EA for Nichols & Wahlen (2004) and Our Sample Nichols & Our Sample Our Sample Our Sample Wahlen 1988 – 2003 1974 - 1987 1988 - 2002 2003 - 2016 MONTHS 13 - 18 13 - 24 13 - 24 13 - 24 GN slope 0.00571 0.00263 0.00260 0.00025 t statistic 11.30 2.59 2.67 0.45 p-value 0.000 0.027 0.024 0.661 BN Slope -0.00191 -0.00335 -0.00119 -0.00008 t statistic -2.57 -3.87 -1.93 -0.12 p-value 0.062 0.003 0.082 0.903 30 Electronic copy available at: https://ssrn.com/abstract=3360686 Table 3 Weighted Average 1974 - 1987 1988 - 2002 2003 - 2016 GNGN/GNBN Slope 0.00263 0.0026 0.00025 T-statistic 2.59 2.67 0.45 P-Value 0.0027 0.024 0.661 BNGN/BNBN Slope -0.00335 -0.00119 -0.00008 T-statistic -3.87 -1.93 -0.12 P-Value 0.003 0.082 0.903 GNGNGN/GNGNBN Slope 0.00509 0.00273 0.0004 T-statistic 5.66 2.73 0.07 P-Value 0 0.021 0.947 GNBNGN/GNBNBN Slope -0.00188 0.0014 0.00002 T-statistic -2.31 2.03 0.05 P-Value 0.04 0.07 0.965 BNGNGN/BNGNBN Slope 0.00207 0.0047 -0.00003 T-statistic 7.84 4.62 0.08 P-Value 0.094 0.001 0.969 BNBNGN/BNBNBN Slope -0.0036 -0.00122 0.00092 T-statistic -3.57 -1.83 0.81 P-Value 0.005 0.097 0.439 31 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "REFERENCES",
    "page_number": 29,
    "page_range": "p.29-31",
    "total_pages": 46,
    "chunk_index": 52,
    "word_count": 293,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES (p.29-31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "0.07 P-Value 0 0.021 0.947 GNBNGN/GNBNBN Slope -0.00188 0.0014 0.00002 T-statistic -2.31 2.03 0.05 P-Value 0.04 0.07 0.965 BNGNGN/BNGNBN Slope 0.00207 0.0047 -0.00003 T-statistic 7.84 4.62 0.08 P-Value 0.094 0.001 0.969 BNBNGN/BNBNBN Slope -0.0036 -0.00122 0.00092 T-statistic -3.57 -1.83 0.81 P-Value 0.005 0.097 0.439 31 Electronic copy available at: https://ssrn.com/abstract=3360686 Figure 1. Ball and Brown (1968) CAR versus Month Plot This figure presents the plot of CAR versus month for firms that were classified as good news or bad news based upon a dichotomous categorization of unexpected earnings for 261 firms over the years 1957 to 1965. Electronic copy available at: https://ssrn.com/abstract=3360686 Figure 2. Foster, Olsen and Shevlin (1984) CAR versus Trading Days Plot This figure presents the plot of CAR versus trading days for firms that were classified as good news or bad news deciles based upon standardized unexpected earnings for the years 1974 to 1981. Electronic copy available at: https://ssrn.com/abstract=3360686 Figure 3. Schematic CAR versus Time Plot for Typical PEAD Analysis This figure presents a schematic CAR versus time plot for a typical post-earnings announcement drift analysis. The slopes of the plots of CAR versus month in the year after the EA have been exaggerated. The observed slopes after the EA (solid lines) have been interpreted as being the result of market inefficiency. The slopes in year 2 are exaggerated for convenience of exposition. EA Year 1 Year 1 Year 2 Observed CAR Expected GN UE >= 0 0 UE0 -12 0 12 MONTH BN UE < 0 Expected Observed Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "REFERENCES",
    "page_number": 32,
    "page_range": "p.32-34",
    "total_pages": 46,
    "chunk_index": 53,
    "word_count": 257,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES (p.32-34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "interpreted as being the result of market inefficiency. The slopes in year 2 are exaggerated for convenience of exposition. EA Year 1 Year 1 Year 2 Observed CAR Expected GN UE >= 0 0 UE0 -12 0 12 MONTH BN UE < 0 Expected Observed Electronic copy available at: https://ssrn.com/abstract=3360686 Figure 4. Schematic CAR versus Time Plot for Proposed Two Period PEAD Analysis This figure presents a schematic CAR versus time plot for the proposed two period PEAD analysis in this paper. The GNBN and BNGN lines do not necessarily meet at month 12. This is done for simplicity of exposition. The dotted lines represent the expected observations if the EA at 12 months is not considered. The slopes of these lines are likely not equal to zero, as shown for simplicity of exposition. This model is extended to three years in the detailed analysis in the paper. Year 1 Year 2 EA Year EA Year 1 2 GNGN CAR GN GNBN 0 UE1 UE2 -12 0 BNGN 12 MONTH BN BNBN Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "REFERENCES",
    "page_number": 35,
    "page_range": "p.35-36",
    "total_pages": 46,
    "chunk_index": 54,
    "word_count": 177,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES (p.35-36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "zero, as shown for simplicity of exposition. This model is extended to three years in the detailed analysis in the paper. Year 1 Year 2 EA Year EA Year 1 2 GNGN CAR GN GNBN 0 UE1 UE2 -12 0 BNGN 12 MONTH BN BNBN Electronic copy available at: https://ssrn.com/abstract=3360686 Figure 5. Classification System for Three Successive Years This figure illustrates the classification of firms into GNBN categories based on a sequence of three years. With this classification, we are able to select subsets of firms that are homogeneous as to the sequence of UEs in the three years. Year 1 Year 2 Year 3 EA Year EA Year Cuml EA Year Cumul 1 D 2 EAs Dij 3 EAs Dijk GN GNGNGN 1 1 1 GN GNGN 1 1 BN GNGNBN 1 1 0 GN 1 GN GNBNGN 1 0 1 BN GNBN 1 0 BN GNBNBN 1 0 0 Start GN BNGNGN 0 1 1 GN BNGN 0 1 BN BNGNBN 0 1 0 BN 0 GN BNBNGN 0 0 1 BN BNBN 0 0 BN BNBNBN 0 0 0 Electronic copy available at: https://ssrn.com/abstract=3360686 Figure 6. Plot of Average CAR versus Month for Months 1-36 for 1988 to 2002 Sample This figure shows the plot of the cumulative CARs versus month over 36 months for the classifications shown in Figure 5. Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "REFERENCES",
    "page_number": 36,
    "page_range": "p.36-38",
    "total_pages": 46,
    "chunk_index": 55,
    "word_count": 229,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES (p.36-38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "0 0 0 Electronic copy available at: https://ssrn.com/abstract=3360686 Figure 6. Plot of Average CAR versus Month for Months 1-36 for 1988 to 2002 Sample This figure shows the plot of the cumulative CARs versus month over 36 months for the classifications shown in Figure 5. Electronic copy available at: https://ssrn.com/abstract=3360686 Figure 7. Slopes, T-statistics, p-Values and Adjusted R-Squared Values for the 1974 to 1987, 1988 to 2002, and 2003 to 2016 Sample Periods This figure shows the slopes from regressing CAR on month for firms categorized based on their sequence of GN/BN earnings announcements (EA). EA Year 1 EA Year 2 EA Year 3 NOTATION: GNGNGN 0.01108 0.01270 0.00781 slope 12.65 13.16 12.08 t-stat 0.9353 0.9400 0.9294 adj R-sq (p-value) Left 1974-01 - 1987-12 GNGN 0.00965 0.01392 0.00836 Middle 1988-01 - 2002-12 9.74 14.61 13.01 6 2.73 0.07 Right 2003-01 - 2016-12 0.8950 0.9508 0.9386 (0.000) (0.021) (0.947) GNGNBN -0.00249 -0.00712 -0.00836 -2.56 -6.80 -15.04 Weighted Average Slopes 0.3365 0.8043 0.9535 GN 0.00706 0.01021 0.00801 0.00263 0.00260 0.00025 6.01 14.17 16.3 2.59 2.67 0.45 0.7615 0.9478 0.9601 (0.027) (0.024) (0.661) GNBNGN 0.00665 0.01101 0.00847 6.95 14.83 14.64 0.8112 0.9533 0.9510 Weighted Average Slopes GNBN -0.00640 -0.00944 -0.00892 -0.00188 0.00140 0.00002 -6.04 -9.01 -16.02 -2.31 2.03 0.05 0.7632 0.8794 0.9587 (0.043) (0.070) (0.965) GNBNBN -0.01311 -0.01213 -0.01132 -19.72 -15.21 -25.59 0.9724 0.9544 0.9835 Start 38 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "REFERENCES",
    "page_number": 38,
    "page_range": "p.38-39",
    "total_pages": 46,
    "chunk_index": 56,
    "word_count": 229,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES (p.38-39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "(0.661) GNBNGN 0.00665 0.01101 0.00847 6.95 14.83 14.64 0.8112 0.9533 0.9510 Weighted Average Slopes GNBN -0.00640 -0.00944 -0.00892 -0.00188 0.00140 0.00002 -6.04 -9.01 -16.02 -2.31 2.03 0.05 0.7632 0.8794 0.9587 (0.043) (0.070) (0.965) GNBNBN -0.01311 -0.01213 -0.01132 -19.72 -15.21 -25.59 0.9724 0.9544 0.9835 Start 38 Electronic copy available at: https://ssrn.com/abstract=3360686 Figure 7 (continued). Slopes, T-statistics, p-Values and Adjusted R-Squared Values for the 1974 to 1987, 1988 to 2002, and 2003 to 2016 Sample Periods This figure shows the slopes from regressing CAR on month for firms categorized based on their sequence of GN/BN earnings announcements (EA). EA Year 1 EA Year 2 EA Year 3 BNGNGN 0.00954 0.01736 0.00803 8.23 17.41 7.28 0.8584 0.9649 0.8254 Weighted Average Slopes BNGN 0.00476 0.00796 0.00831 0.00207 0.00470 -0.00003 4.48 11.83 9.60 1.84 4.62 0.08 0.5955 0.9266 0.8923 (0.094) (0.001) (0.969) BNGNBN -0.00723 -0.00983 -0.00935 Weighted Average Slopes -6.44 -8.35 -14.02 BN -0.01057 -0.01159 -0.01002 -0.00335 -0.00119 -0.00008 0.7866 0.8611 0.9466 -11.04 -13.58 -21.92 -3.87 -1.93 -0.12 0.9165 0.9434 0.9776 (0.003) (0.082) (0.903) BNBNGN 0.00323 0.00708 0.01061 2.34 9.10 7.86 0.3110 0.8816 0.8469 Weighted Average Slopes BNBN -0.01528 -0.01458 -0.01220 -0.00360 -0.00122 0.00092 -23.07 -22.31 -24.34 -3.57 -1.83 0.81 0.9797 0.9783 0.9819 (0.005) (0.097) (0.439) BNBNBN -0.01463 -0.01507 -0.01466 -20.83 -25.93 -17.44 0.9815 0.9839 0.9650 39 Electronic copy available at: https://ssrn.com/abstract=3360686 Figure 8. Plot of Average CAR versus Months 1-24 with Weighted Average for Months 12-24 for 1988 to 2002 Sample 0.4 0.3 WA line 0.2 0.1 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 WA line -0.1 -0.2 -0.3 GGG GG GB WA GBG BGB BG BB WA BBB Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "REFERENCES",
    "page_number": 39,
    "page_range": "p.39-40",
    "total_pages": 46,
    "chunk_index": 57,
    "word_count": 288,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES (p.39-40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "0.3 WA line 0.2 0.1 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 WA line -0.1 -0.2 -0.3 GGG GG GB WA GBG BGB BG BB WA BBB Electronic copy available at: https://ssrn.com/abstract=3360686 Figure 9. Plot of Average CAR versus Month for Months 1-36 with Weighted Average for Months 24-36 for 1988 to 2002 Sample This figure shows the plot of average CAR versus month for months 1 to 36. At month 12, there is GN or BN. At month 24, there is additional GN or BN. At month 36, there is additional GN or BN. WA YR 2 G represents the weighted average line for the GN/GN and GN/BN plots for months 12 to 24. WA YR 2 B represents the weighted average line for the BN/GN and BN/BN plots for months 12 to 24. WA YR 3 GG represents the weighted average line for the GN/GN/GN and GN/GN/BN plots for months 25 to 36. WA YR 3 GB represents the weighted average line for the GN/BN/GN and GN/BN/BN plots for months 25 to 36. WA YR 3 BG represents the weighted average line for the BN/GN/GN and BN/GN/BN plots for months 25 to 36. WA YR 3 BB represents the weighted average line for the BN/BN/GN and BN/BN/BN plots for months 25 to 36. These weighted average lines are commonly referred to as the post-earnings announcement drift (PEAD). WA line WA line WA line WA line WA line WA line 41 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "REFERENCES",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 46,
    "chunk_index": 58,
    "word_count": 265,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "3 BB represents the weighted average line for the BN/BN/GN and BN/BN/BN plots for months 25 to 36. These weighted average lines are commonly referred to as the post-earnings announcement drift (PEAD). WA line WA line WA line WA line WA line WA line 41 Electronic copy available at: https://ssrn.com/abstract=3360686 Figure 10. GN to BN Ratios for Actual Counts – Results for 1974 to 1987, 1988 to 2002, and 2003 to 2016 Samples This figure shows the proportion of observations which fall into each earnings announcement period; namely year 1, year 2, and year 3. By construction, for each earnings announcement period, the proportion of BN observations is equal to (1 – proportion of GN observations). EA Year 1 EA Year 2 EA Year 3 P1 NOTATION: GNGNGN 0.55865 0.49691 0.51931 proportion of observations 5558 7322 8604 number of occurrences P1 GNGN 0.56256 0.51526 0.53102 11335 17579 19448 Left 1974-01 - 1987-12 Middle 1988-01 - 2002-12 GNGNBN 0.44135 0.50309 0.48069 Right 2003-01 - 2016-12 4391 7413 7964 GN 0.57307 0.55072 0.56217 23352 40801 43025 P2 GNBNGN 0.56847 0.58454 0.57313 4330 8252 8409 GNBN 0.43744 0.48474 0.46898 8814 16538 17176 GNBNBN 0.43153 0.41546 0.42687 3287 5865 6263 Start P1 BNGNGN 0.55504 0.53413 0.53620 4084 7261 7532 P2 BNGN 0.59520 0.59379 0.59063 8881 16752 16859 BNGNBN 0.44496 0.46587 0.46380 3274 6333 6515 BN 0.42693 0.44928 0.43783 17397 33286 33509 P2 BNBNGN 0.61779 0.62544 0.61644 3118 5876 6059 BNBN 0.404799 0.40621 0.409368 6040 11460 11685 BNBNBN 0.38221 0.37456 0.38356 1929 3519 3770 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "REFERENCES",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 46,
    "chunk_index": 59,
    "word_count": 254,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "7532 P2 BNGN 0.59520 0.59379 0.59063 8881 16752 16859 BNGNBN 0.44496 0.46587 0.46380 3274 6333 6515 BN 0.42693 0.44928 0.43783 17397 33286 33509 P2 BNBNGN 0.61779 0.62544 0.61644 3118 5876 6059 BNBN 0.404799 0.40621 0.409368 6040 11460 11685 BNBNBN 0.38221 0.37456 0.38356 1929 3519 3770 Electronic copy available at: https://ssrn.com/abstract=3360686 Figure 11. Plot of Average CAR versus Month for Months 1-36 with Weighted Average for Months 24-36 for 2003 to 2016 Sample This figure shows the plot of average CAR versus month for months 1 to 36. At month 12, there is GN or BN. At month 24, there is additional GN or BN. At month 36, there is additional GN or BN. WA YR 2 G represents the weighted average line for the GN/GN and GN/BN plots for months 12 to 24. WA YR 2 B represents the weighted average line for the BN/GN and BN/BN plots for months 12 to 24. WA YR 3 GG represents the weighted average line for the GN/GN/GN and GN/GN/BN plots for months 25 to 36. WA YR 3 GB represents the weighted average line for the GN/BN/GN and GN/BN/BN plots for months 25 to 36. WA YR 3 BG represents the weighted average line for the BN/GN/GN and BN/GN/BN plots for months 25 to 36. WA YR 3 BB represents the weighted average line for the BN/BN/GN and BN/BN/BN plots for months 25 to 36. These weighted average lines are commonly referred to as the post-earnings announcement drift (PEAD). WA line WA line WA line WA line WA line WA line Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "REFERENCES",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 46,
    "chunk_index": 60,
    "word_count": 264,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "YR 3 BB represents the weighted average line for the BN/BN/GN and BN/BN/BN plots for months 25 to 36. These weighted average lines are commonly referred to as the post-earnings announcement drift (PEAD). WA line WA line WA line WA line WA line WA line Electronic copy available at: https://ssrn.com/abstract=3360686 Figure 12. Plot of Average CAR versus Month for Months 1-36 with Weighted Average for Months 24-36 for 1974 to 1987 Sample This figure shows the plot of average CAR versus month for months 1 to 36. At month 12, there is GN or BN. At month 24, there is additional GN or BN. At month 36, there is additional GN or BN. WA YR 2 G represents the weighted average line for the GN/GN and GN/BN plots for months 12 to 24. WA YR 2 B represents the weighted average line for the BN/GN and BN/BN plots for months 12 to 24. WA YR 3 GG represents the weighted average line for the GN/GN/GN and GN/GN/BN plots for months 25 to 36. WA YR 3 GB represents the weighted average line for the GN/BN/GN and GN/BN/BN plots for months 25 to 36. WA YR 3 BG represents the weighted average line for the BN/GN/GN and BN/GN/BN plots for months 25 to 36. WA YR 3 BB represents the weighted average line for the BN/BN/GN and BN/BN/BN plots for months 25 to 36. These weighted average lines are commonly referred to as the post-earnings announcement drift (PEAD). WA line WA line WA line WA line WA line WA line Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "REFERENCES",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 46,
    "chunk_index": 61,
    "word_count": 264,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "YR 3 BB represents the weighted average line for the BN/BN/GN and BN/BN/BN plots for months 25 to 36. These weighted average lines are commonly referred to as the post-earnings announcement drift (PEAD). WA line WA line WA line WA line WA line WA line Electronic copy available at: https://ssrn.com/abstract=3360686 Figure 13. GNGN Hypothesized Behavior Panel A Current quarter EA (GN) Subsequent CAR quarter EA (GN) Aggregate = sum of PEAD and New News # of 0 20 40 60 days Panel B Current quarter EA (GN) Subsequent CAR quarter EA (GN) New News – over 60 trading days – training sample; A and B GG GG generated from this regression # of days 0 20 40 60 Panel C Current quarter EA (GN) Subsequent CAR quarter EA (GN) PEAD test – over 20 trading days – test sample; calculated as CAR’ – GG [A + B * d] GG GG # of days 0 20 40 60 Electronic copy available at: https://ssrn.com/abstract=3360686 Figure 14. GNBN Hypothesized Behavior Panel A Current quarter EA (GN) Subsequent CAR quarter EA (BN) Aggregate = sum of PEAD and New News # of 0 20 40 60 days Panel B Current quarter EA (GN) Subsequent CAR quarter EA (BN) New News – over 60 trading days – training sample; A and B GB GB generated from this regression # of days 0 20 40 60 Panel C Current quarter EA (GN) Subsequent quarter EA (BN) CAR PEAD test – over 20 trading days – test sample; calculated as CAR’ – [A + B GB GB GB * d] # of days 0 20 40 60 46 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "REFERENCES",
    "page_number": 45,
    "page_range": "p.45-46",
    "total_pages": 46,
    "chunk_index": 62,
    "word_count": 277,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES (p.45-46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  },
  {
    "text": "0 20 40 60 Panel C Current quarter EA (GN) Subsequent quarter EA (BN) CAR PEAD test – over 20 trading days – test sample; calculated as CAR’ – [A + B GB GB GB * d] # of days 0 20 40 60 46 Electronic copy available at: https://ssrn.com/abstract=3360686",
    "title": "The Post - Earnings Announcement Drift A Pre - Earnings Announcement Effect A Multi - Period Analysis.",
    "source_type": "pdf",
    "document_id": "e6d4a73a493b",
    "source_file": "The Post-Earnings Announcement Drift  A Pre-Earnings Announcement Effect A Multi-Period Analysis..pdf",
    "section": "REFERENCES",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 46,
    "chunk_index": 63,
    "word_count": 50,
    "author": "A. William Richardson",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200709104812-04'00'",
    "duration": null
  }
]