[
  {
    "text": "The Valuation Effects of Stock Splits and Stock Dividends Mark S. Grinblatt, Ronald W. Masulis and Sheridan Titman * University of California at Los Angeles July 1984 Forthcoming: Journal of Financial Economics 13 (1984) 461-490 Abstract: This study presents evidence which indicates that stock prices, on average, react positively to stock dividend and stock split announcements that are uncontaminated by other contemporaneous firm-specific announcements. In addition, it documents significantly positive excess returns on and around the ex-dates of stock dividends and splits. Both announcement and ex-date returns were found to be larger for stock dividends than for stock splits. While the announcement returns cannot be explained by forecasts of imminent increases in cash dividends, the paper offers several signalling based explanations for them. These are consistent with a cross- sectional analysis of the announcement period returns. * We wish to thank Harry DeAngelo, David Mayers, Maureen McNichols, Richard Roll and the referee, Eugene Fama, for discussions and comments on earlier drafts. Seminar participants at Columbia University, Southern Methodist University, Stanford University, University of California at Los Angeles, University of Southern California, University of Minnesota, University of Utah, and Yale University have also been helpful. The dedicated research assistance of Jim Brandon and financial support from the UCLA Foundation for Research in Financial Markets and Institutions and the Institute for Quantitative Research in Finance is gratefully acknowledged. Electronic copy available at: http://ssrn.com/abstract=995759",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 36,
    "chunk_index": 0,
    "word_count": 231,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "University of Minnesota, University of Utah, and Yale University have also been helpful. The dedicated research assistance of Jim Brandon and financial support from the UCLA Foundation for Research in Financial Markets and Institutions and the Institute for Quantitative Research in Finance is gratefully acknowledged. Electronic copy available at: http://ssrn.com/abstract=995759",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 36,
    "chunk_index": 1,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "An important issue in corporate finance involves the inferences the market draws from managerial decisions. Recent empirical studies document stock price responses to announcements of cash dividend and capital structure changes.1 A plausible explanation for these findings is that changes in the optimal dividend and debt levels stem from changes in, expected cash flows, and thus, signal a change in firm value. Unlike most cash dividend and capital structure changes, stock splits and stock dividends do not directly affect the future cash flows of the firm. According to the standard textbook treatment,2 these stock distributions are no more than a cosmetic accounting change with no direct cost or benefit. This implies that if managers could increase share prices by splitting their firm's stock, both overvalued and undervalued firms will choose to split their shares, eliminating the informational content of the decision. Past empirical research on splits by Fama, Fisher, Jensen and Roll (1969), (hereafter, FFJR), and then later by Bar-Yosef and Brown (1977), and Charest (1978), among others, presents evidence which is interpreted as a split announcement effect. This interpretation, if true, is inconsistent with the above arguments; however, these findings have some important limitations.3 For one, these studies did not control for the potential contamination of other information releases on the returns at the split announcement dates. Indeed, for our sample, over 80% of the split and stock dividend announcements had some other significant simultaneous announcement, such as merger information, earnings reports, cash dividend declarations, and stock authorization announcements. Secondly, these problems were compounded by the use of monthly data, since stock price increases prior to the split announcement and the valuation effects of other announcements that occurred in the same month were included in the 1For a dividend announcement effect, see Pettit (1972), Aharony and Swary (1980), Kwan (1981), Eades (1982), Asquith and Mullins (1983) and Brickley (1983). For capital structure changes, see Masulis (1980a, 1980b, 1983), Dann (1981) and Vermaelen (1981). 2See, for example, Weston and Brigham (1981, p. 695). 3As Fama (1976) has observed, there are alternative interpretations of this data. '... FFJR are somewhat aggressive in interpreting their empirical results... There is no direct evidence... that dividends or splits convey real information... (A)n alternative view, completely consistent with their empirical results, (is) that splits tend to occur when firms have experienced unusual increases in earnings, which accounts for the positive average residual of splitting shares in the months preceding the split... Some of them experience earnings declines in the year after the split, which in the FFJR data show up as decreased dividends. Thus, the behavior of dividends is merely a proxy for the behavior of earnings, and neither dividend changes nor splits are a source of information.' 1 Electronic copy available at: http://ssrn.com/abstract=995759",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 36,
    "chunk_index": 2,
    "word_count": 459,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "experience earnings declines in the year after the split, which in the FFJR data show up as decreased dividends. Thus, the behavior of dividends is merely a proxy for the behavior of earnings, and neither dividend changes nor splits are a source of information.' 1 Electronic copy available at: http://ssrn.com/abstract=995759",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 36,
    "chunk_index": 3,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "announcement return. Recent studies of small stock dividend announcements are less subject to the above criticisms. Foster and Vickrey (1978) and Woolridge (1983b) find small, but significant, stock price adjustments on the declaration dates of these events for a sample of firms that had no concurrent announcement recorded in the Wall Street Journal Index. In contrast to these studies, this paper examines the impact of both stock split and (large) stock dividend announcements. The data exhibit significantly positive announcement returns for the entire sample, for a sample of 'pure events', which have no other announcements in the three- day period around the announcement day, and for a sample where no cash dividends were declared in the previous three years. The analysis of these and other subsamples leads us to conclude not only that there is a valuation effect for a 'pure' split or stock dividend, but that this valuation change, for the most part, cannot be explained by forecasts of near term increases in cash dividends. In addition, the announcement effect is larger for the stock dividend sample than for the stock split sample. We also examine evidence relating to several efficient market anomalies that have been documented in other studies. These studies found abnormal returns in the months subsequent to a stock split announcement and on stock distribution ex-dates.4 Our analysis finds that post- announcement returns, particularly around the ex-dates, are often abnormally large, especially for stock dividends and for securities that trade on the American Stock Exchange. The paper is organized as follows: Section 2 advances various signalling hypotheses that offer theoretical justification for valuation effects at the announcement of a stock dividend or split. Section 3 describes how the data were obtained and categorized. Section 4 examines the effect of stock dividend and split announcements on stock prices at the announcement date and the days immediately subsequent and compares these across various subsamples. It also focuses on the linkage between the announcement effect and prior and subsequent cash dividend announcements. Linear regressions in section 5 analyze cross-sectional differences in the announcement returns. Section 6 examines returns around the stock dividend and stock split ex- 4Chottiner and Young (1971) documented an abnormal number of market-adjusted positive returns on the ex- . dates of some stock splits. However, the number of positive returns was significant only for split factors of specific magnitudes. Woolridge (1983a) found an ex-date effect for stock dividends. Eades, Hess and Kim (1984) found an ex-date effect for a pooled sample of splits and stock dividends. Interestingly, Foster and Vickrey (1978) found no significant ex-date effect for stock dividends. This may be due to the sample size of 82 events. Charest (1978) found abnormal returns for a three-month buy-and-hold strategy with the purchase at the split declaration date. 2",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 36,
    "chunk_index": 4,
    "word_count": 463,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "pooled sample of splits and stock dividends. Interestingly, Foster and Vickrey (1978) found no significant ex-date effect for stock dividends. This may be due to the sample size of 82 events. Charest (1978) found abnormal returns for a three-month buy-and-hold strategy with the purchase at the split declaration date. 2",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 36,
    "chunk_index": 5,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "dates. Section 7 briefly summarizes the results and concludes the paper. 2. Potential effects of stock splits and stock dividends The notion that financial decisions convey information about firm value was proposed by Ross (1977), Leland and Pyle (1977) and Bhattacharya (1979) in adaptations of the Spence (1973) signalling model. This framework assumes asymmetric information between managers and investors, that managers have an incentive to convey favorable information to investors, and that it is prohibitively costly for low-value firms to mimic the financial decisions of high-value firms. As mentioned in the introduction, there are no apparent costs to stock splits or stock dividends suggested in the literature, so that the traditional signalling argument implies that these events should have no informational content. The following discussion offers some possibilities that might lead to an announcement effect. : For stock dividends, the value of the newly distributed shares is subtracted from, retained earnings and added to the firm's capital account. This yields what will be referred to as 'the retained earnings hypothesis'. If the firm faces legal restrictions, stock exchange rules, or has bond convenants written in terms of retained earnings,5 the additional shares can further restrict the firm's ability to pay cash dividends. Firms that anticipate increased earnings will not expect the restrictions to be binding, and thus, will not find it costly to reduce retained earnings. However, firms that expect poor earnings in the future will expect the restrictions to be binding, making it costly to mimic the signals of higher-valued firms. According to generally accepted accounting principles, firms deduct the dollar value of the 'stock dividend' from retained earnings only for stock distributions of 20% or less [see Davidson, Stickney and Weil (1982, pp. 23-27)]. All 'stock dividends' exceeding 25% are treated as splits and do not affect retained earnings, making this signalling argument inapplicable. For stock distributions between 20% and 25%, the accounting principles grant discretion to the manager, but are usually treated as stock dividends. Similar guidelines are imposed by the AICPA, the SEC, and the NYSE and AMEX for stock distributions of less than 20-25%. The accounting requirements vary in the 25–100% range. One might also postulate that there are indirect costs associated with false signalling, such as 5Indeed, this is frequently the case. See Henn (1970, pp. 650,672), Simmons (1972, p. 196) and American Bar Foundation (1972, p. 414) for a discussion. 3",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 36,
    "chunk_index": 6,
    "word_count": 398,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "20-25%. The accounting requirements vary in the 25–100% range. One might also postulate that there are indirect costs associated with false signalling, such as 5Indeed, this is frequently the case. See Henn (1970, pp. 650,672), Simmons (1972, p. 196) and American Bar Foundation (1972, p. 414) for a discussion. 3",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 36,
    "chunk_index": 7,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "loss of reputation. Heinkel (1984) suggests that firms maintain such reputations in order to have the opportunity to signal favorable information in the future. In Heinkel's 'reputation model' firms usually, but not always, reveal their information truthfully. Information releases like split announcements would have some, but not perfect, informational content. Another possibility is that stock dividends and splits call attention to the firm, triggering reassessments of the firm's future cash flows by market analysts. While underpriced firms find such reassessments in their interest, overpriced firms do not. Under this hypothesis, there will be a price impact on the announcement date that reflects the average underpricing of firms that choose to split their shares. Since the announcement only partially reveals the firm's value, subsequent reassessments by analysts are rational. A weakness in the 'reputation' or the 'attention' hypotheses is that they do not explain why firms use stock dividends and splits to convey information rather than straightforward press releases. One possibility is that they are less likely to reveal useful information to competitors. Another is that management may be liable for damages to stockholders if information that is directly communicated to the market turns out to be incorrect. Stock dividends and splits, being more ambiguous announcements, will not subject the firm and its management to such risks. It might be that managers do not deliberately attempt to convey information when they announce a split or stock dividend. For instance, conventional wisdom suggests that managers split to keep the price of their shares within a customary trading range. Given the costs associated with splits and reversals, managers with unfavorable inside information might decide not to split, even if their firm's stock price is high, because they expect that future events will force the price of the split shares to fall below the customary trading range. Investors, observing the correlation between splits and subsequent stock performance, could then use the split announcement to draw inferences about this information. One drawback to this 'trading range hypothesis' is that the managers of some overvalued firms might have little concern about the trading range of their firm's stock and split simply to obtain a temporary increase in its price (e.g. when the firm plans to raise capital or when the manager plans to reduce his stock or stock option holdings in the firm). Thus, the above scenario implicitly rules out such incentives or ascribes to investors the ability to discriminate between these two types of managers. If investors cannot make this distinction, Akerlof's (1970) lemons argument suggests that the average price response cannot be positive. If a positive price effect 4",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 36,
    "chunk_index": 8,
    "word_count": 435,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "the firm). Thus, the above scenario implicitly rules out such incentives or ascribes to investors the ability to discriminate between these two types of managers. If investors cannot make this distinction, Akerlof's (1970) lemons argument suggests that the average price response cannot be positive. If a positive price effect 4",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 36,
    "chunk_index": 9,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "exists, which can be enjoyed by all splitting firms, the managers with an incentive to increase share prices will split their shares to mimic undervalued firms with no such incentives. They will continue to do so until the market recognizes that false signalling predominate among those firms that split their shares and attach only a trivial price impact to the split announcement. The preceding discussion suggests four hypotheses under which stock splits and stock dividends have information content. Although these models have not been formally developed, the results that follow are consistent with many of their implications and dispute the conjecture that stock dividends and splits are purely cosmetic events. 3. Data description Table 1 describes the sample selection procedure. The initial announcements of proposed splits and stock dividends for the years 1967-1976 were independently collected from two sources: (i) the Wall Street Journal Index and (ii) a search of the Wall Street Journal around the CRSP Daily Master Tape's split or stock dividend declaration date.6 The criteria for selection were a stock dividend or split of ten percent or more and listing of the common stock on the American or New York Stock Exchanges at the announcement date. By limiting the sample to distributions of ten percent or more, periodic predictable stock dividends were largely eliminated. After removing sixteen announcement events and thirty-eight ex-date events from the sample, we were left with 1762 announcement events and 1740 ex-date events.7 The stock returns for this study were obtained from the CRSP Daily Returns File. These returns were then characterized according to when they occur in event time. For the announcement sample, day 0 was defined to be the earlier of (i) the trading day prior to the issue date of the Wall Street Journal that announced the event or (ii) the declaration date of the event 6To check the completeness of the sample, the two sources of data were compared. There were thirteen declaration son the CRSP Master t that were not announced in the Wall Street Journal. We also found seven announcements in the Wall Street Journal without declarations listed on CRSP. Two of these events had subsequent public announcements of a split or stock dividend cancellation, two had price patterns around the proposed ex-date which strongly suggest a cancellation, and three actually underwent splits, but had no declaration date on the CRSP Daily Master Tape. 7Twelve events were excluded from both the announcement and ex-date samples, which include four cancellations and eight events where there were no stock distribution announcements in the Wall Street Journal Index prior to the ex-date. Also excluded were nineteen ex-date events where the announcement occurred within two trading days of the ex-date. In addition, four announcement events and seven ex-date events were excluded due to trading suspensions on event day 1 for the announcements and event day 0 for the ex-dates. 5",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 36,
    "chunk_index": 10,
    "word_count": 479,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "to the ex-date. Also excluded were nineteen ex-date events where the announcement occurred within two trading days of the ex-date. In addition, four announcement events and seven ex-date events were excluded due to trading suspensions on event day 1 for the announcements and event day 0 for the ex-dates. 5",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 36,
    "chunk_index": 11,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "on the CRSP daily master tape. Day 0 was presumed to be the date on which the market becomes aware of the firm's intention to expand the number of shares. Using the Wall Street Journal Index, the sample was initially categorized into subsamples based on simultaneous announcements. The purity of the subsample with no contaminating simultaneous announcements8 on trading days 0, 1 and 2 in event time was further checked, and, if necessary, reclassified, on examination of the actual Wall Street Journal articles, which are more accurate sources than the Wall Street Journal Index. It is interesting to note that for approximately 10% of the split announcements where the Wall Street Journal Index did not specify a simultaneous announcement, other announcements were found when the actual Wall Street Journal articles were examined. The pure event subsample was also checked for contamination by examining the cash dividend declaration dates on the CRSP Daily Master Tape for event days –1, 0 and 1. An analogous procedure was applied to the sample of events where only a simultaneous cash dividend was announced where the dividend was unchanged from the prior dividend. The final classifications are reported in table 1. Categorizations of the sample by split factor, exchange listing, dividend policy, and type of stock distribution are also reported. Two approaches were examined for dividing the sample into stock dividend and stock split categories. The split factor method defined all events with split factors in excess of 25% as 'splits', the remainder as 'stock dividends' (in accordance with the generally accepted accounting principles governing splits and stock dividends, discussed in section 2). The second method used the CRSP classification of splits and stock dividends, which was taken from Moody's Dividend Record. Moody's uses the manager's own classification of the event, regardless of whether or not the stock distribution is taken out of retained earnings. Table 2 reports subsample summary statistics for pre-announcement, announcement, and post- announcement returns. This table includes announcement returns for CRSP-denoted stock dividends. Those in excess of 25% have smaller announcement returns than those with lower split factors and are closer in magnitude to the announcement returns of CRSP-denoted stock splits. Based on this, the remaining stock dividend/split comparisons will employ the split factor definition. 8These include earnings announcements, dividend announcements, announcements of new issues, redemptions or repurchases of securities, mergers, acquisitions, spinoffs, large new contracts, late payment of debt interest, exchange offers, impending bankruptcy, major discoveries, new patents, changes in senior management, changes in insider holdings, and major (split adjusted) changes in the management's discretionary equity authorization. 6",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 36,
    "chunk_index": 12,
    "word_count": 428,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "dividend announcements, announcements of new issues, redemptions or repurchases of securities, mergers, acquisitions, spinoffs, large new contracts, late payment of debt interest, exchange offers, impending bankruptcy, major discoveries, new patents, changes in senior management, changes in insider holdings, and major (split adjusted) changes in the management's discretionary equity authorization. 6",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 36,
    "chunk_index": 13,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "The cash dividend declarations were obtained from the CRSP Daily Master Tape. Watts (1973) has found that the CRSP Master dividend declaration date generally represents the first announcement of the dividend. Of the total sample of splits and stock dividends, 66% of the firms either increased their cash dividend (per unsplit shares) at the announcement date or at the subsequent cash dividend declaration. Of the 376 events for which no cash dividends were paid three years prior to the announcement, 32 declared a cash dividend simultaneous with the announcement, while another 44 declared a dividend within the subsequent year. For the 152 pure events where a cash dividend was paid in the previous three years, 48% declared a dividend increase for the cash dividend subsequent to the event. This evidence is indicative of a correlation between the stock split or stock dividend event and a subsequent increase in cash dividends. We will later examine if the stock dividend and split announcement effect stems from its relationship to subsequent dividend decisions. 4. Valuation effects of stock dividend and stock split announcements Since our large sample of announcement dates did not cluster in calendar time,9 market movements tended to average out over the events. For this reason, the event study portion of the analysis employs the mean-adjusted returns methodology, developed in Masulis (1980), rather than the residual analysis approach or risk-adjusted returns approach of many earlier studies.10 The first part of this analysis used daily stock price returns to examine the valuation effect of stock dividend and split announcements and their relation to the information in cash dividend announcements. The returns on various days around the announcement are compared with the average daily return for a subsequent benchmark period of forty trading days (days 4-43). To test the significance of the announcement return, we examine both day 0 and day 1 because the announcement often becomes public after the close of trading on day 0. Assuming return variances are stationary,11 a standard t-test can be used to test the null hypothesis that each of the 9No more than eight events were associated with any single calendar date. In four cases, more than five events were announced on the same date. For over 85% of the trading days with split or stock dividend announcements, no more than two simultaneous announcements occurred. For over 60% of these days, no more than one announcement occurred. 10See Brown and Warner (1980) for evidence of the power of this methodology relative to market-adjusted return, methods for non-contemporaneous announcements. 11Of course, return variances are likely to be higher on announcement days. In this case, the values of the reported t-statistics overstate the probability that the means differ. Because of this, we also examine cross-sectional 7",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 36,
    "chunk_index": 14,
    "word_count": 457,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "of the power of this methodology relative to market-adjusted return, methods for non-contemporaneous announcements. 11Of course, return variances are likely to be higher on announcement days. In this case, the values of the reported t-statistics overstate the probability that the means differ. Because of this, we also examine cross-sectional 7",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 36,
    "chunk_index": 15,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "two announcement period returns has the same mean as a typical post-announcement return. (Analogous tests are used to examine the two days subsequent to the announcement period and the returns around the ex-date.) The average returns in the days subsequent to the announcement (or ex-date) are appropriate benchmarks for the expected returns of these securities if mean returns are stationary and if the market is informationally efficient. If these returns systematically differ from their expected returns, investors can make abnormal returns by trading on the stock dividend or split announcements. However, using the average return before the announcement would be an inappropriate benchmark since firms tend to split or pay large stock dividends after substantial price increases. Table 3 reports daily returns around the announcement date for various subsamples. The mean two-day return around the announcement date for the entire split and stock dividend sample of 1762 firms is 3.41%. The mean two-day return for a benchmark period of forty trading days subsequent to the announcement is 0.10%. As has been emphasized, this abnormal return might be attributable to simultaneous announcements, but we find a similar price response in the sample of 84 pure stock dividend announcements and 244 pure stock split announcements, where no contaminating announcements occur. In this sample of pure events, the mean two-day return around the announcement is 5.87% for the stock dividends and 3.29% for the stock splits. This compares with a mean two-day return for the forty trading days subsequent to the announcement of 0.14% for the stock dividends and 0.16% for the splits. The t-statistic indicates that the day 0 and day 1 returns are significantly higher than the benchmark. It should also be noted that these abnormal returns are not driven by outliers, as evidenced by the large fraction of positive announcement returns. Fig. 1 plots the cumulative return for the pure event subsample. It highlights abnormal returns around the announcement date by the large jumps at days 0 and 1. It also illustrates the selection bias associated with the large price increases preceding the announcement. Table 3 also documents an average return of more than 1% in the two days subsequent to the two-day announcement period of a pure split or stock dividend. The day 2 return is significantly different from the mean daily return of days 4–43 in announcement event time, and while the day 3 return is large, it is significantly different from the benchmark return only for the sample of standard errors. In all cases, including those which are not reported, the estimated cross-sectional standard errors are lower than the corresponding time-series standard deviations reported in the paper. 8",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 36,
    "chunk_index": 16,
    "word_count": 441,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "and while the day 3 return is large, it is significantly different from the benchmark return only for the sample of standard errors. In all cases, including those which are not reported, the estimated cross-sectional standard errors are lower than the corresponding time-series standard deviations reported in the paper. 8",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 36,
    "chunk_index": 17,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "splits. Given the reputation of CRSP for accuracy and the fact that the original Wall Street Journal articles were examined for the pure event sample, it is doubtful that the source of this anomaly is erroneous announcement dates. An unreasonably large portion of the CRSP declaration dates would have had to be in error to produce such large daily returns. Another explanation for this is non-trading on day 1 of the announcement period, but these observations were excluded from the sample. One concern is that the announcement effect could be driven by implicit messages or by private communication about cash dividend policy rather than by the split or stock dividend per se. For instance, many firms that pay small stock dividends report nothing to the Wall Street Journal about cash dividends, and it is understood that the per share dividend will remain unchanged. Yet this represents an increase in the total cash dividend payout, once the additional shares are issued. It is also well known that securities analysts and fund managers telephone corporate sources at the announcement of a split or stock dividend in order to ascertain the announcement's implications for future cash dividend payouts. Nonetheless, for several reasons it is unlikely that our results are driven by these hidden impurities. First, if there is no announcement effect, the pure event sample would not have a larger announcement return than the total sample (assuming the unobservable contaminating returns in the pure event sample are, on average, no larger than the perceptible contaminating returns in the total sample). Second, for the pure events where prior cash dividends were paid and where the subsequent cash dividend was not increased, the announcement return is significantly positive and, thus, cannot be driven by private communication of an imminent dividend increase. (This is observed in table 4 and is further supported by results in the next section.) Finally, the announcement return of 3.94% (see table 4) for the subsample of events where the only contaminating announcement is one of no cash dividend change per unsplit share is larger than the announcement return for the total sample, even though this contaminating information might be thought of as financially neutral (or even negative, when investor expectations are taken into account). This is hardly possible if the stock distribution announcement per se has no informational impact. Table 1 indicates that splits and stock dividends are frequently associated with simultaneous or subsequent dividend increases. Investors correctly infer an increased probability of a near- term cash dividend rise at the announcement of splits and stock dividends. Yet, the above evidence from the sample containing (financially neutral) simultaneous cash dividend 9",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 36,
    "chunk_index": 18,
    "word_count": 440,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "indicates that splits and stock dividends are frequently associated with simultaneous or subsequent dividend increases. Investors correctly infer an increased probability of a near- term cash dividend rise at the announcement of splits and stock dividends. Yet, the above evidence from the sample containing (financially neutral) simultaneous cash dividend 9",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 36,
    "chunk_index": 19,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "announcements suggests that the announcement effect is not completely tied to cash dividend increases, as has been conjectured by some researchers.12 This is further supported by a subsample of 176 pure events where no cash dividend was paid in the three years prior to the announcement, of which only 11% initiated a cash dividend in the following year. For a randomly chosen sample of non-dividend paying stocks that experience a large price increase in the previous year, it is plausible that an equally large percentage of firms would initiate a cash dividend in the subsequent year. Hence, it seems unreasonable to suggest that the announcement per se would appreciably increase investors' expectations of an imminent dividend payment. Furthermore, Asquith and Mullins (1983) found that the announcement of first time cash dividends resulted in an average two-day excess return of 3.7%, while for this sample of pure stock dividends and splits with no cash dividends declared in the prior three years, the average two-day announcement return is 4.3%, as seen in table 4. Clearly, the latter return is too large to be solely attributed to the increased likelihood of the firms initiating dividends. Thus, it appears that some of the informational impact of splits and stock dividends is not dividend related. It should also be noted that the announcement returns reported in table 4 are significantly larger for stock dividends than for stock splits. The difference in these two-day returns is 1.9% for the entire sample and 2.6% for the pure sample. This evidence, which is consistent with the retained earnings hypothesis, suggests that stock dividends and stock split announcements are interpreted as different types of announcements by the market. 5. A cross-sectional analysis of the announcement returns The evidence above indicates that the significant market reaction to the announcement of stock dividends and splits differs for various subgroups of the sample. We concluded that further empirical investigation of the sources of these differences was of interest. Differences in returns might arise because the information being announced has been partially discounted or because the announcements provide different types of information that vary with the particular characteristics of the firm (e.g. firm size or the variability of its stock returns). These effects will vary across subsamples of events and even across individual securities. To 12From FFJR: '... when the information effects of dividend changes are taken into account, the apparent price effects of the split (announcement) will vanish.' 10",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 36,
    "chunk_index": 20,
    "word_count": 407,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "firm (e.g. firm size or the variability of its stock returns). These effects will vary across subsamples of events and even across individual securities. To 12From FFJR: '... when the information effects of dividend changes are taken into account, the apparent price effects of the split (announcement) will vanish.' 10",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 36,
    "chunk_index": 21,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "examine the cross-sectional variation in the price reactions to the stock distribution announcements, linear regressions are estimated, where firm characteristics and prior information available to investors at the time of the event are included as independent variables. These are described below. The effects of market movements on announcement period returns are controlled for by including MKT, which is beta times the return on the market, as an independent variable. As mentioned previously, researchers have conjectured that cash dividend policy is intimately connected with the split announcement effect. For this reason, we control for changes in dividend payouts both preceding and following stock distribution announcements. The coefficient on the percentage change in the prior cash dividend, PDIV, will be negative (positive) if prior cash dividend changes and stock distribution announcements are substitute (complementary) signals. We also examine the percentage change in the subsequent cash dividend, SDI V, to determine if managers informally disclose, or in some way suggest, a possible dividend change at the time of the split or stock dividend announcement. The variable SHRVAL is the logarithm of the market value of the outstanding shares being split at the end of the year prior to the announcement date. Lacking theoretical guidance, our choice of the functional form of SHRVAL is based on the empirical findings of Brown et al. (1983). They document an approximately log-linear relation between firm size and excess returns in their samples. Evidence by Atiase (1980) suggests that less information is generally known about small firms. Since smaller firms have fewer announcements published in the financial press, the split or stock dividend announcement is expected to create greater market interest than it would in the case of larger firms. Hence, the coefficient of SHRVAL is predicted to be negative under the 'attention hypothesis'. The variable RUNUP measures the stock price increase from day –120 to day – 6, which, on average, is abnormally large relative to a random sample of stocks. This stock price increase probably influences the manager's stock distribution decision, at least for the larger distributions, because it measures the extent to which the stock price exceeds its typical trading range. Thus, it acts as a forecast of the forthcoming stock distribution. In addition, RUNUP proxies for the positive firm information that has already been discounted by the market before the announcement and which otherwise would have been signalled by the announcement. For the former reason, RUNUP should be negatively related to the announcement returns of stock splits, 11",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 36,
    "chunk_index": 22,
    "word_count": 414,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "forthcoming stock distribution. In addition, RUNUP proxies for the positive firm information that has already been discounted by the market before the announcement and which otherwise would have been signalled by the announcement. For the former reason, RUNUP should be negatively related to the announcement returns of stock splits, 11",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 36,
    "chunk_index": 23,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "and for the latter reason, it is negatively related to the announcement returns of stock dividends. In addition, if the stock price is positively correlated with retained earnings or with future expected accounting earnings, then bond covenants and exchange or state regulations pertaining to dividend payouts are less restrictive after large runups in the stock price. In this case, the announcement of a stock dividend does little to affect the ability of firms to pay cash dividends: accordingly, investors will have little confidence in the information being signalled and the announcement return will be negligibly small. Thus, the retained earnings hypothesis also predicts a negative relation between RUNUP and stock dividend announcement returns. The LEAKR variable measures the stock price increase due to firm-specific information between days –6 and –1. Due to both information leakages and possibly the use of late announcement dates in some cases, the size of the LEAKR variable may affect the announcement , return. As with the RUNUP variables, LEAKR should be negatively related to the announcement return because it is a proxy for the extent to which the market has already discounted news of a stock dividend or split. The trading range and retained earnings hypotheses, discussed in section 2, lead us to include split factor, market model beta, market model residual variance and dividend yield, respectively SPFAC, BETA, RVAR and DIVYLD, as additional explanatory variables, although they are interesting firm variables in their own right. SPFAC is a measure of the extent to which a split or stock dividend causes the stock price to fall below its preferred trading range, and alternatively, for the case of stock dividends, the amount that is subtracted from retained earnings. Hence, SPFAC is expected to be positively related to the announcement return. BETA and DIVYLD serve as proxies for future expected increases in the price of the stock. Assuming management aversion to reverse splits, stocks with higher betas and lower dividend yields are more likely to be split because their price is more likely to rise in the future. These variables also proxy for the expected increase in cash flow available for dividend increases, and thus, may be related to the degree to which management expects to be constrained in their ability to pay future dividends. Hence, managers of splitting firms that have high beta stocks with low dividend yields are expressing less confidence about their stock prices than managers of firms that have low beta stocks and high dividend yields. It is also possible to interpret the coefficient on BETA as a discount rate effect (among other explanations). That is, if the split predicts a given change in expected cash flows, the discounted value of that change will be larger for low-beta than for high-beta firms. 12",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 36,
    "chunk_index": 24,
    "word_count": 460,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "high dividend yields. It is also possible to interpret the coefficient on BETA as a discount rate effect (among other explanations). That is, if the split predicts a given change in expected cash flows, the discounted value of that change will be larger for low-beta than for high-beta firms. 12",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 36,
    "chunk_index": 25,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "Similarly, managers of firms with highly variable stock prices must be more confident about the post split stock's chances of not falling below the preferred trading range than those managers with less variable stock prices. Alternatively, if a high RVAR reflects highly variable earnings, managers must be more confident that the decrease in retained earnings will not significantly restrict the future payout of cash dividends. These arguments suggest that the announcement returns may be higher for those firms with more variable returns. This effect is likely to lead to a positive relation between RVAR and the announcement returns and, because BETA is a component of total variance, it may offset the aforementioned negative relation between BETA and the announcement returns. One could also argue that for various reasons, such as high leverage, stocks exhibiting a high RVAR are those that have more volatile price responses to information releases about firm value. Thus, the more variable is the stock, the larger is the stock price adjustment to an announced change in firm value. Two ordinary least squares regressions for the pure event sample are examined, each with the two-day announcement return as the dependent variable.13,14 The second regression adds the variables PDIV and SDIV to the set of explanatory variables that are used in the first regression. It has a smaller sample size than the latter regression because approximately half of the firms in the pure event sample paid no dividends in the pre-announcement period. Separate regressions are examined for the pure event stock splits and for the pure event stock dividends, as defined by the split factor method. The differences in the coefficients for these two subsamples suggest that splits and stock dividends are fundamentally different events. Therefore, it is not appropriate to combine the two subsamples for a single regression. The results of these regressions are reported in table 5.15 More accurate coefficient estimates 13We also ran regressions using the two-day announcement period residual (as estimated from a one-factor market model) as the dependent variable and used GLS estimation to control for heteroskedasticity. The findings were essentially the same and are therefore unreported. 14Forty-four pure events were deleted from the sample because of insufficient data on the RUNUP variable. 15We undertook sensitivity tests because of the observed high correlations between RVAR, BETA and some of the other independent variables. Deleting either or both of these variables produced little change in the coefficient estimates of the other variables with the exception of SHRVAL and SPFAC, which became more significant when RVAR was dropped. 13",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 36,
    "chunk_index": 26,
    "word_count": 424,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "because of the observed high correlations between RVAR, BETA and some of the other independent variables. Deleting either or both of these variables produced little change in the coefficient estimates of the other variables with the exception of SHRVAL and SPFAC, which became more significant when RVAR was dropped. 13",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 36,
    "chunk_index": 27,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "are found in the first set of regressions, because the second pair, especially in the stock dividend case, are based on substantially smaller sample sizes. In the first pair, the RUNUP variable is significant in the stock dividend regression, but not in the stock split regression. Conversely, the variables RVAR, SHRVAL and BETA are significant in the stock split regression, but not in the stock dividend regression. LEAKR has a significant negative coefficient in both samples. Finally, after controlling for the effects of these variables, the remaining coefficients are insignificant.16 In the second stock dividend regression, no significant coefficients are found, perhaps because of the limited degrees of freedom. For the second stock split regression, the insignificant coefficient on SDIV and the significant coefficient on PDIV, the prior dividend change, are noteworthy. The latter supports the 'complementarity hypothesis' and the former supports the evidence in the last section that these valuation effects are not driven by premature leakage of future cash dividend payouts. However, the coefficients of LEAKR, BETA, and RVAR are insignificant in this regression while the coefficients of SPFAC, RUNUP, and DIVYLD are significantly different from zero. With the exception of RUNUP (noted in the previous footnote), these changes are due to differences between the sample of firms that pay dividends and those that do not.17 In summary, the independent variables appear to be more significant for stock split announcement returns than for stock dividend announcement returns. We find evidence which is consistent with both the 'trading range hypothesis' and the 'attention hypothesis' and to a lesser extent the 'retained earnings hypothesis'. However a comparison of regressions I and II suggests Other variables were also examined in unreported regressions. The return on the CRSP equally weighted index was included in place of our MKT variable, the exchange on which the stock is listed was included in place of SHRVAL, dummy variables for the sign of the dividend changes were included in place of PDIV and SDIV, and dummies for various split factors were included in place of SPFAC. The results of these regressions were not significantly different from those reported. We also included a dummy variable for whether or not the firm paid a dividend prior to the split and a variable measuring the ratio of the variance of the stock returns before and after the ex-date. The former variable was included because of our observation that the subsample without previous dividends had higher announcement returns than the group with previous dividends. The second variable was motivated by the Ohlson and Penman (1984) observation that return variances increase following stock splits. Neither variable turned out to be significant. 16The insignificant coefficients of RUNUP in the stock split regression might be due to specification error since it is positively correlated with PDIV, which is not included in the regression. When PDIV is deleted from the second stock split regression, RUNUP has an insignificant coefficient. The insignificance of DIVYLD in the stock split regression might stem from the composition of the pure sample. Approximately half the sample in the first set of regressions consist of firms with zero dividend yields. The coefficient of DIVYLD might therefore reflect a comparison between the announcement effects of firms that pay cash dividends and those that do not, rather than any effect across the dividend yields of firms that pay dividends. 17This conclusion comes from an examination of unreported regressions. Curiously, once we control for firm size, the magnitude of the announcement return does not seem to depend on whether dividends are paid. 14",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 36,
    "chunk_index": 28,
    "word_count": 590,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "those that do not, rather than any effect across the dividend yields of firms that pay dividends. 17This conclusion comes from an examination of unreported regressions. Curiously, once we control for firm size, the magnitude of the announcement return does not seem to depend on whether dividends are paid. 14",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 36,
    "chunk_index": 29,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "that several coefficient estimates are not robust to major changes in sample composition. Because of this, caution should be exercised when interpreting these results. 6. Ex-date effects In an efficient market, traders are unable to earn abnormal profits by trading on the public announcement of a stock dividend or split. However, an article by Charest (1978) suggests that traders could have earned an excess return of approximately 1½% percent by purchasing shares at the end of the announcement month of a stock split and holding them for three months. A recent paper by Woolridge (1983a) documents a related anomaly on the ex-dates of securities that predominantly pay small stock dividends. He finds that share prices increase, on average, approximately 1% on the ex-dates of these stock dividends. Tables 6 and 7 and fig. 2 describe the returns around the ex-dates of stock dividends and splits for various subsamples of the data. To eliminate the contaminating effects of price increases in the pre-announcement and announcement period, the results presented in these tables contain only post-announcement returns. Because of this, the sample size decreases as we move back in time prior to the ex-date. Table 6 shows that the three-day return from days –1 to +1 is 1.52% for the total sample, while the five-day return from days –1 to +3 is 1.95%. These returns are significantly larger than the typical three- and five-day returns of 0.11% and 0.19% that are calculated from a benchmark period of forty days after the ex-date. This is also demonstrated in fig. 2, which plots cumulative returns. The ex-date period returns are greater for AMEX stocks than for NYSE stocks, as seen in table 7. However, these returns are significantly greater than the benchmark returns for all subsamples of the data. Furthermore, these abnormal returns occur throughout the sample period. The three-day return for the periods 1967-1970, 1971-1973 and 1974-1976 are 1.44%, 1.57% and 1.64%, respectively. The returns for the ex-date period are of approximately the same magnitude as the abnormal returns documented by Charest (1978), suggesting that his abnormal returns occur predominantly around the ex-dates. Our results also indicate that Woolridge's conjecture that the ex-date effect arises from stock prices not fully adjusting to the payment of small stock dividends, cannot 15",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 36,
    "chunk_index": 30,
    "word_count": 377,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "of approximately the same magnitude as the abnormal returns documented by Charest (1978), suggesting that his abnormal returns occur predominantly around the ex-dates. Our results also indicate that Woolridge's conjecture that the ex-date effect arises from stock prices not fully adjusting to the payment of small stock dividends, cannot 15",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 36,
    "chunk_index": 31,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "adequately explain the ex-date returns. We find abnormal ex-date returns for large stock splits as well as stock dividends. A careful examination of the data suggests that these abnormal returns are probably not caused by error on the CRSP tapes or outliers. The percentage of positive returns in the ex-date period is unusually large and the mean returns over the ex-date period remain positive after deleting the firms with ex-date returns in the top decile. Other possible explanations for the abnormal returns, that they are due to coincidental cash dividend ex-dates, confirmation that the split or stock dividend would not be cancelled, or stock distributions that were not announced in the news media prior to the ex-dates, cannot explain the results. First, only 129 coincidental cash dividend ex-dates are in the sample; their average returns are indistinguishable from the rest of our sample in the three–and five-day ex-date periods. Second, given that there were only four cancellations for our entire sample of Wall Street Journal announcements, little uncertainty as to the completion of a split or stock dividend remains to be resolved at the ex-date. Finally, the average daily stock returns in tables 6 and 7 and fig. 2 exclude events with no Wall Street Journal announcement and returns occurring in or prior to the announcement period. While we offer no resolution of this anomaly, the recent evidence of Choi and Strong (1983) on when-issued shares suggests an interesting line of inquiry. For stock splits, when-issued split shares are sometimes traded between the announcement and the ex-date. These contracts entitle the holder to receive the newly distributed shares when they are issued. Choi and Strong find that the split factor adjusted prices of when-issued shares are about one-percent above the price of the unsplit shares. This difference is of the same magnitude as the ex-date returns for splits. Hence, if the ex-date returns had been measured by the ex-date price change of the when-issued shares, it is unlikely that abnormal ex-date returns would be evident. The existence of a short-lived market in when-issued shares indicates that some shareholders find it costly to receive split shares, particularly for split ratios likely to create odd lots (e.g. 5 for 3 split). The return on the ex-date for splits may simply demonstrate that it is costly to buy shares shortly before the ex-date, except for the specialist, who uses these shares to hedge short positions in the when-issued market.18 Thus, the day prior to the ex-date, we may be observing transactions at the specialist's bid prices, while on the ex-date, after when-issued trading has 18This hedging activity by specialists has been verified in conversations with exchange officials and a member of the NYSE specialist unit. 16",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 36,
    "chunk_index": 32,
    "word_count": 453,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "the when-issued market.18 Thus, the day prior to the ex-date, we may be observing transactions at the specialist's bid prices, while on the ex-date, after when-issued trading has 18This hedging activity by specialists has been verified in conversations with exchange officials and a member of the NYSE specialist unit. 16",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 36,
    "chunk_index": 33,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "ceased, normal trading activity returns. This would imply a positive ex-date return equal to one- half the bid-ask spread as a percentage of the stock price. The larger ex-date returns of stocks traded on the American Stock Exchange, which presumably have higher bid-ask spreads, are consistent with this argument. This bid-ask argument is also partially supported by regressions of the one-day ex-date return on the logarithm of the market value of the firm's equity. This firm size proxy has a significant coefficient in the stock split regression, but not in the stock dividend regression.19 On the other hand, this argument cannot explain the abnormal returns on days 1 through 3 following the ex-date. Table 6 also demonstrates that abnormal returns could have been earned in the days prior to the ex-date for stock dividends. (As mentioned earlier, all of these returns are calculated after filtering out announcement period and pre-announcement returns.) These, however, are almost entirely due to the abnormal returns in the two days subsequent to the announcement period. For approximately 25% of the stock dividend sample, the difference between the announcement and the ex-date is less than seven trading days. 7. Conclusion This study has examined the valuation effects of stock split and stock dividend announcements. It has established that, on average, there is a significant increase in a firm's stock price at the announcement and that, in general, this upward revision of the firm's value cannot be attributed to any other contemporaneous announcements. This increase may be partially due to forecasts of imminent increases in cash dividends, but a subsample of stocks that paid no dividends in the three years prior to the announcement displays similar price behavior. Thus, some of the information content of stock distributions appears to be directly associated with firms' future cash flows. The results of this study raise a number of interesting and important issues which should be addressed in future research. For one, the evidence of a positive split announcement effect seems 19The estimated regressions for the stock split and stock dividend ex-date returns are EXRET =0.04006– 0.00287SHRVAL, R2 = 0.013; (5.05) ( – 4.22) EXRET =0.00092– 0.00018 SHRVAL, R2 = 0.000, (0.64) (– 0.13) respectively, where t-statistics are in parentheses. 17",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 36,
    "chunk_index": 34,
    "word_count": 371,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "one, the evidence of a positive split announcement effect seems 19The estimated regressions for the stock split and stock dividend ex-date returns are EXRET =0.04006– 0.00287SHRVAL, R2 = 0.013; (5.05) ( – 4.22) EXRET =0.00092– 0.00018 SHRVAL, R2 = 0.000, (0.64) (– 0.13) respectively, where t-statistics are in parentheses. 17",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 36,
    "chunk_index": 35,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "to be inconsistent with the applications of 'Spence' signalling in the finance literature (where the cost of signalling is exogenous, as opposed to an endogenous cost as in the 'reputation' or 'attention' models), although the differences in split and stock dividend announcement returns are consistent with the 'retained earnings hypothesis', which is a variant of the Spence signalling model. While we offer several explanations for these results, additional theoretical work is needed. We have also documented post-announcement abnormal returns, particularly around the ex- dates of splits and stock dividends. The average magnitude of these ex-date returns exceeds that found previously for small stock dividends and is as large as the split or stock dividend announcement effect for some subsamples. Although we cannot explain these ex-date returns, the evidence suggests a more cautious interpretation of ex-date returns for cash dividends than is currently found in the literature. Elton and Gruber (1970), among others, have argued that abnormal ex-date returns for cash dividends can be explained by personal tax effects. However, the tax explanation does not apply to the ex-date returns of splits and stock dividends and, on average, these ex-date returns exceed those of cash dividends. Perhaps, whatever underlies the abnormal stock dividend and split ex-date return drives the abnormal cash dividend ex-date return, too.20 A suitable model that adequately explains the results in this paper presents a formidable challenge to financial theorists, particularly those interested in information signalling. Nonetheless, the purely financial nature of splits and stock dividends makes this an important class of events for testing more general theories of information, and financial decisions. Hopefully, further work on these puzzling phenomena will provide additional insights. 20Kalay (1982), Hess (1982), Poterba (1982), Lakonishok and Vermaelen (1983) and Eades, Hess and Kim (1984) uncover new evidence which also questions the tax interpretation of this ex-dividend finding. 18",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 36,
    "chunk_index": 36,
    "word_count": 306,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "testing more general theories of information, and financial decisions. Hopefully, further work on these puzzling phenomena will provide additional insights. 20Kalay (1982), Hess (1982), Poterba (1982), Lakonishok and Vermaelen (1983) and Eades, Hess and Kim (1984) uncover new evidence which also questions the tax interpretation of this ex-dividend finding. 18",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 36,
    "chunk_index": 37,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "Table 1 Sample Classifications (i) Pure and contaminated sample breakdown Classified by CRSP as: Stk. Div. Split Stk. Div. Split Total Classified by split factor as: Stk. Div. Stk. Div. Split Split Pure event N = 66 51 18 193 328 Contaminated event N = 235 188 63 947 1433 Total N = 301 239 81 1140 1761a (ii) Sample breakdown by split factor and exchange listingb Split factor > : – 10% 20% 25% 49% 75% 100% Total Split factor ≤ : 10% 20% 25% 49% 75% 100% – NYSE N = 78 28 37 18 203 563 66 993 (16) (5) (3) (2) (15) (62) (8) (111) AMEX N = 131 26 82 35 209 247 39 769 (31) (5) (24) (11) (58) (75) (13) (217) Total N = 209 54 119 53 412 810 105 1762 (47) (10) (27) (13) (73) (137) (21) (328) (iii) Cash dividend policyb Cash dividend change Increase Decrease No change No dividend Dividend prior 259 39 1088 376 (37) (6) (109) (176) Dividend simultaneous 536 57 336 833 (–) (–) (–) (328) Dividend subsequent 691 77 655 339 (92) (14) (52) (170) aOne event classified by CRSP as a stock dividend and a split was deleted from the analysis. It would have been placed in the contaminated row. bNumbers in parentheses are for the pure subsample. cRelative to split or stock dividend announcement. Changes in cash dividends are based on CRSP cash dividend declaration dates. Declarations and announcements are not always coincidental. 19",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 36,
    "chunk_index": 38,
    "word_count": 251,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "split was deleted from the analysis. It would have been placed in the contaminated row. bNumbers in parentheses are for the pure subsample. cRelative to split or stock dividend announcement. Changes in cash dividends are based on CRSP cash dividend declaration dates. Declarations and announcements are not always coincidental. 19 Table 2 Summary statistics for stock returns.a (i) Two-day announcement return Classified by CRSP as: Stk. Div. Split Stk. Div. Split Total Classified by split Stk. Div. Stk. Div. Split Split f Mean 0.0534 0.0327 0.0364 0.0289 0.0344 (0.0599) (0.0551) (0.0308) (0.0337) (0.0398) Standard deviation 0.0646 0.0521 0.0559 0.0452 0.0518 (0.0647) (0.0626) (0.0578) (0.0487) (0.0554) Minimum –0.1111 –0.0674 –0.1215 –0.1690 –0.1690 (–0.0602) –0.0489) (–0.0430) (–0.0800) (–0.0800) Median 0.0440 0.0260 0.0279 0.0243 0.0271 (0.0503) (0.0443) (0.0179) (0.0306) (0.0320) Maximum 0.3777 0.2168 0.2593 0.2873 0.3777 (0.2356) (0.2168) (0.2593) (0.2324) (0.2592) (ii) Cumulative daily returns around the announcement Classified Days – 120 to – 6 Days – 5 to – 1 Days + 2 to + 120 by Split factor as: Stk. Div. Split Total Stk. Div. Split Total Stk. Div. Split Total Mean 0.1613 0.3257 0.2901 0.0182 0.0174 0.0175 0.0930 0.0663 0.0721 (0.1796) (0.4264) (0.3632) (–0.0020) (0.0227) (0.0164) (0.1021) (0.0662) (0.0754) Standard 0.3637 0.4084 0.4047 0.0662 0.0631 0.0638 0.3282 0.3069 0.3117 (0.4403) (0.4396) (0.4522) (0.0554) (0.0744) (0.0707) (0.3578) (0.3629) Deviation (0.3614) Minimum –0.5652 –0.4495 –0.5652 –0.1603 –0.2190 –0.2190 –0.5333 –0.7225 –0.7225 (–0.5652) (–0.2925) (–0.5652) (–0.1515) (–0.1607) (–0.1607) (–0.4947) (–0.7225) –0.7225) Median 0.1092 0.2293 0.2077 0.0089 0.0100 0.0099 0.0354 0.0332 0.0337 (0.1325) (0.3087) (0.2756) (0.0000) (0.0129) (0.0090) (0.0389) (0.0296) (0.0380) Maximum 2.1776 5.1386 5.1386 0.4000 0.4227 0.4227 1.6152 2.1576 2.1576 (2.1776) (2.2367) (2.2367) (0.1437) (0.3818) (0.3818) (1.1758) (1.5468) (1.5468) aNumbers in parenthesis are for the pure subsample. 20",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 36,
    "chunk_index": 39,
    "word_count": 285,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "(–0.4947) (–0.7225) –0.7225) Median 0.1092 0.2293 0.2077 0.0089 0.0100 0.0099 0.0354 0.0332 0.0337 (0.1325) (0.3087) (0.2756) (0.0000) (0.0129) (0.0090) (0.0389) (0.0296) (0.0380) Maximum 2.1776 5.1386 5.1386 0.4000 0.4227 0.4227 1.6152 2.1576 2.1576 (2.1776) (2.2367) (2.2367) (0.1437) (0.3818) (0.3818) (1.1758) (1.5468) (1.5468) aNumbers in parenthesis are for the pure subsample. 20",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 36,
    "chunk_index": 40,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "Table 3a Average daily stock returns around the announcement date of splits and stock dividends; all 1762 splits and stock dividends Event Av. stk. Av. S&P %stk. Av. S&P %stk. Event day Av stk. %ret. day %ret. %ret. ret. > 0 %ret. ret. > 0 –10 0.32 0.13 48 17 0.04 0.02 42 –9 0.36 0.12 47 18 0.09 0.03 43 –8 0.34 0.13 46 19 0.06 0.00 43 –7 0.29 0.12 44 20 0.04 –0.00 43 –6 0.28 0.09 47 21 0.04 0.00 42 –5 0.21 0.07 47 22 0.14 0.03 44 –4 0.29 0.12 46 23 0.07 0.01 44 –3 0.23 0.09 44 24 –0.00 0.03 42 –2 0.45 0.05 48 25 –0.02 0.03 42 –1 0.55 0.05 49 26 0.08 0.06 44 0 l.84 0.05 67 27 0.01 0.05 44 1 1.57 0.07 64 28 0.20 0.05 46 2 0.67 0.05 53 29 0.09 0.03 43 3 0.22 0.06 46 30 0.25 0.06 43 4 0.07 0.05 44 31 –0.00 0.04 40 5 –0.00 0.04 42 32 0.08 0.05 43 6 0.06 0.06 42 33 0.05 0.01 42 7 0.10 0.06 44 34 0.02 0.04 43 8 –0.10 0.01 40 35 0.05 0.03 43 9 0.06 0.02 42 36 0.15 0.03 43 10 0.06 0.03 43 37 0.08 0.04 44 11 0.00 0.04 42 38 –0.02 –0.02 41 12 –0.07 0.01 41 39 0.00 0.01 41 13 –0.00 0.00 42 40 0.08 0.03 41 14 0.03 0.04 43 41 0.07 0.05 42 15 0.03 0.06 44 42 0.04 0.03 43 16 -0.03 0.02 40 43 0.08 0.03 42 Mean of daily returns from day 4 through day 43 =0.049% (0.0101)a t-statistics:b Day 0 return t = 28.40 Day 1 return t = 24.11 Day 2 return t = 9.85 Day 3 return t = 2.71 aStandard error of mean is in parentheses. b R t t = day i. 21",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 36,
    "chunk_index": 41,
    "word_count": 313,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "daily returns from day 4 through day 43 =0.049% (0.0101)a t-statistics:b Day 0 return t = 28.40 Day 1 return t = 24.11 Day 2 return t = 9.85 Day 3 return t = 2.71 aStandard error of mean is in parentheses. b R t t = day i. 21",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 36,
    "chunk_index": 42,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "Table 3b Average daily stock returns around the announcement date of splits and stock dividends; 84 pure stock dividends. Event Av. stk. Av. S&P %stk. Event Av. stk. %stk. Av. S&P %ret. day %ret. %ret. ret. > 0 day %ret. ret. > 0 –10 –0.12 0.13 37 17 –0.45 –0.01 29 –9 0.08 0.28 43 18 –0.38 0.13 31 –8 0.85 0.27 51 19 0.27 0.14 42 –7 0.84 0.20 39 20 –0.03 –0.05 40 –6 –0.10 0.13 39 21 –0.30 0.13 38 –5 0.04 0.10 40 22 0.27 0.08 40 –4 0.04 0.04 42 23 0.20 0.09 37 –3 –0.46 –0.00 31 24 –0.27 0.29 35 –2 –0.06 –0.06 37 25 –0.41 0.08 40 –1 0.32 0.15 36 26 0.42 0.16 39 0 2.82 0.16 74 27 0.01 0.20 44 1 3.05 0.16 68 28 0.27 0.11 40 2 1.26 0.28 54 29 –0.02 0.09 37 3 0.23 0.21 43 30 0.00 0.13 36 4 0.10 0.08 40 31 –0.021 0.09 35 5 0.01 0.08 38 32 –0.15 0.20 32 6 0.34 0.25 40 33 –0.55 0.08 29 7 0.59 0.16 40 34 0.26 0.18 39 8 –0.11 –0.02 30 35 0.29 0.20 42 9 0.34 –0.02 37 36 0.17 0.27 33 10 0.02 –0.01 42 37 0.91 0.10 47 11 0.23 0.08 39 38 –0.20 0.09 36 12 –0.50 0.02 30 39 –0.18 0.10 31 13 0.40 0.07 42 40 0.51 0.11 40 14 –0.31 0.11 35 41 0.00 0.04 32 15 0.38 0.16 39 42 0.33 0.03 39 16 0.15 –0.01 37 43 0.34 0.07 38 Mean of daily returns from day 4 through 43 = 0.069% (0.0511)a t-statistics: Day 0 return t = 8.62 Day 1 return t = 9.34 Day 2 return t = 3.73 Day 3 return t = 0.50 a Standard error of mean is in parentheses. 22",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 36,
    "chunk_index": 43,
    "word_count": 305,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "43 0.34 0.07 38 Mean of daily returns from day 4 through 43 = 0.069% (0.0511)a t-statistics: Day 0 return t = 8.62 Day 1 return t = 9.34 Day 2 return t = 3.73 Day 3 return t = 0.50 a Standard error of mean is in parentheses. 22",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 36,
    "chunk_index": 44,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "Table 3c Average daily stock returns around the announcement date of splits and stock dividends; 244 pure stock splits. Event Av. stk. Av. S&P %stk. Av. S&P %stk. Event Day Av. stk.%ret. day %rct. %ret. ret. > 0 %ret. ret. > 0 –10 0.65 0.10 52 17 0.23 –0.03 42 –9 0.54 0.14 52 18 –0.05 0.02 43 –8 0.17 0.15 44 19 0.16 –0.02 46 –7 0.84 0.10 49 20 0.22 0.03 47 –6 0.52 0.14 54 21 0.27 0.09 44 –5 0.50 0.13 51 22 0.04 0.06 47 –4 0.43 0.11 45 23 –0.03 0.08 44 –3 0.35 0.07 41 24 0.09 0.06 41 –2 0.54 0.05 53 25 0.05 –0.03 44 –1 0.37 0.10 50 26 –0.05 –0.08 46 0 1.96 0.07 67 27 0.23 –0.02 48 1 1.33 0.12 59 28 0.50 0.03 49 2 0.67 0.05 48 29 0.04 0.00 46 3 0.49 0.07 51 30 0.50 0.06 43 4 0.42 0.15 47 31 –0.23 –0.01 38 5 0.07 0.14 42 32 –0.02 –0.09 41 6 0.03 0.08 43 33 0.13 –0.05 39 7 0.14 0.09 46 34 –0.03 0.05 42 8 –0.02 0.06 40 35 0.07 –0.00 42 9 0.03 0.08 41 36 0.13 –0.04 48 10 0.36 0.07 46 37 0.21 –0.01 47 11 0.24 0.02 45 38 0.13 –0.01 45 12 –0.17 -0.01 41 39 –0.06 –0.00 40 13 0.02 0.03 43 40 –0.11 –0.08 42 14 –0.22 0.03 40 41 0.02 –0.03 44 15 –0.17 0.05 43 42 0.03 –0.01 45 16 –0.07 –0.04 39 43 0.11 0.00 42 Mean of daily returns from day 4 through day 43 =- 0.081% (0.0273)a t-statistics: Day 0 return t = 11.02 Day 1 return t = 7.33 Day 2 return t = 3.45 Day 3 return t = 2.40 a Standard error of mean is in parentheses. 23",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 36,
    "chunk_index": 45,
    "word_count": 305,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "0.11 0.00 42 Mean of daily returns from day 4 through day 43 =- 0.081% (0.0273)a t-statistics: Day 0 return t = 11.02 Day 1 return t = 7.33 Day 2 return t = 3.45 Day 3 return t = 2.40 a Standard error of mean is in parentheses. 23 Table 4 Mean two-day announcement returns and related statistics. Mean Cross- Announcement Sample announcement sectional return sign: size return standard error % positive Total sample 0.0344 0.00123 1762 74.2 Stock dividend 0.0490 0.00321 382 77.2 NYSE 0.0521 0.00493 143 82.5 AMEX 0.0471 0.00419 239 74.1 Stock split 0.0303 0.00128 1380 73.3 NYSE 0.0261 0.00144 850 73.5 AMEX 0.0371 0.00238 530 73.0 Pure only 0.0397 0.00306 328 74.4 Stock dividend 0.0589 0.00697 84 83.3 NYSE 0.0752 0.01251 24 87.5 AMEX 0.0524 0.00830 60 81.7 Stock split 0.0331 0.00324 244 71.3 NYSE 0.0240 0.00471 87 70.1 AMEX 0.0381 0.00426 157 72.0 Pure and no prior dividenda 0.0432 0.00455 176 73.3 Stock dividend 0.0646 0.00970 51 80.4 Stock split 0.0344 0.00485 125 70.4 Pure and next dividend 0.0290 0.00506 79 72.2 not an increase Stock dividend 0.0356 0.01460 14 78.6 Stock split 0.0275 0.00534 65 70.8 Simultaneous dividend but 0.0394 0.00436 113 85.0 unchanged Stock dividend 0.0533 0.00779 44 88.6 Stock split 0.0305 0.00488 69 82.6 aNo CRSP cash dividend declarations in the three years prior to day 0. 24",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 25,
    "page_range": "p.25-26",
    "total_pages": 36,
    "chunk_index": 46,
    "word_count": 227,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.25-26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "72.2 not an increase Stock dividend 0.0356 0.01460 14 78.6 Stock split 0.0275 0.00534 65 70.8 Simultaneous dividend but 0.0394 0.00436 113 85.0 unchanged Stock dividend 0.0533 0.00779 44 88.6 Stock split 0.0305 0.00488 69 82.6 aNo CRSP cash dividend declarations in the three years prior to day 0. 24 Table 5 Linear regressions with the two-day announcement return as the dependent variable (pure event sample). Stock split Stock dividend Variablea Coefficient t-statistic Coefficient t-statistic Regression I Intercept 0.0852 2.83 –0.0323 –0.28 MKT 0.8369 4.79 0.9900 1.78 RUNUP 0.0004 0.05 –0.0621 –4.07 LEAKRb –0.1348 –2.81 –0.3827 –2.65 BETA –0.0187 –3.12 0.0029 0.22 RVAR 29.4793 3.49 –6.8177 –0.55 DIVYLD 0.0083 0.05 –0.5231 –1.55 SIIRVAL – 0.0061 –2.33 –0.0037 –0.58 SPFAC 8.37E - 5 1.51 0.0013 1.23 N = 210 R2 = 0.27 F = 9.09 N = 74 R2 = 0.32 F = 3.82 Regression II Intercept 0.0940 2.40 –0.0959 –0.36 MKT 0.4361 1.45 1.6836 1.30 RUNUP – 0.0300 –2.00 –0.0757 –1.92 LEAKRb – 0.0338 –0.38 –0.1601 –0.64 BETA – 0.0086 –1.04 –0.0112 –0.34 RVAR 19.5648 1.39 10.4533 0.24 DIVYLD 0.4458 2.08 –0.9763 –1.06 SHRVAL –0.0098 –2.98 –0.0074 –0.67 SPFAC 0.0002 2.64 0.0023 1.15 PDIV 0.0084 2.42 –0.0031 –0.04 SDIV 0.0050 1.02 0.0141 0.18 N = 106 R2 = 0.36 F = 5.37 N = 26 R2 = 0.30 F = 0.65 25",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 26,
    "page_range": "p.26-27",
    "total_pages": 36,
    "chunk_index": 47,
    "word_count": 222,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.26-27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "–0.34 RVAR 19.5648 1.39 10.4533 0.24 DIVYLD 0.4458 2.08 –0.9763 –1.06 SHRVAL –0.0098 –2.98 –0.0074 –0.67 SPFAC 0.0002 2.64 0.0023 1.15 PDIV 0.0084 2.42 –0.0031 –0.04 SDIV 0.0050 1.02 0.0141 0.18 N = 106 R2 = 0.36 F = 5.37 N = 26 R2 = 0.30 F = 0.65 25 aBETA: The Vasicek-adjusted beta from the 250 trading days subsequent to the announcement. DIVYLD: The dollar value of the dividends declared in the 250 days prior to the announcement divided by the market value of the stock [exp(SIIRVA LEAKR: The firm's stock price increase between days 6 and 1 which cannot be explained by movements in the equally weighted CRSP index. MKT: The return on the CRSP equally weighted market index for the two-day announcement period times BETA. RUNUP: The firm's stock price increase between days 120 to 6 in announcement event time. RVAR: The Vasicek-adjusted market model residual variance from the 250 days subsequent to the announcement. SDIV [PDIV]: Split-adjusted percent change in the first cash dividend that is declared subsequent [prior] to day 0. SHRVAL: The logarithm of the market value of the stock's outstanding shares at the end of the year prior to the announcement. SPFAC: The gross split factor which is defined as the number of outstanding shares of stock after the stock distribution divided by the number of shares before the stock distribution. -1 -1 bLEAKR= . t = 5 t = 5 The alpha and beta coefficients are derived from , a regression which is estimated for the 250 trading days subsequent to the announcement by regressing the security's returns on the CRSP equally weighted index. The slope coefficients are then Bayesian adjusted with the Vasicek (1973) method and new alphas and residuals are calculated. 26",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 36,
    "chunk_index": 48,
    "word_count": 292,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "coefficients are derived from , a regression which is estimated for the 250 trading days subsequent to the announcement by regressing the security's returns on the CRSP equally weighted index. The slope coefficients are then Bayesian adjusted with the Vasicek (1973) method and new alphas and residuals are calculated. 26",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 36,
    "chunk_index": 49,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "Table 6a Average daily stock returns around the ex-dates of stock splits and stock dividends; all 1740 splits and stock dividends.a Event Av. stk. Av. S&P %stk. Event Av. stk. Av. S&P %stk. day %ret. %ret. ret. > 0 day %ret. %ret. ret. > 0 –10 –0.03 –0.06 44 17 0.02 0.04 42 –9 –0.09 0.03 40 18 0.11 0.01 40 –8 0.05 0.01 45 19 –0.05 0.00 41 –7 –0.01 0.03 42 20 0.05 0.02 42 –6 –0.05 –0.02 41 21 0.11 0.06 42 –5 –0.04 -0.06 42 22 0.07 –0.00 42 –4 0.09 –0.04 43 23 0.18 0.00 43 –3 0.02 –0.01 43 24 0.05 –0.01 43 –2 0.05 0.01 42 25 –0.01 0.01 41 –1 0.30 0.01 47 26 –0.06 0.02 38 0 0.78 –0.03 55 27 0.08 –0.00 41 1 0.44 0.00 47 28 –0.12 –0.05 39 2 0.29 0.01 46 29 0.00 –0.02 39 3 0.14 0.01 45 30 0.05 0.05 42 4 0.05 –0.04 42 31 0.11 0.01 42 5 –0.08 –0.06 41 32 0.09 0.03 42 6 0.02 0.03 40 33 0.07 –0.00 42 7 0.22 0.03 43 34 0.11 –0.02 42 8 0.06 –0.01 42 35 0.02 0.04 42 9 –0.07 0.00 39 36 0.00 –0.02 39 10 0.09 0.04 43 37 0.01 –0.04 41 11 0.15 0.04 41 38 –0.04 –0.03 39 12 –0.02 0.01 40 39 0.05 0.02 41 13 –0.14 –0.01 38 40 0.02 0.05 41 14 –0.08 –0.04 40 41 0.05 0.05 43 15 –0.03 –0.01 41 42 0.16 0.02 44 16 0.09 0.06 42 43 0.16 0.01 44 aAverage stock returns are computed using only post-announcement returns. 27",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 36,
    "chunk_index": 50,
    "word_count": 271,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "12 –0.02 0.01 40 39 0.05 0.02 41 13 –0.14 –0.01 38 40 0.02 0.05 41 14 –0.08 –0.04 40 41 0.05 0.05 43 15 –0.03 –0.01 41 42 0.16 0.02 44 16 0.09 0.06 42 43 0.16 0.01 44 aAverage stock returns are computed using only post-announcement returns. 27",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 36,
    "chunk_index": 51,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "Table 6b Average daily stock returns around the ex-dates of stock splits and stock dividends; 380 stock dividends.a Event Av. stk. Av. S&P %stk. Event Av. stk. Av. S&P %stk. day %ret. %ret. ret. > 0 day %ret. %ret. ret. > 0 –10 –0.02 -0.09 44 17 0.09 0.06 38 –9 0.03 –0.04 36 18 0.12 0.02 36 –8 0.19 0.01 41 19 0.00 –0.01 38 –7 0.37 0.10 46 20 0.07 –0.06 39 –6 0.12 0.01 42 21 –0.01 0.11 34 –5 0.26 –0.04 46 22 0.18 –0.02 40 –4 0.38 –0.08 44 23 0.22 0.09 40 –3 0.13 –0.06 43 24 0.10 0.01 43 –2 0.12 0.12 43 25 0.04 0.02 38 –1 1.05 0.04 57 26 –0.07 0.01 34 0 1.10 0.01 60 27 0.00 0.02 34 1 0.14 0.02 39 28 –0.14 0.02 34 2 –0.04 0.03 36 29 0.00 0.00 38 3 –0.05 0.07 36 30 –0.16 0.05 38 4 –0.23 –0.04 34 31 0.40 0.08 42 5 –0.21 -0.10 35 32 -0.01 0.11 38 6 –0.02 0.10 36 33 0.39 0.01 40 7 0.28 0.06 41 34 0.16 –0.02 38 8 0.05 –0.05 37 35 0.18 –0.01 40 9 –0.18 –0.04 36 36 –0.11 0.01 32 10 –0.08 0.02 36 37 0.15 –0.02 39 11 -0.06 –0.04 35 38 –0.17 –0.06 33 12 –0.28 0.05 32 39 0.09 0.01 36 13 0.03 0.03 37 40 –0.13 0.02 36 14 –0.08 0.05 33 41 0.03 0.13 39 15 –0.22 0.02 34 42 0.29 0.05 46 16 –0.20 0.07 34 43 0.08 –0.00 39 aAverage stock returns are computed using only post-announcement returns. 28",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 36,
    "chunk_index": 52,
    "word_count": 268,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "12 –0.28 0.05 32 39 0.09 0.01 36 13 0.03 0.03 37 40 –0.13 0.02 36 14 –0.08 0.05 33 41 0.03 0.13 39 15 –0.22 0.02 34 42 0.29 0.05 46 16 –0.20 0.07 34 43 0.08 –0.00 39 aAverage stock returns are computed using only post-announcement returns. 28",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 36,
    "chunk_index": 53,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "Table 6c Average daily stock returns around the ex-dates of stock splits and stock dividends; 1360 stock splits.a Event Av. stk. Av. S&P %stk. Event Av. stk. Av. S&P %stk. day %ret. %ret. ret. > 0 day %ret. %ret. ret. > 0 –10 –0.03 –0.06 44 17 0.00 0.04 43 –9 –0.11 –0.03 41 18 0.11 0.00 42 –8 0.03 0.01 45 19 –0.06 0.00 41 –7 –0.08 0.02 41 20 0.04 0.03 43 –6 – 0.09 –0.02 41 21 0.14 0.04 44 –5 –0.10 –0.07 41 22 0.04 0.00 43 –4 0.02 –0.03 43 23 0.16 –0.02 44 –3 –0.01 –0.00 43 24 0.03 –0.02 43 –2 0.03 –0.01 42 25 –0.02 0.01 41 –1 0.09 –0.00 44 26 –0.06 0.02 39 0 0.69 –0.03 53 27 0.10 –0.01 42 1 0.52 –0.00 50 28 –0.12 –0.07 40 2 0.38 – 0.00 49 29 0.00 –0.02 40 3 0.20 –0.01 47 30 0.10 0.04 43 4 0.12 – 0.04 44 31 0.03 –0.01 43 5 –0.04 –0.05 42 32 0.12 0.00 43 6 0.03 0.01 41 33 –0.02 –0.01 42 7 0.21 0.00 44 34 0.10 –0.02 43 8 0.06 0.00 44 35 –0.03 0.05 42 9 –0.04 0.02 40 36 0.03 –0.02 41 10 0.14 0.04 45 37 –0.03 –0.05 41 11 0.21 0.06 43 38 –0.00 –0.02 41 12 0.06 0.00 42 39 0.03 0.02 43 13 –0.18 –0.02 38 40 0.06 0.05 42 14 –0.08 –0.06 43 41 0.06 0.03 44 15 0.02 – 0.02 43 42 0.12 0.02 43 16 0.17 0.05 44 43 0.18 0.01 45 aAverage stock returns are computed using only post-announcement returns. 29",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 36,
    "chunk_index": 54,
    "word_count": 272,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "0.06 0.00 42 39 0.03 0.02 43 13 –0.18 –0.02 38 40 0.06 0.05 42 14 –0.08 –0.06 43 41 0.06 0.03 44 15 0.02 – 0.02 43 42 0.12 0.02 43 16 0.17 0.05 44 43 0.18 0.01 45 aAverage stock returns are computed using only post-announcement returns. 29",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 36,
    "chunk_index": 55,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "Table 6d Average daily stock returns around the ex-dates of stock splits and stock dividends; 238 stock dividends where the issuing firm is listed on the AMEX.a Event Av. stk. Av. S&P %stk Event Av. stk. Av. S&P %stk. day %ret. %ret. ret. > 0 day %ret. %ret. ret. > 0 –10 0.07 –0.04 47 17 0.05 0.00 37 –9 –0.09 0.01 33 18 0.11 0.06 36 –8 0.43 0.04 47 19 –0.07 –0.05 37 –7 0.56 0.14 46 20 0.10 –0.03 38 –6 0.25 0.11 43 21 0.12 0.06 34 –5 0.28 –0.02 45 22 0.19 –0.05 39 –4 0.29 -0.20 38 23 0.29 0.11 38 –3 0.03 –0.09 42 24 0.09 –0.03 44 –2 –0.08 0.08 39 25 0.18 –0.00 39 –1 1.10 0.01 57 26 0.06 0.08 36 0 1.30 –0.04 61 27 0.04 0.08 31 1 0.15 0.05 38 28 –0.17 0.06 32 2 –0.07 0.02 33 29 0.07 –0.02 37 3 -0.12 0.06 34 30 –0.37 0.01 34 4 –0.22 0.01 33 31 0.52 0.02 43 5 -0.18 -0.13 35 32 –0.06 0.14 36 6 -0.13 0.12 34 33 0.52 –0.01 42 7 0.48 0.06 39 34 0.05 –0.05 37 8 0.13 –0.05 39 35 0.20 –0.01 37 9 -0.26 –0.01 37 36 –0.11 –0.00 29 10 -0.05 –0.02 31 37 0.04 –0.04 38 11 0.06 –0.01 36 38 –0.15 –0.05 33 12 -0.34 0.07 31 39 0.11 0.02 35 13 0.02 0.02 38 40 –0.10 0.03 35 14 –0.15 0.06 30 41 –0.03 0.04 37 15 –0.20 0.06 34 42 0.16 0.03 43 16 –0.27 0.07 31 43 0.02 0.01 38 Table 6e Daily t-statistic for significance of return on days b h k i d a Sample Mean Standard error – 1 0 1 2 3 All events 0.038 0.0129 3.25 9.21 4.99 3.13 1.27 All events, 0.015 0.0264 6.28 6.58 0.76 – 0.33 – 0.39 stock dividends All events, 0.045 0.0139 0.52 7.43 5.47 3.86 1.79 stock splits AMEX stocks, 0.019 0.0326 5.31 6.29 0.64 – 0.44 – 0.68 stock dividends a Days 4-43 are used to calculate the mean and standard error. 30",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 36,
    "chunk_index": 56,
    "word_count": 352,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "All events, 0.015 0.0264 6.28 6.58 0.76 – 0.33 – 0.39 stock dividends All events, 0.045 0.0139 0.52 7.43 5.47 3.86 1.79 stock splits AMEX stocks, 0.019 0.0326 5.31 6.29 0.64 – 0.44 – 0.68 stock dividends a Days 4-43 are used to calculate the mean and standard error. 30",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 36,
    "chunk_index": 57,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "Table 7 Summary statistics three-day and five-day returns around ex-dates for subgroups.a Mean of Cross-sectional Mean of Cross-sectional Subsample Negative Zero Positive 3-day returnb standard error of mean 5-day returnc standard error of mean Split factor = 10% 0.0180 (0.0409) 0.00371 (0.00799) 77 (11) 3 (0) 129 (36) 0.0192 (0.0426) 0.00420 (0.00972) 10% < split factor ≤ 20% 0.0052 (0.0085) 0.00584 (0.01121) 26 (4) 0 (0) 28 (6) 0.0007 (0.0002) 0.00695 (0.01272) 20% < split factor ≤ 25% 0.0399 (0.0637) 0.00704 (0.02034) 32 (7) 3 (0) 82 (21) 0.0371 (0.0542) 0.00948 (0.02753) 25% < split factor ≤ 49% 0.0195 (0.0443) 0.00848 (0.01559) 20 (3) 1 (0) 30 (10) 0.0196 (0.0406) 0.01174 (0.02650) 49% < split factor < 75% 0.0193 (0.0256) 0.00334 (0.00938) 149 (27) 13 (1) 240 (42) 0.0244 (0.0284) 0.00411 (0.01176) 75% < split factor ≤ 100% 0.0103 (0.0136) 0.00190 (0.00497) 348 (53) 27 (5) 428 (77). 0.0169 (0.0199) 0.00253 (0.00638) 100% < split factor 0.0086 (0.0361) 0.00616 (0.01626) 50 (6) 3 (1) 51 (14) 0.0153 (0.0438) 0.00848 (0.02038) Total sample 0.0153 (0.0270) 0.00143 (0.00386) 702(111) 50 (7) 988(206) 0.0197 (0.0298) 0.00183 (0.00492) NYSE firms 0.0092 (0.0188) 0.00155 (0.00527) 418 (37) 31 (2) 540 (71) 0.0151 (0.0228) 0.00209 (0.00666) Stock dividend 0.0186 (0.0415) 0.00432 (0.0120) 50 (5) 1 (0) 91 (19) 0.0193 (0.0419) 0.00512 (0.01233) Stock split 0.0077 (0.0124) 0.00166 (0.00570) 368 (32) 30 (2) 449 (52) 0.0144 (0.0175) 0.00228 (0.00774) AMEX firms 0.0233 (0.0313) 0.00258 (0.00517) 284 (74) 19 (5) 448(135) 0.0258 (0.0333) 0.00323 (0.00661) Stock dividend 0.0255 (0.0458) 0.00430 (0.01054) 85 (17) 5 (0) 148 (44) 0.0237 (0.0413) 0.00541 (0.01412) Stock split 0.0222 (0.0255) 0.00321 (0.00584) 199 (57) 14 (5) 300 (91) 0.0268 (0.0302) 0.00401 (0.00735) No cash dividend in 3 years 0.0218 (0.0304) 0.00367 (0.00526) 148 (60) 7 (1) 229(115) 0.0267 (0.0345) 0.00461 (0.00676) prior to announcement date Previous cash dividend 0.0134 (0.0230) 0.00151 (0.00569) 554 (51) 43 (6) 759 (91) 0.0178 (0.0241) 0.00195 (0.00716) aNumbers in parentheses are for the pure subsample. bDays – 1 through +1. cDays – 1 through +3. 31",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 36,
    "chunk_index": 58,
    "word_count": 338,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "(0.00526) 148 (60) 7 (1) 229(115) 0.0267 (0.0345) 0.00461 (0.00676) prior to announcement date Previous cash dividend 0.0134 (0.0230) 0.00151 (0.00569) 554 (51) 43 (6) 759 (91) 0.0178 (0.0241) 0.00195 (0.00716) aNumbers in parentheses are for the pure subsample. bDays – 1 through +1. cDays – 1 through +3. 31 Fig. 1. Plot of the cumulative daily (unadjusted) returns for an equally weighted portfolio of the pure event sample (N = '328), around the announcement date. The cumulative daily returns are plotted in event time; day 0 is the announcement day of the split or stock dividend. 32",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "1. Introduction",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 36,
    "chunk_index": 59,
    "word_count": 98,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "+3. 31 Fig. 1. Plot of the cumulative daily (unadjusted) returns for an equally weighted portfolio of the pure event sample (N = '328), around the announcement date. The cumulative daily returns are plotted in event time; day 0 is the announcement day of the split or stock dividend. 32 Fig. 2. Plot of the cumulative daily (unadjusted) returns for an equally weighted portfolio of the total sample (N = 1740), around the ex-date. The cumulative daily returns are plotted in event time; day 0 is the ex-date of the split or stock dividend. 33",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "EVENT DAY",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 36,
    "chunk_index": 60,
    "word_count": 95,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "EVENT DAY (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "split or stock dividend. 32 Fig. 2. Plot of the cumulative daily (unadjusted) returns for an equally weighted portfolio of the total sample (N = 1740), around the ex-date. The cumulative daily returns are plotted in event time; day 0 is the ex-date of the split or stock dividend. 33",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "References",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 36,
    "chunk_index": 61,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "Aharony, J. and I. Swary, 1980, Quarterly dividend and earnings announcements and stockholders' returns: An empirical analysis, Journal of Finance 35, 1-12. American Bar Foundation, 1971, Commentaries on indentures (Chicago, IL). Akerlof, G., 1970, The market for 'lemons': Quality uncertainty and the market mechanism, Quarterly Journal of Economics 84, 448-500. Asquith, P. and D. Mullins, 1983, The impact of initiating dividend payments on shareholders' wealth, Journal of Business 56, 77-96. Atiase, R., 1980, Predisclosure, informational asymmetries, firm capitalization, financial reports, and security price behavior, Unpublished doctoral dissertation (University of California, Berkeley, CA). Bar-Yosef, S. and L. Brown, 1977, A re-examination of stock splits using moving betas, Journal of Finance 32, 1069-1080. Bhattacharya, S., 1979, Imperfect information, dividend policy and ' the bird in the hand' fallacy, Bell Journal of Economics 10, 259-70. Brickley, J., 1983, Shareholder wealth, information signaling and the specially designated dividend, Journal of Financial Economics 12, 187-209. Brown, P., A. Kleidon and T. Marsh, 1983, New evidence on the nature of size-related anomalies in stock prices, Journal of Financial Economics 12, 33-55. Brown, S. and J. Warner, 1980, Measuring security price performance, Journal of Financial Economics 8, 205-258. Charest, G., 1978, Split information, stock returns, and market efficiency, Journal of Financial Economics 6, 265-296. Choi, D. and R. Strong, 1983, The pricing of when-issued common stock: A note, Journal of Finance 38, 1293-1298. Chottiner, S. and A. Young, 1971, A test of the AICPA differentiation between stock dividends and stock splits, Journal of Accounting Research 9, 367-374. Dann, L., 1981, Common stock repurchases: An analysis of returns to bondholders and stock- holders, Journal of Financial Economics 9, 113-138. Davidson, S., C. Stickney and R. Weil, 1982, Financial accounting: An introduction to concepts, methods, and uses, 3rd ed. (Dryden Press: Hinsdale, IL). Eades, K., 1982, Empirical evidence on dividends as a signal of firm value, Journal of Financial and Quantitative Analysis 17, 471-502. Eades, K., P. Hess and H. Kim, 1984, On interpreting security returns during the ex-dividend period, Journal of Financial Economics 13, 3-34. Elton, E. and M. Gruber, 1970, Marginal stockholder tax rates and the clientele effect, Review of Economics and Statistics 52, 68-74. Fama, E., 1976, Foundations of finance (Basic Books, New York). Fama, E., L. Fisher, M. Jensen and R. Roll, 1969, The adjustment of stock prices to new information, International Economic Review 10, 1-21. Foster, T. and D. Vickrey, 1978, The information content of stock dividend announcements, The Accounting Review 53, 360-370. Heinkel, R., 1984, A theory of credibility: Costless signals in a rational expectations, infinite horizon model, Working paper (University of British Columbia, Vancouver). 34",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "References",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 36,
    "chunk_index": 62,
    "word_count": 433,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "to new information, International Economic Review 10, 1-21. Foster, T. and D. Vickrey, 1978, The information content of stock dividend announcements, The Accounting Review 53, 360-370. Heinkel, R., 1984, A theory of credibility: Costless signals in a rational expectations, infinite horizon model, Working paper (University of British Columbia, Vancouver). 34",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "References",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 36,
    "chunk_index": 63,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "Henn, H., 1970, Handbook of the law of corporations and other business enterprises (West Publishing Co., St. Paul, MN). Hess, P., 1982, The ex-dividend day behavior of stock returns: Further evidence on tax effects, Journal of Finance 37, 445-456. Kalay, A., 1982, The ex-dividend day behavior of stock prices: A re-examination of the clientele effect, Journal of Finance 37, 1059-1070. Kwan, C., 1981, Efficient market tests of the informational content of dividend announcements: Critique and extension, Journal of Financial and Quantitative Analysis 16, 193-205. Lakonishok, J. and T. Vermaelen, 1983, Tax reform and ex-dividend day behavior, Journal of Finance 38, 1157-1176. Leland, H. and D. Pyle, 1977, Informational asymmetries, financial structure, and financial intermediation, Journal of Finance 32, 371-387. Lintner, J., 1956, Distribution of incomes of corporations among dividends, retained earnings,. and taxes, American Economic Review 46, 97-113. Masulis, R., 1980a, Stock repurchase by tender offer: An analysis of the causes of common stock price changes, Journal of Finance 35, 305-319. Masulis, R., 1980b, The effects of capital structure change on security prices: A study of exchange offers, Journal of Financial Economics 8, 139-178. Masulis, R., 1983, The impact of capital structure change on firm value: Some estimates, Journal of Finance 38, 107-126. Ohlson, J. and S. Penman, 1984, Variance increases subsequent to stock splits: An empirical aberration, Working paper (University of California, Berkeley, CA). Pettit, R., 1972, Dividend announcements, security performance, and capital market efficiency, Journal of Finance 27, 993-1007. Poterba, J., 1982, Dividends and taxes: Interpreting ex-dividend evidence, Working paper (Mas- sachusetts Institute of Technology, Cambridge, MA). Ross, S., 1977, The determination of financial structure: The incentive signalling approach, Bell Journal of Economics 8, 23-40. Simmons, Richard, 1972, Drafting of commercial bank loan agreements, Business Lawyer 28, 179-201. Spence, A.M., 1973, Job market signalling, Quarterly Journal of Economics 87, 355-374. Vasicek, 0., 1973, A note on using cross-sectional information in Bayesian estimation of security betas, Journal of Finance 8, 1233-1239. Vermaelen, T., 1981, Common stock repurchases and market signalling: An empirical study, Journal of Financial Economics 9, 139-183. Watts, R., 1973, The information content of dividends, Journal of Business 46, 191-211. Weston, J. and E. Brigham, 1981, Managerial finance, 7th ed. (Dryden Press, Hinsdale, IL) Woolridge, R., 1983a, Ex-date stock price adjustment to stock dividends: A note, Journal of Finance 38, 247-255. Woolridge, R., 1983b, Stock dividends as signals, Journal of Financial Research 6, 1-12. 35",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "References",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 36,
    "chunk_index": 64,
    "word_count": 398,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  },
  {
    "text": "Journal of Business 46, 191-211. Weston, J. and E. Brigham, 1981, Managerial finance, 7th ed. (Dryden Press, Hinsdale, IL) Woolridge, R., 1983a, Ex-date stock price adjustment to stock dividends: A note, Journal of Finance 38, 247-255. Woolridge, R., 1983b, Stock dividends as signals, Journal of Financial Research 6, 1-12. 35",
    "title": "The Valuation Effects of Stock Splits and Stock Dividends.1",
    "source_type": "pdf",
    "document_id": "384c2bcfd899",
    "source_file": "The Valuation Effects of Stock Splits and Stock Dividends.pdf",
    "section": "References",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 36,
    "chunk_index": 65,
    "word_count": 50,
    "author": "ronald.masulis",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070620110121-05'00'",
    "duration": null
  }
]