[
  {
    "text": "THE JOURNAL OF FINANCE * VOL. L, NO. 1 * MARCH 1995 Size and Book-to-Market Factors in Earnings and Returns EUGENE F. FAMA and KENNETH R. FRENCH* ABSTRACT We study whether the behavior of stock prices, in relation to size and book-to- market-equity (BE/ME), reflects the behavior of earnings. Consistent with rational pricing, high BE/ME signals persistent poor earnings and low BE/ME signals strong earnings. Moreover, stock prices forecast the reversion of earnings growth observed after firms are ranked on size and BE/ME. Finally, there are market, size, and BE/ME factors in earnings like those in returns. The market and size factors in earnings help explain those in returns, but we find no link between BE/ME factors in earnings and returns. FAMA AND FRENCH (1992) FIND that two variables, market equity (ME) and the ratio of book equity to market equity (BE/ME) capture much of the cross- section of average stock returns. If stocks are priced rationally, systematic differences in average returns are due to differences in risk. Thus, with rational pricing, size (ME, stock price times shares outstanding) and BE/ME must proxy for sensitivity to common risk factors in returns. Fama and French (1993) confirm that portfolios constructed to mimic risk factors re- lated to size and BE/ME add substantially to the variation in stock returns explained by a market portfolio. Moreover, a three-factor asset-pricing model that includes a market factor and risk factors related to size and BE/ME seems to capture the cross-section of average returns on U.S. stocks. The evidence that size and book-to-market-equity proxy for sensitivity to risk factors in returns is consistent with a rational-pricing story for the role of size and BE/ME in average returns. But return tests cannot tell a complete economic story. Size and BE/ME remain arbitrary indicator vari- ables that, for unexplained economic reasons, are related to risk factors in returns. The goal here is to begin to fill this economic void. Specifically, we study whether the behavior of stock prices, in relation to size and book-to- market-equity, is consistent with the behavior of earnings. We first ask whether stock prices properly reflect differences in the evolu- tion of profitability when stocks are grouped on size and BE/ME. We confirm that, as predicted by simple rational-pricing models, BE/ME is related to * Graduate School of Business, University of Chicago, 1101 East 58th St., Chicago, IL 60637, and Yale School of Management, Box 208200, New Haven, CT 06520. The comments of David Booth, Josef Lakonishok, Stephen Penman, Rex Sinquefield, Rene Stulz, and two referees are gratefully acknowledged. This research is supported by the National Science Foundation (Fama) and the Center for Research in Securities Prices (French). 131",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 25,
    "chunk_index": 0,
    "word_count": 445,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "and Yale School of Management, Box 208200, New Haven, CT 06520. The comments of David Booth, Josef Lakonishok, Stephen Penman, Rex Sinquefield, Rene Stulz, and two referees are gratefully acknowledged. This research is supported by the National Science Foundation (Fama) and the Center for Research in Securities Prices (French). 131",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 25,
    "chunk_index": 1,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "132 The Journal of Finance persistent properties of earnings. High BE/ME (a low stock price relative to book value) signals sustained low earnings on book equity. High-BE/ME stocks are less profitable than low-BE/ME stocks for four years before and at least five years after ranking dates. In a nutshell, low BE/ME (a high stock price relative to book value) is typical of firms with high average returns on capital (growth stocks), whereas high BE/ME is typical of firms that are relatively distressed. Size is also related to profitability. Controlling for BE/ME, small stocks tend to have lower earnings on book equity than do big stocks. The size effect in earnings is, however, largely due to the low profits of small stocks after 1980. Until 1981, profitability shows little relation to size. But the recession of 1981 and 1982 turns into a prolonged earnings depression for small stocks. For some reason, which remains unexplained, small stocks do not participate in the boom of the middle and late 1980s. Like Penman (1991), we find that low-book-to-market-equity firms remain more profitable than high-BE/ME firms for at least five years after portfolios are formed on BE/ME. Like Lakonishok, Shleifer, and Vishny (LSV, 1994), however, we find that the growth rates of earnings of low- and high-BE/ME stocks become more similar in the years after portfolio formation. LSV argue that the market does not understand this convergence of earnings growth. They hypothesize that in the years after portfolio formation, the market extrapolates the strong pre-formation earnings growth of low-BE/ME stocks and the poor growth of high-BE/ME stocks. Low-BE/ME stocks then have low average returns because future earnings growth is weaker than the market expects, and high-BE/ME stocks have high average returns because earnings growth is stronger than expected. In short, LSV hypothesize that the higher average returns of high-book-to-market stocks simply correct irrational pricing. Our tests do not support the LSV story. The behavior of earnings/price ratios and stock returns suggests that once stocks are allocated to portfolios based on size and BE/ME, the market makes unbiased forecasts of earnings growth. Specifically, the market understands that the vastly different earn- ings growth rates of low- and high-book-to-market stocks prior to portfolio formation tend to converge in the post-formation period. Our evidence on the evolution of profitability and earnings/price ratios in relation to size and book-to-market-equity is consistent with rational pricing. It also provides an interesting picture of how size and BE/ME relate to economic fundamentals. But this initial analysis does not address the specific asset-pricing issue raised by the size and BE/ME risk factors in stock returns. Rational stock prices are discounted expected future earnings (net cash flows). If the size and BE/ME risk factors in returns (unexpected changes in stock prices) are the result of rational pricing, they must be driven by common factors in shocks to expected earnings that are related to size and BE/ME. We document size and book-to-market factors in earnings like those in returns. The earnings of firms in different size-BE/ME groups load on 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 25,
    "chunk_index": 2,
    "word_count": 539,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "earnings like those in returns. The earnings of firms in different size-BE/ME groups load on 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 25,
    "chunk_index": 3,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "Size and Book-to-Market Factors in Earnings and Returns 133 market, size, and BE/ME factors in earnings in much the same way that their stock returns load on the market, size, and BE/ME factors in returns. The fact that the common factors in returns mirror common factors in earnings suggests that the market, size, and book-to-market factors in earn- ings are the source of the corresponding factors in returns. The tracks of the market and size factors in earnings are clear in returns. The weak link in our rational asset-pricing story is, however, the absence of evidence that the book-to-market factor in earnings drives the book-to-market factor in returns. We speculate that this negative result is caused by noise in our measure of shocks to expected earnings. The tests center on six portfolios formed on ranked values of size and BE/ME for individual stocks. The first step (Sections I and II) is to describe the portfolios and our measure of profitability. We then (Section III) examine the behavior of earnings for the 11 years around portfolio formation. The purpose is to study the evolution of profitability for a long period before and after firms are ranked on size and BE/ME. Section IV examines profitability in chronological time, to show how the performance of different size and book-to-market combinations relates to business conditions. Section V uses earnings/price ratios, earnings growth rates, and stock returns to study the LSV extrapolation story. Having established in Sections III and IV that the level of earnings is related to size and BE/ME, we show in Section VI that there are market, size, and BE/ME factors in shocks to earnings that look a lot like those in stock returns. Section VII then examines the links between returns and these common factors in earnings. I. The Size-BE / ME Portfolios We focus on six portfolios, formed yearly from a simple sort of firms into two groups on ME and another simple sort into three groups on BE/ME. In June of each year t from 1963 to 1992, we rank all New York Stock Exchange (NYSE) stocks in the Center for Research in Securities Prices (CRSP) database on size, ME (price times shares outstanding). We then use the median NYSE size to allocate NYSE, American Stock Exchange (AMEX), and (after 1972) NASDAQ Stock Market stocks to two groups, small or big (S or B). Most AMEX and NASDAQ stocks are smaller than the NYSE median, so the small group contains many more stocks (3626 of 4878 in 1992). But the small group contains far less than half (about 7.3 percent in 1992) of the combined value of the two size groups. We also break NYSE, AMEX, and NASDAQ stocks into three book-to- market groups based on the breakpoints for the bottom 30 percent (Low), middle 40 percent (Medium), and top 30 percent (High) of the ranked values of BE/ME for NYSE stocks. BE/ME is book common equity for the fiscal year ending in calendar year t - 1, divided by market equity at the end of December of year t - 1. We do not use negative BE firms, which are rare on COMPUSTAT prior to 1980, when calculating the breakpoints for BE/ME or when forming the size-BE/ME portfolios. 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 25,
    "chunk_index": 4,
    "word_count": 575,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "prior to 1980, when calculating the breakpoints for BE/ME or when forming the size-BE/ME portfolios. 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 25,
    "chunk_index": 5,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "134 The Journal of Finance The final portfolios are the six intersections of the two ME and the three BE/ME groups (S/L, S/M, S/H, B/L, B/M, and B/H). For example, the S/L portfolio contains the stocks in the small-ME group that are also in the low-BE/ME group, while the B/H portfolio contains the big stocks that also have high BE/ME. Monthly value-weighted stock returns for the six portfo- lios are calculated from July of year t to June of year t + 1, and the portfolios are reformed in June of year t + 1. We calculate returns beginning in July of year t to be sure that book equity for year t - 1 is known. To be included in the returns tests, a firm must have CRSP stock prices for December of year t - 1 and June of year t, and COMPUSTAT book equity for year t - 1. When we examine profitability and other fundamentals, we also require that firms have COMPUSTAT earnings and sales for year t. This added data requirement is not imposed when we calculate stock returns, however, so it does not lead to look-ahead bias in the returns. Moreover, to reduce the survival bias inherent in the way COMPUSTAT adds firms to its tapes (Banz and Breen (1986)), we do not include firms until they are on COMPUSTAT for two years. Finally, we choose 1962 as the start date for the tests because COMPUSTAT data prior to 1962 have a strong bias toward big, successful firms. II. Profitability: Earnings on Book Equity Our measure of profitability is EI(t)/BE(t - 1), the ratio of common equity income for the fiscal year ending in calendar year t to the book value of common equity for year t - 1. EI(t) is earnings before extraordinary items but after depreciation, taxes, interest, and preferred dividends. EI(t) is a reasonable proxy for the economic income for year t on the book equity of year t - 1 if depreciation (book not tax) is a reasonable measure of the value of assets used up in generating sales. We can report, however, that measur- ing income before depreciation, or before depreciation and taxes, produces results like those for EI(t)/BE(t - 1). EI(t)/BE(t - 1) is the sum of EIi(t) for all firms i in a portfolio, divided by the sum of BEi(t - 1). EI(t)/BE(t - 1) is thus the return on book equity of a firm that would result from merging all firms in the portfolio. We would prefer an inflation-adjusted measure of book common equity in EI(t)/BE(t - 1), but it is not generally available. For our purposes, this is not a problem if the effect of inflation on EI(t)/BE(t - 1) does not differ systematically across the six size-BE/ME portfolios. III. The Persistence of Profitability A simple model is useful for thinking about the relation between book-to- market-equity and expected stock return, and between BE/ME and earnings on book equity. Consider an all-equity firm that finances its investments entirely with retained earnings. Dividends paid by the firm in any year t 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 25,
    "chunk_index": 6,
    "word_count": 550,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "its investments entirely with retained earnings. Dividends paid by the firm in any year t 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 25,
    "chunk_index": 7,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "Size and Book-to-Market Factors in Earnings and Returns 135 (D(t)) are equal to equity income plus depreciation (DP(t)) minus investment outlays (I(t)), D(t) = EI(t) + DP(t) - I(t). Suppose that at time t expected depreciation and investment for any year t + i are proportional to expected future equity income, that is, EtD(t + i) = Ej[EI(t + i) + DP(t + i) - I(t + i)] = EtEI(t + i)(1 + k -k2), where k1 and k2 are the proportionality factors. If the discount rate, r, for expected dividends is constant, the value of market equity at t is, 00 E EI(t + i) ME(t) = (1 + k1 - k2) E (1 +r) (1) and the ratio of market-to-book-equity is, BE?(t) .i=1 (1 + r) (2 This simple model predicts that firms with higher required equity returns, r, will have higher book-to-market ratios. The prediction is consistent with the positive relation between average stock return and BE/ME observed by Fama and French (1992, 1993) and others. More important for current purposes, equations (1) and (2) say that brief periods when equity income is expected to be high or low relative to book equity do not have much effect on market equity and the book-to-market ratio. Thus, the prediction is that high BE/ME should be associated with a persistently low ratio of earnings to book equity, while low BE/ME should be associated with persistently strong EI/BE. Figure 1 supports this prediction. Figure 1 shows mean values of EI(t + i)/BE(t + i - 1) for 11 years around portfolio information. For each portfolio formation year t, the ratios are calculated for year t + i, i = -5, ... , 5, using firms with accounting data for years t and t + i, but not necessarily for other years. The ratio for year t + i is then averaged across portfolio formation years. The plots capture average profitability, as a function of size and BE/ME, for a long period around portfolio formation. The question addressed is: how do earnings behave before firms are classified as small or big on ME and low or high on BE/ME, and how does profitability evolve in the years after portfolio formation? Like Tables 2 and 3 in Penman (1991), Figure 1 shows that book-to- market-equity is associated with persistent differences in profitability, mea- sured by EI/BE. Low-BE/ME stocks are on average more profitable than high-BE/ME stocks for four years before and at least five years after portfolio formation. Moreover, although the simple model of equations (1) and 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 25,
    "chunk_index": 8,
    "word_count": 460,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "least five years after portfolio formation. Moreover, although the simple model of equations (1) and 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 25,
    "chunk_index": 9,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "136 The Journal of Finance 0.24 0.20 B/L 0.16 S/L 0.12 Lli B/H 0.08 . - S/H 0.04 .0.00 , , , I , -5 -4 -3 -2 -1 0 1 2 3 4 5 Year i Relative to Ranking Year Figure 1. The 11-year evolution of earnings on book equity, EI(t + i) /BE(t + i - 1), for size-BE/ME portfolios formed in June of year t (year 0 on the horizontal axis). For each portfolio formation year t = 1963 to 1991, the ratios are calculated for t + i, i = - 5,..., 5. The ratio for t + i is then averaged across portfolio formation years t. EI(t + i) is earnings before extraordinary items but after interest, depreciation, taxes, and preferred dividends for the fiscal year ending in calendar year t + i. BE(t + i - 1) is book common equity for t + i - 1. S or B indicates that the portfolio contains NYSE, AMEX, and NASDAQ stocks below (S) or above (B) the median size (ME) of NYSE stocks. L or H indicates that the portfolio contains NYSE, AMEX, and NASDAQ Stocks in the bottom 30 percent (L) or top 30 percent (H) of the values of book-to-market-equity (BE/ME) for NYSE stocks. (2) makes no prediction on the matter, Figure 1 shows that profitability is also related to size. Small stocks have persistently lower EI/BE than big stocks. BE/ME is, however, a stronger indicator of profitability than size. The size effect in profitability is conditional. Given that BE/ME is high (or low), small stocks on average have lower EI/BE than big stocks. In contrast, the relation between BE/ME and EI/BE is unconditional. From four years before to at least five years after portfolio formation, both low-BE/ME portfolios are more profitable than either high-BE/ME portfolio. Although low-BE/ME stocks tend to be highly profitable long before and after they are sorted into portfolios, Figure 1 shows that their profitability improves prior to portfolio formation, and deteriorates a bit thereafter. The reverse pattern of decay and then improvement in EI/BE is observed for high-BE/ME stocks. Moreover, the tendency of profitability to revert is stronger for small stocks than for big stocks. 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 25,
    "chunk_index": 10,
    "word_count": 402,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "the tendency of profitability to revert is stronger for small stocks than for big stocks. 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 25,
    "chunk_index": 11,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "Size and Book-to-Market Factors in Earnings and Returns 137 Table I characterizes the reversion of EI/BE in terms of the behavior of EI, BE, and total book assets (A) in the 11 years around portfolio formation. Because EI is sometimes negative for the small-stock portfolios, we cannot use percentage changes to describe the growth of earnings. Instead we examine the path of EIp(t + i)/EIm(t + i), the ratio of equity income for portfolio p to equity income for the market. We standardize the ratios so that they are 1.0 for all portfolios in the year of portfolio formation (i = 0). For consistency, this approach is also used to measure the growth of BE and A. Table I shows why EI(t + i)/BE(t + i - 1) peaks around the year of portfolio formation (i = 0) for the two low-book-to-market portfolios. The earnings of low-BE/ME stocks, small and big, grow a lot relative to market earnings through the year of portfolio formation. The earnings of small low-BE/ME stocks continue to grow relative to market earnings but less rapidly. The earnings of big low-BE/ME stocks grow about like market earnings after year t + 1. Why then does EI/BE fall for low-BE/ME stocks after portfolio formation? Because book equity grows faster than earnings. In short, in the years preceding portfolio formation, the earnings of low-BE/ME stocks grow faster than book equity, causing EI/BE to increase, but the opposite is true in the years after portfolio formation. The whole story reverses for high-book-to-market stocks. Their earnings drop faster than book equity in the years preceding portfolio formation (Table I), so EI/BE declines (Figure 1). In the years after portfolio formation, the earnings of big high-BE/ME stocks decline a bit relative to market earnings, but the decline in earnings is weaker than the decline in book equity, so EI/BE increases. After an abysmal decline through the year of portfolio formation, the earnings of small high-BE/ME stocks rebound a bit, but their book equity declines relative to market BE. The result is a stronger post- portfolio-formation increase in EI/BE for small high-BE/ME stocks than for big high-BE/ME stocks. We suggest a simple economic story for the behavior of earnings, book equity, and assets (which behave much like book equity). Sometime prior to portfolio formation low-BE/ME firms experience a demand or supply shock that increases their average return on capital. The profit-maximizing re- sponse is to expand output and investment until, at the margin, earnings on investment return to competitive-equilibrium levels. Conversely, high- BE/ME firms experience a demand or supply shock that decreases their average return on capital. The profit-maximizing response is to restructure, that is, to let output and investment contract until, at the margin, earnings on investment return to competitive-equilibrium levels. Note, however, that the rebound in earnings for small high-book-to-market stocks in the five years after portfolio formation (Table I) recaptures only a small part of the earnings lost in the years preceding portfolio formation. Five years after portfolio formation, the ratio of earnings to book equity for small high-BE/ME stocks is still below that of big high-BE/ME stocks, which in turn is much below the EI/BE ratios of the two low-BE/ME portfolios (Figure 1). Thus, despite the reversion of profitability after portfolio forma- 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 25,
    "chunk_index": 12,
    "word_count": 579,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "the two low-BE/ME portfolios (Figure 1). Thus, despite the reversion of profitability after portfolio forma- 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 25,
    "chunk_index": 13,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "138 The Journal of Finance Table I Economic Fundamentals in the 11 Years around Portfolio Formation At the end of June of each year t (1963 to 1992), New York Stock Exchange (NYSE), American Stock Exchange (AMEX), and NASDAQ stock market stocks are allocated to two groups (small or big, S or B) based on whether their June market equity (ME, stock price times shares outstanding) is below or above the median ME for NYSE stocks. NYSE, AMEX, and NASDAQ stocks are allocated in an independent sort to three book-to-market-equity (BE/ME) groups (low, medium, or high; L, M, or H) based on the breakpoints for the bottom 30 percent, middle 40 percent, and top 30 percent of the values of BE/ME for NYSE stocks. BE is the COMPUSTAT book value of stockholders' equity, plus balance sheet deferred taxes and investment tax credit (if available), minus the book value of preferred stock. Depending on availability, we use the redemption, liquidation, or par value (in that order) to estimate the book value of preferred stock. Book-to-market-equity (BE/ME) is then book common equity for the fiscal year ending in calendar year t - 1, divided by market equity at the end of December of year t - 1. The six size-BE/ME portfolios (S/L, S/M, S/H, B/L, B/M, B/H) are the intersections of the two ME and the three BE/ME groups. We do not use negative BE firms, which are rare prior to 1980, when calculating the breakpoints for BE/ME or when forming the size-BE/ME portfolios. Also, only firms with ordinary common equity (as classified by the Center for Research in Securities Prices, (CRSP)) are included in the tests. This means that American depositary receipts, real estate investment trusts, and units of beneficial interest are excluded. The market portfolio (Mkt) includes all stocks in the six size-BE/ME portfolios, plus the negative BE stocks excluded from the portfolios. A(t) is total assets, and EI(t) is earnings before extraordinary items but after interest, depreciation, taxes, and preferred dividends for the fiscal year ending in calendar year t. For a portfolio, A, BE, and El are the sums for the stocks in the portfolio. In Panel A, El, BE, and A for the size-BE/ME portfolios are measured relative to the values of the variables for the market portfolio, and then standardized so the ratios are 1.0 in the portfolio formation year. For example, if p is a size-BE/ME portfolio and m is the market, we calculate EIp(t + j)/EIm(t + i) and EIp(t)/EIm(t) for each portfolio formation year t and each lead or lag i, i = -5,...,5, using firms that have data in years t and t + i. The two ratios are then averaged, separately, across portfolio formation years t = 1963 to 1991. The table shows Mean[EIp(t + i)/EIm(t + i)]/Mean[EIp(t)/EIm(t)] for i = -5,...,5. In Panel B, EI(t + i)/ME(t + i - 1) is the ratio of the sums of El for year t + i and ME for December of year t + i - 1 for all firms in a portfolio that have the required data for t + i and the portfolio formation year t. Mean[ EI(t + i)/ME(t + i - 1)] is the average of EI(t + i)/ME(t + i - 1) across the portfolio formation years t = 1963 to 1991. In Panel C, i = 0 is the 12 months preceding portfolio formation, at the end of June of each year from 1963 to 1992. Value-weighted monthly returns on the portfolios formed in each year t are calculated for years t - 5 to t + 5. The average monthly value-weighted returns for each year relative to portfolio formation are then averaged across all portfolio formation years. Year i Relative to Portfolio Formation -5 -4 -3 -2 -1 0 1 2 3 4 5 Panel A. Mean of Ratio-to-Market for t + i Divided by Mean for t Earnings: Mean[EIp(t + i)/EIm(t + i)]/Mean[EIp(t)/EIm(t)] S/L 0.649 0.668 0.705 0.817 0.947 1.000 0.932 0.973 1.031 1.086 1.150 S/H 5.442 4.520 3.839 3.001 2.137 1.000 0.978 1.135 1.299 1.386 1.438 B/L 0.700 0.727 0.762 0.821 0.903 1.000 1.038 1.044 1.038 1.041 1.038 B/H 1.459 1.466 1.425 1.343 1.173 1000 0.950 0.951 0.909 0.879 0.921 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 25,
    "chunk_index": 14,
    "word_count": 742,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "1.038 1.041 1.038 B/H 1.459 1.466 1.425 1.343 1.173 1000 0.950 0.951 0.909 0.879 0.921 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 25,
    "chunk_index": 15,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "Size and Book-to-Market Factors in Earnings and Returns 139 Table I-Continued Year i Relative to Portfolio Formation -5 -4 -3 -2 -1 0 1 2 3 4 5 Panel A. Mean of Ratio-to-Market for t + i Divided by Mean for t Book Equity: Mean[ BEp(t + i - 1)/BEm(t + i - 1)]/Mean[ BEp(t - 1)/BEm(t - 1)] S/L 0.953 0.927 0.904 0.896 0.928 1.000 1.131 1.240 1.341 1.432 1.522 S/H 1.153 1.136 1.117 1.093 1.052 1.000 0.941 0.912 0.900 0.900 0.907 B/L 0.882 0.887 0.907 0.931 0.961 1.000 1.051 1.090 1.122 1.145 1.162 B/H 1.039 1.039 1.042 1.038 1.025 1.000 0.960 0.924 0.893 0.865 0.837 Assets: Mean[Ap(t + i - 1)/An(t + i - 1)]/Mean[Ap(t - 1)/Am(t - 1)] S/L 0.903 0.894 0.882 0.890 0.928 1.000 1.098 1.190 1.276 1.361 1.437 S/H 1.076 1.071 1.065 1.056 1.035 1.000 0.962 0.940 0.936 0.941 0.944 B/L 0.862 0.869 0.893 0.921 0.956 1.000 1.048 1.089 1.120 1.142 1.167 B/H 1.037 1.036 1.034 1.035 1.021 1.000 0.968 0.937 0.909 0.882 0.854 Panel B. Average Earnings/Price Ratio, Mean[ EI(t + i)/ME(t + i - 1)] Mkt 0.098 0.097 0.097 0.096 0.094 0.091 0.092 0.094 0.095 0.097 0.098 S/L 0.061 0.061 0.062 0.066 0.068 0.064 0.067 0.067 0.069 0.071 0.072 S/H 0.107 0.107 0.103 0.090 0.075 0.052 0.081 0.096 0.106 0.108 0.109 B/L 0.071 0.071 0.072 0.074 0.075 0.074 0.074 0.075 0.075 0.077 0.078 B/H 0.131 0.135 0.135 0.133 0.127 0.123 0.122 0.123 0.120 0.116 0.116 Panel C. Average Monthly Percent Portfolio Return, 6/1963 to 6/1992 Mkt 0.95 0.93 0.90 0.93 0.90 0.96 0.96 0.94 0.96 0.99 0.99 S/L 1.04 0.88 1.11 1.31 1.32 0.73 1.02 1.21 1.19 1.13 1.16 S/H 0.43 0.30 -0.00 -0.21 -0.50 0.32 1.57 1.52 1.53 1.42 1.32 B/L 1.18 1.20 1.20 1.32 1.33 1.20 0.91 0.88 0.90 0.93 0.92 B/H 0.67 0.65 0.52 0.45 0.33 0.91 1.25 1.19 1.16 1.15 1.11 tion, low-BE/ME firms remain much more profitable than high-BE/ME firms for at least five years. Figure 2 shows that, like profitability, the book-to-market ratio is persis- tent. The distressed firms in the high-BE/ME portfolios tend to have high BE/ME for at least five years before and five years after portfolio formation. Conversely, low-BE/ME firms have sustained high profitability, and the market responds by persistently pricing their equity at a premium to book. It is no surprise that book-to-market-equity is associated with persistent properties of earnings. Simple models like equations (1) and (2) show that with rational pricing, poor (or strong) earnings that are short term do not have much effect on stock price and BE/ME. (Penman (1991, 1992) empha- sizes this point.) But asset pricing need not be rational. With irrational pricing, stock prices and BE/ME can be driven by swings in investor senti- ment that have little to do with long-term earnings (Shiller (1984)). Figure 1 does not support the irrational view; at least on average, differences in BE/ME line up well with long-term future profitability. 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 25,
    "chunk_index": 16,
    "word_count": 524,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "view; at least on average, differences in BE/ME line up well with long-term future profitability. 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 25,
    "chunk_index": 17,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "140 The Journal of Finance 1.8 1.6 N S/H 1.4 / .- B/H -- 1.2 -- \\ 1.0 LclmJ 0.8 0.6 S/L 0.4 - B/L 0 .2 ' l l l Il l l l I -5 -4 -3 -2 -1 0 1 2 3 4 5 Year i Relative to Ranking Year Figure 2. The 11-year evolution of book-to-market-equity, BE(t+i-1)/ME(t+i-1), for size-BE/ME portfolios formed in June of year t (year 0 on the horizontal axis). For each portfolio formation years t = 1963 to 1991, the ratios are calculated for t + i, i = - 5,..., 5. The ratio for t + i is then averaged across portfolio formation years t. BE(t + i - 1) is book common equity for the fiscal year ending in calendar year t + i - 1. ME(t + i - 1) is market equity (stock price times shares outstanding) at the end of December of year t + i - 1. S or B indicates that the portfolio contains NYSE, AMEX, and NASDAQ stocks below (S) or above (B) the median size (ME) of NYSE stocks. L or H indicates that the portfolio contains NYSE, AMEX, and NASDAQ stocks in the bottom 30 percent (L) or top 30 percent (H) of the values of book-to-market-equity (BE/ME) for NYSE stocks. IV. Profitability: Time-Series Evidence Do the strong patterns in earnings on book equity in Figure 1 show up when EI/BE is examined chronologically? The answer to this question comes from Figure 3, which shows time-series plots of EI(t)/BE(t - 1). Because Figure 3 is meant to capture the chronology of profitability, we use only firms with a common December fiscal year-end. The behavior of the ratio is similar, however, when all fiscal year-ends are included. Like Figure 1, Figure 3 shows that conditional on size, a low book-to-market ratio is associated with high profitability. For big stocks, in every year t of the 1963 to 1991 period, the B/L portfolio has much higher EI(t)/BE(t - 1) than the B/H portfolio. Thus, in boom times or recessions, the typical big low-book-to-market firm is more profitable than the typical big high-BE/ME firm. For small stocks, the S/L portfolio has higher earnings on book equity 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 25,
    "chunk_index": 18,
    "word_count": 405,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "big high-BE/ME firm. For small stocks, the S/L portfolio has higher earnings on book equity 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 25,
    "chunk_index": 19,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "Size and Book-to-Market Factors in Earnings and Returns 141 0.25 - n 20 0 /' ~~~~~~~~~~~\\,B_ /L 0.105 -0.100 -0.05 / -0.10 _ -0.15 - I , ,I , , , l , , I 62 64 66 68 70 72 74 76 78 80 82 84 86 88 90 92 Year Figure 3. Earnings on book common equity, EI(t)/BE(t - 1), for size-BE/ME portfo- lios formed in June of year t. The horizontal axis is t, the year for EI. EI(t) is earnings before extraordinary items but after interest, depreciation, taxes, and preferred dividends for the fiscal year ending in calendar year t. BE(t - 1) is book common equity for year t - 1. S or B indicates that the portfolio contains NYSE, AMEX, and NASDAQ stocks below (S) or above (B) the median size (ME) of NYSE stocks. L or H indicates that the portfolio contains NYSE, AMEX, and NASDAQ Stocks in the bottom 30 percent (L) or top 30 percent (H) of the values of book-to- market-equity (BE/ME) for NYSE stocks. Only firms with December fiscal year ends are included. than the S/H portfolio in every year but 1986, so again low BE/ME is associated with higher profitability. Unlike Figure 1, however, the time-series plots in Figure 3 do not show that conditional on BE/ME, small stocks are much less profitable than big stocks, at least prior to 1980. Given BE/ME, EI(t)/BE(t - 1) tends to be a bit higher for big stocks before 1980. But the recovery of small firms from the recession of 1981 and 1982 aborts. After a rise in profitability in 1983 and 1984, their earnings on book equity drop and remain at historically low levels through 1991. In short, for some unexplained reason, the recession 1981 and 1982 turns into a prolonged earnings depression for small stocks. The depression is general. It hits high-BE/ME small stocks, which typically have weak earn- ings, and low-BE/ME small stocks, which in normal times have strong earnings. The poor earnings of small stocks after 1980 are largely responsible for the evidence in Figure 1 that, conditional on BE/ME, small stocks are less profitable than big stocks in the 11 years around portfolio formation. 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 25,
    "chunk_index": 20,
    "word_count": 403,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "small stocks are less profitable than big stocks in the 11 years around portfolio formation. 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 25,
    "chunk_index": 21,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "142 The Journal of Finance V. Does the Market Incorrectly Extrapolate Past Earnings Growth? Lakonishok, Shleifer, and Vishny (1994) suggest an irrational-pricing story that can explain some aspects of the behavior of the earnings and stock returns of low- and high-book-to-market stocks. They argue that the market does not understand the temporary nature of earnings growth in the years prior to portfolio formation. The market incorrectly extrapolates the strong earnings growth of low-BE/ME stocks and the weak growth of high-BE/ME stocks. Low-BE/ME stocks then have low average returns after portfolio formation because their earnings growth is weaker than the market expects, and high-BE/ME stocks have high average returns because their earnings growth is stronger than expected. The LSV story is consistent with the behavior of earnings growth and stock returns, but it implies a prediction about earnings/price ratios that is contradicted by the data. Low-book-to-market stocks have strong earnings growth through the year of portfolio formation. If the market incorrectly extrapolates this growth, the ratio of next year's earnings to this year's price, EI(t + i)/ME(t + i - 1), should be low beginning in year i = 1 (the year after portfolio formation) when earnings cease to grow as fast as extrapola- tion would predict. Table I shows, however, that for the two low-BE/ME portfolios, EI(t + i)/ME(t + i - 1) is quite stable in the 11 years around portfolio formation; if anything, the ratios increase a bit beginning in year i = 1. The earnings/price ratios of the high-book-to-market portfolios are no kinder to the LSV story. High-BE/ME stocks have poor earnings growth through the year of portfolio formation (i = 0). If the market incorrectly extrapolates this weak growth, EI(t + i)/ME(t + i - 1) should be high be- ginning in the year after portfolio formation (i = 1), when earnings growth is better than expected. Table I shows, however, that for big high-BE/ME stocks, EI(t + i)/ME(t + i - 1) is stable in the 11 years around portfolio formation; if anything, it decreases a bit beginning in year i = 1. For small high-BE/ME stocks, EI(t + i)/ME(t + i - 1) does increase in year i = 1, but only relative to its abnormally low level in years i = 0 and i= -1. This suggests that the market is (understandably) fooled by the catastrophic decline in the earnings of small high-BE/ME stocks in the portfolio formation year (i = 0) and the preceding year (i = - 1). Contradict- ing the LSV prediction, the improved earnings growth of small high-BE/ME stocks in the years after portfolio formation is associated with EI(t + i)/ME(t + i - 1) ratios much like those observed in the pre-formation years i = -5 to i = -2. The persistence of average stock returns in the years after portfolio forma- tion is also troublesome for the LSV story. If the low post-formation returns of low-BE/ME stocks are due to incorrect extrapolation of strong past earnings growth, the low returns should be temporary, a one- or two-year phenomenon that passes as it becomes clear that post-formation earnings growth is 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 25,
    "chunk_index": 22,
    "word_count": 557,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "one- or two-year phenomenon that passes as it becomes clear that post-formation earnings growth is 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 25,
    "chunk_index": 23,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "Size and Book-to-Market Factors in Earnings and Returns 143 weaker than expected. In fact, the average returns on low-BE/ME stocks are low and rather flat for at least five years after portfolio formation (as far as we look). Similarly, the high average returns on high-BE/ME stocks persist for at least five years after portfolio formation. This long period of high returns is difficult to explain as the response to surprisingly strong earnings, since the improvement in earnings growth for high-BE/ME stocks occurs soon after portfolio formation. In short, contrary to the LSV hypothesis, the behavior of the earnings/price ratio, EI(t + i)/ME(t + i - 1), suggests that the market forecasts the rever- sion of earnings growth that occurs beginning in the year (i = 1) after portfolio formation. The persistent differences in average stock returns after portfolio formation then suggest that the higher average returns of high- book-to-market stocks reflect equilibrium expected returns. VI. Common Factors in Returns and Earnings Table I and Figures 1 to 3 tell an interesting story about how size and book-to-market-equity are related to profitability and average stock return. The story is consistent with rational pricing, but it does not address the more specific pricing issue raised by the evidence in Fama and French (1993) that size and BE/ME are related to risk factors in returns. With rational pricing, size and BE/ME risk factors in returns must be due to common factors in shocks to expected earnings (net cash flows). The persistent relations be- tween the level of profitability and size or BE/ME (Figure 1) are interesting, but they do not imply that the size and book-to-market factors in returns are due to common factors in shocks to expected earnings. The next two sections test for links between the risk factors in returns and earnings. We first ask whether there are market, size, and book-to-market factors in earnings shocks like those in stock returns. The answer is a solid yes. We then test whether variation in returns traces to the common factors in earnings. The results here are weaker. Stock returns are related to crude estimates of the market and size factors in earnings, but not to our estimate of the book-to-market factor. Moreover, the patterns in the relations between returns and the earnings factors are not as strong as expected, given the similarity between the way stock returns load on the common factors in returns and the way earnings load on similar common factors in earnings. A. Market, Size, and BE/ME Factors in Stock Returns To provide a reference point, the time-series regressions in Table II illus- trate and the split-sample regressions extend the evidence in Fama and French (1993) that there are risk factors in stock returns related to size and BE/ME. The dependent variables in the regressions are the value-weighted excess returns on the six size-BE/ME portfolios. The explanatory variables are the excess return on our value-weighted market portfolio, RM-RF, and the returns SMB (small minus big) and HML (high minus low) on the 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 25,
    "chunk_index": 24,
    "word_count": 538,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "RM-RF, and the returns SMB (small minus big) and HML (high minus low) on the 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 25,
    "chunk_index": 25,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "144 The Journal of Finance portfolios Fama and French (1993) use to mimic the risk factors in returns related to size and BE/ME. SMB is the difference, each month, between the simple average of the returns on the three small-stock portfolios (S/L, S/M, and S/H) and the average of the returns on the three big-stock portfolios (B/L, B/M, and Table II Excess Returns on the Six Size-BE/ME Portfolios Regressed on RM-RF, SMB, and HML. Summary Statistics for the Dependent and Explanatory Returns (in Percent): July 1963 to December 1992, 354 Monthly Observations The six size-BE/ME portfolios (S/L, S/M, S/H, B/L, B/M, and B/H) and the market portfolio RM are described in Table I. The portfolios are formed in June of each year t and value-weighted monthly returns are calculated from July to the following June. The dependent variables are the returns on the size-BE/ME portfolios minus the 1-month Treasury bill rate (RF) observed at the beginning of the month. SMB is the difference, each month, between the average of the returns on the three small-stock portfolios (S/L, S/M, and S/H) and the average of the returns on the three big-stock portfolios (B/L, B/M, and B/H). HML is the difference between the average of the returns on the two high-BE/ME portfolios (S/H and B/H) and the average of the returns on the two low-BE/ME portfolios (S/L and B/L). In the split-sample regressions, the stocks in each of the six size-BE/ME portfolios are divided randomly into two groups, and dependent variables constructed from one group are regressed on the explanatory variables constructed from the other. t() is a regression coefficient divided by its standard error. Regression R2 values are adjusted for degrees of freedom. Panel A. Summary Statistics Full Sample Split A Split B Mean Std t(Mn) Mean Std t(Mn) Mean Std t(Mn) RM-RF 0.44 4.48 1.82 0.45 4.48 1.88 0.42 4.53 1.74 SMB 0.28 2.93 1.77 0.23 3.01 1.46 0.31 2.91 2.02 HML 0.44 2.56 3.23 0.47 2.73 3.27 0.42 2.61 3.02 S/L-RF 0.49 6.76 1.37 0.47 6.86 1.28 0.52 6.72 1.46 S/M-RF 0.82 5.62 2.73 0.81 5.70 2.69 0.82 5.59 2.75 S/H-RF 1.04 5.65 3.45 1.02 5.66 3.40 1.04 5.70 3.44 B/L-RF 0.38 4.86 1.47 0.39 4.88 1.50 0.36 4.95 1.38 B/M-RF 0.42 4.28 1.82 0.43 4.36 1.85 0.40 4.37 1.72 B/H-RF 0.72 4.50 3.00 0.78 4.56 3.22 0.68 4.70 2.73 R(t) - RF(t) = a + b[RM(t) - RF(t)] + sSMB(t) + hHML(t) + e(t) a b s h t(a) t(b) t(s) t(h) R2 Panel B. Full Sample S/L -0.12 1.06 1.04 -0.31 -2.48 88.17 60.68 -15.27 0.98 S/M 0.03 0.98 0.90 0.26 0.97 121.10 78.17 19.12 0.99 S/H 0.06 1.00 0.93 0.63 2.49 156.83 102.70 59.55 0.99 B/L 0.13 0.99 -0.06 -0.36 3.39 106.19 -4.84 -23.42 0.98 B/M -0.10 0.99 -0.11 0.25 -1.70 71.47 -5.68 10.82 0.94 B/H -0.06 1.05 0.04 0.70 -1.18 87.97 2.60 34.91 0.96 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 25,
    "chunk_index": 26,
    "word_count": 514,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "-1.70 71.47 -5.68 10.82 0.94 B/H -0.06 1.05 0.04 0.70 -1.18 87.97 2.60 34.91 0.96 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 25,
    "chunk_index": 27,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "Size and Book-to-Market Factors in Earnings and Returns 145 Table II-Continued R(t) - RF(t) = a + b[RM(t) - RF(t)] + sSMB(t) + hHML(t) + e(t) a b s h t(a) t(b) t(s) t(h) R2 Panel C. Split A Regressed on Split B S/L -0.24 1.11 1.03 -0.20 -3.00 59.72 37.55 -6.55 0.96 S/M 0.01 1.00 0.88 0.26 0.21 81.71 49.00 12.66 0.97 S/H 0.08 0.99 0.90 0.57 1.37 67.20 41.97 23.33 0.96 B/L 0.13 0.97 -0.04 -0.31 1.72 56.02 -1.76 -10.62 0.93 B/M -0.06 0.96 -0.07 0.25 -0.75 51.20 -2.43 8.07 0.89 B/H 0.10 0.97 0.10 0.57 1.07 43.35 3.20 15.39 0.86 Panel D. Split B Regressed on Split A S/L -0.07 1.06 0.99 -0.24 -0.91 57.11 38.53 -8.27 0.96 S/M 0.07 0.96 0.87 0.24 1.31 74.25 48.96 11.92 0.97 S/H 0.12 0.99 0.92 0.56 1.92 65.58 43.84 23.74 0.96 B/L 0.05 0.99 -0.02 -0.27 0.69 54.62 -0.76 -9.43 0.93 B/M -0.11 0.97 -0.04 0.19 -1.43 49.21 -1.35 6.21 0.89 B/H -0.05 1.03 0.12 0.51 -0.53 46.96 4.00 14.68 0.88 B/H). Thus, SMB is the difference between the returns on small- and big-stock portfolios with about the same weighted-average BE/ME. SMB should be largely clean of book-to-market effects, focusing instead on the different return behaviors of small and big stocks. HML is the difference between the simple average of the returns on the two high-BE/ME portfolios (S/H and B/H) and the average of the returns on the two low-BE/ME portfolios (S/L and B/L). The two components of HML are returns on high- and low-BE/ME portfolios with about the same weighted average size. Thus, HML should be largely clean of the size factor in returns, focusing instead on the different return behaviors of high- and low-BE/ME stocks. As testimony to the success of this simple procedure, the correlation between the monthly SMB and HML returns for July 1963 to December 1992 is only - 0.08. Table II shows three sets of regressions. In one set, the six size-BE/ME portfolios and the market, SMB, and HML returns use all stocks. To avoid spurious common return variation that might be induced by the fact that SMB and HML are constructed from the size-BE/ME portfolios, the second and third sets of regressions use different stocks in the dependent and explanatory returns. Specifically, we split the stocks in each of the six size-BE/ME portfolios into two equal groups. One group becomes the six dependent value-weighted size-BE/ME portfolio returns for the time-series regressions. The other is used to form half-sample versions of the explanatory returns. The roles of the two groups in the regressions are then reversed. Table II confirms that SMB and HML, the mimicking returns for risk factors related to size and BE/ME, capture common variation in stock returns missed by the market return. The size factor is especially important 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 25,
    "chunk_index": 28,
    "word_count": 502,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "variation in stock returns missed by the market return. The size factor is especially important 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 25,
    "chunk_index": 29,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "146 The Journal of Finance in small-stock returns; the ts for the SMB slopes for the small-stock portfo- lios are all greater than 35.0. The slopes on the book-to-market factor, HML, are all more than 6.0 standard errors from 0.0. Controlling for size, the slopes on HML increase monotonically from the low- to the high-BE/ME portfolios. The common return variation captured by risk factors related to size and BE/ME is not spurious. The slopes on RM-RF, SMB, and HML when the dependent and explanatory returns are from disjoint sets of stocks are close to those obtained when the dependent and explanatory returns are con- structed from all stocks. The explanatory power of the split-sample regres- sions, as measured by R2, is always high. In practical terms, the intercepts in the three-factor return regressions are close to (all but one are within 14 basis points of) 0.0. Thus, as in Fama and French (1993), the regression slopes and the average premiums for the three risk factors (the average values of RM-RF, SMB, and HML) capture most of the strong spread in the average returns on the six size-BE/ME portfolios reported in Table II. Finally, Kothari, Shanken, and Sloan (KSS, 1992) argue that the COMPU- STAT data we use have survivor bias. COMPUSTAT is more likely to add firms that have done well. If past data are included when firms are added, returns and earnings for the COMPUSTAT sample are upward biased. KSS argue that this bias is stronger for small high-BE/ME stocks because small distressed firms are more likely to die before making it to COMPUSTAT. We doubt that survivor bias is important in our tests. First, survivor bias is less important in value-weighted portfolios like those used here (and in Fama and French (1993)). Second, survivor bias is less important for large stocks. We find that high-book-to-market COMPUSTAT stocks have higher average returns than low-BE/ME stocks even when the tests are limited to stocks above the median market capitalization on the NYSE. (Compare the B/H and B/L portfolio returns in Table II. LSV (1994) likewise find a book-to- market effect in the largest 20 percent of the stocks on the NYSE and AMEX.) Third, the KSS hyopthesis is that the average size and book-to- market premiums (the average SMB and HML returns in Table II) esti- mated from COMPUSTAT firms are biased. Survivor bias cannot explain the month-by-month size and book-to-market risk factors in returns (the common variation in returns related to size and BE/ME) documented here and in Fama and French (1993). It also seems unlikely that survivor bias necessarily produces intercepts close to 0.0 in the three-factor asset-pricing regressions in Table II and the more extensive tests in Fama and French (1993). Finally, any upward bias in the earnings of small high-BE/ME firms on COMPU- STAT reinforces the evidence in Figures 1 to 3 that these firms have persistently poor earnings. B. Market, Size, and BE / ME Factors in Earnings and Sales In standard valuation models, a stock price is the present value of expected future net cash flows to stockholders. Unexpected changes in price are caused 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 25,
    "chunk_index": 30,
    "word_count": 555,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "value of expected future net cash flows to stockholders. Unexpected changes in price are caused 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 25,
    "chunk_index": 31,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "Size and Book-to-Market Factors in Earnings and Returns 147 by shocks to expected net cash flows and discount rates. Thus, to measure the relation between returns and the common factors in net cash flows, we must measure (i) shocks to expected net cash flows and (ii) the common factors in the shocks. As a crude proxy for shocks to expected net cash flows, we use changes in the earnings yield EI/BE. We use changes in EI/BE, rather than growth rates of EI, because equity income is sometimes negative for the small-stock portfolios. We use the changes in EI/BE, rather than the residuals from a time series model, because earnings yields are highly autocorrelated, and because we would have only 29 annual observations on EI/BE to estimate a richer time-series model. We first test for common factors in the year-to-year changes in earnings yields. Table III shows time-series regressions in which changes in EI/BE for the six size-BE/ME portfolios are regressed on market, size, and book-to- market factors in yield changes. The common factors in yield changes are constructed like those in stock returns. (See Table III legend.) In Table III, the dependent and explanatory variables use all stocks. We also estimate two sets of split-sample regressions in which the dependent and explanatory variables are from disjoint sets of stocks. One set of split-sample regressions is in Table IV. The other (not shown) produces similar results. The earnings-yield regressions are more sensitive to the way the dependent and explanatory variables are formed than the stock-return regressions. In the earnings-yield regressions, R2 drops more and the slopes on the market, size, and book-to-market factors in earnings change more when disjoint sets of stocks are used to construct the dependent and explanatory yields. We suspect that the culprit is measurement error. We measure the risk factors in stock returns more accurately and in a more timely way than the common factors in earnings. We have 354 monthly stock returns but only 28 annual changes in EI/BE. Moreover, common informa- tion should be incorporated quickly in stock prices, but the impact of a common demand or supply shock can be spread across several years of reported earnings, and the timing can vary across firms. Thus, our proxies for the common factors in returns are likely to be sharper than the proxies for the common factors in earnings. In the earnings-yield regressions that use all stocks to form the explana- tory variables, measurement error has two effects that tend to offset. (i) Since measurement error in the earnings yield for a given size-BE/ME portfolio is also in the explanatory yields, it can spuriously increase the explanatory power of the regression for that portfolio. (ii) Measurement error in the explanatory yields that is not shared with the dependent yield spuriously decreases the estimated role of the common yield factors. It is difficult to judge whether, on balance, measurement error increases or decreases the explanatory power of the regressions that use all stocks in the independent variables. In contrast, when we use disjoint sets of stocks to construct the portfolios, measurement error in the explanatory yields is not related to the 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 25,
    "chunk_index": 32,
    "word_count": 559,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "to construct the portfolios, measurement error in the explanatory yields is not related to the 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 25,
    "chunk_index": 33,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "148 The Journal of Finance Table III Full-Sample Regressions: Changes in Fundamentals for the Six Size-BE/ME Portfolios Regressed on Proxies for Market (Mkt), Size (SMB) and Book-to-Market (HML) Factors in the Changes in Fundamentals: 1964 to 1991, 28 Annual Observations AY(t + 1) = a + b AMkt(t + 1) + s ASMB(t + 1) +h AHML(t + 1) + e(t + 1) The six size-BE/ME portfolios (S/L, S/M, S/H, B/L, B/M, and B/H), equity income EI(t + 1), and book equity BE(t) are described in Table I. EI(t + 1)/BE(t) is the sum of EI(t + 1) for all firms in a portfolio for the fiscal year ending in calendar year t, divided by the sum of BE(t). EBI(t + 1) is EI(t + 1) plus interest expense and preferred dividends summed over all stocks in a portfolio. S(t + 1) is the sum of sales for the stocks in a portfolio. AY(t + 1) is the change in a fundamental variable (EI/BE, ln EBI, or ln S) from year t to t + 1 for all firms in a portfolio that have all required accounting data for both the portfolio formation year t and year t + 1. Ln is a natural logarithm. ASMB, the size factor in AY, is the simple average of AY for the three small-stock portfolios (S/L, S/M, and S/H) minus the average for the three big-stock portfolios (B/L, B/M, and B/H). The book-to-market factor, AHML, is the simple average of AY for the two high-BE/ME portfolios (S/H and B/H) minus the average for the two low-BE/ME portfolios (S/L and B/L). For EBI or S, the market is the sum of EBI or S for all stocks, and Mkt is the log of EBI or S for the market. For EI/BE, Mkt is the sum of EI over the sum of BE. t(-) is a regression coefficient divided by its standard error. Regression R2 values are adjusted for degrees of freedom. a b s h t(a) t(b) t(s) t(h) R2 Panel A. Y(t + 1) = EI(t + 1)/BE(t) S/L -0.77 1.09 1.44 -0.57 -3.34 12.06 9.77 -7.47 0.94 S/M 0.53 0.95 0.21 -0.14 2.49 11.54 1.53 -2.04 0.87 S/H -0.17 1.09 1.18 0.61 -0.59 9.52 6.31 6.35 0.92 B/L 0.00 1.00 -0.20 -0.43 0.02 9.00 -1.10 -4.59 0.78 B/M 0.17 1.13 -0.03 -0.05 0.80 13.36 -0.24 -0.70 0.89 B/H -0.59 1.00 0.06 0.38 -1.96 8.50 0.33 3.83 0.82 Panel B. Y(t + 1) = ln EBI(t + 1) S/L -2.09 1.04 1.12 -0.40 -1.60 8.28 9.39 -4.76 0.93 S/M 1.08 1.05 0.39 -0.19 0.87 8.69 3.40 -2.37 0.88 S/H 0.73 0.93 1.26 0.77 0.63 8.29 11.97 10.38 0.98 B/L 2.20 0.89 -0.10 -0.29 1.91 7.96 -0.96 -3.91 0.74 B/M -1.87 1.13 0.12 -0.08 -1.65 10.30 1.15 -1.12 0.90 B/H -0.61 1.00 -0.25 0.55 -0.35 6.04 -1.58 5.01 0.87 Panel C. Y(t + 1) = ln S(t + 1) S/L 2.85 0.93 0.90 -0.35 2.21 11.15 7.21 -3.61 0.84 S/M -0.61 1.03 0.93 0.03 -0.50 12.95 7.81 0.28 0.90 S/H 0.03 0.91 0.88 0.49 0.03 15.32 9.90 7.17 0.95 B/L 0.29 0.84 0.06 -0.48 0.36 15.84 0.79 -7.95 0.90 B/M -1.13 1.17 -0.43 -0.02 -1.00 15.92 -3.89 -0.29 0.95 B/H 3.11 0.86 0.08 0.68 2.21 9.40 0.57 6.49 0.92 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 25,
    "chunk_index": 34,
    "word_count": 580,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "-1.00 15.92 -3.89 -0.29 0.95 B/H 3.11 0.86 0.08 0.68 2.21 9.40 0.57 6.49 0.92 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 25,
    "chunk_index": 35,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "Size and Book-to-Market Factors in Earnings and Returns 149 Table IV Split-Sample Regressions: Changes in Fundamentals for the Six Size-BE/ME Portfolios Regressed on Proxies for Market (Mkt), Size (SMB) and Book-to-Market (HML) Factors in the Changes in Fundamentals: 1964 to 1991, 28 Annual Observations AY(t + 1) = a + b AMkt(t + 1) + s ASMB(t + 1) +hlAHML(t + 1) +e(t + 1) In the split-sample regressions, the stocks in each of the six size-BE/ME portfolios are divided randomly into two groups, and dependent variables constructed from one group are regressed on the explanatory variables constructed from the other. The six size-BE/ME portfolios (S/L, S/M, S/H, B/L, B/M, and B/H), as well as equity income/book equity (EI/BE), earnings before interest and preferred dividends (EBI), and sales (S) are defined in Table III. AY(t + 1) is the change in a fundamental variable (EI/BE, ln EBI, or ln S) from year t to t + 1, for all firms in a portfolio that have all required accounting data for both the portfolio formation year t and year t + 1. (Ln is a natural logarithm.) The market (A Mkt), size (A SMB), and book-to-market (AHML) factors in changes in the fundamental variables are defined in Table III. t() is a regression coefficient divided by its standard error. Regression R2 values are adjusted for degrees of freedom. a b s h t(a) t(b) t(s) t(h) R2 Panel A. Y(t + 1) = EI(t + 1)/BE(t) S/L -1.82 1.41 1.01 -0.18 -2.41 5.63 2.79 -0.74 0.56 S/M 0.29 0.69 0.38 -0.00 0.85 6.20 2.36 -0.06 0.59 S/H -0.08 1.50 1.06 0.50 -0.19 11.18 5.46 3.77 0.86 B/L -0.35 0.78 0.21 -0.20 -0.78 5.23 0.95 -1.35 0.48 B/M 0.24 0.73 0.61 -0.09 0.86 8.12 4.68 -1.06 0.75 B/H -0.39 0.82 0.93 0.49 -0.70 4.50 3.51 2.75 0.57 Panel B. Y(t + 1) = ln EBI(t + 1) S/L -1.23 1.02 0.99 0.03 -0.46 4.34 3.97 0.18 0.71 S/M 4.98 0.70 0.34 -0.04 2.83 4.50 2.07 -0.35 0.61 S/H -4.79 1.52 1.15 0.61 -1.78 6.36 4.56 3.67 0.88 B/L 4.42 0.70 -0.10 -0.12 2.76 4.95 -0.67 -1.25 0.51 B/M 0.54 0.77 0.46 -0.14 0.36 5.88 3.28 -1.55 0.72 B/H 3.88 0.56 0.34 0.43 1.31 2.15 1.21 2.33 0.53 Panel C. Y(t + 1) = ln S(t + 1) S/L 6.42 0.83 0.78 0.03 2.62 4.88 3.29 0.20 0.49 S/M 0.79 0.99 0.75 0.12 0.53 9.56 5.22 1.24 0.81 S/H -0.38 0.97 0.77 0.48 -0.23 8.45 4.84 4.35 0.83 B/L 2.97 0.72 0.35 -0.15 1.88 6.59 2.27 -1.43 0.61 B/M 1.86 0.96 -0.08 0.25 1.28 9.54 -0.56 2.54 0.88 B/H -1.18 1.06 0.19 0.27 -0.57 7.33 0.97 1.92 0.78 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 25,
    "chunk_index": 36,
    "word_count": 480,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "1.28 9.54 -0.56 2.54 0.88 B/H -1.18 1.06 0.19 0.27 -0.57 7.33 0.97 1.92 0.78 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 25,
    "chunk_index": 37,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "150 The Journal of Finance measurement error in the dependent yields, so it can only reduce the ex- planatory power of the regressions. Despite these measurement-error problems, the results from the earnings- yield regressions are positive. The full-sample and split-sample regressions identify market, size, and book-to-market factors in earnings that parallel those in returns. All the regressions produce strong evidence of a market factor in earnings. The ts for the slopes on the market factor are all greater than 4.0. As in the return regressions, the slopes on the market factor in the yield regressions are similar for the six size-BE/ME portfolios when all stocks are used to construct the dependent and explanatory yields. Like the return regressions, the earnings-yield regressions say that the size factor is important in distinguishing the earnings variation of small stocks and big stocks. Finally, like the return regressions, the yield regressions say that there is a book-to-market factor in earnings, and the slopes on the book-to- market factor increase from the low- to the high-BE/ME portfolios. The tracks of market, size, and book-to-market factors are also clear in other fundamentals. Earnings before interest (EBI, EI plus interest and preferred dividends) is a measure of total earnings on assets. Since EBI is never negative for the six size-BE/ME portfolios, we can use growth rates of EBI to measure shocks to earnings. Growth rates of sales are also clear candidates to explain how common shocks to fundamentals can produce market, size, and book-to-market factors in stock returns. Tables III and IV confirm that there are market, size, and book-to-market factors in the growth rates of EBI and sales like those in changes in EI/BE. VII. Stock Returns and Earnings The evidence in Tables III and IV that there are market, size, and book-to- market factors in fundamentals (earnings and sales) that are similar to those in stock returns (Table II) leads to a strong presumption that the common factors in fundamentals drive the risk factors in returns. We find next that the market and size factors in fundamentals show up in returns. There is no evidence, however, that the book-to-market factors in fundamentals drive the book-to-market factor in returns. Moreover, the return responses to the market and size factors in fundamentals do not consistently reproduce the strong and intuitively pleasing patterns observed when returns and funda- mentals are examined separately. Tables V and VI show time-series regressions of annual returns on the size-BE/ME portfolios on (i) the portfolio-specific changes one year ahead in fundamentals (Table V), or (ii) the changes one year ahead in the market, size, and book-to-market factors in fundamentals (Table VI). Using future changes in fundamentals to explain stock returns is in line with the evidence that stock returns are forward looking (e.g., Fama (1981)). Preliminary regressions showed that current and past changes in fundamentals, or changes more than a year ahead, add little to explanatory power. Finally, as a rough control for common variation in expected returns, the regressions 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 25,
    "chunk_index": 38,
    "word_count": 532,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "explanatory power. Finally, as a rough control for common variation in expected returns, the regressions 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 25,
    "chunk_index": 39,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "Size and Book-to-Market Factors in Earnings and Returns 151 Table V Arnnual Portfolio Returns Regressed on the Beginning-of-Year New York Stock Exchange Dividend Yield and on Own (Portfolio-Specific) Changes in Fundamentals One Year Ahead: 27 Annual Observations (1964 to 1990) for Returns R(t) = a + dD(t - 1)/P(t -1) + b AY(t + 1) + e(t) The dependent variables in the regressions are the returns on the six size-BE/ME portfolios (S/L, S/M, S/H, B/L, B/M, and B/H) and the market (Mkt), size (SMB) and book-to-market (HML) factors in returns, described in Table II. D(t - 1)/P(t - 1) is dividends on the value- weighted portfolio of New York Stock Exchange stocks for year t - 1, divided by the value of the portfolio at the end of year t - 1. (See Fama and French (1988)). AY(t + 1) is the change in a fundamental variable (EI/BE, ln EBI or ln S) from year t to t + 1, and ln is the natural logarithm. EI/BE (equity income/book equity), EBI (earnings before interest), S (sales), and the market (AMkt), size (ASMB), and book-to-market (AHML) factors in changes in the fundamental variables are described in Table III. t() is a regression coefficient divided by its standard error. Regression R2 values are adjusted for degrees of freedom. a d b t(a) t(d) t(b) R2 Panel A. Y(t + 1) = EI(t + 1)/BE(t) S/L -43.67 18.46 4.29 -1.93 3.18 2.60 0.33 S/M -46.90 17.45 7.72 -2.69 3.90 3.63 0.47 S/H -34.57 14.09 2.64 -1.62 2.58 1.74 0.23 B/L -24.76 10.10 2.64 -1.75 2.77 1.57 0.21 B/M -35.49 12.60 3.26 -3.14 4.34 2.64 0.46 B/H -23.94 10.31 2.88 -1.73 2.92 2.07 0.28 Mkt -31.80 11.67 3.82 -2.71 3.88 2.54 0.41 SMB -11.41 4.98 6.55 -0.83 1.42 2.27 0.17 HML 9.11 -0.81 0.05 0.74 -0.26 0.04 -0.08 Panel B. Y(t + 1) = ln EBI(t + 1) S/L -65.93 19.12 0.87 -2.92 3.36 2.89 0.36 S/M - 62.48 18.24 1.07 - 3.26 3.88 3.22 0.43 S/H -38.97 14.75 0.39 -1.89 2.80 2.26 0.29 B/L -30.05 9.44 0.44 - 1.98 2.54 1.03 0.17 B/M -39.74 12.46 0.50 -3.37 4.19 2.34 0.43 B/H -26.78 10.31 0.37 -1.89 2.88 1.91 0.26 Mkt -36.71 11.50 0.51 -2.89 3.64 1.89 0.35 SMB - 19.04 6.20 0.84 - 1.41 1.80 2.53 0.20 HML 9.43 -0.84 0.09 0.78 -0.27 0.43 -0.07 Panel C. Y(t + 1) = ln S(t + 1) S/L - 148.83 24.26 4.45 -5.04 4.69 4.37 0.52 S/M -86.16 19.28 2.88 -4.18 4.31 3.81 0.49 S/H -64.51 18.51 2.07 -2.77 3.43 2.52 0.32 B/L -42.24 9.80 1.29 -2.30 2.68 1.45 0.20 B/M -41.83 12.82 0.46 -2.96 3.91 1.12 0.34 B/H -31.58 11.17 0.62 -1.95 2.90 1.28 0.20 Mkt -40.62 12.01 0.64 -2.63 3.53 1.13 0.29 SMB -22.87 5.80 3.11 -1.86 1.87 3.61 0.35 HML 10.90 -0.16 0.60 0.91 -0.05 1.00 -0.04 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 25,
    "chunk_index": 40,
    "word_count": 509,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "-22.87 5.80 3.11 -1.86 1.87 3.61 0.35 HML 10.90 -0.16 0.60 0.91 -0.05 1.00 -0.04 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 25,
    "chunk_index": 41,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "152 The Journal of Finance Table VI Annual Portfolio Returns Regressed on the Beginning-of-Year New York Stock Exchange Dividend Yield and on Proxies for Market (A Mkt), Size (A SMB), and Book-to-Market (A HML) Factors in the Changes in Fundamentals One year Ahead: 27 Arnnual Observations(1964 to 1990) for Returns R(t) = a + dD(t - 1)/P(t - 1) + b A Mkt(t + 1) + s iSMB(t + 1) + h zHML(t + 1) + e(t) The dependent variables in the regressions are the returns on the six size-BE/ME portfolios (S/L, S/M, S/H, B/L, B/M, B/H) described in Table II. D(t - 1)/P(t - 1) is dividends on the value-weighted portfolio of NYSE stocks for year t - 1, divided by the value of the portfolio at the end of year t - 1. (See Fama and French (1988)). EI/BE (equity income/book equity), EBI (earnings before interest), S (sales), and the market (AMkt), size (ASMB), and book-to-market (AHML) factors in changes in the fundamental variables are described in Table III. t(-) is a regression coefficient divided by its standard error. Regression R2 values are adjusted for degrees of freedom. a d b s h t(a) t(d) t(b) t(s) t(h) R2 - Panel A. Fundamental Variable is EI(t + 1)/BE(t) S/L -46.26 18.54 6.52 3.02 -3.18 -1.95 3.04 1.91 0.55 -1.10 0.28 S/M -39.81 17.31 5.72 1.97 -2.37 -1.96 3.31 1.96 0.42 -0.96 0.31 S/H -30.64 16.09 5.50 4.79 -2.55 - 1.49 3.04 1.86 1.00 - 1.01 0.31 S/L -27.99 10.14 4.32 -3.18 -0.14 -1.95 2.75 2.10 -0.95 -0.08 0.22 B/M -35.84 12.95 4.45 - 1.83 -0.53 -3.03 4.25 2.62 -0.67 -0.37 0.43 B/H -23.34 10.63 4.32 -1.01 -0.36 -1.63 2.88 2.10 -0.30 -0.20 0.24 Panel B. Fundamental Variable is EBI(t + 1) S/L -66.17 18.33 1.09 0.60 -0.31 -2.61 2.99 1.38 0.80 -0.58 0.26 S/M -52.69 17.00 0.63 0.61 -0.09 -2.40 3.20 0.93 0.95 -0.20 0.27 S/H -44.61 16.12 0.41 1.04 -0.02 -2.02 3.02 0.60 1.59 -0.05 0.29 B/L -29.07 9.22 0.52 -0.39 0.13 -1.85 2.42 1.05 -0.83 0.39 0.15 B/M -40.67 12.49 0.55 -0.00 -0.01 -3.08 3.90 1.33 -0.02 -0.03 0.36 B/H -25.13 10.15 0.22 0.21 0.20 -1.61 2.68 0.45 0.45 0.61 0.19 Panel C. Fundamental Variable is S(t + 1) S/L -124.44 23.24 3.79 6.44 -0.29 -4.85 4.75 3.72 4.17 -0.24 0.57 S/M -95.13 21.48 2.56 6.30 0.60 -4.48 5.29 3.03 4.92 0.60 0.61 S/H -83.15 20.88 2.32 6.81 1.40 -3.77 4.95 2.65 5.11 1.33 0.60 B/L -46.74 10.99 1.09 1.53 -0.30 -2.25 2.77 1.32 1.22 -0.31 0.16 B/M -59.32 13.83 1.37 1.12 -0.45 -3.40 4.16 1.98 1.07 -0.55 0.37 B/H -39.79 12.52 0.92 2.33 0.79 -1.98 3.27 1.16 1.92 0.82 0.24 also include the beginning-of-year dividend yield (D/P) on the value-weighted portfolio of NYSE stocks as an explanatory variable. Table V shows, not surprisingly, that the returns on the six size-BE/ME portfolios are related to changes in their own (portfolio-specific) fundamen- tals. For our purposes, however, the interesting positive result in Table V is 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 25,
    "chunk_index": 42,
    "word_count": 533,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "(portfolio-specific) fundamen- tals. For our purposes, however, the interesting positive result in Table V is 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 25,
    "chunk_index": 43,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "Size and Book-to-Market Factors in Earnings and Returns 153 that the market and size factors in returns are related to the market and size factors in fundamentals. This is consistent with the hypothesis that the market and size factors in fundamentals are the source of the market and size factors in returns. Our -prime negative result also shows up in Table V. We find no evidence that the book-to-market factors in earnings and sales are related to the book-to-market factor in returns. The regressions in Table VI, which use the market, size, and book-to-market factors in fundamentals to explain the returns on the six size-BE/ME portfolios, reinforce Table V. The market factors in EI/BE and sales show up reliably in the returns on the six size-BE/ME portfolios. Small-stock returns consistently respond more than big-stock returns to the size factors in fundamentals; the relation is strong when the fundamental is the growth rate of sales. As in Table V, however, there is no reliable evidence in Table VI that the book-to-market factors in fundamentals show up in stock returns. The strongest book-to-market result is the weak hint that the returns on high- book-to-market stocks respond more strongly than the returns on low-BE/ME stocks to the book-to-market factor in the growth of sales. More generally, the evidence (Tables V and VI) that the common factors in fundamentals drive stock returns is weaker than the evidence (Tables II to IV) that there are parallel market, size, and book-to-market factors in returns and fundamentals. We can suggest explanations. The sample size for the regressions in Tables V and VI is small (27 annual returns for 1964 to 1990), so parameter estimates are imprecise. Moreover, annual changes in funda- mentals are crude proxies for the shocks to the stream of expected future net cash flows that should drive stock returns. For example, Figure 3 says that the distinguishing feature of small-stock earnings is the depression of the 1980s that is not shared with big stocks. Small-stock returns were indeed low during the 1980s, but the way information about the depression in the level of earnings developed through time, and was incorporated in small-stock prices, probably is not captured well by changes in earnings. In short, perhaps we must learn to live with the fact that noisy measures of shocks to fundamentals mean that we have poor measures of the links between stock returns and the common factors in fundamentals. VIII. Conclusions Our long-term goal is to provide an economic foundation for the empirical relations between average stock return and size, and average return and book-to-market-equity, observed in Fama and French (1992). Our work to date is guided by two hypotheses. If the average-return relations are due to rational pricing, then (i) there must be common risk factors in returns associated with size and BE/ME, and (ii) the size and book-to-market patterns in returns must be explained by the behavior of earnings. In Fama and French (1993), we show that size and BE/ME proxy for sensitivity to risk factors that capture strong common variation in stock returns and help 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 25,
    "chunk_index": 44,
    "word_count": 548,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "for sensitivity to risk factors that capture strong common variation in stock returns and help 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 25,
    "chunk_index": 45,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "154 The Journal of Finance explain the cross-section of average returns. The evidence presented here shows that size and BE/ME are related to profitability. In a rational market, short-term variation in profitability should have little effect on stock price and book-to-market-equity; BE/ME should be associated with long-term differences in profitability. Our results confirm this predic- tion. Firms with high BE/ME (a low stock price relative to book value) tend to be persistently distressed. They have low ratios of earnings to book equity for at least 11 years around portfolio formation. Conversely, low BE/ME (a high stock price relative to book value) is associated with sustained strong profitability. Within book-to-market groups, small stocks tend to be less profitable than big stocks. The relation between size and profitability is, however, largely due to the 1980s. Prior to 1980, given BE/ME, ratios of earnings to book equity are similar for small and big stocks. But for small stocks, the recession of 1981 and 1982 turns into a prolonged earnings depression; on average, small stocks do not participate in the boom of the middle and late 1980s. Though we have no explanation for the small-stock depression of the 1980s, it does suggest that there is a size factor in fundamentals that might lead to a size-related risk factor in returns. Rational pricing indeed says that the size and book-to-market risk factors in stock returns should trace to common factors in shocks to expected earnings that are related to size and BE/ME. We find that there are size and book-to-market factors in earnings like those in returns. The earnings of firms in different size-BE/ME groups load on market, size, and BE/ME factors in earnings in much the same way that their stock returns load on the corresponding common factors in returns. Our efforts to document that the common variation in returns is driven by the common factors in earnings are, however, not entirely successful. We do find that the market and size factors in earnings help explain the market and size factors in returns. But we find no evidence that returns respond to the book-to-market factor in earnings. Given that there are reliable common factors in earnings much like those in returns, we suspect that our failure to find more systematic evidence that the common factors in earnings drive returns is due to noisy measures of shocks to expected earnings. But we have no evidence on the matter. And our colleagues in behavioral finance will surely suggest another explanation. Finally, our work on stock returns and profitability leaves important open questions. In Fama and French (1993) we argue that our return results are consistent with a multifactor version of Merton's (1973) intertemporal asset- pricing model in which size and BE/ME proxy for sensitivity to risk factors in returns. This conclusion leads to two as yet unanswered questions. (i) What are the underlying economic state variables that produce variation in earnings and returns related to size and BE/ME? (ii) Do these unnamed state variables produce variation in consumption and wealth that is not captured by an overall market factor and so can explain the risk premiums in returns associated with size and BE/ME? 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 25,
    "chunk_index": 46,
    "word_count": 562,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "factor and so can explain the risk premiums in returns associated with size and BE/ME? 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 25,
    "chunk_index": 47,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "Size and Book-to-Market Factors in Earnings and Returns 155 We intend to pursue these issues, but we are not confident they can be resolved. Most candidate state variables (gross national product, consump- tion, employment) have measurement problems as severe as earnings. Our experience with measuring shocks to earnings suggests that it will not be easy to produce convincing results on the state variables that drive earnings and returns. REFERENCES Banz, Rolf W., and William J. Breen, 1986, Sample dependent results using accounting and market data: Some evidence, Journal of Finance 41, 779-793. Fama, Eugene F., 1981, Stock returns, real activity, inflation, and money, American Economic Review 71, 545-565. , and Kenneth R. French, 1988, Dividend yields and expected stock returns, Journal of Financial Economics 22, 3-25. 1992, The cross-section of expected stock returns, Journal of Finance 47, 427-465. 1993, Common risk factors in the returns on stocks and bonds, Journal of Financial Economics 33, 3-56. Kothari, S. P., Jay Shanken, and Richard G. Sloan, 1995, Another look at the cross-section of expected stock returns, Journal of Finance 50, 185-224. Lakonishok, Josef, Andrei Shleifer, and Robert W. Vishny, 1994, Contrarian investment, extrap- olation, and risk, Journal of Finance 49, 1541-1578. Merton, Robert C., 1973, An intertemporal capital asset pricing model, Econometrica 41, 867-887. Penman, Stephen H., 1991, An evaluation of accounting rate of return, Journal of Accounting, Auditing, and Finance 6, 233-255. , 1992, The articulation of price-earnings ratios and market-to-book ratios and the evaluation of growth, Working paper, Walter A. Haas School of Business, University of California at Berkeley. Shiller, Robert J., 1984, Stock prices and social dynamics, Brookings Papers on Economic Activity 2, 457-510. 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 25,
    "chunk_index": 48,
    "word_count": 310,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  },
  {
    "text": "Robert J., 1984, Stock prices and social dynamics, Brookings Papers on Economic Activity 2, 457-510. 15406261, 1995, 1, Downloaded from https://onlinelibrary.wiley.com/doi/10.1111/j.1540-6261.1995.tb05169.x, Wiley Online Library on [18/11/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License",
    "title": "Size and Book‐to‐Market Factors in Earnings and Returns",
    "source_type": "pdf",
    "document_id": "0c8f84fcfa9c",
    "source_file": "The Journal of Finance - March 1995 - FAMA - Size and Book‐to‐Market Factors in Earnings and Returns.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 25,
    "chunk_index": 49,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071214145541-05'00'",
    "duration": null
  }
]