[
  {
    "text": "Charles M. Jones Columbia Business School Xiaoyan Zhang Krannert School of Management, Purdue University October 16, 2016 ABSTRACT We provide an easy way to use recent, publicly available U.S. equity transactions data to identify retail purchases and sales. Based on retail order imbalances, we find that retail investors are informed at horizons up to 12 weeks. Individual stocks with net buying by retail investors outperform stocks with negative imbalances; the magnitude is approximately 10 basis points over the following week, or 5% annualized. Retail investors are better informed in smaller stocks with lower share prices. They do not, however, exhibit any market timing ability. Keywords: retail investors, price improvement, return predictability. JEL Classification: G11, G14 We thank Kevin Crotty, Larry Glosten, Frank Hatheway, and seminar participants at Purdue University, Rice University, Singapore Management University, Southern Methodist University, and Tsinghua University for helpful comments.",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "Singapore Management University",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 38,
    "chunk_index": 0,
    "word_count": 143,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Singapore Management University (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "share prices. They do not, however, exhibit any market timing ability. Keywords: retail investors, price improvement, return predictability. JEL Classification: G11, G14 We thank Kevin Crotty, Larry Glosten, Frank Hatheway, and seminar participants at Purdue University, Rice University, Singapore Management University, Southern Methodist University, and Tsinghua University for helpful comments.",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "Tracking Retail Investor Activity",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 38,
    "chunk_index": 1,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Tracking Retail Investor Activity (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "We provide an easy way to use recent, publicly available U.S. equity transactions data to identify retail purchases and sales. Based on retail order imbalances, we find that retail investors are informed at horizons up to 12 weeks. Individual stocks with net buying by retail investors outperform stocks with negative imbalances; the magnitude is approximately 10 basis points over the following week, or 5% annualized. Retail investors are better informed in smaller stocks with lower share prices. They do not, however, exhibit any market timing ability. Keywords: retail investors, price improvements, return predictability. JEL Classification: G11, G14",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "ABSTRACT",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 38,
    "chunk_index": 2,
    "word_count": 97,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "ABSTRACT (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "stocks with negative imbalances; the magnitude is approximately 10 basis points over the following week, or 5% annualized. Retail investors are better informed in smaller stocks with lower share prices. They do not, however, exhibit any market timing ability. Keywords: retail investors, price improvements, return predictability. JEL Classification: G11, G14",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 38,
    "chunk_index": 3,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "Are retail equity investors informed? Do they make systematic, costly mistakes in their trading decisions? The answers are important to other market participants looking for useful signals about future price moves, to behavioral finance researchers, and to policymakers who need to decide whether these investors should be protected from themselves. Many researchers have concluded that retail equity investors are generally uninformed and make systematic mistakes. However, some more recent evidence, including Kaniel, Saar, and Titman (2008), Kelley and Tetlock (2013) and Barrot, Kaniel and Sraer (2016), suggests otherwise. Unfortunately, most studies of retail order flow are based on proprietary datasets with relatively small subsets of overall retail order flow. For example, Kaniel, Saar and Titman (2008) and Boehmer, Jones and Zhang (2008) use proprietary account-type data from the NYSE during the early 2000’s. During that sample period, only a couple of large brokerages sent their retail order flow to the NYSE, so that exchange has a very small market share of overall retail order executions. Barber and Odean (2000) analyze data from a single U.S. retail brokerage firm, Kelley and Tetlock (2013) have data from a single U.S. wholesaler, and Barrot, Kaniel and Sraer (2016) have data from one French brokerage firm. In existing work, many researchers use trade size as a proxy for retail order flow. Before the spread of computer algorithms that “slice and dice” large institutional parent orders into a sequence of small child orders, small trades were much more likely to come from retail customers, while institutions were likely behind the larger reported trades. For example, Lee and Radhakrishna (2000) use a $20,000 cutoff point to separate smaller individual trades from larger institutional trades. More recently, Campbell, Ramadorai, and Schwartz (2009) effectively allow these cutoff points to vary using a regression approach calibrated to observed quarterly changes in institutional 1",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 38,
    "chunk_index": 4,
    "word_count": 304,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "the larger reported trades. For example, Lee and Radhakrishna (2000) use a $20,000 cutoff point to separate smaller individual trades from larger institutional trades. More recently, Campbell, Ramadorai, and Schwartz (2009) effectively allow these cutoff points to vary using a regression approach calibrated to observed quarterly changes in institutional 1",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 38,
    "chunk_index": 5,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "ownership, but they maintain the same basic assumption that small trades are more likely to arise from individual trading. However, once algorithms become an important feature of institutional order executions in the early 2000’s, this trade size partition becomes far less useful as a proxy for retail order flow. In fact, the tendency for algorithms to slice orders into smaller and smaller pieces has progressed so far that we find that during our recent sample period retail order flow actually has a slightly larger average trade size compared to other flow. More generally, researchers need an easily implementable method to isolate retail order under the current automated and algorithm-driven market structure. This is one of our main contributions. We provide an easy way to use recent publicly available trade data to isolate a broad swath of retail order flow. To be more specific, our data are from TRF, which is included in TAQ with exchange code “D”. A substantial part of retail investors market order flows is internalized or sent to wholesalers. To justify the internalization or whole-selling, these retail orders normally would receive price improvement less than a penny. These transactions happen off the exchange and are reported to TRF. From TRF data, we identify transactions as retail-initiated buys if the transaction price is slightly below the round penny, and retail-initiated sells if the transaction price is slightly above the round penny. We are confident that this approach only applies to retail investors because the institutional-initiated trades are normally not internalized or sent to wholesalers, and if they do receive price improvements, it would be around half-penny due to NMS regulations. Overall, we believe our method of identification of retail trades are conservative and clean. We analyze retail order flow for six years between January 2010 and December 2015. We find that retail investors are contrarian on average, and they are informed: the cross-section of retail order imbalances in a given week predicts the cross-section of returns over the next several weeks, 2",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 38,
    "chunk_index": 6,
    "word_count": 334,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "and clean. We analyze retail order flow for six years between January 2010 and December 2015. We find that retail investors are contrarian on average, and they are informed: the cross-section of retail order imbalances in a given week predicts the cross-section of returns over the next several weeks, 2",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 38,
    "chunk_index": 7,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "consistent with Kelley and Tetlock (2013) and Barrot, Kaniel and Sraer (2016), but inconsistent with the findings of many others. We also examine whether aggregate retail order imbalance predicts future market returns, and fail to find any predictive relation. Thus, it appears that our identified retail investors have some stock-picking ability but no market timing skills. The article is organized as follows. We describe the data and our identification method in Section 2. Section 3 contains our main empirical results. We provide more discussion in Section 4. Section 5 concludes. 2. Data Most equity trades initiated by retail investors do not take place on one of the dozen or so registered exchanges. Instead, most marketable retail orders are executed either by wholesalers or via internalization. If an order is internalized, it is filled from the broker’s own inventory. If an order is executed by a wholesaler, it typically pays the retail customer’s broker a small amount, typically a fraction of a penny per share, a practice that is called “payment for order flow.” Orders executed in this way are usually reported to a FINRA Trade Reporting Facility (TRF), which provides broker-dealers with a mechanism to report transactions that take place off-exchange, and these TRF executions are then included in the “consolidated tape” of all reported transactions, such as TAQ with exchange code “D”. Often, orders that are internalized or sold in this way are given a small amount of price improvement relative to the National Best Bid or Offer (NBBO). If a retail customer wants to sell, for example, the internalizing or wholesaling counterparty often agrees to pay slightly more than the National Best Bid. This price improvement is typically only a small fraction of a cent. 3",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 38,
    "chunk_index": 8,
    "word_count": 288,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "of price improvement relative to the National Best Bid or Offer (NBBO). If a retail customer wants to sell, for example, the internalizing or wholesaling counterparty often agrees to pay slightly more than the National Best Bid. This price improvement is typically only a small fraction of a cent. 3",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 38,
    "chunk_index": 9,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "Common price improvement amounts are 0.01 cents, 0.1 cent, and 0.2 cents. Notably, these types of price improvements are not a feature of institutional order executions, as institutional orders are almost never internalized or sold to wholesalers. Instead, their orders are almost always executed on exchanges and dark pools, and because Regulation NMS, which is applied to exchange orders and dark pools, prohibits orders from having subpenny limit prices, these execution prices are usually in round pennies. There is one exception: Reg NMS has been interpreted to allow executions at the midpoint between the best bid and best offer. Institutions are heavy users of crossing networks and midpoint peg orders that generate transactions at this midpoint price. Since the quoted spread is now typically one cent per share, this means that there are many institutional transactions reported at a half-penny. There is also a dark pool that for a time allowed some negotiation around the midquote and thus printed trades at 0.4, 0.5 or 0.6 cents. Based on these institutional arrangements, it is fairly straightforward to identify transactions initiated by retail customers from TRF. Transactions with a retail seller tend to take place at prices that are just above a round penny due to the small amount of price improvement, while transactions with a retail buyer tend to take place at prices just below a round penny. To be precise, for all trades reported to a FINRA TRF (exchange code ‘D’ in TAQ), let P be the transaction price in it stock i at time t, and let Z ≡ 100 * mod(P , 0.01) be the fraction of a penny associated with that it it transaction price. Z can take on any value in the unit interval [0,1). If Z is in the interval (0,0.4), it it it would be a retail seller-initiated transaction. If Z is in the interval (0.6,1) then the transaction it is coded as retail buyer-initiated. Transactions at a round penny (Z = 0) or near the half-penny it (0.4 ≤ Z ≤ 0.6) are not assigned to the retail category. it We are confident that our data captures most of the marketable orders from retail investors. This can be discerned from SEC Rule 606 filings, where U.S. brokerage firms are required to 4",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 38,
    "chunk_index": 10,
    "word_count": 379,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "or near the half-penny it (0.4 ≤ Z ≤ 0.6) are not assigned to the retail category. it We are confident that our data captures most of the marketable orders from retail investors. This can be discerned from SEC Rule 606 filings, where U.S. brokerage firms are required to 4",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 38,
    "chunk_index": 11,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "provide regular summary statistics on their order routing practices for non-directed orders. A directed order instructs the broker to execute an order on a given exchange or trading venue; a non-directed order gives the broker discretion on execution venue. The vast majority of retail orders are non-directed. For example, Charles Schwab reports that 98.6% of their security orders during the second quarter of 2016 were non-directed orders. The corresponding figure for TD Ameritrade is 99%. In addition, according to the 606 filings of these brokerage firms, more than 90% of these orders receive small price improvements. In addition, our approach identifies marketable retail orders rather than limit orders. As discussed above, Reg NMS requires that limit orders be priced at round pennies, so retail limit orders are not distinguishable from institutional limit orders based on the limit price. Nevertheless, marketable orders represent a large part of retail order flow. The 606 filings are partitioned into market and limit orders. While we have not collected data systematically, from our spot checks retail investors use market orders and limit orders in more or less equal numbers. For example, the Charles Schwab brokerage firm reports that for the second quarter of 2016, market orders account for 50.0% of its customers’ non-directed orders in NYSE-listed securities, while limit orders account for 45.1%, and other orders account for the remainder. For securities listed on Nasdaq, limit orders are slightly more prevalent than market orders at Schwab, with market orders accounting for 44.0% and limit orders accounting for 50.7%. After collecting information on retail investor activity, we merge it with stock return data and accounting data from CRSP and Compustat, respectively. We only include common stocks with share code 10 or 11 (which excludes mainly ETFs, ADRs, and REITs) listed on the NYSE, NYSE MKT (formerly the AMEX), or Nasdaq. We remove low-priced stocks by requiring the minimum stock price to be $1 at the previous month-end. Our sample period is from January 3, 2010 to 5",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 38,
    "chunk_index": 12,
    "word_count": 331,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "share code 10 or 11 (which excludes mainly ETFs, ADRs, and REITs) listed on the NYSE, NYSE MKT (formerly the AMEX), or Nasdaq. We remove low-priced stocks by requiring the minimum stock price to be $1 at the previous month-end. Our sample period is from January 3, 2010 to 5",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 38,
    "chunk_index": 13,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "December 31, 2015. On each day, we have an average of around 3,000 firms included in the sample. Table 1 presents summary statistics of retail investors’ activity. We pool observations across stocks and across days, and compute the mean, standard deviation, median, 25 and 75 percentile. Our sample includes over 4.6 million stock-day observations. For the number of shares traded per day (vol), the mean share volume is around 1.23 million, and the standard deviation is about 6.85 million shares. The average stock has 5,917 trades each day (trd), and comparing this to the average daily share volume implies that the average trade size over this sample period is about 200 shares. Our identified retail investor activity is only a small part of the overall trading volume. The average daily buy volume from retail investors (indbvol) is 42,481 shares, and the average daily sell volume from retail investors (indsvol) is 42,430 shares. Thus, we identify an average of 84,911 shares per stock-day traded by retail investors, about 6.91% of the average total shares traded each day. The average number of buy trades from retail investors (indbtrd) each day is 110, and the average sell trades from retail investors (indstrd) each day is 108. Thus, the total number of trades per stock-day from retail investors is 218, around 3.68% of the total number of trades. Over our sample period, there is slightly more buying than selling by retail investors. Information on odd lot trades (trades of fewer than 100 shares) is reported on the TRF and on the consolidated tape beginning in December of 2013 (see O’Hara, Yao, and Ye, 2014). During the December 2013 through December 2015 sample period where odd lot data are available, the daily average of odd lot retail buy (sell) volume (oddindbvol and oddindsvol, respectively) is 506 and 443 respectively, for a total of 949 shares traded by retail investors in odd lots per average stock-day. This is about one third of all odd lot share volume at 3,027 shares. A similar pattern exists for the number of trades. Older papers studying odd lots generally find that these retail- 6",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 38,
    "chunk_index": 14,
    "word_count": 354,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "for a total of 949 shares traded by retail investors in odd lots per average stock-day. This is about one third of all odd lot share volume at 3,027 shares. A similar pattern exists for the number of trades. Older papers studying odd lots generally find that these retail- 6 dominated orders are virtually uninformed, so we study odd lots separately to determine whether the information content in odd lots executed by retail customers differs from that of retail round lots. To measure retail investors’ directional trade, we compute the following four order imbalance measures, for each stock i on each day t: indbvol(cid:4666)i,t(cid:4667)(cid:3398)indsvol(cid:4666)i,t(cid:4667) (cid:4666)1(cid:4667) oibvol(cid:4666)i,t(cid:4667) (cid:3404) , indbvol(cid:4666)i,t(cid:4667)(cid:3397)indsvol(cid:4666)i,t(cid:4667) indbtrd(cid:4666)i,t(cid:4667)(cid:3398)indstrd(cid:4666)i,t(cid:4667) (cid:4666)2(cid:4667) oibtrd(cid:4666)i,t(cid:4667) (cid:3404) , indbtrd(cid:4666)i,t(cid:4667)(cid:3397)indstrd(cid:4666)i,t(cid:4667) oddindbvol(cid:4666)i,t(cid:4667)(cid:3398)oddindsvol(cid:4666)i,t(cid:4667) (cid:4666)3(cid:4667) oddoibvol(cid:4666)i,t(cid:4667) (cid:3404) , oddindbvol(cid:4666)i,t(cid:4667)(cid:3397)oddindsvol(cid:4666)i,t(cid:4667) oddindbtrd(cid:4666)i,t(cid:4667)(cid:3398)oddindstrd(cid:4666)i,t(cid:4667) (cid:4666)4(cid:4667) oddoibtrd(cid:4666)i,t(cid:4667) (cid:3404) . oddindbtrd(cid:4666)i,t(cid:4667)(cid:3397)oddindstrd(cid:4666)i,t(cid:4667) The first two measures are calculated using retail round lot executions before December 2013 and by aggregating round lot and odd lot executions thereafter, while the last two measures are calculated using only retail odd lots, and thus these measures begin in December 2013. Summary statistics on the order imbalance measures are reported at the bottom of Table 1. Across all stocks and all days, the mean order imbalance for share volume, oibvol, is -0.038, with a standard deviation of 0.464, and the mean order imbalance for trade, oibtrd, is -0.032, with a standard deviation of 0.437. The correlation between oibtrd and oibvol is around 85%, indicating great overlap in information covered in these two measures. Our later discussions mostly focus on oibvol, and the results using these two measures are quite similar given the high correlation between the two. 7",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 38,
    "chunk_index": 15,
    "word_count": 268,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "with a standard deviation of 0.437. The correlation between oibtrd and oibvol is around 85%, indicating great overlap in information covered in these two measures. Our later discussions mostly focus on oibvol, and the results using these two measures are quite similar given the high correlation between the two. 7",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 38,
    "chunk_index": 16,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "Overall, the order imbalance is close to zero on average, but with sells slightly more prevalent than buys, which is slightly different from what we observe from the number of trades and numbers of shares traded, where buy trades and share volume slightly dominate sell trades and share volume on average. More importantly, the sizable standard deviation measures show that there is substantial cross-sectional variation in the activity levels and trading direction of retail investors. The odd lot order imbalance measures exhibit similar patterns. In Figure 1, we plot the time-series of the cross sectional mean, median, the 25th percentile and the 75th percentile of the order imbalance measures over the six-year sample period. Across all four order imbalance measures, the means and medians are all close to zero, while the 25th percentile are mostly around -0.3, and the 75th percentile mostly around 0.2. There are no obvious time trends or structural breaks in the time-series observations. To reduce the impact of microstructure noise on our results, even though we have daily data, we choose to focus on weekly horizons. That is, our main variables of interest are average order imbalance over 5-day horizons, and 5-day returns. Blume and Stambaugh (1986) show that using the end-of-day closing price to compute daily returns can generate an upward bias, due to bid-ask bounce. Therefore, we compute two versions of weekly returns, one by compounding CRSP daily returns, which is based on daily closing prices, and one by compounding daily returns using the end-of-day bid-ask average price. We report results for both types of returns. 3. Empirical Results 3.1 What Explains Retail Investor Order Imbalances? 8",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 38,
    "chunk_index": 17,
    "word_count": 273,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "compute two versions of weekly returns, one by compounding CRSP daily returns, which is based on daily closing prices, and one by compounding daily returns using the end-of-day bid-ask average price. We report results for both types of returns. 3. Empirical Results 3.1 What Explains Retail Investor Order Imbalances? 8",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 38,
    "chunk_index": 18,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "We start our empirical investigation by investigating what drives the trading of retail investors. More specifically, we examine whether retail investors’ order flow is contrarian or momentum. To allow maximal time-series flexibility and focus on cross-sectional patterns, we adopt the Fama and MacBeth (1973) 2-stage estimation. At the first stage, for each day, we estimate the following predictive regression: (cid:4666)5(cid:4667) (cid:1867)(cid:1861)(cid:1854)(cid:4666)(cid:1861),(cid:1875)(cid:4667) (cid:3404) (cid:1854)0(cid:4666)(cid:1875)(cid:4667)(cid:3397)(cid:1854)1(cid:4666)(cid:1875)(cid:4667)(cid:4593) ∗(cid:1870)(cid:1857)(cid:1872)(cid:4666)(cid:1861),(cid:1875) (cid:3398)1(cid:4667)(cid:3397)(cid:1854)2(cid:4666)(cid:1872)(cid:4667)(cid:4593) ∗(cid:1855)(cid:1867)(cid:1866)(cid:1872)(cid:1870)(cid:1867)(cid:1864)(cid:1871)(cid:4666)(cid:1861),(cid:1875) (cid:3398)1(cid:4667)(cid:3397)(cid:1873)(cid:4666)(cid:1861),(cid:1875)(cid:4667), where we use various horizons of past returns, ret(i, w-1) and various control variables from the past to explain the order imbalance measures, oib(i,w) at week w. The first stage estimation generates daily time-series of coefficients {b0(w), b1’(w), b2’(w)}. At the second stage, we conduct statistical inference using the time-series of the coefficients. Because we use overlapping daily frequency data for weekly order imbalance and return measures, the standard deviations of the time-series are calculated using Newey-West (1987) with 5 lags. To explain the order imbalance over week w, we first include its own lag, the past week order imbalance measures from day -5 to day -1, or oib(w-1). We also include past returns over three different horizons: the previous week (ret(w-1)), the previous month (ret(m-1)), and the previous six months (ret(m-7,m-2)). For control variables, we use log market cap, log book-to-market ratio, turnover (share volume over shares outstanding), and daily return volatility, all observed from the previous month. Results are presented in Table 2, with regression I and II explaining the order imbalance expressed using share volume and regression III and IV explaining order imbalance based on the number of trades. In the first regression, we use the bid-ask return to explain the order imbalance using share volume, oibvol. The oibvol has a positive correlation with its own lag, with a highly 9",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 38,
    "chunk_index": 19,
    "word_count": 291,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "expressed using share volume and regression III and IV explaining order imbalance based on the number of trades. In the first regression, we use the bid-ask return to explain the order imbalance using share volume, oibvol. The oibvol has a positive correlation with its own lag, with a highly 9",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 38,
    "chunk_index": 20,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "significant coefficient of 0.22, which indicates that directional trading activity is somewhat persistent over successive weeks. The coefficients for past week, past one month, and past six- month returns are -0.9481, -0.2778, and -0.0586, respectively. All three coefficients are highly significant, which indicates that retail investors are contrarian, especially over the short horizon. For the control variables, investors tend to buy more aggressively in larger firms, growth firms and firms with higher turnover and higher volatility. All coefficients are highly significant. Similar patterns are observed for regressions II, III and IV, with different return and order imbalance measures, indicating that at the weekly horizon, different ways of computing results do not generate significantly different results. Henceforth, we focus our discussion on bid-ask midpoint returns, which do not have bid-ask bounce and thus exhibit a much smaller degree of time-series predictability compared to returns based on transaction prices. We also include CRSP returns in the results for completeness and robustness. To summarize, retail investors are contrarian on average. Why are they contrarian? There are at least two possibilities: retail investors might be informed and know something about future stock returns, or retail investors are uninformed but tend to simply “buy the dips” by trading in the opposite direction of order imbalances and returns. In the latter case, retail investors could be worse than uninformed, making systematic mistakes by buying prior to further price declines or selling prior to further share price increases. We investigate these possibilities in the next sections by examining whether the retail order imbalance can predict future stock returns. 3.2 Predictive Regressions for Future Stock Returns 10",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 38,
    "chunk_index": 21,
    "word_count": 269,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "be worse than uninformed, making systematic mistakes by buying prior to further price declines or selling prior to further share price increases. We investigate these possibilities in the next sections by examining whether the retail order imbalance can predict future stock returns. 3.2 Predictive Regressions for Future Stock Returns 10",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 38,
    "chunk_index": 22,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "Can retail investors’ activity provide useful information for future stock returns? In this section, we examine the predictive power of our order imbalance measures using Fama-MacBeth regressions as follows: (cid:4666)6(cid:4667) (cid:1870)(cid:1857)(cid:1872)(cid:4666)(cid:1861),(cid:1875)(cid:4667) (cid:3404) (cid:1855)0(cid:4666)(cid:1875)(cid:4667)(cid:3397)(cid:1855)1(cid:4666)(cid:1875)(cid:4667)(cid:1867)(cid:1861)(cid:1854)(cid:4666)(cid:1861),(cid:1875) (cid:3398)1(cid:4667)(cid:3397)(cid:1855)2(cid:4666)(cid:1875)(cid:4667)(cid:4593)(cid:1855)(cid:1867)(cid:1866)(cid:1872)(cid:1870)(cid:1867)(cid:1864)(cid:1871)(cid:4666)(cid:1861),(cid:1875) (cid:3398)1(cid:4667)(cid:3397)(cid:1857)(cid:4666)(cid:1861),(cid:1875)(cid:4667), where we use the order imbalance measure from week t-1, oib(i, w-1) and various control variables to explain the next week’s return, ret(i,w). As in the previous section, because we use overlapping daily frequency data for weekly order imbalance and return measures, the standard deviations of the time-series are adjusted using Newey-West (1987) with 5 lags. If retail investors are informed about future stock returns, past order imbalance should be able to predict future returns in the right direction and we expect the coefficient c1 to be significantly positive. If retail investors are uninformed or wrongly-informed, the coefficient c1 might be close to zero or significantly negative. For the control variables, we again include past returns over three different horizons: the previous week, the previous month, and the previous six months (from month m-7 to month m-2). In addition, we include log market cap, log book-to-market ratio, turnover, and daily return volatility, all from the previous month. The estimation results are reported in Table 3. In regression I, we use order imbalance based on share volume, oibvol, to predict next week’s return based on bid-ask midpoints. The coefficient on oibvol is 0.0009, with a t-statistic of 15.60. The positive and significant coefficient shows that if retail investors buy more than they sell in a given week, the return on that stock in the next week is significantly higher. In terms of magnitude, we present at the bottom of the table that the inter-quartile range for the oibvol measure is 1.1888 per week, which means the difference 11",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 38,
    "chunk_index": 23,
    "word_count": 292,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "buy more than they sell in a given week, the return on that stock in the next week is significantly higher. In terms of magnitude, we present at the bottom of the table that the inter-quartile range for the oibvol measure is 1.1888 per week, which means the difference 11",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 38,
    "chunk_index": 24,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "between the 25th percentile and the 75th percentile is 1.1888 per week. Multiplying the interquartile difference by the regression coefficient of 0.0009 generates a weekly return difference of 10.89 basis points (or 5.66% per year annualized). When we use different order imbalance and return measures, the same pattern is present, and the weekly interquartile difference in the conditional mean return ranges from 9.31 basis points to 11.44 basis points (4.84% to 5.94% per year). For the control variables, we observe negative coefficients on ret(w-1), which shows the presence of weekly return reversals, and positive coefficients on the other longer-horizon returns, which shows momentum. Size, book to market, turnover and volatility all carry their expected signs, while most of them are not statistically significant. To summarize, order imbalance measures from retail investors strongly and positively predict one-week ahead stock returns. As a group, these retail investors seem to be informed about future stock return movements. 3.3 Subgroups Each day, our sample includes on average more than 3,000 firms. Is the predictive power of retails investor order imbalances restricted to a particular type of firm, or do informed retail investors have preferences for particular types of firms? To investigate this, we analyze various firm subgroups in this section. We first sort all firms into three groups, based on one particular characteristic observed at the end of previous month. Then we estimate equation (6) within each characteristic group. That is, we allow all coefficients in equation (6) to be different within each group, which allows substantial flexibility in the possible predictive relationship across these different groups. 12",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 38,
    "chunk_index": 25,
    "word_count": 264,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "based on one particular characteristic observed at the end of previous month. Then we estimate equation (6) within each characteristic group. That is, we allow all coefficients in equation (6) to be different within each group, which allows substantial flexibility in the possible predictive relationship across these different groups. 12",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 38,
    "chunk_index": 26,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "The results are reported in Table 4. To save space, we only include results on weekly returns computed using end-of-day bid-ask average price. We first sort all stocks into three different size groups: small, medium and big. The results are reported in Panel A of Table 4. In the left panel, we report coefficients on oibvol, the order imbalance computed from share volume. When we move from the smallest one-third of firms by market cap to the largest tercile, the coefficients on obivol decrease from 0.0013 to 0.0003, and the t-statistics decrease from 13.90 to 3.68. Clearly, the predictive power of retail order imbalance is much stronger for smaller firms than for larger cap firms. Economically, the interquartile difference in weekly returns is 21.9 basis points for the smallest firms (11.39% per year), and 2.6 basis points for the largest firms (1.35% per year). The results in the right panel using order imbalance based on the number of trades (oibtrd) are quite similar. In Panel B of Table 4, we sort all firms into three groups based on previous month end share price. In the left panel, moving from the lowest share price firms to the highest share price firms, the coefficient on oibvol decreases from 0.0014 to 0.0002, and t-statistics go from 13.34 to 3.23. In terms of magnitude, the interquartile weekly return difference is 20.5 basis points (10.66% per year) for the lowest price firms and only 2.0 basis points for the firms with the highest share price (1.04% per year). For specifications using oibtrd, which are reported in the right panel, the results are similar, with slightly lower coefficients and t-statistics. The pattern is clear: retail investor order imbalance predicts returns more for low price firms. Next we sort all firms based on previous month turnover, which is a proxy for liquidity. In the left panel, moving from the tercile of low trading activity to the firms with more turnover, the coefficient on oibvol decreases from 0.0011 to 0.0007, and t-statistics decrease from 15.60 to 4.98. In terms of magnitude, the interquartile weekly return difference is 20.5 basis points (10.66% per 13",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 38,
    "chunk_index": 27,
    "word_count": 355,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "In the left panel, moving from the tercile of low trading activity to the firms with more turnover, the coefficient on oibvol decreases from 0.0011 to 0.0007, and t-statistics decrease from 15.60 to 4.98. In terms of magnitude, the interquartile weekly return difference is 20.5 basis points (10.66% per 13",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 38,
    "chunk_index": 28,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "year) for the firms with the lowest turnover and 6.5 basis points for the firms with the highest turnover (3.38% per year). For specifications based on oibtrd in the right panel, the results are similar, with slightly lower coefficients and t-statistics. Overall, retail investor order imbalance predicts returns better for firms with lower trading activity. To summarize this section, we find that the predictive power of the retail investor order imbalance is significant and positive for all but one subgroup, which shows that the predictive power is not particularly driven by special subgroups. But there is a clear cross-sectional pattern for the predictive power. The predictive power of retail order imbalance is much stronger for small, low price and low liquidity firms. 3.4 Longer Horizons The results in the previous section show that retail investor order imbalances can predict next week’s returns positively and significantly. One natural question at this point is: is the predictive power transient or persistent? If the predictive power quickly vanishes or reverses, maybe these retail investors are catching on price reversals, and if the predictive power lingers, potentially the retails investors are informed about information related to firm fundamentals. To answer this question, we extend equation (6) to longer horizons as follows: (cid:4666)7(cid:4667) (cid:1870)(cid:1857)(cid:1872)(cid:4666)(cid:1861),(cid:1875) (cid:3398)1(cid:3397)(cid:1863)(cid:4667) (cid:3404) (cid:1855)0(cid:4666)(cid:1875)(cid:4667)(cid:3397)(cid:1855)1(cid:4666)(cid:1875)(cid:4667)(cid:1867)(cid:1861)(cid:1854)(cid:4666)(cid:1861),(cid:1875) (cid:3398)1(cid:4667)(cid:3397)(cid:1855)2(cid:4666)(cid:1875)(cid:4667)(cid:4593)(cid:1855)(cid:1867)(cid:1866)(cid:1872)(cid:1870)(cid:1867)(cid:1864)(cid:1871)(cid:4666)(cid:1861),(cid:1875) (cid:3398)1(cid:4667)(cid:3397)(cid:1857)(cid:4666)(cid:1861),(cid:1875)(cid:4667). That is, we use one week of order imbalance measures to predict k-week ahead returns, ret(i,w+k), with k=1 to 12. Notice that to clear observe the decay of the predictive power of retail order imbalance, the return to be predicted is a weekly return over a one-week period, rather than a cumulative return over n weeks, which is an average over all weeks involved. If retail order imbalances have only short-lived predictive power for future returns, we might observe the 14",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 38,
    "chunk_index": 29,
    "word_count": 295,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "of retail order imbalance, the return to be predicted is a weekly return over a one-week period, rather than a cumulative return over n weeks, which is an average over all weeks involved. If retail order imbalances have only short-lived predictive power for future returns, we might observe the 14",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 38,
    "chunk_index": 30,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "coefficient c1 decrease to zero within a couple of weeks. Alternatively, if the retail order imbalance has longer predictive power, the coefficient c1 should remain statistically significant for a longer period. In our empirical estimation, we choose n to be 2 weeks, 4 weeks, 6 weeks, 8 weeks, 10 weeks, and 12 weeks. We report the results in Table 5, with results based on bid-ask average returns in Panel A, and results based on closing transaction prices in Panel B. In Panel A, when we extend the window from two weeks to 12 weeks, the coefficient on oibvol monotonically decreases from 0.00055 to 0.00007, and the coefficient on oibtrd gradually decreases from 0.00048 to 0.00006. The coefficients are statistically significant up to six or eight weeks ahead. Results in Panel B are similar. Figure 2 plots the coefficients over different horizons. With oibvol in Panel A and oibtrd in Panel B, the general pattern is similar: the predictive power of retail order imbalances gradually decreases to zero over six to eight weeks. Potentially the retail order imbalances capture information longer than a one-month quick reversal. 3.5 Long-Short Portfolios One might wonder whether we can use retail order imbalances as a signal to form a profitable trading strategy. As discussed earlier, both oibvol and oibtrd are publicly available information. In this section, we form quintile portfolios based on the previous week’s average order imbalance, then we hold the quintile portfolios for up to 12 weeks. If retail investors can select the right stocks to buy and sell, then firms with higher or positive retail order imbalance would outperform firms with lower or negative order imbalance. 15",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 38,
    "chunk_index": 31,
    "word_count": 275,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "based on the previous week’s average order imbalance, then we hold the quintile portfolios for up to 12 weeks. If retail investors can select the right stocks to buy and sell, then firms with higher or positive retail order imbalance would outperform firms with lower or negative order imbalance. 15",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 38,
    "chunk_index": 32,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "Table 6 reports long-short portfolio returns, where we buy the stocks in the highest quintile of scaled order imbalance, and short the stocks in the lowest order imbalance quintile. Portfolio returns are value-weighted using the previous month-end market cap. Because the holding period can be as long as 12 weeks, we report both the raw returns and risk-adjusted returns using the Fama-French three-factor model. Given the overlapping data, we adjust the standard deviations of the portfolio return time-series using Newey-West (1987) with the corresponding number of lags. In Panel A, the long-short strategy is based on the previous week’s oibvol, and we report bid-ask average returns. Over a one-week horizon, the long-short portfolio return is 0.104%, or 5.41% per year annualized. The t-statistic is 3.28. Risk adjustment using the Fama-French three- factor model does not make much difference: the weekly Fama-French alpha for the long-short portfolio is 0.101%, with a t-statistic of 3.09. When we increase the holding horizon to 12 weeks, the mean return becomes 0.617%, with a t-statistic of 2.35. The general pattern is that holding- period returns (and alphas) continue to grow at a decreasing rate over time. We never observe evidence of a reversal in returns. In terms of statistical significance, the t-statistics are significant even the longest 12-week horizon. The results are slightly weaker compared to the Fama-MacBeth regressions, and the main reason is that in this section we value-weight the portfolio returns across firms, while the Fama-MacBeth approach implicitly weights each stock equally. When we restrict portfolio formation to one of the three different market cap groups, the one- week return is 0.472% (or 24.54% per year) with a t-statistic of 9.20 for the smallest size firms, while the one-week return is 0.071% (or 3.69% per year) with a t-statistic of 2.16 for the largest size firms. When the holding horizon becomes longer, the long-short strategy is still significant and positive out to 12 weeks for the smallest third of firms, but significance is marginal for the largest tercile. 16",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 38,
    "chunk_index": 33,
    "word_count": 336,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "return is 0.071% (or 3.69% per year) with a t-statistic of 2.16 for the largest size firms. When the holding horizon becomes longer, the long-short strategy is still significant and positive out to 12 weeks for the smallest third of firms, but significance is marginal for the largest tercile. 16",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 38,
    "chunk_index": 34,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "Results in Panel B, using oibtrd, are qualitatively similar, but with smaller magnitude and lower statistical significance. This is expected, because as discussed earlier, oibvol provides similar but finer information than oibtrd. 4. Discussion We characterize the predictive power of the retail order imbalance in previous section, and we find that the retail orders are informed about future stock returns, the predictive lasting up to 8 weeks, and is stronger for smaller firms and lower price firms. The retail investors, overall, show some stock picking ability. In this section, we discuss other related issues to put the retail order imbalance’s predictive power in perspective. In section 4.1, we discuss whether the retail investors can time the market. We further examine whether the predictive power is related to overall market conditions in section 4.2. It is important to understand the role of wholesalers in this setup, and we look into the size of price improvement and how it affect retail order imbalance predictive power in section 4.3. Finally, we investigate the predictive power of odd lot retail orders in section 4.4. 4.1 Aggregate Retail Order Imbalance If retail order imbalance measures can predict future stock returns in the cross section, retail investors may also be able to time aggregate market moves. To investigate this, we aggregate retail order imbalances across all firms to see if we can predict aggregate stock market returns. We estimate the following equation, (cid:4666)8(cid:4667) (cid:1865)(cid:1863)(cid:1872)(cid:4666)(cid:1875) (cid:3397)1,(cid:1875) (cid:3397)(cid:1863)(cid:4667) (cid:3404) (cid:1856)0(cid:3397)(cid:1856)1∗(cid:1853)(cid:1859)(cid:1859)(cid:1867)(cid:1861)(cid:1854)(cid:4666)(cid:1875)(cid:4667)(cid:3397)(cid:1873)(cid:4666)(cid:1875)(cid:4667), where mkt(w+1,w+k) is the future k-week market return from week w+1 to week w+k, and aggoib(w) is the current aggregated retail order imbalance measure for week w. We compute aggoib using either value-weighted or equal-weighted oibvol or oibtrd measures. 17",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 38,
    "chunk_index": 35,
    "word_count": 282,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "estimate the following equation, (cid:4666)8(cid:4667) (cid:1865)(cid:1863)(cid:1872)(cid:4666)(cid:1875) (cid:3397)1,(cid:1875) (cid:3397)(cid:1863)(cid:4667) (cid:3404) (cid:1856)0(cid:3397)(cid:1856)1∗(cid:1853)(cid:1859)(cid:1859)(cid:1867)(cid:1861)(cid:1854)(cid:4666)(cid:1875)(cid:4667)(cid:3397)(cid:1873)(cid:4666)(cid:1875)(cid:4667), where mkt(w+1,w+k) is the future k-week market return from week w+1 to week w+k, and aggoib(w) is the current aggregated retail order imbalance measure for week w. We compute aggoib using either value-weighted or equal-weighted oibvol or oibtrd measures. 17",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 38,
    "chunk_index": 36,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "Results are presented in Panel A of Table 7. Regardless of the weighting scheme and the order imbalance measure, the result is the same: there is no evidence that retail investors can reliably predict future market returns. Although retail investors display stock selection skills, they do not seem to be able to do market timing. Our data actually contains a large cross-section of various ETFs. In Table 7 Panel B, we also examine retail order flow in exchanged-traded funds (ETFs) over the same time period. The coefficient is mostly around or below 1bps, which is much smaller than those in Table 3, and the t-statistics are mostly insignificant. It is possible that ETFs can be sector oriented and actively managed, and they might not be good candidates for overall market-timing checks. To ease this concern, we pick the 6 largest ETFs that focus on U.S. equity market and tracking the overall U.S. equity market index: SPY, IVV, VTI, VOO, IWM and IWB. The results are reported in the last row of Panel B. Consistent with the Panel A market timing results, we find little evidence that retail order flow is informed about future returns on broad equity market ETFs. 4.2 Market Conditions Barrot, Kaniel and Srear (2016) find that retail traders are significantly rewarded when markets are volatile, specifically when the VIX option-implied volatility index is high. Their sample is from 2002 to 2010, during which VIX has dramatic increases and decreases. In contrast, our sample is from 2010 to 2015, and VIX is far less volatile. Still, we separate our sample into two parts, when VIX is higher than the historical median, and when VIX is lower than the historical median. The historical median of VIX over its life is 18%. We re-estimate equation (6) for the high VIX and low VIX subsample, and results are presented in Panel C of Table 7. Comparing the low and high VIX regimes, the coefficient on oibvol is quite 18",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 38,
    "chunk_index": 37,
    "word_count": 328,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "than the historical median. The historical median of VIX over its life is 18%. We re-estimate equation (6) for the high VIX and low VIX subsample, and results are presented in Panel C of Table 7. Comparing the low and high VIX regimes, the coefficient on oibvol is quite 18",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 38,
    "chunk_index": 38,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "similar, yet the t-statistic is higher when VIX is low rather than high. This might not be surprising, given that volatility of all variables increase when VIX is high. Overall, the predictive power in both high and low VIX regimes is positive and significant. 4.3 The Profitability of Marketable Retail Order Flow If marketable retail order flow is sufficiently informed, trading with these orders would be unprofitable, which might make readers wonder whether our results are consistent with the apparently profitable business model of internalizers and wholesalers. Ultimately, as long as the information content of retail order flow is less than the bid-ask spread being charged, internalizers and wholesalers on average earn positive revenues by trading with these orders. For example, if a retail buy and sell order arrive at the same time, they offset each other, and a wholesaler earns the full bid-ask spread charged (the quoted spread less the price improvement given). Ultimately, internalizers and wholesalers are only exposed to adverse selection on retail order imbalances. The summary statistics in Table 1 show that there is a substantial amount of offsetting retail order flow. The interquartile range for the volume-based daily order imbalance measure goes from -0.301 to 0.217, indicating that even at the ends of these ranges, more than two-thirds of the retail order flow in such a stock on a given day is offsetting buys and sells. A simple calibration exercise based on retail order imbalances, average effective bid-ask spreads including price improvement, and the estimates of informedness in Table 3, suggests that the information content of retail order flow is a relatively minor drag on the trading revenue of internalizers and wholesalers. Luckily, price improvement itself has variations that might shed light on this issue. For instance, the magnitude of price improvement is chosen by the internalizers/wholesalers. They can rationally incorporate the potential information embedded in retail orders and only offer price improvement to the point that themselves can still profit from the trade. That is, if they expect 19",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 38,
    "chunk_index": 39,
    "word_count": 335,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "shed light on this issue. For instance, the magnitude of price improvement is chosen by the internalizers/wholesalers. They can rationally incorporate the potential information embedded in retail orders and only offer price improvement to the point that themselves can still profit from the trade. That is, if they expect 19",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 38,
    "chunk_index": 40,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "there might be relevant information in the retail order, they might offer less price improvement, and on the other side, if they don’t expect the retail order contains relevant information, they might be willing to offer more price improvement. If this is true, the predictive power of retail order imbalance should be higher for trades with less price improvement. In our earlier exercise, we group all orders with subpenny price between 0.6 and 1 to be retail- initiated buy orders, and between 0 and 0.4 to be retail-initiated sell orders. In this section, we further separate orders into “less price improvement” order imbalance and “more price improvement” order imbalance. For the “less price improvement”, we define buy-initiated orders as with transaction price between 0.8 and 1, and sell-initiated orders as with transaction price between 0 and 0.2. For the “more price improvement”, we define buy-initiated orders as with transaction price between 0.6 and 0.8, and sell-initiated orders as with transaction price between 0.2 and 0.4. We compute retail order imbalance following equation (1) and (2). To compare predictive power of retail order imbalance for “more” or “less” price improvement, we estimate equation (4). We first present the distribution of the magnitude of price improvement in Figure 3. As expected, most of the transaction prices happen at a round penny or a half penny. For the other ten bins, each containing 10 bps, there are slightly more trading volume for “less price improvement” than “more price improvement”. Regression results are presented in Panel D of Table 7. For less price improvement, the coefficient ranges between 0.0004 to 0.0007, all with t-statistics above 5. For more price improvement, the coefficient ranges between 0.0001 to 0.0002, all with t-statistics below 4. Clearly both sets of retail order imbalances have predictive power for future stock returns, but the ones with less price improvements have stronger predictive power. It is likely the 20",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 38,
    "chunk_index": 41,
    "word_count": 318,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "with t-statistics above 5. For more price improvement, the coefficient ranges between 0.0001 to 0.0002, all with t-statistics below 4. Clearly both sets of retail order imbalances have predictive power for future stock returns, but the ones with less price improvements have stronger predictive power. It is likely the 20",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 38,
    "chunk_index": 42,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "internalizers/wholesalers price discriminate against the retail orders with potential more information content. Furthermore, we are currently collecting more precise data to measure the trading revenues associated with being on the other side of this retail order flow. This will also allow us to express the information content of retail order flow as a fraction of the charged bid-ask spread, which is a common way of expressing information content in the market microstructure literature. 4.4 Odd Lots We also investigate the behavior of odd lot retail trades over the post-December 2013 period when odd lot transactions are reported to the consolidated tape. In untabulated results, we find that odd lot retail order imbalances are fairly similar to overall retail order imbalances in two dimensions. First, they are also contrarian with respect to the previous one-week return. Second, odd-lot order imbalances are contemporaneously correlated with market returns. Can odd lot retail order flow predict future returns? We estimate regression (6) using odd lot retail order imbalance and present the results in Panel E of Table 7. The oddoibvol seems to predict CRSP returns positively with a t-statistic of 1.99, but the other combinations fall short of standard critical values. We conclude that odd lot order imbalance predictive power is much weaker than retail order imbalance predictive power and that the former may not be present at all in our sample. 5. Conclusions In this paper, we exploit the fact that most retail order flow in U.S. equity markets is internalized or sold to wholesalers. As a part of this routing process, retail orders are typically given a small fraction of a penny per share of price improvement relative to the national best bid or offer price, and this price improvement can be observed when the trade is reported to the 21",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 38,
    "chunk_index": 43,
    "word_count": 299,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "sold to wholesalers. As a part of this routing process, retail orders are typically given a small fraction of a penny per share of price improvement relative to the national best bid or offer price, and this price improvement can be observed when the trade is reported to the 21",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 38,
    "chunk_index": 44,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "consolidated tape. Institutional orders almost never receive this kind of price improvement, so it becomes possible to use subpenny trade prices to identify a broad swath of marketable retail order flow. It is also straightforward to identify whether the retail trader is buying or selling stock: transactions at prices that are just above a round penny are classified as retail sales, while transactions that are just below a round penny are retail purchases. We use this methodology to characterize the trading behavior and the information content of retail orders. We find that retail investors are on average contrarian, buying stocks that have experienced recent price declines and selling stocks that have risen in the past week. More significantly, we find that these investors are quite well-informed as a group. Over the next week, stocks with more positive retail order imbalances outperform stocks with relatively negative retail order imbalances by about 10 basis points, which is on the order of 5% per year annualized. This predictability extends out to about 12 weeks before dying off. An important advantage of our method is that it is based on widely available intraday transaction data: anyone with access to TAQ can easily identify retail buys and sells using our approach. We believe there are many possible research applications. For example, researchers can investigate various behavioral biases, such as the disposition effect, to see whether individual traders as a group exhibit these biases. It should also be possible to identify the nature of the information possessed by these retail investors (e.g., whether retail investors are informed about future earnings news), along the lines of Boehmer, Jones, and Zhang (2016). Another possible direction is to study the seasonality and time-series variation of retail trading, including tax-related and calendar-driven trading as well as activity around corporate events such as dividends, stock splits, and equity issuance. 22",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 38,
    "chunk_index": 45,
    "word_count": 309,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "are informed about future earnings news), along the lines of Boehmer, Jones, and Zhang (2016). Another possible direction is to study the seasonality and time-series variation of retail trading, including tax-related and calendar-driven trading as well as activity around corporate events such as dividends, stock splits, and equity issuance. 22",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "1. Introduction",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 38,
    "chunk_index": 46,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "Barber, Brad M., and Terrance Odean, 2000, Trading is hazardous to your wealth: The common stock investment performance of individual investors, Journal of Finance 55, 773−806. Barber, Brad M., and Terrance Odean, 2002, Online investors: Do the slow die first? Review of Financial Studies 15, 455−488. Barber, Brad M., and Terrance Odean, 2008, All that glitters: The effect of attention and news on the buying behavior of individual and institutional investors, Review of Financial Studies 21, 785−818. Barber, Brad M., Yi-Tsung Lee, Yu-Jane Liu, and Terrance Odean, 2009, Just how much do individual investors lose by trading? Review of Financial Studies 22, 609−632. Barber, Barber M., Terrance Odean, and Ning Zhu, 2009, Do retail trades move markets? Review of Financial Studies 22, 151−186. Barrot, Jean-Noel, Ron Kaniel and David Alexandre Sraer, 2016, Are Retail Traders Compensated for Providing Liquidity? Journal of Financial Economics 120, 146-168. Battalio, Robert H., and Tim Loughran, 2008, Does payment for order flow to your broker help or hurt you? Journal of Business Ethics 80, 37−44. Benartzi, Shlomo, and Richard H. Thaler, 2001, Naive diversification strategies in defined contribution savings plans, American Economic Review 91, 79−98. Black, Fischer, 1986, Noise, Journal of Finance 41, 529−543. Bloomfield, Robert, Maureen O’Hara, and Gideon Saar, 2005, The ‘make or take’ decision in an electronic market: Evidence on the evolution of liquidity, Journal of Financial Economics 75, 165−199. Chan, Louis K. C., and Josef Lakonishok, 1995, The behavior of stock prices around institutional trades, Journal of Finance 50, 1147−1174. Chordia, Tarun, and Avanidhar Subrahmanyam, 2004, Order imbalance and stock returns: Theory and evidence, Journal of Financial Economics 72, 485−518. Dorn, Daniel, Gur Huberman, and Paul Sengmueller, 2008, Correlated trading and returns, Journal of Finance 58, 885−920. Easley, David, and Maureen O’Hara, 1992, Time and the process of security price adjustment, Journal of Finance 47, 577−605. Fama, Eugene F., and James D. MacBeth, 1973, Risk, return, and equilibrium: Empirical tests, Journal of Political Economy 81, 607−636. Fox, Merritt B., Lawrence R. Glosten, and Paul C. Tetlock, 2010, Short selling and the news: A preliminary report on an empirical study, New York Law School Law Review 54, 129−171. Frazzini, Andrea, and Owen A. Lamont, 2008, Dumb money: Mutual fund flows and the cross- section of stock returns, Journal of Financial Economics 88, 299−322. French, Kenneth R., 2008, The cost of active investing, Journal of Finance 58, 1537−1573. Gervais, Simon, Ron Kaniel, and Dan H. Mingelgrin, 2001, The high-volume return premium, Journal of Finance 56, 877−919. Griffin, John M., Jeffrey H. Harris, and Selim Topalaglu, 2003, Dynamics of institutional and individual trading, Journal of Finance 58, 2285−2320. Griffin, John M., Tao Shu, and Selim Topaloglu, 2011, Examining the dark side of financial markets: Who trades ahead of major announcements? Working paper, University of Texas. Grossman, Sanford J., and Merton H. Miller, 1988, Liquidity and market structure, Journal of Finance 43, 617−633. 23",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "References",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 38,
    "chunk_index": 47,
    "word_count": 479,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "Journal of Finance 58, 2285−2320. Griffin, John M., Tao Shu, and Selim Topaloglu, 2011, Examining the dark side of financial markets: Who trades ahead of major announcements? Working paper, University of Texas. Grossman, Sanford J., and Merton H. Miller, 1988, Liquidity and market structure, Journal of Finance 43, 617−633. 23",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "References",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 38,
    "chunk_index": 48,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "Gutierrez, Roberto C., and Eric K. Kelley, 2008, The long-lasting momentum in weekly returns, Journal of Finance 63, 415−447. Hvidkjaer, Soeren, 2008, Small trades and the cross-section of stock returns, Review of Financial Studies 21, 1123−1151. Ivković, Zoran, and Scott Weisbenner, 2005, Local does as local is: Information content of the geography of individual investors’ common stock investments, Journal of Finance 60, 267−305. Jegadeesh, Narasimhan, and Sheridan Titman, 1993, Returns to buying winners and selling losers: Implications for stock market efficiency, Journal of Finance 48, 65−91. Kaniel, Ron, and Hong Liu, 2006, So what orders do informed traders use? Journal of Business 79, 1867−1913. Kaniel, Ron, Shuming Liu, Gideon Saar, and Sheridan Titman, 2011, Individual investor trading and return patterns around earnings announcements, Journal of Finance, forthcoming. Kaniel, Ron, Gideon Saar, and Sheridan Titman, 2008 , Individual investor sentiment and stock returns, Journal of Finance 63, 273−310. Keim, Donald B., and Ananth Madhavan, 1997, Transactions costs and investment style: An inter- exchange analysis of institutional equity trades, Journal of Financial Economics 46, 265−292. Kelley, Eric K. and Paul C. Tetlock, 2013, How Wise Are Crowds? Insights from Retail Orders and Stock Returns, Journal of Finance 68, 1229-1265. Kyle, Albert S., 1985, Continuous auctions and insider trading, Econometrica 53, 1315-1335. Linnainmaa, Juhani T., 2010, Do limit orders alter inferences about investor performance and behavior? Journal of Finance 65, 1473−1506. Lakonishok, Josef, Andrei Shleifer, Richard Thaler, and Robert Vishny, 1991, Window dressing by pension fund managers, American Economic Review Papers and Proceedings 81, 227-231. Lou, Dong, 2011, A flow-based explanation for return predictability, working paper, London School of Economics. Loughran, Tim, and Bill McDonald, 2011, When is a liability not a liability? Textual analysis, dictionaries, and 10-Ks, Journal of Finance 66, 35−65. Newey, Whitney K., and Kenneth D. West, 1987, A simple, positive semi-definite, heteroskedasticity and autocorrelation consistent covariance matrix, Econometrica 55, 703−708. Odean, Terrance, 1998, Are investors reluctant to realize their losses? Journal of Finance 53, 1775−1798. Odean, Terrance, 1999, Do investors trade too much? American Economic Review 89, 1279−1298. Shleifer, Andrei, and Robert W. Vishny, 1997, The limits of arbitrage, Journal of Finance 52, 35−55. Tetlock, Paul C., 2007, Giving content to investor sentiment: The role of media in the stock market, Journal of Finance 62, 1139−1168. Tetlock, Paul C., Maytal Saar-Tsechansky, and Sofus Macskassy, 2008, More than words: Using language to quantify firms’ fundamentals, Journal of Finance 63, 1437−1467. Tetlock, Paul C., 2010, Does public financial news resolve asymmetric information? Review of Financial Studies 23, 3520−3557. Tetlock, Paul C., 2011, All the news that’s fit to reprint: Do investors react to stale information? Review of Financial Studies 24, 1481−1512. 24",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "References",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 38,
    "chunk_index": 49,
    "word_count": 441,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "to quantify firms’ fundamentals, Journal of Finance 63, 1437−1467. Tetlock, Paul C., 2010, Does public financial news resolve asymmetric information? Review of Financial Studies 23, 3520−3557. Tetlock, Paul C., 2011, All the news that’s fit to reprint: Do investors react to stale information? Review of Financial Studies 24, 1481−1512. 24 Table 1. Summary Statistics This table reports summary statistics of retail investor trading activity. Our sample period is from January 2010 to December 2015, and our sample firms are common stocks listed on all U.S. stock exchanges with a share price of at least $1. Across all stocks and all days, we report the pooled sample mean for number of shares traded (vol), retail buy volumes (indbvol), retail sell volumes (indsvol), number of trades (trd), retail buy trades (indbtrd), retail sell trades (indstrd), as well as their odd lot counterparts (prefix odd). Odd lot measures are available at the end of 2013. In this paper, we include odd lot-related data starting January 2014. We compute order imbalance measures (variables containing oib) as in equation (1) to (4). N Mean Std Median Q1 Q3 vol 4628957 1,229,004 6,849,849 221,234 51,768 819,615 trd 4628957 5,917 13,909 1,505 312 5,502 indbvol 4628957 42,481 280,474 5,165 1,200 20,681 indsvol 4628957 42,430 264,704 5,635 1,369 21,828 indbtrd 4628957 110 410 22 5 79 indstrd 4628957 108 355 24 6 81 oibvol 4628957 -0.038 0.464 -0.027 -0.301 0.217 oibtrd 4628957 -0.032 0.437 -0.010 -0.276 0.205 oddvol 1446749 6,561 20,141 1,811 629 5,250 oddtrd 1446749 222 669 64 21 186 oddindbvol 1446749 1,108 5,054 211 58 690 oddindsvol 1446749 968 3,488 210 62 663 oddindbtrd 1446749 37 171 7 2 23 oddindstrd 1446749 33 114 7 2 23 oddoibvol 1446749 -0.004 0.559 0.014 -0.338 0.331 oddoibtrd 1446749 -0.017 0.506 0.000 -0.290 0.250 26",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "References",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 38,
    "chunk_index": 50,
    "word_count": 296,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "oddtrd 1446749 222 669 64 21 186 oddindbvol 1446749 1,108 5,054 211 58 690 oddindsvol 1446749 968 3,488 210 62 663 oddindbtrd 1446749 37 171 7 2 23 oddindstrd 1446749 33 114 7 2 23 oddoibvol 1446749 -0.004 0.559 0.014 -0.338 0.331 oddoibtrd 1446749 -0.017 0.506 0.000 -0.290 0.250 26",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "References",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 38,
    "chunk_index": 51,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "Table 2. Determinants of Retail Investor Order Imbalances This table reports determinants of retail investor trading activity. Our sample period is from January 2010 to December 2015, and our sample firms are all common stocks listed on U.S. stock exchanges with a share price of at least $1. We estimate Fama-MacBeth regressions, specified in equation (5). The dependent variables are two order imbalance measures: oibvol (number of shares traded) and oibtrd (number of trades). As independent variables, we include previous week return, ret(w-1), previous month return, ret(m-1), and previous 6-month return, ret(m-7, m-2). For the weekly returns, we compute it in two ways, using end of day bid-ask average price or using CRSP closing price. The control variables are monthly turnover (lmto), monthly volatility of daily returns (lvol), log market cap (size) and log book to market ratio (lbm), all measured at the end of previous month. To account for serial correlation in the coefficients, the standard deviations of the time-series are adjusted using Newey-West (1987) with 5 lags. reg I II III IV Dep.var oibvol oibvol oibtrd oibtrd return Bid-ask return CRSP return Bid-ask return CRSP return Coef. t-stat Coef. t-stat Coef. t-stat Coef. t-stat Intercept -0.4013 -21.19 -0.4065 -21.35 -0.4326 -23.19 -0.4357 -23.19 Own lag 0.2200 99.34 0.2201 99.38 0.2865 158.97 0.2866 159.04 Ret (w-1) -0.9481 -42.39 -0.9620 -43.24 -0.9003 -37.66 -0.9156 -38.50 Ret (m-1) -0.2778 -20.39 -0.2784 -20.45 -0.2258 -15.75 -0.2262 -15.78 Ret (m-7, m-2) -0.0586 -12.10 -0.0584 -12.07 -0.0380 -6.85 -0.0378 -6.83 lmto 0.0003 5.59 0.0003 5.46 0.0002 4.12 0.0002 4.02 lvol 0.8100 8.75 0.8478 9.20 0.4366 4.44 0.4633 4.72 size 0.0154 12.76 0.0157 13.03 0.0209 17.30 0.0211 17.41 lbm -0.0275 -18.52 -0.0274 -18.46 -0.0274 -18.84 -0.0273 -18.80 27",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "References",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 38,
    "chunk_index": 52,
    "word_count": 283,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "-0.2262 -15.78 Ret (m-7, m-2) -0.0586 -12.10 -0.0584 -12.07 -0.0380 -6.85 -0.0378 -6.83 lmto 0.0003 5.59 0.0003 5.46 0.0002 4.12 0.0002 4.02 lvol 0.8100 8.75 0.8478 9.20 0.4366 4.44 0.4633 4.72 size 0.0154 12.76 0.0157 13.03 0.0209 17.30 0.0211 17.41 lbm -0.0275 -18.52 -0.0274 -18.46 -0.0274 -18.84 -0.0273 -18.80 27",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "References",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 38,
    "chunk_index": 53,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "Table 3. Predicting Next Week Returns Using Retail Order Imbalances This table reports estimation results on whether retail investor trading activity can predict one week ahead returns. Our sample period is from January 2010 to December 2015, and our sample firms are all common stocks listed on U.S. stock exchanges with a share price of at least $1. We estimate Fama-MacBeth regressions, specified in equation (6). The dependent variable is weekly returns, computed in two ways, using end of day bid-ask average price or using CRSP closing price. The independent variables are two order imbalance measures: oibvol (number of shares traded) and oibtrd (number of trades). As independent variables, we include previous week return, ret(w-1), previous month return, ret(m-1), and previous 6-month return, ret(m-7, m-2). The control variables are log book to market ratio (lbm), log market cap (size), monthly turnover (lmto), and monthly volatility of daily returns (lvol), all measured at the end of previous month. To account for serial correlation in the coefficients, the standard deviations of the time-series are adjusted using Newey- West (1987) with 5 lags. reg I II III IV Order imbalance oibvol Oibvol oibtrd oibtrd Dep. var Bidask return CRSP return Bidask return CRSP return Coef. t-stat Coef. t-stat Coef. t-stat Coef. t-stat Intercept 0.0050 2.58 0.0056 2.85 0.0050 2.58 0.0056 2.85 oib 0.0009 15.60 0.0010 16.29 0.0008 12.30 0.0008 13.20 Ret (w-1) -0.0185 -5.83 -0.0220 -6.85 -0.0186 -5.88 -0.0222 -6.91 Ret (m-1) 0.0006 0.35 0.0006 0.34 0.0005 0.29 0.0005 0.29 Ret (m-7, m-2) 0.0008 1.16 0.0008 1.16 0.0008 1.12 0.0008 1.12 lmto 0.0000 -3.37 0.0000 -3.76 0.0000 -3.36 0.0000 -3.75 lvol -0.0223 -1.41 -0.0205 -1.31 -0.0217 -1.37 -0.0198 -1.27 size -0.0001 -0.86 -0.0001 -0.92 -0.0001 -0.90 -0.0001 -0.96 lbm -0.0001 -0.39 0.0000 -0.07 -0.0001 -0.42 0.0000 -0.10 Interquartile 1.1888 1.1888 1.2292 1.2292 Return diff 0.1089% 0.1144% 0.0931% 0.0997% 28",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "References",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 38,
    "chunk_index": 54,
    "word_count": 306,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "0.0008 1.12 lmto 0.0000 -3.37 0.0000 -3.76 0.0000 -3.36 0.0000 -3.75 lvol -0.0223 -1.41 -0.0205 -1.31 -0.0217 -1.37 -0.0198 -1.27 size -0.0001 -0.86 -0.0001 -0.92 -0.0001 -0.90 -0.0001 -0.96 lbm -0.0001 -0.39 0.0000 -0.07 -0.0001 -0.42 0.0000 -0.10 Interquartile 1.1888 1.1888 1.2292 1.2292 Return diff 0.1089% 0.1144% 0.0931% 0.0997% 28",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "References",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 38,
    "chunk_index": 55,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "Table 4. Retail Return Predictability within Subgroups This table reports whether retail investor trading activity can predict the cross-section of returns for a subset of stocks. Our sample period is from January 2010 to December 2015, and our sample firms are all common stocks listed on U.S. stock exchanges with a share price of at least $1. We first sort all firms into 3 groups based on previous month-end characteristics. Then we estimate Fama-MacBeth regressions, specified in equation (6), for each subgroup. The dependent variable is weekly returns, computed using end-of-day bid-ask average price. The independent variables are two order imbalance measures: oibvol (number of shares traded) and oibtrd (number of trades). To account for serial correlation in the coefficients, the standard deviations of the time-series are adjusted using Newey-West (1987) with 5 lags. For each regression, we also provide the interquartile range for the relevant explanatory order imbalance along with the difference in predicted week-ahead returns for observations at the two ends of the interquartile range. Control variables are the same as in Table 3; those coefficients are not reported. Panel A. Size groups Oib measure oibvol oibtrd Size groups coef. t-stat interquartile weekly return diff coef. t-stat interquartile weekly return diff small 0.0013 13.90 1.662 0.219% 0.0012 11.58 1.736 0.207% medium 0.0007 9.18 1.323 0.087% 0.0004 5.63 1.346 0.059% big 0.0003 3.68 0.892 0.026% 0.0002 2.52 0.929 0.019% Panel B. Share price groups Oib measure oibvol oibtrd price groups coef. t-stat interquartile weekly return diff coef. t-stat interquartile weekly return diff low 0.0014 13.34 1.432 0.205% 0.0012 10.34 1.586 0.185% medium 0.0007 10.00 1.289 0.089% 0.0005 7.56 1.309 0.070% high 0.0002 3.23 0.961 0.020% 0.0002 2.19 0.961 0.015% Panel C. Turnover groups Oib measure oibvol oibtrd turnover groups coef. t-stat interquartile weekly return diff coef. t-stat interquartile weekly return diff low 0.0011 15.60 1.837 0.205% 0.0011 14.71 1.777 0.195% medium 0.0008 10.21 1.219 0.094% 0.0006 7.05 1.228 0.071% high 0.0007 4.98 0.910 0.065% 0.0004 2.55 1.005 0.037% 29",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "References",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 38,
    "chunk_index": 56,
    "word_count": 330,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "Panel C. Turnover groups Oib measure oibvol oibtrd turnover groups coef. t-stat interquartile weekly return diff coef. t-stat interquartile weekly return diff low 0.0011 15.60 1.837 0.205% 0.0011 14.71 1.777 0.195% medium 0.0008 10.21 1.219 0.094% 0.0006 7.05 1.228 0.071% high 0.0007 4.98 0.910 0.065% 0.0004 2.55 1.005 0.037% 29",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "References",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 38,
    "chunk_index": 57,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "Table 5. Predicting Returns N-weeks Ahead This table reports estimation results on whether retail investor trading activity can predict individual stock returns in future weeks. Our sample period is from January 2010 to December 2015, and our sample firms are all common stocks listed on U.S. stock exchanges with a share price of at least $1. We estimate Fama-MacBeth regressions, specified in equation (6). The dependent variable is n-week ahead weekly returns, computed in two ways, using end of day bid-ask average price (Panel A) or using CRSP closing price (Panel B). The independent variables are two retail order imbalance measures, oibvol (number of shares traded), and oibtrd (number of trades), respectively. To account for serial correlation in the coefficients, the standard deviations of the time-series are adjusted using Newey- West (1987) with 5 lags. Control variables are the same as in Table 3; those coefficients are not reported. Panel A. predict bid-ask average return n weeks ahead oibvol oibtrd # of week coef. t-stat coef. t-stat 1 week 0.00092 15.60 0.00076 12.30 2 weeks 0.00055 9.35 0.00048 7.89 4 weeks 0.00031 5.56 0.00026 4.66 6 weeks 0.00022 3.90 0.00015 2.60 8 weeks 0.00021 3.47 0.00011 1.75 10 weeks 0.00010 1.82 0.00002 0.35 12 weeks 0.00007 1.29 0.00009 1.52 Panel B. predict CRSP return n weeks ahead oibvol oibtrd # of week coef. t-stat coef. t-stat 1 week 0.00096 16.29 0.00081 13.20 2 weeks 0.00058 9.99 0.00052 8.57 4 weeks 0.00032 5.92 0.00028 5.05 6 weeks 0.00024 4.18 0.00017 2.93 8 weeks 0.00021 3.50 0.00011 1.80 10 weeks 0.00011 2.04 0.00005 0.81 12 weeks 0.00008 1.39 0.00010 1.76 30",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "References",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 38,
    "chunk_index": 58,
    "word_count": 269,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "# of week coef. t-stat coef. t-stat 1 week 0.00096 16.29 0.00081 13.20 2 weeks 0.00058 9.99 0.00052 8.57 4 weeks 0.00032 5.92 0.00028 5.05 6 weeks 0.00024 4.18 0.00017 2.93 8 weeks 0.00021 3.50 0.00011 1.80 10 weeks 0.00011 2.04 0.00005 0.81 12 weeks 0.00008 1.39 0.00010 1.76 30",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "References",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 38,
    "chunk_index": 59,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "Table 6. Long-short strategy returns based on retail order imbalances This table reports portfolio returns using a long-short strategy where we buy the stocks in the highest quintile of scaled order imbalance, and we short the stocks in the lowest order imbalance quintile. The order imbalance is computed from the previous week. Our sample period is from January 2010 to December 2015, and our sample firms are all common stocks listed on U.S. stock exchanges with a share price of at least $1. Portfolio returns are value-weighted, and market cap terciles are based on the previous month-end market cap. Because the holding period can be as long as 12 weeks, we report both the raw returns and risk-adjusted returns using the Fama-French three-factor model. Given the data we use is overlapping, we adjust the standard deviations of the portfolio return time-series using Newey-West (1987) with corresponding lags. Panel A. Form portfolios on previous week retail order imbalance based on number of shares traded Holding whole sample small medium big period mean t-stat alpha t-stat alpha t-stat alpha t-stat alpha t-stat 1 week 0.104% 3.28 0.101% 3.09 0.472% 11.84 0.179% 7.73 0.071% 2.16 2 weeks 0.160% 2.93 0.151% 2.90 0.734% 10.70 0.304% 7.60 0.105% 2.00 4 weeks 0.262% 2.54 0.254% 2.80 1.163% 11.04 0.456% 6.65 0.174% 1.88 6 weeks 0.262% 2.35 0.232% 2.37 1.182% 11.59 0.462% 6.25 0.150% 1.53 8 weeks 0.508% 2.61 0.517% 2.97 1.779% 12.69 0.574% 4.63 0.393% 2.51 10 weeks 0.569% 2.45 0.520% 2.21 1.964% 10.77 0.545% 3.94 0.443% 2.14 12 weeks 0.617% 2.35 0.629% 2.14 2.266% 9.57 0.459% 2.53 0.515% 1.90 Panel B. Form portfolios on previous week retail order imbalance based on number of trades Holding whole sample small medium big period mean t-stat alpha t-stat alpha t-stat alpha t-stat alpha t-stat 1 week 0.074% 2.14 0.081% 2.27 0.379% 8.73 0.103% 4.24 0.064% 1.90 2 weeks 0.145% 2.20 0.156% 2.48 0.602% 8.01 0.165% 4.11 0.133% 2.20 4 weeks 0.236% 1.95 0.256% 2.29 0.993% 8.60 0.264% 3.93 0.228% 1.96 6 weeks 0.236% 1.82 0.191% 1.48 1.015% 8.13 0.275% 4.12 0.153% 1.15 8 weeks 0.453% 2.05 0.543% 2.82 1.615% 6.62 0.308% 2.33 0.461% 2.57 10 weeks 0.456% 1.68 0.515% 1.93 1.733% 6.04 0.248% 1.59 0.472% 1.88 12 weeks 0.490% 1.56 0.635% 1.83 2.149% 6.27 0.182% 0.93 0.563% 1.70 31",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "References",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 38,
    "chunk_index": 60,
    "word_count": 381,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "1.96 6 weeks 0.236% 1.82 0.191% 1.48 1.015% 8.13 0.275% 4.12 0.153% 1.15 8 weeks 0.453% 2.05 0.543% 2.82 1.615% 6.62 0.308% 2.33 0.461% 2.57 10 weeks 0.456% 1.68 0.515% 1.93 1.733% 6.04 0.248% 1.59 0.472% 1.88 12 weeks 0.490% 1.56 0.635% 1.83 2.149% 6.27 0.182% 0.93 0.563% 1.70 31",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "References",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 38,
    "chunk_index": 61,
    "word_count": 50,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "Table 7. Predicting aggregate market returns and additional analysis Our sample period is from January 2010 to December 2015, and our sample firms are all common stocks listed on U.S. stock exchanges with a share price of at least $1. Standard errors are calculated using Newey-West (1987). In Panel A, we estimate equation (8). The dependent variable is the n-week ahead weekly value-weighted market return. The independent variables are two retail order imbalance measures, oibvol (number of shares traded), and oibtrd (number of trade), respectively. For all other panels, the regression is specified in equation (6), and estimated using Fama-MacBeth regressions. In Panel B, the dependent variable is weekly returns on approximately 1000 ETFs. In Panel C, we estimate the coefficients for different VIX regimes. In Panel D, we estimate the coefficients for different bins of price improvements. In Panel E, the independent variables are two odd lot retail order imbalance measures, oddoibvol (number of odd lot shares traded), and oddoibtrd (number of odd lot trades), respectively. The dependent variable is weekly returns, computed in two ways, using end-of-day bid-ask average price or using CRSP closing price. The independent variables are two retail order imbalance measures, oibvol (number of shares traded), and oibtrd (number of trades), respectively. Control variables for the cross-sectional regressions are the same as in Table 3, except that we do not include a book-to-market variable in the ETF regression; those coefficients are not reported. Panel A. predicting future n-week market return oibvol oibvol oibtrd oibtrd Weights vw ew vw ew Horizon coef. t-stat coef. t-stat coef. t-stat coef. t-stat 1 week 0.0037 0.50 -0.0053 -0.57 0.0054 0.92 -0.0038 -0.46 2 weeks 0.0101 0.79 -0.0030 -0.20 0.0120 1.21 0.0007 0.06 4 weeks 0.0044 0.20 -0.0236 -1.04 0.0073 0.43 -0.0136 -0.63 6 weeks -0.0061 -0.22 -0.0356 -1.25 0.0022 0.10 -0.0216 -0.80 8 weeks 0.0075 0.20 -0.0046 -0.10 0.0118 0.41 0.0044 0.11 10 weeks 0.0051 0.11 -0.0114 -0.23 0.0101 0.28 -0.0038 -0.08 12 weeks -0.0059 -0.10 -0.0315 -0.58 0.0000 0.00 -0.0227 -0.46 32",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "References",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 38,
    "chunk_index": 62,
    "word_count": 334,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "weeks 0.0044 0.20 -0.0236 -1.04 0.0073 0.43 -0.0136 -0.63 6 weeks -0.0061 -0.22 -0.0356 -1.25 0.0022 0.10 -0.0216 -0.80 8 weeks 0.0075 0.20 -0.0046 -0.10 0.0118 0.41 0.0044 0.11 10 weeks 0.0051 0.11 -0.0114 -0.23 0.0101 0.28 -0.0038 -0.08 12 weeks -0.0059 -0.10 -0.0315 -0.58 0.0000 0.00 -0.0227 -0.46 32 Panel B. Using retail oib to predict ETF returns reg I II III IV Order imbalance oibvol oibvol oibtrd oibtrd Dep. var Bidask return CRSP return Bidask return CRSP return Coef. t-stat Coef. t-stat Coef. t-stat Coef. t-stat All ETFs 0.0001 2.04 0.0000 1.23 0.0001 1.68 0.0001 1.12 Interquartile 1.4726 1.4726 1.4737 1.4737 Return diff 0.0153% 0.0071% 0.0118% 0.0075% Broad market ETFs -0.0004 -0.81 -0.0003 -0.61 0.0005 1.52 0.0006 1.64 Panel C. Different market conditions vix<=18% vix<=18% vix>18% vix>18% Dep. var bidaskret crspret bidaskret crspret Indep. var coef. t-stat coef. t-stat coef. t-stat coef. t-stat oibvol 0.0009 13.49 0.0009 14.02 0.0010 9.36 0.0010 9.78 oibtrd 0.0007 10.32 0.0008 11.03 0.0008 7.60 0.0009 8.17 Panel D. Different price improvement sizes reg I II III IV Order imbalance oibvol oibvol oibtrd oibtrd Dep. var Bidask return CRSP return Bidask return CRSP return Coef. t-stat Coef. t-stat Coef. t-stat Coef. t-stat less price improvement 0.00071 9.30 0.00081 10.43 0.00042 5.57 0.00053 6.84 more price improvement 0.00021 3.04 0.00025 3.67 0.00018 2.43 0.00023 3.14 33 Panel E. Predicting next week stock return with odd-lot order imbalances reg I II III IV Dep.var oibvol oibvol oibtrd oibtrd return Bid-ask return CRSP return Bid-ask return CRSP return Coef. t-stat Coef. t-stat Coef. t-stat Coef. t-stat Odd lot 0.0001 1.41 0.0002 1.99 0.0001 0.77 0.0001 1.36 Interquartile 1.2734 1.2734 1.1314 1.1314 Return diff 0.0154% 0.0216% 0.0086% 0.0153% 34",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "References",
    "page_number": 34,
    "page_range": "p.34-35",
    "total_pages": 38,
    "chunk_index": 63,
    "word_count": 281,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.34-35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "imbalances reg I II III IV Dep.var oibvol oibvol oibtrd oibtrd return Bid-ask return CRSP return Bid-ask return CRSP return Coef. t-stat Coef. t-stat Coef. t-stat Coef. t-stat Odd lot 0.0001 1.41 0.0002 1.99 0.0001 0.77 0.0001 1.36 Interquartile 1.2734 1.2734 1.1314 1.1314 Return diff 0.0154% 0.0216% 0.0086% 0.0153% 34 Figure 1. Time series of retail investor order imbalances These figures report time series statistics of retail investor trading activities. Our sample period is from January 2010 to December 2015, and our sample firms are all common stocks listed on U.S. stock exchanges with a share price of at least $1. We present cross- sectional mean, median, q1 (25 percentile) and q3 (75 percentile) each day. 0.5 0.5 0.4 0.4 0.3 0.3 0.2 0.2 0.1 0.1 0 0 ‐0.1 ‐0.1 ‐0.2 ‐0.2 ‐0.3 ‐0.3 ‐0.4 ‐0.4 ‐0.5 ‐0.5 ‐0.6 20100105 20101231 20111228 20121227 20131224 20141222 20151218 20100105 20101231 20111228 20121227 20131224 20141222 20151218 mean oibtrd median oibtrd q1 oibtrd q3 oibtrd mean oibvol median oibvol q1 oibvol q3 oibvol 0.5 0.6 0.4 0.4 0.3 0.2 0.2 0.1 0 0 ‐0.2 ‐0.1 ‐0.2 ‐0.4 ‐0.3 ‐0.6 ‐0.4 ‐0.5 ‐0.8 20100105 20101231 20111228 20121227 20131224 20141222 20151218 20100105 20101231 20111228 20121227 20131224 20141222 20151218 mean oddoibtrd median oddoibtrd mean oddoibvol median oddoibvol q1 oddoibtrd q3 oddoibtrd q1 oddoibvol q3 oddoibvol 35",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "References",
    "page_number": 36,
    "page_range": "p.36-37",
    "total_pages": 38,
    "chunk_index": 64,
    "word_count": 219,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.36-37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "0.5 0.6 0.4 0.4 0.3 0.2 0.2 0.1 0 0 ‐0.2 ‐0.1 ‐0.2 ‐0.4 ‐0.3 ‐0.6 ‐0.4 ‐0.5 ‐0.8 20100105 20101231 20111228 20121227 20131224 20141222 20151218 20100105 20101231 20111228 20121227 20131224 20141222 20151218 mean oddoibtrd median oddoibtrd mean oddoibvol median oddoibvol q1 oddoibtrd q3 oddoibtrd q1 oddoibvol q3 oddoibvol 35 Figure 2. Predicting weekly returns n-weeks ahead, Fama-MacBeth regression coefficients These figures plot the Fama-MacBeth coefficients on retail order imbalance measures in regression (6). Our sample period is from January 2010 to December 2015, and our sample firms are all common stocks listed on U.S. stock exchanges with a share price of at least $1. The dependent variable is weekly returns n weeks ahead, computed in two ways, using end of day bid-ask average price (bidaskret) or using CRSP closing price (crspret). The main independent variables are two retail order imbalance measures, oibvol (number of shares traded) and oibtrd (number of trades), respectively. Panel A. Using retail order imbalance from number of shares traded (oibvol) 0.0012 0.0010 0.0008 0.0006 0.0004 0.0002 0.0000 1 wk 2 wk 4 wk 6 wk 8 wk 10 wk 12 wk oibvol bidaskret oibvol crspret Panel B. Using retail order imbalance from number of trades (oibtrd) 0.0009 0.0008 0.0007 0.0006 0.0005 0.0004 0.0003 0.0002 0.0001 0.0000 1 wk 2 wk 4 wk 6 wk 8 wk 10 wk 12 wk oibtrd bidaskret oibtrd crspret 36",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "References",
    "page_number": 37,
    "page_range": "p.37-38",
    "total_pages": 38,
    "chunk_index": 65,
    "word_count": 230,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.37-38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  },
  {
    "text": "8 wk 10 wk 12 wk oibvol bidaskret oibvol crspret Panel B. Using retail order imbalance from number of trades (oibtrd) 0.0009 0.0008 0.0007 0.0006 0.0005 0.0004 0.0003 0.0002 0.0001 0.0000 1 wk 2 wk 4 wk 6 wk 8 wk 10 wk 12 wk oibtrd bidaskret oibtrd crspret 36 Figure 3. Distribution of Subpenny Bins These figures plot average share volume and average number of trades when the price improvement is within each of the 12 subpenny bins. Our sample period is from January 2010 to December 2015, and our sample firms are all common stocks listed on U.S. stock exchanges with a share price of at least $1. Panel A. trading volume in each bin shsvol 200000 180000 160000 140000 120000 100000 80000 60000 40000 20000 0 Panel B. number of trades in each bin ntrades 600 500 400 300 200 100 0 37",
    "title": "TRACKING RETAIL INVESTOR ACTIVITY",
    "source_type": "pdf",
    "document_id": "192fbc5ff163",
    "source_file": "TRACKING RETAIL INVESTOR ACTIVITY.pdf",
    "section": "References",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 38,
    "chunk_index": 66,
    "word_count": 146,
    "author": "zhang654",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20161101080501+08'00'",
    "duration": null
  }
]