[
  {
    "text": "Trading Hours and Retail Investment Performance Ed deHaan † edehaan@stanford.edu Graduate School of Business Stanford University Andrew Glover glov@uw.edu Foster School of Business University of Washington August 18, 2023 Abstract We examine the effects of stock market access, and in particular trading hours, on retail investment performance. Using discontinuities around time zone borders, we find that plausibly exogenous decreases in waking trading hours are associated with meaningful increases in retail investors’ capital gains, as reported on tax returns for the U.S. population. Our results indicate that limiting trading hours mitigates retail investors’ tendencies to trade “too much,” leading to improvements in portfolio performance. Our findings inform discussions among academics, practitioners, and regulators about the potential detrimental effects of decreasing barriers to entry for retail investors in trading markets. Keywords Retail Investors; SEC Policy; Market Access; Investment Decision-Making; Investment Performance JEL classification M41; M48; G40; G51 †Corresponding Author Thanks to workshop participants at Arizona, UC San Diego, Florida International, University of Hong Kong, Washington, Houston, Boston College, Harvard, Colorado, Michigan Conference, Western AAA Doctoral Interchange, BYU Accounting Research Symposium, and the Shevlin Accounting Research Conference for helpful comments. Thanks to Austin Moss (discussant) and Fiona Sequeira for helpful comments, and to Changyong Kim for excellent research assistance. LDB data were kindly provided by Terrance Odean. EDGAR IP mappings were kindly provided by Phil Quinn. All errors are our own. Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 51,
    "chunk_index": 0,
    "word_count": 233,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "Conference for helpful comments. Thanks to Austin Moss (discussant) and Fiona Sequeira for helpful comments, and to Changyong Kim for excellent research assistance. LDB data were kindly provided by Terrance Odean. EDGAR IP mappings were kindly provided by Phil Quinn. All errors are our own. Electronic copy available at: https://ssrn.com/abstract=4486721 “It is usually agreed that casinos should, in the public interest, be inaccessible and expensive. And perhaps the same is true of Stock Exchanges.” ~ John Maynard Keynes (1936) “The world never stops, so why should investing be any different? … Robinhood’s 24 Hour Market levels the playing field so extended trading is no longer exclusively reserved for those operating on U.S. East Coast hours. You invest on your time.” ~ Robinhood Markets, Inc. (2023) I. INTRODUCTION Retail investor access to capital markets has increased dramatically in recent years. For example, trading apps, fractional shares, and commission-free trades make it easier for retail investors to trade securities, and platforms such as Robinhood are beginning to offer 24-hour trading. Accordingly, trading volume from retail investors as a percentage of all trades has more than doubled in the last decade (BNY Mellon 2021). While a common public opinion seems to be that the “democratization” of capital markets is advantageous for retail investors, academic research finds that retail investors tend to trade “too much” and to their financial detriment.1 This study investigates whether easier market access in the form of expanded trading hours improves or hurts retail investors’ investment performance. A challenge in investigating our research question is identifying variation in retail investor trading hours. We use a geographic discontinuity design to exploit plausibly exogenous variation in waking trading hours for retail investors living on either side of U.S. time zone borders. Well-established evidence demonstrates that humans’ schedules are determined by social time (i.e., the local time on one’s watch) more than a universal time (i.e., the time in a specific location, such as New York City). For example, social time typically dictates business 1 TechCrunch’s review of Robinhood’s initial launch concludes “Technology has already democratized publishing, funding, and so many more industries. Now Robinhood wants to steal stock trading from the rich and give it to the poor” (Constine 2014). Below we discuss extensive academic findings that retail investors underperform. 1 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 51,
    "chunk_index": 1,
    "word_count": 384,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "of Robinhood’s initial launch concludes “Technology has already democratized publishing, funding, and so many more industries. Now Robinhood wants to steal stock trading from the rich and give it to the poor” (Constine 2014). Below we discuss extensive academic findings that retail investors underperform. 1 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 51,
    "chunk_index": 2,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "hours, school hours, and when we rise each morning. Discrete changes in social time across time zones cause people on either side of a time zone border to exhibit discontinuous changes in behaviors, despite sharing similar demographic and environmental characteristics. Because major U.S. stock exchanges are open from 9:30AM to 4:00PM Eastern time, individuals in each time zone moving west have one hour less of the trading day that falls within their “normal waking hours,” as compared to their east-side peers (see Figure 1). Time zone borders therefore provide measurable variation in the relative ease of active morning trading for otherwise similar retail investors, and serve as our proxy for variation in trading hours.2 The effects of variation in trading hours on retail investment performance are ex ante unclear. Within our empirical context, retail investors who miss morning trading miss the hour of the day with the highest volatility, information asymmetry, and adverse selection (e.g., Gerety & Mulherin 1992; McInish & Wood 1992), and miss the opportunity to trade on the morning’s news before prices adjust.3 For example, roughly one third of earnings announcements (EAs) happen between 6:00AM and 8:30AM Eastern time, and most of the price response to EAs happens within the first few minutes of regular trading (deHaan et al. 2015; Wertz 2020). Classic rational theory indicates that trading frictions impair investment efficiency, in which case westerly retail investors likely underperform their easterly peers. However, it is also plausible that missing morning trading mitigates retail investors’ tendencies to make excessive and under- informed trades, in which case westerly investors’ average performance likely improves. For 2 Time zones were introduced in the late 19th century to improve coordination across geographic space (e.g., train schedules). Before the introduction of time zones, social time was dictated by the sun’s position. Section 2 further discusses research on the dominant role of social time in daily schedules. 3 As discussed in Section 2, volatility and adverse selection at the start of regular trading are largely due to trading on news events since the prior close. Extended hours offer additional trading opportunities, but retail trading volume in the extended sessions is currently minimal. For example, in 2019, just 1-3 percent of single stock trading volume occurred in extended hours, of which only 2 percent was attributed to retail traders (Bazinas 2021). 2 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 51,
    "chunk_index": 3,
    "word_count": 393,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "hours offer additional trading opportunities, but retail trading volume in the extended sessions is currently minimal. For example, in 2019, just 1-3 percent of single stock trading volume occurred in extended hours, of which only 2 percent was attributed to retail traders (Bazinas 2021). 2 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 51,
    "chunk_index": 4,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "example, westerly investors who miss the morning’s attention-grabbing EAs are plausibly less tempted to make ill-informed, impulsive trades (e.g., Blankespoor et al. 2018, 2019), or they trade later in the day when prices are more efficient. Or, westerly investors who recognize their limited access may choose to eschew holding stocks in favor of more passive and diversified securities. Section 2 further discusses these competing predictions. A third possibility is that westerly retail investors are willing to incur the personal costs of waking earlier to trade and so time zones have little effect, but extensive prior research and our own analyses in Section 2 indicate that this is unlikely to be true on average. For example, we find that time zones are a first-order determinant of firms’ chosen EA times (see Figure 2) and of when sophisticated investors research stocks throughout the day (as proxied by EDGAR downloads; see Figure 3), consistent with time zones affecting professional market participants’ activities. Finding that time zones affect professional investors indicates that the effects on retail investors, who have weaker trading incentives, are likely even greater. We measure retail investment performance using aggregated tax return data on realized capital gains/losses, sourced from the IRS Statistics of Income (SOI). SOI provides Form 1040 data for all U.S. taxpayers on an annual basis, aggregated by income bracket and county.4 Our sample includes 205,190 county-bracket-year observations covering the contiguous U.S. states and Washington D.C. from 2010 through 2019. The average county-bracket-year observation includes 1,129 tax returns reporting an average of $15.8 thousand in capital gains. Capital gains are skewed and include non-positive values, so we use a percentile ranking of gains (variable Gains) as our dependent variable in regression specifications. 4 The SOI data appears in academic tax research as early as White (1928) and are used in recent tax studies of individuals (e.g., Ferguson 2023) and firms (e.g., Green et al. 2022). To our knowledge, SOI data have not been used in prior financial or household accounting research to proxy for individual financial outcomes, but likely have numerous applications for future work examining geographically disparate phenomena. 3 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 51,
    "chunk_index": 5,
    "word_count": 356,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "(e.g., Ferguson 2023) and firms (e.g., Green et al. 2022). To our knowledge, SOI data have not been used in prior financial or household accounting research to proxy for individual financial outcomes, but likely have numerous applications for future work examining geographically disparate phenomena. 3 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 51,
    "chunk_index": 6,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "Initial analyses include the full U.S. sample and regress Gains on a time zone count variable and year and income bracket fixed effects. We find that a one-hour decrease in waking trading hours is associated with a 3.9 percentage point increase in investment performance. However, this design tenuously assumes that traders living across the U.S. are similar across factors that determine investment performance. Our primary analyses focus on the 208 counties (13,380 observations) that are immediately adjacent to an interior time zone border. Our identifying assumption is that other than their time zones, retail investors living just to the east and west of a border are similar in ways that determine investment performance. We support this assumption by examining a wide variety of economic, demographic, education, housing, and health data, and find that border county populations are observationally identical. Moreover, counties on either side of a border have statistically similar longitudes and latitudes, meaning they have similar solar time (i.e., time relative to the sun) and environmental conditions. We regress Gains on a west-side indicator variable and use border fixed effects to contrast investors on either side of each border, in addition to year and bracket fixed effects. Retail investors just to the west of a border have 2.9 percentage points higher capital gains per year, which is consistent with barriers to market access improving investment performance. We run two sets of falsification tests to ensure that our results are not a statistical artifact or driven by general differences between east-west adjacent counties. Our first set of falsification tests is based on contiguous pseudo-borders that mimic true time zone borders but do not include true time zone borders (see Figure 4A). Reperforming the border test for 9,999 random combinations of pseudo-borders finds that only 33 trials produce a larger coefficient than our true coefficient estimate, for a Fisher p-value of 0.003. Because our first set of pseudo-borders do 4 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 51,
    "chunk_index": 7,
    "word_count": 324,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "true time zone borders (see Figure 4A). Reperforming the border test for 9,999 random combinations of pseudo-borders finds that only 33 trials produce a larger coefficient than our true coefficient estimate, for a Fisher p-value of 0.003. Because our first set of pseudo-borders do 4 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 51,
    "chunk_index": 8,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "not precisely match the number of observations at each true border, our second set of tests create non-contiguous pseudo-borders using the precise number of east-west counties at each true border (see Figure 4B), and produce a Fisher p-value of <0.000. Thus, our border test results do not appear to be driven by latent characteristics of east-west adjacent counties that exist in the absence of a time zone change. We perform several robustness analyses. First, to reduce concerns about differences in environmental conditions driving our results, we include latitude-longitude fixed effects to contrast only counties within a small geographic quadrangle that happen to span a time zone border. Second, to reduce concerns about state-level effects such as tax policy, we examine differences only within the eleven states that span a time zone border. Third, we examine results by year and by income bracket, controlling for demographic characteristics, and dropping large cities. All results are qualitatively unchanged. Fourth, we show that our results are unlikely to be materially driven by sunset-related differences in sleep across time zone borders. Finally, while the SOI data do not allow us to directly observe the mechanism for why westerly investors have better performance, four supplementary analyses support that westerly investors do so by trading less intensively and holding more passive investments. First, we examine the extensive margin of market participation using the fraction of tax filers reporting non-zero gain/loss, and find no differences around time zone borders. These results indicate that westerly investors do not exit the market altogether. Second, we use the Boehmer et al. (2021) method to identify anonymous retail trades around EAs and leverage the “home bias” literature to use firms’ locations as a proxy for retail investors’ locations (e.g., Chi & Shanthikumar 2017). We find that easterly retail investors trade in response to both before- and after-hours EAs while westerly retail investors trade significantly less around before-hours EAs (i.e., which occur when 5 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 51,
    "chunk_index": 9,
    "word_count": 326,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "use firms’ locations as a proxy for retail investors’ locations (e.g., Chi & Shanthikumar 2017). We find that easterly retail investors trade in response to both before- and after-hours EAs while westerly retail investors trade significantly less around before-hours EAs (i.e., which occur when 5 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 51,
    "chunk_index": 10,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "many westerly investors are asleep), again consistent with time zones curbing retail trading. Third, we use the Barber & Odean (2000) retail trading dataset to provide further evidence that households in more westerly time zones indeed execute fewer trades.5 Fourth, we use the Barber & Odean data to document that households in more westerly time zones hold more passive investment portfolios (e.g., fewer stocks and more mutual funds). In sum, our experimental design identifies groups of observationally homogenous retail investors who have differences in the relative ease of trading, and we find that the groups with easier access have meaningfully worse investment performance. Our results and corroborating mechanism tests are consistent with increased trading hours exacerbating retail investors’ tendencies to make excessive, under-informed stock trades, and impairing their investment performance.6 The generalizability of our empirical findings warrants discussion. Our setting limits access in the first hour(s) of regular trading, when volume, volatility, spreads, and adverse selection are especially high. Adverse selection, spreads, and news-driven volatility are often even higher outside of regular hours (Barclay & Hendershott 2004; Boudoukh et al. 2019), so it is plausible that expanding retail investors’ out-of-hours trading access would have marginally worse effects than what our estimates imply.7 Symmetrically, reducing retail investors’ ability to trade in the middle of the day would likely have a marginally smaller effect because prices are more efficient, although we have little reason to think that the directional effect would reverse. 5 A drawback of the Barber & Odean dataset is that it does not overlap with our primarily sample period. 6 As always, it is impossible to eliminate all identification threats in our observational data, and we encourage future studies to reexamine this important research question using alternative designs. 7 Consistent with this notion, retail brokerages warn about the enhanced risks of out-of-hours trading. For example, Robinhood’s extended hours disclosure reads, “There are additional, unique risks with trading outside of regular market hours you should be aware of before making an investment decision, including the risk of lower liquidity, increased volatility, greater spreads, and pricing uncertainty.” 6 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 51,
    "chunk_index": 11,
    "word_count": 352,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "out-of-hours trading. For example, Robinhood’s extended hours disclosure reads, “There are additional, unique risks with trading outside of regular market hours you should be aware of before making an investment decision, including the risk of lower liquidity, increased volatility, greater spreads, and pricing uncertainty.” 6 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 51,
    "chunk_index": 12,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "Our study has important implications for regulators, brokers, and exchanges that are considering expanding retail trading hours.8 For example, the SEC recently considered a proposal for 24-hour exchanges (SEC 2022; Osipovich 2021), and Robinhood recently announced 24-hour trading in select ETFs and stocks (Osipovich & Miao 2023). Our findings indicate that expanding out-of-hours retail access will likely have a material negative effect on the average retail investor’s performance, which raises serious questions about the welfare implications of such policies. Our findings also raise concerns about retail investors’ current abilities to trade 24-hours a day in assets such as cryptocurrencies and NFTs. Our study’s primary academic contribution is to the accounting literature on retail investment. As reviewed by Blankespoor et al. (2020), many studies since Cready (1988) and Lee (1992) find that retail investors under-perform by trading in ways that are systematically less-timely and less-informed than professional investors. Another line of studies investigates the effects of regulations on retail investor welfare, including regulations relating to market participation and design (e.g., Christensen et al., 2019; Gerakos et al. 2013; Zingales 2009).9 Our study lies at the intersection of these literatures. Rather than examining the specific disclosures or biases that drive ill-informed retail trades, we model the collective effects of ill-informed retail trading on portfolio performance to investigate the types of regulations that are likely to enhance investors’ financial wellbeing. In doing so, we respond to Blankespoor et al.’s (2020, p21) call for accounting research on whether and how regulators can deter active retail trading in favor of longer-term, passive investment strategies. We also provide new evidence to inform the literatures on the temporal and geographic determinants of retail information acquisition and 8 Providing evidence on the likely effects of potential regulatory changes is inherently challenging. Because material out-of-hours retail trading does not yet exist, we examine an alternative empirical setting that captures the key forces of the proposed regulation. Complementary approaches would be analytical modeling or lab experiments. 9 A related literature examines the effects of tax regulations on retail investment (e.g., Seida & Wempe 2000). 7 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 51,
    "chunk_index": 13,
    "word_count": 350,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "yet exist, we examine an alternative empirical setting that captures the key forces of the proposed regulation. Complementary approaches would be analytical modeling or lab experiments. 9 A related literature examines the effects of tax regulations on retail investment (e.g., Seida & Wempe 2000). 7 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 51,
    "chunk_index": 14,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "trading around disclosures (e.g., Chi & Shantikumar 2017; Drake et al. 2017). Research on retail investors intersects accounting, finance, and economics, so another contribution of our study is to leverage accountants’ institutional knowledge (e.g., regarding the timing of EAs and information processing) and data (e.g., IRS data to measure performance) to speak to issues that span disciplines (Leuz 2018). To our knowledge, ours is the first study in or outside of accounting to examine the effects of trading hours on retail investors.10 II. THEORY AND BACKGROUND LITERATURE There are two steps in our hypothesized causal chain: 1) that time zones affect retail trading hours, and 2) that retail trading hours affect investment performance. We discuss each in the following subsections. 2.1. Time Zones and Retail Trading Chronobiology research shows that social time largely dictates individuals’ daily activities, even when social time conflicts with their natural schedule preferences (Roenneberg et. al 2003; Witmann et al. 2006; Roenneberg et al. 2019; Korman et al. 2020; Aschoff et al. 1971; Hamermesh et al. 2008). In other words, the average east- and west-coaster wake up, eat breakfast, and go to work at roughly the same local time. Trading hours at traditional U.S. exchanges follow Eastern time, with regular hours from 9:30AM to 4:00PM. These are productive waking hours for retail investors on the East coast but fall increasingly outside of productive waking hours for investors in more westerly time zones. Individuals in the Pacific time zone can actively trade from 6:30AM to 1:00PM local time. While professional traders in the Pacific time zone are likely willing to incur the physiological and 10 Other working papers on retail market access include Even-Tov et al. (2023), who find that decreasing fees on a retail platform increases trading and improves net-of-fees performance, and Eliner (2022) who examines retail investor attention during COVID. See Barber & Odean (2013) and Gomes et al. (2021) for reviews of the retail investor literatures in finance and economics. 8 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 51,
    "chunk_index": 15,
    "word_count": 332,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "that decreasing fees on a retail platform increases trading and improves net-of-fees performance, and Eliner (2022) who examines retail investor attention during COVID. See Barber & Odean (2013) and Gomes et al. (2021) for reviews of the retail investor literatures in finance and economics. 8 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 51,
    "chunk_index": 16,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "personal costs of adjusting their schedules to Eastern hours, typical retail investors likely are not. Instead, Pacific retail investors likely limit their trading to normal productive waking hours, perhaps between 9:30AM to 1:00PM Pacific. The same general pattern, although to a lesser magnitude, applies to retail investors living in the Central and Mountain time zones. Several international studies find that having less overlap between trading hours and waking hours impedes market access. Portes & Rey (2005) find that an increase in overlapping trading hours between two nations’ stock exchanges leads to greater cross-border trading volume and equity flows. Stein & Daude (2007) estimate that each hour of time difference reduces bilateral foreign trade by between 7 and 11 percent, and Beracha et al. (2014) find that longitudinal distance between traders and nations is negatively related to trading frequency. Related evidence in the U.S. comes from Kleppe et al. (2023), which finds that social time disruptions caused by daylight savings time adjustments impair investors’ processing of EA information news, and that the effects are larger among less sophisticated investors. To further investigate whether social time dictates the behaviors of U.S. market participants, Figure 2 plots the EA times of firms located in each time zone. Nearly all firms announce earnings shortly before or after standard trading hours (deHaan et al. 2015), and we expect that westerly firms likely choose after-hours EAs to cater to the social time preferences of their managers, institutional investors, and analysts.11 Figure 2 shows that ~50 percent of Eastern firms have after-hours EAs and that this percentage increases to ~80 percent for Pacific firms. Geography-based sorting is even starker among only S&P 500 firms that likely have more discretion over their EA timing. These data indicate that market professionals prefer to avoid 11 Extensive evidence finds that managers cater to the disclosure preferences of institutions and analysts (e.g., Bushee & Noe 2000; Beyer et al. 2010; Ayers et al. 2011), and that institutional investors and analysts concentrate in nearby firms (e.g., Coval & Moskowitz 1999; O’Brien & Tan 2015; Dyer 2021). See Figure 2 for sample details. 9 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 51,
    "chunk_index": 17,
    "word_count": 356,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "of institutions and analysts (e.g., Bushee & Noe 2000; Beyer et al. 2010; Ayers et al. 2011), and that institutional investors and analysts concentrate in nearby firms (e.g., Coval & Moskowitz 1999; O’Brien & Tan 2015; Dyer 2021). See Figure 2 for sample details. 9 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 51,
    "chunk_index": 18,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "early morning hours, which increases the plausibility of social time affecting retail investors.12 Figure 3 uses SEC EDGAR downloads to characterize the intraday timing of market participants’ information acquisition activities. EDGAR downloads are most likely from market professionals such as institutional investors and analysts (Blankespoor et al. 2020). If more westerly market participants prefer to operate on social time, then their information acquisition activities should occur later in the trading day.13 Figure 3A presents density plots of downloads in Eastern time and reveals similar shapes but clear rightward shifts for downloaders in more westerly time zones. Figure 3B presents cumulative distributions and shows that downloads begin increasing around 8:30AM in the East but later for each westerly time zone. Untabulated regressions find that the cumulative distributions hit 25, 50 and 75 percent roughly 38 minutes later for each time zone moving west. The distributional shifts in Figure 3 indicate that many westerly market professionals work according to their local social time. Again, if professionals operate on social time, then it seems all the more likely that retail investors do as well. In sum, we expect that differences in time zones affect investors’ behaviors and are a meaningful friction to retail investor trading. Retail investors in westerly time zones face greater frictions and thus likely miss some part of morning trading. 2.2. Retail Trading Hours and Investment Performance The first minutes and hours of regular trading have the highest volume, volatility, and bid-ask spreads of the day (e.g., Gerety & Mulherin 1992; McInish & Wood 1992). For example, Strumpf & Driebusch (2015) report that 13 percent of daily trading volume occurs in the first 30 12 Historical anecdotes also indicate that social time preferences affect market professionals. For example, the former Pacific Stock Exchange opposed a 1990 proposal by NYSE to begin trading at 9AM Eastern time because “it would wreak havoc with brokers’ sleep and commuting habits in the West. As it is, many West Coast brokers rise by 3:30 a.m. to get to 4:30 meetings to prepare for the day” (Groves 1991). 13 Download IP location mappings are from Drake et al. (2017) and available only for 2011. 10 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 51,
    "chunk_index": 19,
    "word_count": 365,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "commuting habits in the West. As it is, many West Coast brokers rise by 3:30 a.m. to get to 4:30 meetings to prepare for the day” (Groves 1991). 13 Download IP location mappings are from Drake et al. (2017) and available only for 2011. 10 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 51,
    "chunk_index": 20,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "minutes of market open and that spreads decline from an average of 84 basis points at 9:30AM to 8 points by 9:45AM. Recent studies (e.g., Yueshen et al. 2022; Bogousslavsky 2021) also find that high spreads at market open are driven by adverse selection from trading on news since the prior day. Our data find that 36 percent of EAs occur between 6AM and 8:30AM Eastern. Classic rational theory indicates that any barriers to trading should impair an investor’s trading performance. In our setting, many westerly retail investors are likely asleep while Eastern investors are trading on morning EAs and other news, so westerly investors miss most of the associated price adjustments.14 Moreover, once those westerly investors are awake to trade on the morning’s news, they plausibly have less time for analysis and make lower-quality decisions (Svenson & Maule 1993; Kocher et al. 2013). Some behavioral theory predicts the same; for example, Kamstra et al. (2000) and Kleppe et al. (2023) find that sleep desynchronization due to daylight savings time adjustments negatively affect trading performance. Biological frictions on cognitive performance shortly after waking (“sleep inertia”) plausibly also impair westerly investors who rise early to trade during east coast hours (e.g., Jewett et al. 1999). However, extensive evidence indicates that retail investors tend to trade “too much,” in which case restricting their market access plausibly improves their investment performance. Reviews by Barber & Odean (2013) and Blankespoor et al. (2020) discuss evidence that retail investors systematically underperform buy-and-hold diversified portfolios, trade in the opposite direction of fundamental signals, and are prone to attention-based trading on stock volatility and volume. Excessive, under-informed retail trading is thought to be driven by a combination of behavioral biases and inferior information processing capabilities. Barriers to trading plausibly 14 For after-hours EAs, easterly and westerly investors are likely awake to place orders for the following morning. However, easterly investors are also awake the following morning to learn from price responses and adjust their orders. For before-hours EAs, westerly investors are more likely to be asleep and thus cannot make informed trades until after the price adjustment is substantially complete. 11 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 51,
    "chunk_index": 21,
    "word_count": 359,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "morning. However, easterly investors are also awake the following morning to learn from price responses and adjust their orders. For before-hours EAs, westerly investors are more likely to be asleep and thus cannot make informed trades until after the price adjustment is substantially complete. 11 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 51,
    "chunk_index": 22,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "mitigate retail investors’ underperformance for three non-exclusive reasons. First, westerly retail investors plausibly trade less intensively. Second, the trades that westerly investors do execute are later in the day when prices are more efficient. Third, westerly investors plausibly decide to substitute from holding stocks to more passive and diversified securities such as ETFs. III. DATA 3.1. Sample Selection IRS SOI publishes annual data on aggregated taxpayer 1040 filings by county and income bracket.15 Form 1040, and its sub-types, is the required tax filing for nearly all individuals with income exceeding the standard deduction and anyone below that threshold claiming a refund. The SOI data are published a few years after each tax year. The 1040 data used in our study are available from 2010 through 2019. Within each county, 1040 fields are aggregated based on taxpayers’ adjusted gross income (AGI) bracket. Six AGI brackets span negative income to $199,999, and a seventh bracket includes $200,000 and more.16 1040 fields are summed for all individuals within the county-bracket and rounded to the nearest 10. To preserve anonymity, SOI combines fields representing fewer than 20 returns into the next closest income bracket. SOI also reports the count of returns with non-zero values for each 1040 field. Table 1 details our sample selection. We begin with 3,146 counties and 219,898 county- bracket-year observations for U.S. States and Washington D.C. from 2010 through 2019. We 15 Other geographic units are available, including metropolitan area and ZIP code. We use county for our analyses as it has the closest conformity with time zone boundaries and frequently aligns with local institutions (e.g., school districts and transit authorities) that likely impact the schedules and characteristics of the local population. 16 After 2012 there are eight brackets. Original bracket #2 ($1 – $24,999) is split into two brackets. We consolidate new brackets #2 and #3 in later years to maintain the same number of brackets throughout the sample window. 12 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 51,
    "chunk_index": 23,
    "word_count": 327,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "characteristics of the local population. 16 After 2012 there are eight brackets. Original bracket #2 ($1 – $24,999) is split into two brackets. We consolidate new brackets #2 and #3 in later years to maintain the same number of brackets throughout the sample window. 12 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 51,
    "chunk_index": 24,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "drop counties in Hawaii and Alaska because they are not useable in our border county analyses.17 We drop Arizona because most of the state does not observe daylight savings time, so its counties effectively span two time zones.18 We also drop 10,711 observations that have missing values for the 1040 capital gain/loss field (discussed below), in which case the SOI data aggregate the gain/loss with the next closest income bracket. We merge the IRS data with time zone data from the National Weather Service. We drop nine counties that span two time zones. Our final sample includes 205,190 county-bracket-year observations relating to 3,083 unique counties. 13,380 county-bracket-year observations from 208 counties are immediately adjacent to an interior time zone border.19 3.2. SOI Data Descriptive Statistics Table 2 includes descriptive statistics for the SOI data. The mean county-bracket-year includes 7,033 tax returns from 13,658 individuals, although both numbers are highly skewed. Our dependent variable is based on the 1040 field for net capital gain/loss, which we use to proxy for retail traders’ investment performance. During our sample, taxpayers were required to report all capital gains and a maximum of $3 thousand in losses per year. The 1040 field includes short- and long-term gains and losses from the sale of securities in a taxable account, including stocks, bonds, mutual funds, options, and other securities that are traded on traditional 17 The contiguous United States is home to 99 percent of the population. Results for our full sample test are inferentially unchanged if Hawaii and Alaska are included. 18 Most of Arizona is aligned with the Pacific zone during daylight savings time (34 weeks) and with the Mountain zone for the rest of the year (18 weeks), so most Arizona counties effectively span two time zones within our annual data. The exceptions are the Navajo Nation territories that do observe daylight savings time. We drop Arizona to avoid these complications, but untabulated results including Arizona are qualitatively unchanged. 19 Our criteria for identifying border counties are that: 1) the county boundary must align with an interior time zone border by more than what appears as a single point; and 2) the county must be adjacent to at least one county on the other side of the time zone border. When time zones are divided by water, we identify adjacent counties as those that are latitudinally aligned across the water. No county switches time zones during our sample period. Recognizing there is some subjectivity in identifying border counties, we had a research assistant independently identify border counties based on the aforementioned criteria. The RA’s coding included three differences in border county classifications, and untabulated results using the RA’s classifications are marginally stronger than those we report. 13 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 51,
    "chunk_index": 25,
    "word_count": 458,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "some subjectivity in identifying border counties, we had a research assistant independently identify border counties based on the aforementioned criteria. The RA’s coding included three differences in border county classifications, and untabulated results using the RA’s classifications are marginally stronger than those we report. 13 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 51,
    "chunk_index": 26,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "exchanges. IRS summary data for years 2010-2015 show that 85 percent of reported gain/loss transactions involve the types of traded securities that are the intended focus of our study. The remaining 15 percent of transactions in the 1040 capital gain/loss field relate to other capital assets such as real estate sales, partnership interests, and passthrough gains/losses, which are measurement error for our purpose of examining the performance of securities traded on standard exchanges. Section 3.3 investigates our identifying assumption that this measurement error does not systematically differ on either side of a time zone border. We also run versions of our tests excluding income brackets 1 (< $0 AGI) and 7 (> $200 thousand AGI), which are more likely to include non-security transactions. For example, SOI summary data indicate that passthrough entities make up a large percentage of the value of capital gains for extremely wealthy taxpayers, and having gains/losses on many passthrough entity transactions (e.g., from private equity investments) requires accredited investors who make over $200 thousand in earned income per year. Negative AGI (i.e., bracket 1) frequently arises from wealthy individuals who own companies that generate large earned-income losses.20 The SOI data are reported in aggregate, so we estimate average gains per investor by dividing the aggregate gains by the number of returns reporting any gain/loss. We then winsorize average gain/loss at the 1st and 99th percentiles by year to account for extreme outliers, which are likely the result of atypical large transactions or possibly data errors. The mean gain/loss per investor is $15.81 thousand, but this amount is highly skewed due to both skewness in wealth and because of the IRS limit on reported losses. The functional form of our dependent variable requires discussion. Logging to eliminate 20 Income from passthrough entities (e.g., sole proprietorships and partnerships) is reported as earned income on individuals’ tax returns, so is not included in the 1040 capital gain/loss field. Capital gains/losses from passthrough entities can arise from selling the entity itself or from the entity selling certain capital assets. For example, gains/losses from a private equity fund divestment flow-through to the capital gain/loss field in an owner’s 1040. 14 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 51,
    "chunk_index": 27,
    "word_count": 364,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "the 1040 capital gain/loss field. Capital gains/losses from passthrough entities can arise from selling the entity itself or from the entity selling certain capital assets. For example, gains/losses from a private equity fund divestment flow-through to the capital gain/loss field in an owner’s 1040. 14 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 51,
    "chunk_index": 28,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "skewness is problematic because average gain/loss includes non-positive values (Chen & Roth 2023). We instead use the percentile ranking of average gain/loss, variable Gains, which has a uniform distribution. Our main regression specifications include year and income bracket fixed effects, and Gains residualized to fixed effects has a largely normal distribution as indicated by the “Gains residualized to fixed effects” row in Table 2.21 Time Zone in Table 2 is a count variable identifying each county’s time zone, from Eastern Time = 0 to Pacific Time = 3. The average Time Zone is 0.81, which is towards the western edge of the Eastern time zone. 3.3. The Homogeneity of Border Counties Our main tests examine only the 208 counties that are adjacent to an time zone border. Of those, the variable West identifies the 47 percent of observations that are on the west side. The identifying assumption in our time zone border tests is that, except for their assigned time zone, investors on either side of a border are, on-average, homogeneous in ways that affect investment performance. For example, we assume that investors on either side of a time zone border do not have systematic differences in investment incentives or skills. Also, because our Gains proxy for investment performance also includes gains/losses relating to assets that are not traded on standard exchanges (e.g., real estate and partnerships), we must assume that these other gains/losses do not systematically differ across time zone borders.22 21 Because fixed effects de-mean each variable by group, it is the distribution of the residualized data that matters for assumptions about normality (Breuer & deHaan 2023). Raw average gain/loss residualized to fixed effects is still highly leptokurtic with long tails, which is why we use the percentile rank instead of raw values. Untabulated robustness tests using logged average gain/loss produce similar results. 22 The homogeneity assumption is important in a geographic discontinuity design because agents can sort themselves around the boundary (Keele & Titiunik 2015). In our setting, it is conceivable that retail investors who are especially interested in stock trading move to the Eastern time zone, but it seems unlikely that such migrations are sufficiently numerous to materially impact our findings. Still, assuming that migrating retail investors are more skilled than average, migrations are one reason why east coast retail investors could outperform their westerly peers. 15 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 51,
    "chunk_index": 29,
    "word_count": 396,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "the Eastern time zone, but it seems unlikely that such migrations are sufficiently numerous to materially impact our findings. Still, assuming that migrating retail investors are more skilled than average, migrations are one reason why east coast retail investors could outperform their westerly peers. 15 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 51,
    "chunk_index": 30,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "We investigate the homogeneity of border counties in Table 3. Demographic data are from the 5-year American Community Survey (ACS). We average the ACS 5-year data for 2010-2014 and 2015-2019 to the county level. We present logged population and income variables to mitigate skewness. Health variables are sourced from the CDC’s National Environmental Public Health Tracking Network, again averaged to one observation per county. Table 3 presents the average values of east- and west-side counties. To facilitate interpretation, the rightmost column presents the standardized differences in means between the two sides. The upper rows of Table 3 present the average longitude and latitude of border county centroids. A county’s geographic coordinates determine sunrise and sunset times relative to stock markets hours, and one could be concerned that differences in sunlight or weather patterns affect trading performance (deHaan et al. 2017). However, the average difference in longitudes between border county centroids is just 0.39 (roughly 21 miles), which is both statistically and economically insignificant.23 We also observe no significant difference in average latitude. The next set of rows of Table 3 reports economic characteristics, including household income, income per capita, unemployment, percent of households with retirement income, and households below the poverty line. All differences are statistically and economically insignificant. The third set of rows reports demographic characteristics, including population size and the percentages of population with a college degree, who work in finance, or who report as a minority. All differences are insignificant. The fourth set of rows investigates differences in housing characteristics, including home 23 While longitudes become more negative from east to west, we find that western border counties have, on average, slightly more positive longitudes. This counterintuitive difference is because: i) time zone borders do not follow straight lines; and ii) there are more counties on the east side of each border. Clustering of eastern counties in the bulging portions of the borders causes eastern counties to have nominally more westerly longitudes, on average. 16 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 51,
    "chunk_index": 31,
    "word_count": 333,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "i) time zone borders do not follow straight lines; and ii) there are more counties on the east side of each border. Clustering of eastern counties in the bulging portions of the borders causes eastern counties to have nominally more westerly longitudes, on average. 16 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 51,
    "chunk_index": 32,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "values, monthly mortgages, monthly rent, and percent of individuals renting. These statistics are likely indicative of investors’ wealth and financial stability. Also, because housing sales are included in the form 1040 gain/loss field, systematic differences in housing ownership or values could confound our analyses.24 We find no significant differences in housing characteristics, except that west-side median monthly rents are an economically modest but statistically significant 0.19 standard deviations lower than east-side rents (significant at 10 percent). The final set of rows investigates differences in health outcomes that plausibly correlate with wealth and other investment performance determinants. We find no significant differences in the percentage of citizens reporting less than seven hours of sleep per night, those who report no leisure physical activity, or those who experience a variety of major adverse health outcomes. In sum, the data in Table 3 indicate that individuals on either side of time zone borders are, on average, observationally homogenous. These data support the identifying assumption underlying our border tests, as discussed further below. IV. MAIN ANALYSES 4.1 Full Sample Test We examine differences in investment performance across time zones using the following linear regression: Gains i,t,b = β 1 Time Zone i +  year +  bracket + ε i,t,b (1) Where Gains pertains to county i in year t in income bracket b. Year fixed effects restrict i,t,b analysis to within-year variation and bracket fixed effects do the same for income groupings. Neither fixed effect covaries with Time Zone and so are only included to improve model fit. We 24 For a primary residence, only gains over $250 thousand ($500 thousand for married filing jointly) are included in capital gain/loss. SOI’s estimates for 2010-2015 show that total primary and secondary residential property sales represent just 3.6 percent of gains and 5.0 percent of losses, indicating that residential sales are unlikely to be a major confound. 17 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 51,
    "chunk_index": 33,
    "word_count": 319,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "for married filing jointly) are included in capital gain/loss. SOI’s estimates for 2010-2015 show that total primary and secondary residential property sales represent just 3.6 percent of gains and 5.0 percent of losses, indicating that residential sales are unlikely to be a major confound. 17 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 51,
    "chunk_index": 34,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "cluster standard errors at the county level to address likely serial dependence.25 Table 4A presents results for our full sample. Column (1) estimates equation (1) without fixed effects. Column (2) includes both sets of fixed effects. Both specifications find statistically significant positive coefficients for Time Zone, consistent with more positive capital gains for investors with less market access. The coefficient of 3.916 in column (2) suggests that a one hour decrease in market access is associated with a 3.9 percentage point increase in net gains. This is consistent with investors in more westerly time zones (i.e., those with fewer waking hours to actively trade) having improved investment performance. Column (3) in Table 4A limits the sample to only the “middle income” brackets between $1 and $199,999, which comprises roughly 94 percent of all tax returns. Limiting the sample to middle income brackets likely mitigates measurement error in Gains and likely better focuses on the types of retail investors that regulators are most concerned about protecting. The Time Zone estimate is similar and explanatory power slightly improves, suggesting that Time Zone better explains the trading performance of middle income households. 4.2. Border Test It is highly possible that unobserved differences between easterly and westerly investors confound our results. We address this endogeneity issue by examining only counties that are immediately adjacent to a time zone border. Our tests use the following modification of (1): Gains i,t,b = β 1 West i +  year +  bracket +  border + ε i,t,b (2) West is an indicator variable taking a value of one for counties immediately to the west of the border and zero for counties immediately to the east. Border fixed effects strictly contrast investors on either side of each border. Other model details are unchanged from (1). 25 Time Zone does not vary by year, so cross-sectional clustering is unnecessary. 18 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 51,
    "chunk_index": 35,
    "word_count": 318,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "west of the border and zero for counties immediately to the east. Border fixed effects strictly contrast investors on either side of each border. Other model details are unchanged from (1). 25 Time Zone does not vary by year, so cross-sectional clustering is unnecessary. 18 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 51,
    "chunk_index": 36,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "Table 4B mirrors 4A but for equation (2) and limited to only border counties, and produces qualitatively similar results. Column (1) of Table 4B omits year and bracket fixed effects, and finds that investors on the west side of each border have roughly 2.9 percentage points larger gains than investors immediately to the east. Results are similar in column (2) when year and bracket fixed effects are included, and in column (3) when the extreme income brackets are excluded. These results again indicate that limiting market access improves investment performance for retail investors. A 2.9 percentage point increase in gain/loss in column (2) equates to roughly $393 per year, or to $1,179 per year if extrapolated across three time zones.26 4.3. Pseudo-Border Falsification Tests We conduct pseudo-border falsification tests to address concerns that our findings are a statistical artifact due to violated distributional assumptions in equation (2) or are due to latent differences across east-west counties that exist even in the absence of a time zone change. Randomized inference has the advantage of making no distributional assumptions about test statistics or error terms (White and Webb 2021). Version #1 of our falsification tests is based on pseudo-borders that are similar in shape and composition to the actual time zone borders, as depicted in Figure 4A. We construct pseudo- borders by beginning with each northernmost county and randomly pairing it with one adjacent neighbor to the south, and then repeating until the north-south stack reaches a southern U.S. border. After constructing the north-south stack, we match each stack to its west-adjacent neighbors. We exclude actual time zone border counties from our pseudo-borders. This process produces a total of 53 pseudo-borders, and we repeat the process twice for a total set of 106 26 The average investor in this sample falls into roughly the 51st centile of Gains. The 51st to 52nd centiles of Gains differ by $135.5. Thus, $135.5 × 2.9 centiles = $393. 19 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 51,
    "chunk_index": 37,
    "word_count": 329,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "and we repeat the process twice for a total set of 106 26 The average investor in this sample falls into roughly the 51st centile of Gains. The 51st to 52nd centiles of Gains differ by $135.5. Thus, $135.5 × 2.9 centiles = $393. 19 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 51,
    "chunk_index": 38,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "pseudo-borders.27 We then vertically stratify the U.S. into thirds and randomly select one pseudo-border from each stratum for inclusion in equation (2). We save the pseudo-West coefficient estimate and repeat the process a total of 9,999 times. Results in Table 5 find no evidence of differences in Gains across our pseudo-borders. The 9,999 pseudo-West coefficients have a 99th percentile of 2.581. Only 33 pseudo-West coefficients are larger than the true West coefficient of 2.930 from column (2) of Table 4B, which amounts to a nonparametric Fisher p-value of 0.003. Version #2 of our falsification tests addresses the concern that our pseudo-borders in version #1 do not have precisely the same number of counties as the true time zone borders. Version #2 creates west-side pseudo-borders by swapping each true west-side county with a randomly selected county from the same region of the country. For each random west-side county, we randomly retain one adjacent county with a more easterly centroid to be the east-side pseudo-border county. In cases where the true west-side county has multiple adjacent true east- side counties, we randomly retain the same number of adjacent pseudo east-side counties. This process ensures that each pseudo-border has the same number of easterly and westerly counties as the true borders, from the same general regions. Thus, version #2 better preserves the sample size and structure used in our main tests, but inevitably sacrifices some similarity to the natural setting by foregoing continuous north-south borders (see Figure 4B). Once more, results in Table 5 find no evidence of differences in Gains between eastern and western counties across version #2 our pseudo-borders. No pseudo-West coefficient is larger than the true West coefficient, which amounts to a Fisher p-value of <0.000. 27 Of the 70 northernmost counties, we eliminate those that are very close to the coasts (which produce short north- south stacks) and those that are actual time zone border counties. 53 northernmost counties remain. To allow for 9,999 unique combinations, we repeat the random selection process twice. Creating pseudo-borders requires manual cleaning, so we do not generate new pseudo-borders for each trial. 20 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 51,
    "chunk_index": 39,
    "word_count": 355,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "north- south stacks) and those that are actual time zone border counties. 53 northernmost counties remain. To allow for 9,999 unique combinations, we repeat the random selection process twice. Creating pseudo-borders requires manual cleaning, so we do not generate new pseudo-borders for each trial. 20 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 51,
    "chunk_index": 40,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "Taken together, these falsification test indicate that the sharp differences in Gains observed across time zone borders in Table 4B are unlikely to occur by chance across adjacent counties elsewhere in the U.S. Said differently, the sharp differences in Gains only appear across adjacent counties that are divided by a time zone border. These results indicate that differences in social time drive the changes in Gains, consistent with our hypothesized mechanism of limited market access. Section 5 further investigates the underlying mechanism. 4.4. Supplemental Analysis 4.4.1. Controlling for Geographic Coordinates One could be concerned that differences in daylight hours relative to stock exchanges affect our findings. However, a county’s universal sunrise and sunset times are determined by its geographic location, and Table 3 finds no evidence of significant differences in latitude or longitude between east and west border counties. Table 6 further investigates the effects of geographic location by controlling for longitude and latitude. Longitudes and latitudes are rounded to the nearest integer, resulting in 57 unique longitudes and 25 unique latitudes. Results in Table 6 repeat the border test from column (2) of Table 4B but add fixed effects for longitude (column 1) or latitude (column 2). The fixed effects contrast observations within the same approximate distance from New York. Column (3) includes fixed effects for each latitude-longitude combination, which contrasts only counties on either side of a time zone border within a quadrangle of roughly 50x50 miles. The results are qualitatively unchanged. 4.4.2. Do State Regulations Play a Role? Because time zone borders often follow state borders, it is possible that state-level regulations or tax policies affect our analyses in unpredictable ways. Table 7 repeats column (2) from Table 4A but restricts the sample to only the eleven states that span more than one time 21 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 51,
    "chunk_index": 41,
    "word_count": 303,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "zone borders often follow state borders, it is possible that state-level regulations or tax policies affect our analyses in unpredictable ways. Table 7 repeats column (2) from Table 4A but restricts the sample to only the eleven states that span more than one time 21 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 51,
    "chunk_index": 42,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "zone. Column (1) expands regression (1) to includes state fixed effects, which strictly contrast counties within the same state. Column (2) includes state-year-bracket fixed effects. Both models find qualitatively unchanged inferences from Table 4A. 4.4.3. Regressions by Year The decade from 2010 to 2019 saw major changes in both the number of retail traders participating in equity markets as well as the way in which they placed trades. Mobile app trading was relatively new in 2010, most brokerages charged trading commissions, and few brokerages allowed fractional trading. Much of this had changed by 2019, which lowered barriers to entry and expanded market access for retail traders. Table 8A presents the results of equation (1) by year. The Time Zone coefficient estimate is statistically significant in all years and trends downward over time. These results are consistent with the protectionary effect of limited waking trading hours becoming weaker over time, although it is difficult to exclude the effects of other changes in the market and economy. Table 8B presents results of equation (2) by year. While test power is limited by smaller sample sizes, the West coefficient estimate is still statistically significant at 10 percent in eight years. Coefficient magnitudes again tend to decrease over time, except for the first two years. In sum, these findings are generally consistent with the protectionary effects of time zones declining over time. 4.4.4. Do Sunset Times and Sleeping Patterns Play a Role? Research in health and economics finds that reduced sleep affects health and productivity outcomes. Relevant to our study, Gibson & Shrader (2018) estimate that a one-hour increase in sunset times caused by a county’s longitude relative to time zone borders is associated with eight minutes less sleep per night, which in turn has a decreasing effect on long-term earnings. 22 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 51,
    "chunk_index": 43,
    "word_count": 303,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "to our study, Gibson & Shrader (2018) estimate that a one-hour increase in sunset times caused by a county’s longitude relative to time zone borders is associated with eight minutes less sleep per night, which in turn has a decreasing effect on long-term earnings. 22 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 51,
    "chunk_index": 44,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "Giuntella & Mazzonna (2019) find that longitude-related differences in bedtimes affect health outcomes. In our setting, investors on the east side of a border have roughly one-hour later sunsets (in social time) than investors on the west side, so plausibly get slightly less sleep. Thus, it is possible that east-side investors’ decreased sleep affects their investment performance. The analyses in Table 3 indicate that the effect of sunset times on sleep is unlikely to be a major confound in our setting. Specifically, Table 3 finds no evidence of differences in average income, economic indicators, or health outcomes between counties on either side of a border. While these results may appear inconsistent with prior literature at first blush, a likely explanation is that the effects of sunset-related differences in sleep on outcomes are simply too small to detect between adjacent counties around a border.28 Thus, while time zones plausibly effect sleep, health, and some economic outcomes, the effects across immediately adjacent counties appear to be too small to drive the significant differences in Gains that we document. As an extra test to reduce concerns about local sunset times and sleep, we examine differences in Gains across counties in each time zone that are roughly 15 degrees longitude apart, which equates to one hour of solar time. Sunsets in these counties occur at the same social times, which should eliminate the effects of sunset times on sleep. Untabulated results of model (1) restricted to these counties are qualitatively unchanged, again indicating that our findings are unlikely to be materially driven by differences in sunset times across time zone borders. 4.4.5. Regressions by Income Bracket Untabulated results repeat column (2) of Table 4B for each income bracket. The West 28 Gibson & Shrader (2018) compare individuals living long distances apart and find that one hour differences in local sunset times cause an eight minute difference in sleep, which in turn affects economic outcomes. Giuntella & Mazzonna (2019) use a time zone discontinuity approach somewhat like our own and, like us, do not find differences in income across adjacent time zone border counties. They instead only find an association between sunset times and income when excluding areas that are immediately adjacent to each border, indicating that the effects of longitude-related differences in sleep are undetectably small over narrow geographic distances. 23 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 51,
    "chunk_index": 45,
    "word_count": 392,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "income across adjacent time zone border counties. They instead only find an association between sunset times and income when excluding areas that are immediately adjacent to each border, indicating that the effects of longitude-related differences in sleep are undetectably small over narrow geographic distances. 23 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 51,
    "chunk_index": 46,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "coefficients range from 3.78 to 4.36 and are statistically significant for the middle-income brackets between $25 thousand and $100 thousand, which represent around half of the U.S. population. The coefficient estimates are nearly zero for the highest income bracket, indicating that trading hours have little impact on the performance of the wealthiest retail investors. 4.4.6. Controlling for County Characteristics Untabulated tests repeat column (2) of Table 4B while controlling for the county characteristics listed in Table 3, and find qualitatively unchanged results. We also run a separate regression controlling for each characteristic and again find unchanged results. 4.4.7. Effects of Large or Small Cities The data in Table 3 indicate that average population sizes are similar on either side of time zone borders, and results mentioned in the prior subsection are similar when controlling for populations. Still, to reduce concerns that large or small population centers drive our findings, we repeat column (2) of Table 4B after dropping the largest and smallest 1, 2, 3 … 10 percent of observations by population. Untabulated results are qualitatively unchanged across the 10 models, indicating that the largest and smallest cities do not materially drive our findings. 4.4.8. Influential Observations Untabulated tests reduce concerns about influential observations using trials that repeat column (2) of Table 4B after randomly dropping 10 percent of counties. Across 1,000 trials, the average West coefficient is 2.92, which is close to the actual estimate of 2.93. All 1,000 trials find significant results at a 10 percent level of confidence, and all but one trial is significant at 5 percent. Thus, our findings do not appear sensitive to a few influential observations. V. MECHANISM TESTS The mechanism thought to drive our results is that investors living in westerly time zones 24 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 51,
    "chunk_index": 47,
    "word_count": 297,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "percent level of confidence, and all but one trial is significant at 5 percent. Thus, our findings do not appear sensitive to a few influential observations. V. MECHANISM TESTS The mechanism thought to drive our results is that investors living in westerly time zones 24 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 51,
    "chunk_index": 48,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "have fewer waking trading hours, and so trade less intensively, and so under-perform to a lesser degree. For example, westerly retail investors trade stocks less often and/or substitute to more passive investments such as ETFs. While a direct test of retail trading is not possible using the SOI data, here we present several alternative corroborating analyses. 5.1. Market Participation Rates (i.e., Extensive Margin of Retail Investment) While our expected mechanism is that limited market access decreases the intensity of retail trading, it is also possible that some retail investors opt-out of the market altogether. If less sophisticated investors opt-out and instead hold cash or increase consumption, the higher Gains could be driven by the more sophisticated investors who remain in the market. Such a mechanism would still be consistent with limited market access protecting less sophisticated retail investors from over-trading, but extensive margin differences may warrant a different policy response than intensive margin differences. We measure the extensive margin of market participation, Participation, as the number of returns reporting any capital gain/loss divided by the total number of returns filed in the county- year-bracket. Table 9 examines differences in Participation around time zone borders using similar models as in Table 4B and finds no evidence of declines in westerly counties. Untabulated regressions by income bracket also find insignificant results. Finding no evidence of declines in market participation indicates that access-constrained retail investors remain in the market. 5.2. Retail Trading Around Earnings Announcements Extensive research finds that retail investors actively trade around EAs but systematically underperform by trading in ways that are under-informed or unrelated to the information contained in the EA (e.g., Bhattacharya 2001; Hirshleifer et al. 2008; Blankespoor et al. 2019). 25 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 51,
    "chunk_index": 49,
    "word_count": 288,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "Trading Around Earnings Announcements Extensive research finds that retail investors actively trade around EAs but systematically underperform by trading in ways that are under-informed or unrelated to the information contained in the EA (e.g., Bhattacharya 2001; Hirshleifer et al. 2008; Blankespoor et al. 2019). 25 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 51,
    "chunk_index": 50,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "Here we use the timing of EAs to provide further evidence on whether retail investors in westerly time zones indeed trade less. We identify anonymized retail trades in TAQ using the Boehmer et. al (2021) method and calculate abnormal retail trading (Abn_Trades) around EAs as trading in days [0,1] scaled by the trailing average. After-hours EAs are set to the following trading day. See the header to Table 10 for sample details. Before-hours (after-hours) EAs occur at roughly 8AM (4PM) for Eastern investors but at 5AM (1PM) for Pacific investors. Most Eastern retail investors are awake for both before- and after-hours EAs, so can trade on both. Most Pacific retail investors are awake for after-hours EAs, so can place orders to execute at the next open.29 However, Pacific retail investors are unlikely to learn about before-hours EAs until several hours after the EA, and after most of the price response has taken place. Thus, Pacific investors who aim to capitalize on EA-related price adjustments are less likely to trade on before-hours EAs than after-hours EAs. We expect a similar but smaller effect for Central and Mountain investors. Averaged across the country, we expect that after-hours EAs should have more retail trading volume than before-hours EAs.30 Column 1 of Table 10 provides descriptive evidence consistent with after-hours EAs receiving, on average, greater retail trading volume than before-hours EAs. Column (1) is a simple regression of retail trading volume on an after-hours indicator variable (After). The average abnormal retail trading is 0.078 before-hours and 0.108 after-hours, indicating that retail trading is roughly 26 percent greater for after-hours EAs. Column (2) adds date-time-zone fixed effects to contrast only EAs on the same date within the same time zone, and finds similar 29 As mentioned, extended-hours retail trading is rare during our sample period. 30 Blankespoor er al. (2020) conclude that existing research finds mixed results about whether the market is collectively more attentive or equally attentive to before-hours EAs. Our prediction is that retail investors are more likely to trade on after-hours EAs, which is the opposite of prior studies that focus on total market volume or professional market participants. As discussed, we expect that professional market participants have economic incentives to work Eastern hours regardless of their location. 26 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 51,
    "chunk_index": 51,
    "word_count": 382,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "are more likely to trade on after-hours EAs, which is the opposite of prior studies that focus on total market volume or professional market participants. As discussed, we expect that professional market participants have economic incentives to work Eastern hours regardless of their location. 26 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 51,
    "chunk_index": 52,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "results. Column (3) includes fixed effects for decile rankings of known determinants of EA timing: market value to control for differences in firm size and attention; analyst following to control for differences in institutional attention; reporting lag to control for where the EA falls within earnings season; and earnings surprise to control for differences in the nature of the firms’ news (deHaan et al. 2015). Results are again similar. We next examine whether the increased retail trading for after-hours EAs is driven by retail investors located in westerly time zones. Because the Boehmer et al. (2021) method does not reveal investors’ locations, we proxy for retail investors’ locations using the locations of EA firms. Chi & Shanthikumar (2017) find a distinct local bias in information acquisition around EAs, consistent with the “home bias” that has been extensively documented among retail investors (e.g., Zhu 2002) and institutional investors (e.g., Coval & Moskowitz 1999; Dyer 2021). Thus, EA firms’ locations should correlate with retail investors’ locations. Columns (4) and (5) repeat (2) and (3) but with an interaction After × Time Zone. The main effect of Time Zone is absorbed by the time zone fixed effects. The insignificant coefficient on After indicates that Eastern investors trade in similar quantities around before- and after-hours EAs. The interaction is positive and significant, indicating that increased trading around after- hours EAs is driven by investors in westerly time zones. These results are consistent with our expected mechanism that access-constrained westerly retail investors trade less often. 5.3. Trading Volume Using Retail Brokerage Data (i.e., Intensive Margin of Trading) We examine the relation between market access and retail trading intensity using the Large Discount Brokerage (LDB) dataset from Barber & Odean (2000), which includes security positions and trades from 1991 – 1996. While the LDB data does not overlap with our sample period and the retail trading environment has changed since the mid-nineties, the fundamental 27 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 51,
    "chunk_index": 53,
    "word_count": 324,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "the Large Discount Brokerage (LDB) dataset from Barber & Odean (2000), which includes security positions and trades from 1991 – 1996. While the LDB data does not overlap with our sample period and the retail trading environment has changed since the mid-nineties, the fundamental 27 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 51,
    "chunk_index": 54,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "link between waking hours and trading should still exist. We consolidate the LDB accounts to the household level, all of which have an open account at the beginning of the sample. We retain households that make no trades during the sample. Approximately 70 percent of households have ZIP code data, yielding a sample of 53,488 households mapped to time zones.31 Descriptive statistics in Table 11A show that the average household places 33 trades (variable Trades) over the sample period. The distribution of Trades is skewed, so we also present statistics for ln(1+Trades) and ln(Trades), where the latter is undefined for households with zero trades. The log transformed variables are more normally distributed. Table 11B presents several specifications of regressions of Trades on Time Zone. If fewer waking trading hours cause less trading, then we expect the coefficient on Time Zone to be negative. Column (1) uses the percentile ranking of Trades, column (2) uses ln(1+Trades), and column (3) uses ln(Trades). All models find statistically significant negative coefficients, consistent with less trading by households in westerly time zones.32 In sum, the results using LDB data are generally consistent with westerly retail investors having more limited market access and therefore trading less frequently. 5.4. Portfolio Positions Using Retail Brokerage Data In addition to trading less often, a logical supposition is that westerly investors with greater frictions to active trading shift into more diversified and passive investments. For example, instead of actively trading in single corporate stocks and bonds, a westerly retail 31 Approximately 20 percent of ZIP codes cross county lines, in which case we assign the ZIP to the more populated county. 32 Just 2,249 LDB households live in a border county, 80 percent of which are concentrated in three counties. Thus, the LDB data provide very limited variation for tests at time zone borders. Untabulated regressions examining this small subset of households find statistically insignificant results. 28 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 51,
    "chunk_index": 55,
    "word_count": 322,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "Just 2,249 LDB households live in a border county, 80 percent of which are concentrated in three counties. Thus, the LDB data provide very limited variation for tests at time zone borders. Untabulated regressions examining this small subset of households find statistically insignificant results. 28 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 51,
    "chunk_index": 56,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "investor plausibly chooses to hold diversified mutual funds or assets such as government bonds. We investigate retail investors’ holdings using the LDB data on month-end positions. Geographic data are available for 50,252 households over the four-year sample window, yielding roughly 2.4 million household-month observations. Summary statistics in Table 12A show that corporate stocks comprise 71.4 percent of the average portfolio and that 85.2 percent of portfolios contain at least one corporate stock. The next highest asset category is mutual funds, which are 16.2 percent of the average portfolio and are non-zero in 27.5 percent of portfolios. If westerly investors switch to a more passive strategy, we expect them to hold fewer stocks, bonds, and options, and more mutual funds and government debt. We do not have a clear prediction for closed-end funds or an “Other” category of securities.33 Table 12B regresses each security type’s portfolio weight on Time Zone, and finds evidence consistent with our predictions. For example, investors in each time zone moving west allocate 0.8 percentage points less of their portfolio to stocks and 0.9 percentage points more to mutual funds. Because portfolio weights have unusual distributions, Panel C presents results using an indicator for non-zero holdings in each security type, and finds similar results.34 In sum, the LDB data are consistent with more westerly retail investors being less tempted to actively trade, and therefore substituting towards holding more passive portfolios. VI. CONCLUSION We examine the effects of trading hours on retail investors’ performance. Our central finding is that a plausibly exogenous impediment to trading is associated with meaningful 33 Closed-end funds are more diversified than single-name securities, so could be considered part of a more passive strategy. However, closed-end funds are also actively traded throughout the day like equities, and so could be considered part of an active strategy. 34 Unlike in Table 11, a given household appears each month in the data used in Table 12. As such, our regressions in Table 12 cluster by household and include year-month fixed effects. 29 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 51,
    "chunk_index": 57,
    "word_count": 341,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "equities, and so could be considered part of an active strategy. 34 Unlike in Table 11, a given household appears each month in the data used in Table 12. As such, our regressions in Table 12 cluster by household and include year-month fixed effects. 29 Electronic copy available at: https://ssrn.com/abstract=4486721 increases in retail investors’ net gains. Consistent with prior evidence that retail investors trade “too much,” our findings indicate that increasing market access impairs retail investors’ performance. Our study’s primary contribution is to inform the ongoing academic and regulatory debates about what causes retail investors to underperform diversified and passive portfolios, and what can be done about it. In particular, our findings raise serious questions about the implications of recent trends towards 24-hour equity trading, and indicate that increasing market access should be a concern for academics and regulators interested in retail investor welfare. 30 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "Document",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 51,
    "chunk_index": 58,
    "word_count": 150,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "portfolios, and what can be done about it. In particular, our findings raise serious questions about the implications of recent trends towards 24-hour equity trading, and indicate that increasing market access should be a concern for academics and regulators interested in retail investor welfare. 30 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "References",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 51,
    "chunk_index": 59,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "Aschoff, J., M. Fatranská, H. Giedke, P. Doerr, D. Stamm, and H. Wisser. 1971. Human circadian rhythms in continuous darkness: Entrainment by social cues. Science. Ayers, B. C., S. Ramalingegowda, and P. Eric Yeung. 2011. Hometown advantage: The effects of monitoring institution location on financial reporting discretion. Journal of Accounting and Economics. Barber, B. M., and T. Odean. 2000. Trading is hazardous to your wealth: The common stock investment performance of individual investors. The Journal of Finance. ———. 2013. Chapter 22 – The behavior of individual investors. In Handbook of the Economics of Finance, Elsevier. Barclay, M. J., and T. Hendershott. 2003. Price discovery and trading after hours. The Review of Financial Studies. Bazinas, S. 2021. Earnings announcements & retail participation: A deep-dive into after-hours trading. NYSE.com. Beracha, E., M. Fedenia, and H. Skiba. 2014. Culture’s impact on institutional investors’ trading frequency. International Review of Financial Analysis. Beyer, A., Cohen, D., Lys, T., and Walther, B. 2010. The financial reporting environment: Review of the recent literature. Journal of Accounting and Economics. Bhattacharya, N., 2001. Investors' trade size and trading responses around earnings announcements: An empirical investigation. The Accounting Review. Blankespoor, E., E. deHaan, and I. Marinovic. 2020. Disclosure processing costs, investors’ information choice, and equity market outcomes: A review. Journal of Accounting and Economics. Blankespoor, E., E. deHaan, J. Wertz, and C. Zhu. 2019. Why do individual investors disregard accounting information? The roles of information awareness and acquisition costs. Journal of Accounting Research. Bushee, B., and Noe, C. Corporate disclosure practices, institutional investors, and stock return volatility. Journal of Accounting Research. BNY Mellon Wealth Management. 2021. The rise of retail traders. https://www.bnymellonwealth.com/insights/the-rise-of-retail-traders.html. Boehmer, E., C. M. Jones, Xiaoyan Zhang, and Xinran Zhang. 2021. Tracking retail investor activity. The Journal of Finance. Bogousslavsky, V. 2021. The cross-section of intraday and overnight returns. Journal of Financial Economics. Boudoukh, J., R. Feldman, S. Kogan, and M. Richardson. 2019. Information, trading, and volatility: Evidence from firm-specific news. The Review of Financial Studies. Breuer, M. and deHaan, E. 2023. Using and interpreting fixed effects models. Working Paper. Chen, J., J. Roth. 2023. Logs with zeros? Some problems and solutions. Working Paper. Chi, S. S., and D. M. Shanthikumar. 2017. Local bias in Google search and the market response around earnings announcements. The Accounting Review. Christensen, H., M. Maffett, and L. Vollon. 2019. Securities regulation, household equity ownership, and trust in the stock market. Review of Accounting Studies. Constine, J. 2014. Robinhood launches zero-fee stock trading app. TechCrunch. https://techcrunch.com/2014/12/11/robinhood-free-stock-trading/. Coval, J. D., and T. J. Moskowitz. 1999. Home bias at home: Local equity preference in domestic portfolios. The Journal of Finance. 31 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "References",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 51,
    "chunk_index": 60,
    "word_count": 441,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "ownership, and trust in the stock market. Review of Accounting Studies. Constine, J. 2014. Robinhood launches zero-fee stock trading app. TechCrunch. https://techcrunch.com/2014/12/11/robinhood-free-stock-trading/. Coval, J. D., and T. J. Moskowitz. 1999. Home bias at home: Local equity preference in domestic portfolios. The Journal of Finance. 31 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "References",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 51,
    "chunk_index": 61,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "deHaan, E., Shevlin, T., and Thornock, J. 2015. Market (in)attention and the strategic scheduling and timing of earnings announcements. Journal of Accounting and Economics. deHaan, E., Madsen, J., and Piotroski, J. 2017. Do weather induced moods affect the processing of earnings news? Journal of Accounting Research. Drake, M. S., D. T. Roulstone, and J. R. Thornock. 2015. The determinants and consequences of information acquisition via EDGAR. Contemporary Accounting Research. Drake, M., Quinn, P., and Thornock, J. 2017. Who uses financial statements? A demographic analysis of financial statement downloads from EDGAR. Journal of Financial Reporting. Drake, M. S., B. A. Johnson, D. T. Roulstone, and J. R. Thornock. 2020. Is there information content in information acquisition? Accounting Review. Dyer, T. 2021. The demand for public information by local and nonlocal investors: Evidence from investor-level data. Journal of Accounting and Economics. Eliner, L., 2022. Trading from home: On the implications of time constraints for retail investors. Working Paper. Even-Tov, O., K. George, S. Kogan, and E. So. 2023. Fee the people: Retail investor behavior and trading commission fees. Working Paper. Ferguson, D. 2023. Gaming the IRS’ third-party reporting system: Evidence from pari-mutuel wagering. Journal of Accounting Research. Gerakos, J., M. Lang, and M. Maffett. 2013. Post-listing performance and private sector regulation: The experience of London's alternative investment market. Journal of Accounting and Economics. Gerety, M. S., and J. H. Mulherin. 1992. Trading halts and market activity: An analysis of volume at the open and the close. The Journal of Finance. Gibson, M., and J. Shrader. 2018. Time use and labor productivity: The returns to sleep. The Review of Economics and Statistics. Giuntella, O., and F. Mazzonna. 2019. Sunset time and the economic effects of social jetlag: evidence from US time zone borders. Journal of Health Economics. Gomes, F., M. Haliassos, and T. Tarun Ramadorai. 2021. Household finance. Journal of Economic Literature. Green, D. H., E. Henry, S. M. Parsons, and G. A. Plesko. 2022. Incorporating financial statement information to improve forecasts of corporate taxable income. The Accounting Review. Groves, M. 1991. Pacific Stock Exchange to extend hours. Los Angeles Times. Hamermesh, D. S., C. K. Myers, and M. L. Pocock. 2008. Cues for timing and coordination: Latitude, Letterman, and longitude. Journal of Labor Economics. Hirshleifer, D., J. Myers, L. Myers, and S. H. Teoh. 2008. Do individual investors cause post-earnings announcement drift? Direct evidence from personal trades. The Accounting Review. Jewett, M. E., J. K. Wyatt, A. Ritz-De Cecco, S. B. Khalsa, D.-J. Dijk, and C. A. Czeisler. 1999. Time course of sleep inertia dissipation in human performance and alertness. Journal of Sleep Research. Kamstra, M. J., L. A. Kramer, and M. D. Levi. 2000. Losing sleep at the market: The daylight saving anomaly. American Economic Review. Keele, L. J., and R. Titiunik. 2015. Geographic boundaries as regression discontinuities. Political Analysis. Kleppe, T., A. Pierce, Z. Wiebe, and T. Yohn. 2023. The effects of daylight saving time adjustments on investor information processing. The Accounting Review, forthcoming. Kocher, M., J. Pahlke, and S. Trautmann. 2013. Tempus fugit: Time pressure in risky decisions. Management Science. 32 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "References",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 51,
    "chunk_index": 62,
    "word_count": 517,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "Political Analysis. Kleppe, T., A. Pierce, Z. Wiebe, and T. Yohn. 2023. The effects of daylight saving time adjustments on investor information processing. The Accounting Review, forthcoming. Kocher, M., J. Pahlke, and S. Trautmann. 2013. Tempus fugit: Time pressure in risky decisions. Management Science. 32 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "References",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 51,
    "chunk_index": 63,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "Korman, M., V. Tkachev, C. Reis, Y. Komada, S. Kitamura, D. Gubin, V. Kumar, and T. Roenneberg. 2020. COVID-19-mandated social restrictions unveil the impact of social time pressure on sleep and body clock. Scientific Reports. Leuz, C. 2018. Evidence-based policymaking: Promise, challenges and opportunities for accounting and financial markets research. Accounting and Business Research. Maule, A. J., G. R. J. Hockey, and L. Bdzola. 2000. Effects of time-pressure on decision-making under uncertainty: Changes in affective state and information processing strategy. Acta Psychologica. McInish, T., and R. Wood. 1992. An analysis of intraday patterns in bid/ask spreads for NYSE stocks. The Journal of Finance. O’Brien, P. and Tan, H. 2015. Geographic proximity and analyst coverage decisions: Evidence from IPOs. Journal of Accounting and Economics. Osipovich, A. 2021. Is the stock market open at 3 a.m.? This startup says it should be. Wall Street Journal. Osipovich, A. and Miao, H. 2023. Robinhood to launch 24-hour trading on weekdays in stocks and ETFs. Wall Street Journal. Pietsch, C. P. R., and W. F. Messier Jr. 2017. The effects of time pressure on belief revision in accounting: A review of relevant literature within a pressure-arousal-effort-performance framework. Behavioral Research in Accounting. Portes, R., and H. Rey. 2005. The determinants of cross-border equity flows. Journal of International Economics. Roenneberg, T., E. C. Winnebeck, and E. B. Klerman. 2019. Daylight saving time and artificial time zones – A battle between biological and social times. Frontiers in Physiology. Roenneberg, T., A. Wirz-Justice, and M. Merrow. 2003. Life between clocks: Daily temporal patterns of human chronotypes. Journal of Biological Rhythms. SEC. 2022. Release No. 34-95007; File No. 10-239. Available at: sec.gov/rules/other/2022/34-95007.pdf Seida, J. and W. Wempe. 2000. Do capital gain tax rate increases affect individual investors’ trading decisions? Journal of Accounting and Economics. Stein, E., and C. Daude. 2007. Longitude matters: Time zones and the location of foreign direct investment. Journal of International Economics. Strumpf, D., and C. Driebusch. 2015. Why morning is the worst time to trade stocks. Wall Street Journal. Svenson, O., and A. J. Maule. 1993. Time Pressure and Stress in Human Judgment and Decision Making. Springer Science & Business Media. Wertz, J. 2020. Bundled signals, processing costs, and pricing speed. Working Paper. White, R. M., and M. D. Webb. 2021. Randomization inference for accounting researchers. Journal of Financial Reporting. White, E. 1928. The income tax – statistical aspects. The Accounting Review. Wittmann, M., J. Dinich, M. Merrow, and T. Roenneberg. 2006. Social jetlag: Misalignment of biological and social time. Chronobiology International. Yueshen, B. Z., M. Zamojski, and J. Zhang. 2022. Dynamic trade informativeness. Working Paper. Zhu, N. 2002. The local bias of individual investors. Working paper. Zingales, L. 2009. The future of securities regulation. Journal of Accounting Research. 33 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "References",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 51,
    "chunk_index": 64,
    "word_count": 459,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "of biological and social time. Chronobiology International. Yueshen, B. Z., M. Zamojski, and J. Zhang. 2022. Dynamic trade informativeness. Working Paper. Zhu, N. 2002. The local bias of individual investors. Working paper. Zingales, L. 2009. The future of securities regulation. Journal of Accounting Research. 33 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "References",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 51,
    "chunk_index": 65,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "Appendix A: Variable Definitions This table provides variable definitions and data sources. SOI data is defined annually and by income bracket: 1. $0 or less; 2. $1 – $24,999; 3. $25,000 – $49,999; 4. $50,000 – $74,999; 5. $75,000 – $99,999; 6. $100,000 – $199,999; 7. $ 200,000+. *Indicates variables that are winsorized by year. Variable Description Source # of individuals Estimated individuals associated with the filed returns in the IRS SOI county-year-bracket. # of returns Count of 1040 tax returns in the county-year-bracket. IRS SOI # of returns reporting Count of 1040 tax returns in the county-year-bracket with a IRS SOI gain/loss non-zero value for net gains or losses. Average capital Aggregate net gain/loss in the county-year-bracket divided Calculated gain/loss per investor* by the # of returns reporting gain/loss. In $ thousands. Border Identifier A count variable identifying time zone borders, used as fixed National effects in the border specifications: 1 – Eastern/Central; 2 – Weather Central/Mountain; 3 – Mountain/Pacific. Service Economic, Variables as defined in the ACS 5-year data profiles. U.S. Demographic, Social, https://www.census.gov/acs/www/data/data-tables-and- Census & Housing Attributes tools/data-profiles/ Bureau Gains The percentile ranking of average capital gain/loss per Calculated investor in the county-year-bracket. Health Attributes Variables defined by the CDC EPH Tracking Network. U.S. CDC https://ephtracking.cdc.gov/DataExplorer/ Latitude/Longitude The latitude and longitude of the county centroid as of 2010, U.S. rounded to the nearest integer. Census Bureau Market Participation* (# of returns reporting gain/loss) / # of returns Calculated Time Zone A count variable equal to: 0 – Eastern; 1 – Central; 2 – National Mountain; 3 – Pacific. Defined at the county level. Counties Weather split by a time zone are excluded. Service West An indicator variable equal to 1 if a county is immediately National west of a time zone boundary and equal to 0 if a county is Weather immediately east of a time zone boundary. Counties split by Service a time zone are excluded. 34 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "References",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 51,
    "chunk_index": 66,
    "word_count": 326,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "West An indicator variable equal to 1 if a county is immediately National west of a time zone boundary and equal to 0 if a county is Weather immediately east of a time zone boundary. Counties split by Service a time zone are excluded. 34 Electronic copy available at: https://ssrn.com/abstract=4486721 Figure 1: U.S. Time Zones and Corresponding Trading Hours 6:30AM – 1:00PM 7:30AM – 2:00PM 8:30AM – 3:00PM 9:30AM – 4:00PM 35 Electronic copy available at: https://ssrn.com/abstract=4486721 Figure 2: Percentage of After-Hours Earnings Announcements, by Corporate HQ Location Figure 2 illustrates the percentage of firms that announce earnings after normal trading hours. All other firms in the sample announce earnings before normal trading hours. The sample includes common stocks at the intersection of Compustat, CRSP, and I/B/E/S and that are headquartered in the continental US. To reduce noise, the sample excludes firm-quarters without the same earnings announcement (“EA”) date in Compustat and I/B/E/S, EAs that occur outside of days [0,90] relative to the fiscal quarter-end, and the 4% of EAs with a time stamp during trading hours (Blankespoor et al. 2020). The final sample includes 120,521 EAs from 2010 – 2019. Confidence intervals are based on tests of whether each time zone differs from the Eastern time zone, with standard errors clustered by firm and date. 36 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "References",
    "page_number": 36,
    "page_range": "p.36-38",
    "total_pages": 51,
    "chunk_index": 67,
    "word_count": 222,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.36-38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "time stamp during trading hours (Blankespoor et al. 2020). The final sample includes 120,521 EAs from 2010 – 2019. Confidence intervals are based on tests of whether each time zone differs from the Eastern time zone, with standard errors clustered by firm and date. 36 Electronic copy available at: https://ssrn.com/abstract=4486721 Figure 3: Information Acquisition During the Day Figure 3 illustrates downloads of financial reports from EDGAR throughout the typical weekday, denominated in Eastern time. The sample is for the year 2011 and drops automated downloads, as constructed by Drake et al. (2017). Panel A illustrates density plots of downloads, on 15-minute intervals. Panel B illustrates the cumulative distributions of downloads during the day. In both panels, regular trading hours are represented with red lines. Panel A: Density plots of downloads Panel B: Cumulative distribution throughout the day 37 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "References",
    "page_number": 38,
    "page_range": "p.38-39",
    "total_pages": 51,
    "chunk_index": 68,
    "word_count": 143,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.38-39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "A illustrates density plots of downloads, on 15-minute intervals. Panel B illustrates the cumulative distributions of downloads during the day. In both panels, regular trading hours are represented with red lines. Panel A: Density plots of downloads Panel B: Cumulative distribution throughout the day 37 Electronic copy available at: https://ssrn.com/abstract=4486721 Figure 4: Illustration of Pseudo-Borders Examples of several pseudo-borders used in the falsification tests. In version #1 in Panel A, we construct pseudo- borders by beginning with each northernmost county (excluding actual time zone border counties), matching it to a randomly selected southern-adjacent county, and then repeating until the north-south stack reaches the southern U.S. border. We then match each stack to its west-adjacent neighbor counties. We repeat the process twice and exclude especially short north-south stacks. Our final dataset includes 106 pseudo-borders. Version #2 in Panel B swaps each true west-side county with a randomly selected county from the same region of the country, and then randomly retains the appropriate number of adjacent counties with more easterly centroids to be the east-side pseudo-border counties. The advantage of version #2 is that it ensures that each pseudo-border has the same number of easterly and westerly counties as the true borders, from the same general regions of the country. Panel A: Version #1 based on linear North-South pseudo-borders Panel B: Version #2 based on East-West matched county pseudo-borders 38 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "References",
    "page_number": 39,
    "page_range": "p.39-40",
    "total_pages": 51,
    "chunk_index": 69,
    "word_count": 233,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.39-40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "ensures that each pseudo-border has the same number of easterly and westerly counties as the true borders, from the same general regions of the country. Panel A: Version #1 based on linear North-South pseudo-borders Panel B: Version #2 based on East-West matched county pseudo-borders 38 Electronic copy available at: https://ssrn.com/abstract=4486721 Table 1: Sample Selection This table presents our sample selection procedures, starting with all counties and county equivalents (e.g., parishes) for U.S. States and Washington D.C. from 2010 through 2019. Each county-year observation includes seven income brackets. Dropping observations with missing gains/losses eliminates 10,711 county-bracket-year observations but only three complete counties. As discussed in Section 3, missing data on capital gains/losses is usually because the county-year-bracket contains fewer than 20 tax returns, in which cases the returns are combined into the next closest bracket. County and County County-Bracket-Year Equivalents Observations IRS SOI Observations 3,146 219,898 Less: Hawaii, Alaska, Arizona (51) (3,367) Less: Missing Gain/Loss (3) (10,711) Less: Counties with split time zones (9) (630) Full Sample 3,083 205,190 Less: Counties not bordering an interior (2,880) (191,810) time zone boundary Border County Sample 208 13,380 39 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "References",
    "page_number": 40,
    "page_range": "p.40-41",
    "total_pages": 51,
    "chunk_index": 70,
    "word_count": 190,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.40-41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "IRS SOI Observations 3,146 219,898 Less: Hawaii, Alaska, Arizona (51) (3,367) Less: Missing Gain/Loss (3) (10,711) Less: Counties with split time zones (9) (630) Full Sample 3,083 205,190 Less: Counties not bordering an interior (2,880) (191,810) time zone boundary Border County Sample 208 13,380 39 Electronic copy available at: https://ssrn.com/abstract=4486721 Table 2: Descriptive Statistics This table presents summary statistics. The unit of observation is county-bracket-year. All variables are defined in Appendix A. N Mean Std. Dev P25 Median P75 # of returns 205,190 7,033 28,935 336 1,190 4,180 # of individuals 205,190 13,658 52,371 760 2,670 8,600 # of returns reporting gain/loss 205,190 1,129 4,261 80 200 610 Average capital gain/loss per 205,190 $15.81 $29.94 $2.21 $4.75 $11.05 investor (in $ thousands) Gains 205,190 50.5 28.9 25 50.5 75 Gains residualized to year and 205,190 0.00 15.3 -7.9 -1.1 7.8 income bracket fixed effects Time Zone 205,190 0.81 0.80 0.00 1.00 1.00 West (border counties only) 13,380 0.47 0.50 0.00 0.00 1.00 Participation (border counties only) 13,380 0.27 0.20 0.11 0.21 0.37 40 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "References",
    "page_number": 41,
    "page_range": "p.41-42",
    "total_pages": 51,
    "chunk_index": 71,
    "word_count": 178,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.41-42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "75 Gains residualized to year and 205,190 0.00 15.3 -7.9 -1.1 7.8 income bracket fixed effects Time Zone 205,190 0.81 0.80 0.00 1.00 1.00 West (border counties only) 13,380 0.47 0.50 0.00 0.00 1.00 Participation (border counties only) 13,380 0.27 0.20 0.11 0.21 0.37 40 Electronic copy available at: https://ssrn.com/abstract=4486721 Table 3: Border County Characteristics This table presents averages of county-level attributes. Each county has one observation. All economic, demographic, and housing variables as defined by the U.S. Census Bureau in the ACS 5-year Data Profile summaries. Health variables as defined by the CDC EPH Tracking Network. The rightmost column presents the difference in means scaled by the population standard deviation. T-tests are based on White standard errors. *** indicates statistically significance at 1%; ** at 5%; and * at 10%. West Side (N=95) East Side (N=113) Standardized Diff. Mean Mean [(West – East) / ] Coordinates Longitude -93.95 -94.34 0.03 Latitude 39.67 39.16 0.11 Economic Attributes ln(Mean Household Income) 11.00 11.02 -0.12 ln(Median Household Income) 10.72 10.76 -0.15 ln(Income per Capita) 10.09 10.09 0.01 % Unemployment 6.90 6.74 0.06 % with Retirement Income 19.75 19.30 0.09 % below Poverty Line 16.59 15.89 0.11 Demographic Attributes ln(Total Population) 9.83 9.61 0.15 ln(Total Households) 8.89 8.64 0.18 % Bachelor’s Degree or Higher 18.44 19.27 -0.09 % Finance, Insurance, Real Estate Professionals 4.23 4.14 0.05 % Minority 13.93 13.66 0.02 Housing Attributes ln(Median Home Value) 11.61 11.58 0.05 ln(Median Monthly Mortgage) 6.97 6.98 -0.07 ln(Median Monthly Rent) 6.46 6.50 -0.19* % Homes with Mortgage 49.38 48.87 0.04 % Vacant Housing Units 19.73 20.54 -0.08 % Rented Housing Units 27.83 27.20 0.08 Health Attributes % Regularly Less than 7-Hours Sleep 35.16 36.05 -0.22 % No Leisure-time Physical Activity 30.43 30.39 0.01 % Heart Disease 8.61 8.38 0.14 % Stroke 4.25 4.13 0.14 % Obesity 35.79 35.94 -0.04 % Diabetes 10.77 10.78 -0.01 % Asthma 9.90 9.74 0.18 % Depression 21.98 21.69 0.08 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "References",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 51,
    "chunk_index": 72,
    "word_count": 324,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "than 7-Hours Sleep 35.16 36.05 -0.22 % No Leisure-time Physical Activity 30.43 30.39 0.01 % Heart Disease 8.61 8.38 0.14 % Stroke 4.25 4.13 0.14 % Obesity 35.79 35.94 -0.04 % Diabetes 10.77 10.78 -0.01 % Asthma 9.90 9.74 0.18 % Depression 21.98 21.69 0.08 Electronic copy available at: https://ssrn.com/abstract=4486721 Table 4: Main Results This table presents results of regressing investment performance (Gains) on a proxy for market access (Time Zone or West). Panel A presents results for the full sample using equation (1). Panel B presents results for the border sample using equation (2). Fixed effects are noted near the bottom of each specification. Standard errors are clustered by county and t-statistics are reported in parentheses. *** indicates significance at 1%; ** at 5%; and * at 10%. Panel A: Full Sample (1) (2) (3) Time Zone 3.700*** 3.916*** 3.903*** (19.47) (19.49) (16.22) Observations 205,190 205,190 151,504 Year & Bracket Fixed Effects No Yes Yes Brackets Included 1 -- 7 1 -- 7 2 -- 6 Adj. R-squared 0.010 0.730 0.732 Within R-squared - 0.042 0.057 Panel B: Border Sample (1) (2) (3) West 2.853*** 2.930*** 3.089*** (3.24) (3.07) (2.85) Observations 13,380 13,380 10,066 Year & Bracket Fixed Effects No Yes Yes Border Fixed Effects Yes Yes Yes Brackets Included 1 -- 7 1 -- 7 2 -- 6 Adj. R-squared 0.054 0.714 0.729 Within R-squared 0.003 0.009 0.013 42 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "References",
    "page_number": 43,
    "page_range": "p.43-44",
    "total_pages": 51,
    "chunk_index": 73,
    "word_count": 236,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.43-44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "2.930*** 3.089*** (3.24) (3.07) (2.85) Observations 13,380 13,380 10,066 Year & Bracket Fixed Effects No Yes Yes Border Fixed Effects Yes Yes Yes Brackets Included 1 -- 7 1 -- 7 2 -- 6 Adj. R-squared 0.054 0.714 0.729 Within R-squared 0.003 0.009 0.013 42 Electronic copy available at: https://ssrn.com/abstract=4486721 Table 5: Pseudo-Border Falsification Test Results This table presents results of regressions that follow column (2) of Table 4B but for random pseudo- borders, as described in Section 4.3. Panel A presents a histograms of the pseudo-West coefficient estimates for versions #1 and #2 of our falsification tests, and the vertical red line depicts the actual West estimate from column (2) of Table 4B. Panel B presents distributional statistics of the pseudo-West coefficients and results of a non-parametric Fisher p-value, which is the ratio of more extreme occurrences to number of tests (e.g., 30/10,000 = .003). Both versions conduct 9,999 trials. Panel A: Histograms of falsification test pseudo-West coefficients versions #1 (left) and #2 (right) Panel B: Pseudo-West coefficient distributional statistics and test values Mean Median P75 P95 P99 Fisher p-value Pseudo-West version #1 0.233 0.186 0.772 1.792 2.581 0.003*** Pseudo-West version #2 0.018 0.013 0.500 1.176 1.711 <0.000*** 43 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "References",
    "page_number": 44,
    "page_range": "p.44-45",
    "total_pages": 51,
    "chunk_index": 74,
    "word_count": 205,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.44-45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "falsification test pseudo-West coefficients versions #1 (left) and #2 (right) Panel B: Pseudo-West coefficient distributional statistics and test values Mean Median P75 P95 P99 Fisher p-value Pseudo-West version #1 0.233 0.186 0.772 1.792 2.581 0.003*** Pseudo-West version #2 0.018 0.013 0.500 1.176 1.711 <0.000*** 43 Electronic copy available at: https://ssrn.com/abstract=4486721 Table 6: Controlling for Latitude & Longitude This table repeats column (2) of Table 4B but including fixed effects for the latitude and longitude of the county centroid, rounded to the nearest integer. Fixed effects are noted near the bottom of each specification. All other details are unchanged from Table 4. ***indicates significance at 1%; ** at 5%; and * at 10%. (1) (2) (3) West 3.786*** 2.644*** 2.273** (4.44) (3.25) (2.52) Observations 13,380 13,380 13,380 Year & Bracket Fixed Effects Yes Yes Yes Border Fixed Effects Yes Yes Yes Latitude Fixed Effects No Yes No Longitude Fixed Effects Yes No No Latitude-Longitude Fixed Effects No No Yes Adj. R-squared 0.726 0.729 0.759 44 Electronic copy available at: https://ssrn.com/abstract=4486721 Table 7: Within-State Analysis This table repeats column (2) of Table 4A but is restricted to the eleven states spanning more than one time zone, and adds state fixed effects (column 1) or State-Year-Bracket fixed effects (column 2). *** indicates significance at 1%; ** at 5%; and * at 10%. (1) (2) Time Zone 2.836*** 2.748*** (4.36) (4.29) Observations 69,415 69,415 Year & Bracket Fixed Effects Yes No State Fixed Effects Yes No State-Year-Bracket Fixed Effects No Yes Adj. R-squared 0.740 0.769 45 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "References",
    "page_number": 45,
    "page_range": "p.45-46",
    "total_pages": 51,
    "chunk_index": 75,
    "word_count": 257,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.45-46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "*** indicates significance at 1%; ** at 5%; and * at 10%. (1) (2) Time Zone 2.836*** 2.748*** (4.36) (4.29) Observations 69,415 69,415 Year & Bracket Fixed Effects Yes No State Fixed Effects Yes No State-Year-Bracket Fixed Effects No Yes Adj. R-squared 0.740 0.769 45 Electronic copy available at: https://ssrn.com/abstract=4486721 Table 8: By Year This table repeats columns (2) from Tables 4A and 4B, but estimated by year. All regressions include bracket fixed effects. Panel B also includes border fixed effects. *** indicates significance at 1%; ** at 5%; and * at 10%. Panel A: Full Sample Year 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 Time Zone 4.563*** 4.568*** 4.559*** 4.015*** 3.472*** 3.683*** 4.034*** 3.711*** 3.252*** 3.344*** (14.67) (14.83) (16.96) (18.59) (18.64) (19.19) (19.27) (21.19) (20.02) (19.89) Observations 20,311 20,305 20,473 20,507 20,538 20,562 20,561 20,622 20,670 20,641 Adj. R-squared 0.684 0.657 0.738 0.746 0.767 0.751 0.741 0.756 0.763 0.755 Panel B: Border Sample Year 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 West 2.113 1.854 4.230*** 3.680*** 3.860*** 3.237*** 3.456*** 3.120*** 1.515* 2.024** (1.42) (1.26) (3.24) (3.32) (3.98) (3.16) (2.89) (3.07) (1.75) (1.99) Observations 1,317 1,316 1,333 1,332 1,343 1,342 1,343 1,358 1,348 1,348 Adj. R-squared 0.696 0.667 0.739 0.733 0.765 0.728 0.705 0.732 0.726 0.704 46 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "References",
    "page_number": 47,
    "page_range": "p.47-48",
    "total_pages": 51,
    "chunk_index": 76,
    "word_count": 218,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.47-48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "West 2.113 1.854 4.230*** 3.680*** 3.860*** 3.237*** 3.456*** 3.120*** 1.515* 2.024** (1.42) (1.26) (3.24) (3.32) (3.98) (3.16) (2.89) (3.07) (1.75) (1.99) Observations 1,317 1,316 1,333 1,332 1,343 1,342 1,343 1,358 1,348 1,348 Adj. R-squared 0.696 0.667 0.739 0.733 0.765 0.728 0.705 0.732 0.726 0.704 46 Electronic copy available at: https://ssrn.com/abstract=4486721 Table 9: Mechanism Test – Extensive Margin of Market Participation This table presents analyses of market participation rates for border counties, measured using SOI data as (# of returns with gains/losses) / (total returns). It uses the regression specifications from Table 4B but with Participation as the dependent variable. Standard errors are clustered by county and t-statistics are reported in parentheses. *** indicates significance at 1%; ** at 5%; and * at 10%. (1) (2) (3) West 0.009 0.007 0.010 (0.97) (0.73) (0.99) Observations 13,380 13,380 10,066 Year & Bracket Fixed Effects No Yes Yes Border Fixed Effects Yes Yes Yes Brackets Included 1 -- 7 1 -- 7 2 -- 6 Adj. R-squared 0.019 0.770 0.578 47 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "References",
    "page_number": 48,
    "page_range": "p.48-49",
    "total_pages": 51,
    "chunk_index": 77,
    "word_count": 173,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.48-49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "(1) (2) (3) West 0.009 0.007 0.010 (0.97) (0.73) (0.99) Observations 13,380 13,380 10,066 Year & Bracket Fixed Effects No Yes Yes Border Fixed Effects Yes Yes Yes Brackets Included 1 -- 7 1 -- 7 2 -- 6 Adj. R-squared 0.019 0.770 0.578 47 Electronic copy available at: https://ssrn.com/abstract=4486721 Table 10: Mechanism Test – Retail Trading around Earnings Announcements This table presents analysis of abnormal retail trading volume around earnings announcements (EAs). The sample includes EAs for US common stocks from 2010 – 2016, as used in Blankespoor et al. (2020). The dependent variable abnormal retail trading, Abn_Trades, which is the log of ((one + the average daily retail volume over trading days [0,1]) divided by (one + the average daily retail volume over days [-41,- 11]), multiplied by 100. After is an indicator for after-hours EAs. Time Zone is a count variable for the location of retail investors as proxied by firm’s headquarters location. Fixed effects are listed in the lower rows. We do not tabulate the estimated constant in models that include fixed effects (Breuer and deHaan 2023). Columns (2) through (5) include fixed effects combination of EA date and time zone. Columns (3) and (5) also include fixed effects for decile rankings of firm market value, analyst following, reporting lag, and earnings surprise. Standard errors are clustered by firm and date. T-statistics are in parentheses. *** indicates significance at 1%; ** at 5%; and * at 10%. (1) (2) (3) (4) (5) Abn_Trades Abn_Trades Abn_Trades Abn_Trades Abn_Trades A fter 0.020*** 0.009*** 0.012*** -0.002 0.004 (5.87) (3.08) (3.92) (-0.61) (0.90) After × Time Zone 0.015*** 0.010*** (5.10) (3.80) C onstant 0.078*** (28.10) Fixed Effects None Date-Time-Zone Date-Time-Zone, Date-Time-Zone Date-Time-Zone, Control Deciles Control Deciles Observations 77,056 76,343 69,275 76,343 69,275 Adj. R-squared 0.001 0.070 0.132 0.071 0.132 48 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "References",
    "page_number": 49,
    "page_range": "p.49",
    "total_pages": 51,
    "chunk_index": 78,
    "word_count": 305,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "0.012*** -0.002 0.004 (5.87) (3.08) (3.92) (-0.61) (0.90) After × Time Zone 0.015*** 0.010*** (5.10) (3.80) C onstant 0.078*** (28.10) Fixed Effects None Date-Time-Zone Date-Time-Zone, Date-Time-Zone Date-Time-Zone, Control Deciles Control Deciles Observations 77,056 76,343 69,275 76,343 69,275 Adj. R-squared 0.001 0.070 0.132 0.071 0.132 48 Electronic copy available at: https://ssrn.com/abstract=4486721 Table 11: Mechanism Test – Trade Frequency This table presents analyses of the Large Discount Brokerage (LDB) dataset of households’ trades. The unit of observation is one per household. Panel A presents summary statistics. Panel B presents results of regressing trading frequency on Time Zone. T-statistics based on heteroskedasticity-robust standard errors are reported in parentheses. *** indicates significance at 1%; ** at 5%; and * at 10%. Panel A: Descriptive Statistics Households Mean Std. Dev. P25 Median P75 Trades 53,488 32.75 59.60 3 12 34 ln(1+Trades) 53,488 2.48 1.50 1.39 2.56 3.56 ln(Trades) 46,837 2.70 1.40 1.79 2.71 3.66 Panel B: Regression Results (1) (2) (3) Dependent Variable Trades Percentile Ln(Trades + 1) Ln(Trades) Time Zone -0.687*** -0.0323*** -0.0248*** (-6.734) (-6.377) (-4.903) C onstant 49.85*** 2.525*** 2.730*** (258.4) (264.5) (288.4) Observations 53,488 53,488 46,837 Adjusted R-squared 0.001 0.001 0.000 49 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "References",
    "page_number": 50,
    "page_range": "p.50-51",
    "total_pages": 51,
    "chunk_index": 79,
    "word_count": 195,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.50-51)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "1.40 1.79 2.71 3.66 Panel B: Regression Results (1) (2) (3) Dependent Variable Trades Percentile Ln(Trades + 1) Ln(Trades) Time Zone -0.687*** -0.0323*** -0.0248*** (-6.734) (-6.377) (-4.903) C onstant 49.85*** 2.525*** 2.730*** (258.4) (264.5) (288.4) Observations 53,488 53,488 46,837 Adjusted R-squared 0.001 0.001 0.000 49 Electronic copy available at: https://ssrn.com/abstract=4486721 Table 12: Mechanism Test – Portfolio Holdings This table presents analyses of the Large Discount Brokerage (LDB) dataset of households’ month-end portfolio balances. The unit of observation is household-month. Panel A presents summary statistics. Panel B presents results of regressing % Holding for each security type on Time Zone. Panel C presents similar results but for an indicator variable of non-zero holdings. Regressions in Panels B and C include year-month fixed effects. Standard errors are clustered by household and t-statistics are in parentheses. *** indicates significance at 1%; ** at 5%; and * at 10%. Panel A: Sample Averages Stocks Bonds Options Mutual Gov. Closed- Other Funds End % Holding 0.714 0.021 0.004 0.162 0.048 0.030 0.018 Non-Zero Indicator 0.852 0.070 0.041 0.275 0.088 0.107 0.067 Panel B: Regression Results - % Holding as Dependent Variable (1) (2) (3) (4) (5) (6) (7) Stocks Bonds Options Mutual Gov. Closed-End Other Funds Expected coef. sign - - - + + ? ? Time Zone -0.008*** -0.002*** -0.000 0.009*** 0.002*** -0.001*** 0.000 (-6.15) (-4.75) (-0.38) (7.90) (3.21) (-3.00) (1.09) Observations 2,369,831 2,369,831 2,369,831 2,369,831 2,369,831 2,369,831 2,369,831 Adjusted R-squared 0.007 0.011 0.000 0.000 0.000 0.002 0.002 Year-Month FE Yes Yes Yes Yes Yes Yes Yes Panel C: Regression Results – Non-zero Indicator as Dependent Variable (1) (2) (3) (4) (5) (6) (7) Stocks Bonds Options Mutual Gov. Closed-End Other Funds Expected coef. sign - - - + + ? ? Time Zone -0.006*** -0.006*** -0.003*** 0.013*** 0.003*** -0.004*** -0.001 (-5.28) (-7.28) (-5.82) (8.59) (2.99) (-3.45) (-0.88) Observations 2,369,831 2,369,831 2,369,831 2,369,831 2,369,831 2,369,831 2,369,831 Adjusted R-squared 0.001 0.023 0.001 0.007 0.001 0.002 0.001 Year-Month FE Yes Yes Yes Yes Yes Yes Yes 50 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "References",
    "page_number": 51,
    "page_range": "p.51",
    "total_pages": 51,
    "chunk_index": 80,
    "word_count": 336,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.51)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  },
  {
    "text": "? ? Time Zone -0.006*** -0.006*** -0.003*** 0.013*** 0.003*** -0.004*** -0.001 (-5.28) (-7.28) (-5.82) (8.59) (2.99) (-3.45) (-0.88) Observations 2,369,831 2,369,831 2,369,831 2,369,831 2,369,831 2,369,831 2,369,831 Adjusted R-squared 0.001 0.023 0.001 0.007 0.001 0.002 0.001 Year-Month FE Yes Yes Yes Yes Yes Yes Yes 50 Electronic copy available at: https://ssrn.com/abstract=4486721",
    "title": "MarketAccess 20230818c ssrnformatchangesonly",
    "source_type": "pdf",
    "document_id": "8a0491bc79a9",
    "source_file": "Trading Hours and Retail Investment Performance.pdf",
    "section": "References",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 51,
    "chunk_index": 81,
    "word_count": 50,
    "author": "glov",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230818150000-07'00'",
    "duration": null
  }
]