[
  {
    "text": "Trading Is Hazardous to Your Wealth: The Common Stock Investment Performance of Individual Investors BRAD M. BARBER and TERRANCE ODEAN* ABSTRACT Individual investors who hold common stocks directly pay a tremendous perfor- mance penalty for active trading. Of 66,465 households with accounts at a large discountbrokerduring1991to1996,thosethattrademostearnanannualreturn of 11.4 percent, while the market returns 17.9 percent. The average household earnsanannualreturnof16.4percent,tiltsitscommonstockinvestmenttoward high-beta,small,valuestocks,andturnsover75percentofitsportfolioannually. Overconfidencecanexplainhightradinglevelsandtheresultingpoorperformance of individual investors. Our central message is that trading is hazardous to your wealth. The investor’s chief problem—and even his worst enemy—is likely to be himself. Benjamin Graham In1996,approximately47percentofequityinvestmentsintheUnitedStates were held directly by households, 23 percent by pension funds, and 14 per- cent by mutual funds ~Securities Industry Fact Book, 1997!. Financial econ- omistshaveextensivelyanalyzedthereturnperformanceofequitiesmanaged by mutual funds. There is also a fair amount of research on the performance of equities managed by pension funds. Unfortunately, there is little research on the return performance of equities held directly by households, despite their large ownership of equities. *Graduate School of Management, University of California, Davis. We are grateful to the discountbrokeragefirmthatprovideduswiththedataforthisstudy.Weappreciatethecom- ments of Christopher Barry, George Bittlingmayer, Eugene Fama, Ken French, Laurie Krig- man,BingLiang,JohnNofsinger,SrinivasanRangan,MarkRubinstein,RenéStulz~theeditor!, Avanidhar Subrahmanyam, Kent Womack, Jason Zweig, two anonymous reviewers, seminar participants at theAmerican FinanceAssociation Meetings ~NewYork, 1999!, the 9thAnnual ConferenceonFinancialEconomicsandAccountancyatNewYorkUniversity,NotreDameUni- versity, the University of Illinois, and participants in the Compuserve Investor Forum. All errors are our own. 773",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 34,
    "chunk_index": 0,
    "word_count": 221,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "of Christopher Barry, George Bittlingmayer, Eugene Fama, Ken French, Laurie Krig- man,BingLiang,JohnNofsinger,SrinivasanRangan,MarkRubinstein,RenéStulz~theeditor!, Avanidhar Subrahmanyam, Kent Womack, Jason Zweig, two anonymous reviewers, seminar participants at theAmerican FinanceAssociation Meetings ~NewYork, 1999!, the 9thAnnual ConferenceonFinancialEconomicsandAccountancyatNewYorkUniversity,NotreDameUni- versity, the University of Illinois, and participants in the Compuserve Investor Forum. All errors are our own. 773 774 The Journal of Finance In this paper, we attempt to shed light on the investment performance of common stocks held directly by households. To do so, we analyze a unique data set that consists of position statements and trading activity for 78,000 households at a large discount brokerage firm over a six-year period ending in January 1997. Our analyses also allow us to test two competing theories of trading ac- tivity.Usingarationalexpectationframework,GrossmanandStiglitz~1980! argue that investors will trade when the marginal benefit of doing so is equaltoorexceedsthemarginalcostofthetrade.IncontrastOdean~1998b!, Gervais and Odean ~1998!, and Caballé and Sákovics ~1998! develop theo- retical models of financial markets where investors suffer from overconfi- dence. These overconfidence models predict that investors will trade to their detriment.1 Our most dramatic empirical evidence supports the view that overconfi- dence leads to excessive trading ~see Figure 1!. On one hand, there is very littledifferenceinthegrossperformanceofhouseholdsthattradefrequently ~with monthly turnover in excess of 8.8 percent! and those that trade infre- quently. In contrast, households that trade frequently earn a net annualized geometric mean return of 11.4 percent, and those that trade infrequently earn 18.5 percent. These results are consistent with models where trading emanates from investor overconfidence, but are inconsistent with models where trading results from rational expectations. Though liquidity, risk- based rebalancing, and taxes can explain some trading activity, we argue that it belies common sense that these motivations for trade, even in com- bination, can explain average annual turnover of more than 250 percent for those households that trade most. We also document that, overall, the households we analyze significantly underperformrelevantbenchmarks,afterareasonableaccountingfortrans- actioncosts.Thesehouseholdsearngrossreturns~beforeaccountingfortrans- action costs! that are close to those earned by an investment in a value- weighted index of NYSE0AMEX0Nasdaq stocks. During our sample period, an investment in a value-weighted market index earns an annualized geo- metric mean return of 17.9 percent, the average household earns a gross return of 18.7 percent, and in aggregate households earn a gross return of 18.2 percent. In contrast, the net performance ~after accounting for the bid- ask spread and commissions! of these households is below par, with the av- erage household earning 16.4 percent and in aggregate households earning 16.7 percent. The empirical tests supporting these conclusions come from abnormalreturncalculationsthatalloweachhouseholdtoself-selectitsown 1Inanexceptiontothisfinding,KyleandWang~1997!arguethatwhentraderscompetefor duopoly profits, overconfident traders may reap greater profits. This prediction is based on severalassumptionsthatdonotapplytoindividualstradingcommonstocks.Benos~1998!has asimilarresult.Daniel,Hirshleifer,andSubrahmanyam~1998!considertheassetpriceimpli- cations of overconfidence but do not directly address investor welfare.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 34,
    "chunk_index": 1,
    "word_count": 442,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "with the av- erage household earning 16.4 percent and in aggregate households earning 16.7 percent. The empirical tests supporting these conclusions come from abnormalreturncalculationsthatalloweachhouseholdtoself-selectitsown 1Inanexceptiontothisfinding,KyleandWang~1997!arguethatwhentraderscompetefor duopoly profits, overconfident traders may reap greater profits. This prediction is based on severalassumptionsthatdonotapplytoindividualstradingcommonstocks.Benos~1998!has asimilarresult.Daniel,Hirshleifer,andSubrahmanyam~1998!considertheassetpriceimpli- cations of overconfidence but do not directly address investor welfare. Trading Is Hazardous to Your Wealth 775 Figure1.Monthlyturnoverandannualperformanceofindividualinvestors.Thewhite bar~blackbar!representsthegross~net!annualizedgeometricmeanreturnforFebruary1991 throughJanuary1997forindividualinvestorquintilesbasedonmonthlyturnover,theaverage individualinvestor,andtheS&P500.ThenetreturnontheS&P500IndexFundisthatearned by the Vanguard Index 500. The gray bar represents the monthly turnover. investment style and from time-series regressions that employ either the CapitalAsset Pricing Model ~CAPM! or the three-factor model developed by Fama and French ~1993! as our benchmark. Our descriptive analysis provides several additional conclusions that are noteworthy: 1. Households2 trade common stocks frequently. The average household turnsovermorethan75percentofitscommonstockportfolioannually. 2. Tradingcostsarehigh.Theaverageround-triptradeinexcessof$1,000 costs three percent in commissions and one percent in bid-ask spread. 3. Householdstilttheirinvestmentstowardsmall,high-betastocks.There is a less obvious tilt toward value ~high book-to-market! stocks. 2Throughout this paper, “households” and “individual investors” refer to households and investorswithdiscountbrokerageaccounts.Thoughwebelievethatourfindingsgeneralizeto customersatotherdiscountbrokerages,wesuspectthatthetradingpracticesofretailcustom- ersdiffer.Someofoursamplehouseholdsmayhavebothretailanddiscountaccounts.Inthese cases, our observations are limited to their discount accounts.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 3,
    "page_range": "p.3-4",
    "total_pages": 34,
    "chunk_index": 2,
    "word_count": 168,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.3-4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "household turnsovermorethan75percentofitscommonstockportfolioannually. 2. Tradingcostsarehigh.Theaverageround-triptradeinexcessof$1,000 costs three percent in commissions and one percent in bid-ask spread. 3. Householdstilttheirinvestmentstowardsmall,high-betastocks.There is a less obvious tilt toward value ~high book-to-market! stocks. 2Throughout this paper, “households” and “individual investors” refer to households and investorswithdiscountbrokerageaccounts.Thoughwebelievethatourfindingsgeneralizeto customersatotherdiscountbrokerages,wesuspectthatthetradingpracticesofretailcustom- ersdiffer.Someofoursamplehouseholdsmayhavebothretailanddiscountaccounts.Inthese cases, our observations are limited to their discount accounts. 776 The Journal of Finance Itisthecostoftradingandthefrequencyoftrading,notportfolioselections, thatexplainthepoorinvestmentperformanceofhouseholdsduringoursam- ple period. In fact, the tilt of households toward small stocks and, to a lesser extent, value stocks helps their performance during our sample period ~dur- ing which small stocks outperform large stocks by 15 basis points per month and value outperforms growth by 20 basis points per month!.3 The remainder of this paper is organized as follows. We discuss related research in Section I and our data and empirical methods in Section II. Our main descriptive results are presented in Section III. We test the models of investor overconfidence in Section IV. We discuss the impact of price mo- mentum on individual investor performance in Section V and liquidity, risk, and taxes as motivations for trading in Section VI. Concluding remarks are made in Section VII. I. Related Research To our knowledge, the current investigation is the first comprehensive study of the aggregate common stock performance of individual investors who manage their own equity investments without the advice of a full- service broker. Schlarbaum, Lewellen, and Lease ~1978a! analyze the aggre- gatecommonstockperformanceofinvestorsatafull-servicebrokeragefirm. Odean~1999!andSchlarbaum,Lewellen,andLease~1978b!analyzetheprof- itability of common stock trades ~as distinct from positions held! by individ- ual investors. Schlarbaum et al. ~1978a! calculate monthly gross and net portfolio re- turns for 2,500 accounts at a retail brokerage firm over a seven-year period ending in December 1970. In a separate paper, Schlarbaum et al. ~1978b! analyze the gross and net returns of round-trip trades made by the same 2,500 accounts over the same period. Though they emphasize that their re- sults are conjectural, they conclude that their results “portray an overall picture of quite respectable individual investor security selection acumen.” In contrast, we document that individual investors at a discount brokerage firm during the six-year period ending January 1997 perform poorly. Thereareatleastthreereasonswhyourresultsmightdifferfromthosein Schlarbaum et al. ~1978a, 1978b!. First, we analyze households that hold their investments at a discount brokerage firm rather than at a retail bro- kerage firm. A wide variety of investment advice is available to both retail anddiscountinvestorsfromsourcessuchasnewsletters,ValueLine,andthe financial press. Retail brokerage firms also provide stock selection advice to their clients. If this advice is valuable and if investors attend to it, it is 3ThesefiguresarebasedonthemeanreturnfromFebruary1991throughJanuary1997for thesizeandbook-to-marketfactorsconstructedbyFamaandFrench~1993!.Intheremainder ofthispaper,whenwerefertoasizeorvaluepremium,ourinferenceisbasedonthereturns of these zero-investment portfolios.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 34,
    "chunk_index": 3,
    "word_count": 419,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "a retail bro- kerage firm. A wide variety of investment advice is available to both retail anddiscountinvestorsfromsourcessuchasnewsletters,ValueLine,andthe financial press. Retail brokerage firms also provide stock selection advice to their clients. If this advice is valuable and if investors attend to it, it is 3ThesefiguresarebasedonthemeanreturnfromFebruary1991throughJanuary1997for thesizeandbook-to-marketfactorsconstructedbyFamaandFrench~1993!.Intheremainder ofthispaper,whenwerefertoasizeorvaluepremium,ourinferenceisbasedonthereturns of these zero-investment portfolios.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 34,
    "chunk_index": 4,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "Trading Is Hazardous to Your Wealth 777 plausible that individual investors at these firms earn both better gross returns and net returns. We would welcome the opportunity to test this hypothesis directly by obtaining a data set similar to that employed in our study from a retail brokerage firm. Barber et al. ~1998! and Womack ~1996! presentevidencethattherecommendationsofbrokerage-houseanalystshave investment value. Second, the analysis in Schlarbaum et al. ~1978b! focuses on the returns from round-trip trades. There is now evidence that investors have a ten- dency to sell winning investments and hold on to losing investments ~Odean ~1998a!!. Thus, by analyzing trades rather than position statements ~as we do in the current study!, Schlarbaum et al. may upwardly bias their return estimates. Schlarbaum et al. ~1978a! do attempt to reconstruct monthly po- sitionsfromtradingrecordsandpartialend-of-periodpositions.However,as they point out, stocks purchased before 1964 and sold after 1970 may not appear in their study. Third, although Schlarbaum et al. ~1978a, 1978b! evaluate performance using a variety of market indexes, they do not consider the tendency for individual investors to tilt toward small stocks ~though of course firm size did not have the same celebrity status in 1978 that it enjoys today!. They do not explicitly address whether such a tilt exists among the individual inves- tors they analyze, but we suspect that it does. This small-stock tilt is likely to be extremely important because small stocks outperform large stocks by 67 basis points per month during their sample period. As do Schlarbaum et al. ~1978b!, Odean ~1999! focuses on the trades of individual investors. He analyzes the timing of trades made by individual investors at a large discount brokerage firm during the seven years ending in December 1993, a sample period that overlaps with ours. ~The data sets employed in Odean ~1999! and this study are different.! He documents that thestocksindividualssellsubsequentlyoutperformthestockstheybuy.Thus, the implications of his study and the current investigation are similar: In- dividual investors trade too much. However, Odean does not analyze the aggregate performance of all stocks held by individuals. Consequently, he is unable to conclude whether individual investors perform well in aggregate, which is the focus of our investigation. II. Data and Methods A. Household Account Data The primary data set for this research is information from a large dis- countbrokeragefirmontheinvestmentsof78,000householdsfromJanuary 1991 through December 1996.4 Of the sampled households, 42 percent are in 4The month-end position statements for this period allow us to calculate returns for Feb- ruary 1991 through January 1997. Data on trades are from January 1991 through November 1996.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 34,
    "chunk_index": 5,
    "word_count": 419,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "this research is information from a large dis- countbrokeragefirmontheinvestmentsof78,000householdsfromJanuary 1991 through December 1996.4 Of the sampled households, 42 percent are in 4The month-end position statements for this period allow us to calculate returns for Feb- ruary 1991 through January 1997. Data on trades are from January 1991 through November 1996.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 34,
    "chunk_index": 6,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "778 The Journal of Finance the western part of the United States, 19 percent in the East, 24 percent in theSouth,and15percentintheMidwest.Thedatasetincludesallaccounts opened by each household at this discount brokerage firm. The sample se- lection was performed at the household level and was stratified based on whether the discount brokerage firm labeled the household as a general ~60,000 households!, affluent ~12,000 households!, or active trader house- hold~6,000households!.Thefirmlabelshouseholdsthatmakemorethan48 trades in any year as active traders, households with more than $100,000 in equity at any point in time as affluent, and all other households as general. If a household qualifies as either active trader or affluent, it is assigned the active trader label. In 1997, approximately 61 percent of all retail accounts atthisbrokeragefirmwereclassifiedasgeneral,28percentasaffluent,and 11 percent as active. Sampled households were required to have an open account with the discount brokerage firm during 1991. Roughly half of the accounts in our analysis were opened prior to 1987 and half were opened between 1987 and 1991. In this research, we focus on the common stock investments of house- holds. We exclude from the current analysis investments in mutual funds ~both open-end and closed-end!,American Depositary Receipts ~ADRs!, war- rants, and options. Of the 78,000 sampled households, 66,465 have posi- tions in common stocks during at least one month; the remaining accounts hold either cash or investments in other than individual common stocks. Households have, on average, two accounts: 48 percent have a single ac- count, 27 percent have two, 14 percent have three, and the remaining 11 percent have more than three. The most common reason for two ac- counts is the tax-preferred status of retirement accounts ~e.g., IRAs and Keoghs!. Some households also have different accounts for different house- hold members ~e.g., custodial accounts for children!. Roughly 60 percent of the market value in the accounts is held in common stocks. In these house- holds, more than 3 million trades are made in all securities during the sample period, with common stocks accounting for slightly more than 60 percent of all trades. On average during our sample period, the mean house- hold holds 4.3 stocks worth $47,334, though each of these figures is posi- tively skewed. The median household holds 2.61 stocks worth $16,210. In December 1996, these households held more than $4.5 billion in common stock. In Table I, we present descriptive information on the trading activity for oursample.PanelsAandBshowthereareslightlymorepurchases~1,082,107! than sales ~887,594! during our sample period, though the average value of stocks sold ~$13,707! is slightly higher than the value of stocks purchased ~$11,205!.As a result, the aggregate value of purchases and sales is roughly equal ~$12.1 and $12.2 billion, respectively!. The average trade is transacted at a price of $31 per share. The value of trades and the transaction price of trades are positively skewed; the medians for both purchases and sales are substantially less than the mean values.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 34,
    "chunk_index": 7,
    "word_count": 476,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "purchases and sales is roughly equal ~$12.1 and $12.2 billion, respectively!. The average trade is transacted at a price of $31 per share. The value of trades and the transaction price of trades are positively skewed; the medians for both purchases and sales are substantially less than the mean values.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 34,
    "chunk_index": 8,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "Trading Is Hazardous to Your Wealth 779 TableI Descriptive Statistics on Trade Size, Trade Price, Transaction Costs, and Turnover The sample is account records for 66,465 households at a large discount brokerage firm from January 1991 to December 1996. Spread is calculated as the transaction price divided by the closing price on the day of the transaction minus one ~and then multiplied by minus one for purchases!.Commissioniscalculatedasthecommissionpaiddividedbythevalueofthetrade. Monthlyturnoveristhebeginning-of-monthmarketvalueofsharespurchasedinmontht21 ~or sold in month t! divided by the total beginning-of-month market value of shares held in month t. Trade-weighted spread and commission are averages weighted by trade size.Aggre- gate turnover is the aggregate value of sales ~or purchases! divided by the aggregate value of positions held during our sample period. 25th 75th Standard No. of Mean Percentile Median Percentile Deviation Obs. PanelA: Purchases Trade size ~$! 11,205 2,513 4,988 10,500 32,179 1,082,107 Price0share 31.06 11.00 23.00 40.00 117.82 1,082,107 Monthly turnover ~%! 6.49 0.54 2.67 7.08 11.89 66,465 Commission ~%!* 1.58 0.78 1.29 2.10 1.45 966,492 Spread~%! 0.31 1,028,087 Panel B: Sales Trade size ~$! 13,707 2,688 5,738 13,000 38,275 887,594 Price0share 31.22 12.00 24.00 41.00 113.03 887,594 Monthly turnover ~%! 6.23 0.39 2.58 6.95 11.36 66,465 Commission ~%!* 1.45 0.70 1.16 1.91 1.06 785,206 Spread ~%! 0.69 845,644 Panel C: Trade-Weighted andAggregate Purchases Aggregate monthly 6.05 turnover ~%! Trade-weighted 0.77 NotApplicable commission ~%! Trade-weighted 0.27 spread ~%! Panel D: Trade-Weighted Sales Aggregate monthly 6.06 turnover ~%! Trade-weighted 0.66 Not applicable commission ~%! Trade-weighted 0.61 spread ~%! *Commissions are calculated based on trades in excess of $1,000. Including smaller trades results in a mean buy ~sale! commission of 2.09 ~3.07! percent.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 34,
    "chunk_index": 9,
    "word_count": 269,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "NotApplicable commission ~%! Trade-weighted 0.27 spread ~%! Panel D: Trade-Weighted Sales Aggregate monthly 6.06 turnover ~%! Trade-weighted 0.66 Not applicable commission ~%! Trade-weighted 0.61 spread ~%! *Commissions are calculated based on trades in excess of $1,000. Including smaller trades results in a mean buy ~sale! commission of 2.09 ~3.07! percent.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 34,
    "chunk_index": 10,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "780 The Journal of Finance For each trade, we estimate the bid-ask spread component of transaction costs for purchases ~spr ! and sales ~spr ! as db ds S D S D Pcl Pcl spr 5 ds 21 and spr 52 db 21 , ~1! ds Ps db Pb ds db where Pcl and Pcl are the reported closing prices from the Center for Re- ds db search in Security Prices ~CRSP! daily stock return files on the day of a sale and purchase, respectively, and Ps and Pb are the actual sale price and ds db purchasepricefromouraccountdatabase.5Ourestimateofthebid-askspread component of transaction costs includes any market impact that might re- sultfromatrade.Italsoincludesanintradayreturnonthedayofthetrade. ~In Appendix A, we provide a detailed reconciliation of our return calcula- tions.! The commission component of transaction costs is estimated as the dollar value of the commission paid scaled by the total principal value of the transaction, both of which are reported in our account data. The average purchase costs an investor 0.31 percent, and the average sale costs an investor 0.69 percent in bid-ask spread. Our estimate of the bid-ask spreadisveryclosetothetradingcostof0.21percentforpurchasesand0.63 percent for sales paid by open-end mutual funds from 1966 to 1993~Carhart ~1997!!.6 The average purchase in excess of $1,000 costs 1.58 percent in com- missions, and the average sale in excess of $1,000 costs 1.45 percent.7 InPanelsCandDofTableI,wecalculatethetrade-weighted~weightedby trade size! spreads and commissions. These figures can be thought of as the total cost of conducting the $24 billion in common stock trades ~$12 billion eachinpurchasesandsales!.Tradesizehaslittleeffectonspreadcosts~0.27 percent for purchases and 0.69 percent for sales! but substantially reduces the commission costs ~0.77 percent for purchases and 0.66 percent for sales!. Insum,theaveragetradeincursaround-triptransactioncostofaboutone percent for the bid-ask spread and about three percent in commissions. In aggregate, round-trip trades cost about one percent for the bid-ask spread and about 1.4 percent in commissions. 5Kraus and Stoll ~1972!, Holthausen, Leftwich, and Mayers ~1987!, Laplante and Musca- rella ~1997!, and Beebower and Priest ~1980! use closing prices either before or following a transaction to estimate effective spreads and market impact. See Keim and Madhavan ~1998! for a review of different approaches to calculating transactions costs. 6Odean~1999!findsthatindividualinvestorsaremorelikelytobothbuyandsellparticular stockswhenthepricesofthosestocksarerising.Thistendencycanpartiallyexplaintheasym- metryinbuyandsellspreads.Anyintradaypricerisesfollowingtransactionssubtractfromour estimate of the spread for buys and add to our estimate of the spread for sells. 7To provide more representative descriptive statistics on percentage commissions, we ex- cludetradesoflessthan$1,000.Theinclusionofthesetradesresultsinaround-tripcommis- sion cost of five percent on average ~2.1 percent for purchases and 3.1 percent for sales!.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 34,
    "chunk_index": 11,
    "word_count": 398,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "calculating transactions costs. 6Odean~1999!findsthatindividualinvestorsaremorelikelytobothbuyandsellparticular stockswhenthepricesofthosestocksarerising.Thistendencycanpartiallyexplaintheasym- metryinbuyandsellspreads.Anyintradaypricerisesfollowingtransactionssubtractfromour estimate of the spread for buys and add to our estimate of the spread for sells. 7To provide more representative descriptive statistics on percentage commissions, we ex- cludetradesoflessthan$1,000.Theinclusionofthesetradesresultsinaround-tripcommis- sion cost of five percent on average ~2.1 percent for purchases and 3.1 percent for sales!.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 34,
    "chunk_index": 12,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "Trading Is Hazardous to Your Wealth 781 Finally,wecalculatethemonthlyportfolioturnoverforeachhousehold.In each month during our sample period, we identify the common stocks held by each household at the beginning of month t from their position state- ments.Tocalculatemonthlysalesturnover,wematchthesepositionstosales during month t. The monthly sales turnover is calculated as the shares sold timesthebeginning-of-monthpricepersharedividedbythetotalbeginning- of-month market value of the household’s portfolio. To calculate monthly purchaseturnover,wematchthesepositionstopurchasesduringmontht21. The monthly purchase turnover is calculated as the shares purchased times the beginning-of-month price per share divided by the total beginning-of- month market value of the portfolio.8 In PanelsAand B of Table I we report that, on average, households purchase 6.49 percent and sell 6.23 percent of their stock portfolio each month, though the median household trades much less frequently ~buying 2.67 percent of their stock portfolio and selling 2.58 percent!. In Panels C and D, we calculate aggregate purchase ~sales! turn- over by summing all purchases ~sales! and dividing by the sum of all posi- tions during our sample period. The aggregate purchase turnover is 6.05 percent and the aggregate sales turnover is 6.06 percent. In sum, these investors trade their common stocks quite frequently. The average household turns over more than 75 percent of its common stock portfolio each year. This result is uncannily close to the average turnover of 77 percent reported by U.S. common stock mutual funds for the period 1966 to 1993 ~Carhart ~1997!!. In aggregate, these investors turn over more than 70 percent of their invested wealth each year. B. Measuring Return Performance Thefocusofouranalysisisthereturnperformanceofinvestmentsincom- mon stocks by households. We analyze both the gross performance and net performance ~after a reasonable accounting for commissions, the bid-ask spread, and the market impact of trades!. We estimate the gross monthly return on each common stock investment using the beginning-of-month position statements from our household data and the CRSP monthly returns file. In so doing, we make two simplifying assumptions. First, we assume that all securities are bought or sold on the last day of the month. Thus, we ignore the returns earned on stocks pur- chased from the purchase date to the end of the month and include the returns earned on stocks sold from the sale date to the end of the month. 8If more shares are sold than were held at the beginning of the month ~e.g., because an investor purchases additional shares after the beginning of the month!, we assume the entire beginning-of-monthpositioninthatsecurityissold.Similarly,ifmoreshareswerepurchasedin theprecedingmonththanareheldinthepositionstatement,weassumetheentirepositionis purchasedintheprecedingmonth.Thus,turnover,aswehavecalculatedit,cannotexceed100 percent in a month.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 34,
    "chunk_index": 13,
    "word_count": 404,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "stocks sold from the sale date to the end of the month. 8If more shares are sold than were held at the beginning of the month ~e.g., because an investor purchases additional shares after the beginning of the month!, we assume the entire beginning-of-monthpositioninthatsecurityissold.Similarly,ifmoreshareswerepurchasedin theprecedingmonththanareheldinthepositionstatement,weassumetheentirepositionis purchasedintheprecedingmonth.Thus,turnover,aswehavecalculatedit,cannotexceed100 percent in a month.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 34,
    "chunk_index": 14,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "782 The Journal of Finance Second, we ignore intramonth trading ~e.g., a purchase on March 6 and a sale of the same security on March 20!, though we do include in our analysis short-term trades that yield a position at the end of a calendar month. InAppendixA,wedocumentthataccountingfortheexacttimingoftrades would reduce the performance of individual investors by about two basis points per month. In Appendix B, we document that accounting for intra- month trades would improve the performance of individual investors re- ported in our main results by less than one basis point per month. More important, a careful accounting for both the exact timing of trades and the profitability of intramonth trades indicates that the results we report in the main text are slightly high for our full sample and for every sample parti- tion that we analyze. Consider the common stock portfolio for a particular household. The gross monthly return on the household’s portfolio ~Rgr! is calculated as ht s ht Rgr5 ( p Rgr, ~2! ht it it i51 where p is the beginning-of-month market value for the holding of stock i it by household h in month t divided by the beginning-of-month market value of all stocks held by household h, Rgr is the gross monthly return for stock it i, and s is the number of stocks held by household h in month t. ht For security i in month t, we calculate a monthly return net of transaction costs ~Rnet! as it ~12cs! ~11Rnet!5~11Rgr! it , ~3! it it ~11cb ! i,t21 where cs is the cost of sales scaled by the sales price in month t and cb is it i,t21 the cost of purchases scaled by the purchase price in month t21. The costs of purchases and sales include the commissions and bid-ask spread compo- nents, which are estimated individually for each trade as previously de- scribed. Thus, for a security purchased in month t21 and sold in month t, both cs and cb are positive; for a security neither purchased in month it i,t21 t21 nor sold in month t, both cs and cb are zero. Because the timing and it i,t21 cost of purchases and sales vary across households, the net return for secu- rity i in month t varies across households. The net monthly portfolio return for each household is s ht Rnet5 ( p Rnet. ~4! ht it it i51",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 34,
    "chunk_index": 15,
    "word_count": 400,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "cb are zero. Because the timing and it i,t21 cost of purchases and sales vary across households, the net return for secu- rity i in month t varies across households. The net monthly portfolio return for each household is s ht Rnet5 ( p Rnet. ~4! ht it it i51",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 34,
    "chunk_index": 16,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "Trading Is Hazardous to Your Wealth 783 Ifonlyaportionofthebeginning-of-monthpositioninstockiispurchasedor sold, the transaction cost is applied only to that portion. We estimate the aggregate gross and net monthly return earned by individual investors as n n ht ht RAGgr5 ( x Rgr and RAGnet5 ( x Rnet, ~5! t ht ht t ht ht h51 h51 where n is the number of households with common stock investment in ht month t and x is the beginning-of-month market value of common stocks ht heldbyhouseholdhdividedbythebeginning-of-monthmarketvalueofcom- mon stock held by all households. We estimate the gross and net monthly return earned by the average household as 1 n ht 1 n ht RHgr5 ( Rgr and RHnet5 ( Rnet. ~6! t n ht t n ht ht h51 ht h51 C. Risk-Adjusted Return Performance We calculate four measures of risk-adjusted performance.9 First, we cal- culateanown-benchmarkabnormalreturnforindividualinvestors,whichis similar in spirit to that proposed by Grinblatt and Titman ~1993! and La- konishok, Shleifer, and Vishny ~1992!. In this abnormal return calculation, the benchmark for household h is the month t return of the beginning-of- yearportfolioheldbyhouseholdh.10Itrepresentsthereturnthatthehouse- holdwouldhaveearnedhaditmerelyhelditsbeginning-of-yearportfoliofor the entire year. The own-benchmark abnormal return is the return earned by household h less the own-benchmark return; if the household did not trade during the year, the own-benchmark return is zero for all 12 months during the year. In each month, the abnormal returns across households are averaged, yielding a 72-month time-series of mean monthly own-benchmark abnormalreturns.Statisticalsignificanceiscalculatedusingt-statisticsbased on this time-series. The advantage of the own-benchmark abnormal return 9Afifth alternative measure of risk-adjusted returns is the Sharpe ratio, the mean excess returndividedbyitsstandarddeviation.TheaverageSharperatioforthegross~net!returnof theaveragehouseholdinoursampleis0.179 ~0.134!.TheSharperatioforthemarketduring our sample period is 0.3665~1.057802.8880!. We do not report Sharpe ratios for most parti- tions of the data because we do not observe the entire portfolios of these households. Unob- servedassetssuchasequitiesatotherbrokeragefirmsandmutualfundholdingsareunlikely to greatly change average observed portfolio returns, but they are likely to reduce average observedvolatility.ThuswetendtounderestimatethetotalportfolioSharperatiosofinvestors with significant unobserved assets. 10Whencalculatingthisbenchmark,webegintheyearonFebruary1.Wedosobecauseour firstmonthlypositionstatementsarefromthemonthendofJanuary1991.Ifthestocksheld byahouseholdatthebeginningoftheyeararemissingCRSPreturnsdataduringtheyear,we assume that stock is invested in the remainder of the household’s portfolio.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 34,
    "chunk_index": 17,
    "word_count": 327,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "of the data because we do not observe the entire portfolios of these households. Unob- servedassetssuchasequitiesatotherbrokeragefirmsandmutualfundholdingsareunlikely to greatly change average observed portfolio returns, but they are likely to reduce average observedvolatility.ThuswetendtounderestimatethetotalportfolioSharperatiosofinvestors with significant unobserved assets. 10Whencalculatingthisbenchmark,webegintheyearonFebruary1.Wedosobecauseour firstmonthlypositionstatementsarefromthemonthendofJanuary1991.Ifthestocksheld byahouseholdatthebeginningoftheyeararemissingCRSPreturnsdataduringtheyear,we assume that stock is invested in the remainder of the household’s portfolio.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 34,
    "chunk_index": 18,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "784 The Journal of Finance measure is that it does not adjust returns according to a particular risk model. No model of risk is universally accepted; furthermore, it may be in- appropriatetoadjustinvestors’returnsforstockcharacteristicsthattheydo not associate with risk. The own-benchmark measure allows each household to self-select the investment style and risk profile of its benchmark ~i.e., the portfolio it held at the beginning of the year!, thus emphasizing the effect trading has on performance. Second, we calculate the mean monthly market-adjusted abnormal return for individual investors by subtracting the return on a value-weighted index ofNYSE0AMEX0Nasdaqstocksfromthereturnearnedbyindividualinvestors. Third, we employ the theoretical framework of the capital asset pricing model and estimate Jensen’s alpha by regressing the monthly excess return earned by individual investors on the market excess return. For example, to evaluate the gross monthly return earned by individual investors in aggre- gate, we estimate the following monthly time-series regression: ~RAGgr2R !5a 1b ~R 2R !1e , ~7! t ft i i mt ft it where R 5the monthly return on T-bills,11 R 5the monthly return on a ft mt value-weighted market index, a 5 the CAPM intercept ~Jensen’s alpha!, i b 5 the market beta, and e 5 the regression error term. The subscript i i it denotes parameter estimates and error terms from regression i, where we estimate four regressions: one each for the gross and net performance of individual investors in aggregate, and one each for the gross and net per- formance of the average household. Fourth, we employ an intercept test using the three-factor model devel- oped by Fama and French ~1993!. For example, to evaluate the performance of individuals in aggregate, we estimate the following monthly time-series regression: ~RAGgr2R !5a 1b ~R 2R !1s SMB 1h HML 1e , ~8! t ft j j mt ft j t j t jt where SMB is the return on a value-weighted portfolio of small stocks mi- t nus the return on a value-weighted portfolio of large stocks andHML is the t return on a value-weighted portfolio of high book-to-market stocks minus the return on a value-weighted portfolio of low book-to-market stocks.12 The regression yields parameter estimates of a , b , s , and h . The error term in j j j j theregressionisdenotedbye .Thesubscriptjdenotesparameterestimates jt and error terms from regression j, where we again estimate four regres- 11The return on Treasury bills is from Stocks, Bonds, Bills, and Inflation, 1997 Yearbook, IbbotsonAssociates, Chicago, Ill. 12TheconstructionoftheseportfoliosisdiscussedindetailinFamaandFrench~1993!.We thank Kenneth French for providing us with these data.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 34,
    "chunk_index": 19,
    "word_count": 415,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "The error term in j j j j theregressionisdenotedbye .Thesubscriptjdenotesparameterestimates jt and error terms from regression j, where we again estimate four regres- 11The return on Treasury bills is from Stocks, Bonds, Bills, and Inflation, 1997 Yearbook, IbbotsonAssociates, Chicago, Ill. 12TheconstructionoftheseportfoliosisdiscussedindetailinFamaandFrench~1993!.We thank Kenneth French for providing us with these data.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 34,
    "chunk_index": 20,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "Trading Is Hazardous to Your Wealth 785 sions. We place particular emphasis on the Fama–French intercept tests, sinceindividualinvestorstilttheirportfoliostowardsmallstocks.Thethree- factor model provides a reasonable adjustment for this small stock tilt.13 Fama and French ~1993! argue that the risk of common stock investments can be parsimoniously summarized as risk related to the market, firm size, and a firm’s book-to-market ratio. We measure these three risk exposures using the coefficient estimates on the market excess return ~R 2R !, the mt ft sizezeroinvestmentportfolio~SMB !,andthebook-to-marketzero-investment t portfolio ~HML ! from the three-factor regressions. Portfolios with above- t average market risk have betas greater than one, b . 1. Portfolios with a j tilt toward small ~value! stocks relative to a value-weighted market index have size ~book-to-market! coefficients greater than zero, s . 0 ~h . 0!. j j We suspect there is little quibble with interpreting the coefficient on the market excess return ~b ! as a risk factor. Interpreting the coefficient esti- j mates on the size and the book-to-market zero-investment portfolios is more controversial. For the purposes of this investigation, we are interested in measuringriskasperceivedbyindividualinvestors.Assuch,itisourcasual observation that investors view common stock investment in small firms as riskier than that in large firms. Thus, we would willingly accept a stronger tilt toward small stocks as evidence that a particular group of investors is pursuing a strategy that it perceives as riskier. It is less clear to us whether a tilt toward high book-to-market stocks ~which tend to be ugly, financially distressed, firms! or toward low book-to-market stocks ~which tend to be high-growthfirms!isperceivedasriskierbyinvestors.Assuch,weinterpret thecoefficientestimatesonthebook-to-marketzero-investmentportfoliowith a bit more trepidation.14 III. Results A. Full Sample Results Our main findings for the full sample can be summarized simply. The gross return earned by individual investors in aggregate ~RAGgr! and the t gross return earned by the average household ~RHgr! are remarkably close t to that earned by an investment in a value-weighted index of NYSE0AMEX0 Nasdaq stocks.15 The annualized geometric mean return earned by individ- 13Lyon,Barber,andTsai~1999!documentthatintercepttestsusingthethree-factormodel are well specified in random samples and samples of large or small firms. Thus, the Fama– Frenchintercepttestsemployedhereaccountwellforthesmallstocktiltofindividualinvestors. 14Some authors have also identified price momentum effects in stock returns. We discuss momentum in Section V. 15WeusetheNYSE0AMEX0Nasdaqvalue-weightedmarketindexconstructedbyFamaand French ~1993!. Firms comprising the index must have data for firm size and book-to-market ratio.ThecorrelationbetweenthismarketindexandtheNYSE0AMEX0Nasdaqvalue-weighted index from CRSPis 99.9 percent.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 34,
    "chunk_index": 21,
    "word_count": 384,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "samples and samples of large or small firms. Thus, the Fama– Frenchintercepttestsemployedhereaccountwellforthesmallstocktiltofindividualinvestors. 14Some authors have also identified price momentum effects in stock returns. We discuss momentum in Section V. 15WeusetheNYSE0AMEX0Nasdaqvalue-weightedmarketindexconstructedbyFamaand French ~1993!. Firms comprising the index must have data for firm size and book-to-market ratio.ThecorrelationbetweenthismarketindexandtheNYSE0AMEX0Nasdaqvalue-weighted index from CRSPis 99.9 percent.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 34,
    "chunk_index": 22,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "786 The Journal of Finance ual investors in aggregate, the average household, and the value-weighted market index are 18.2, 18.7, and 17.9 percent, respectively. In contrast, the net returns earned by individual investors in aggregate ~RAGnet! and t the net return earned by the average household ~RHnet! underperform the t value-weighted index by more than 100 basis points annually. The net an- nualized geometric mean return earned by individual investors in aggregate and by the average household are 16.7 and 16.4 percent, respectively. The results of this analysis are presented in Table II. Panel A presents resultsforthegrossperformanceof individualinvestorsinaggregate,PanelB presents results for the average household. Three of the four performance measures indicate that the gross performance of individual investors is un- remarkable; neither the market-adjusted return, Jensen’s alpha, nor the in- tercept test from the Fama–French three-factor model is reliably different from zero. The fourth performance measure, the own-benchmark abnormal return, is reliably negative. This result indicates that the investors would have earned higher returns from following a buy-and-hold strategy; they hurt their gross performance by trading. Also noteworthy in these results are the coefficient estimates on the mar- ket, size, and book-to-market factors. Individual investors tilt toward small stocks with high market risk. The market beta for stocks held by individual investors is reliably greater than one and the coefficient estimate on SMB t is reliably positive. Though in aggregate individual investors have no tilt towardvalueorgrowth,theaveragehouseholdhasaslighttilttowardvalue stocks ~those with high book-to-market ratios! and a more pronounced tilt toward small stocks.16 These tilts serve individual investors well during our periodofanalysis;themeanmonthlyreturnsonSMB andHML duringour t t 72-month sample period are 0.15 and 0.20 percent, respectively. This obser- vation can account for the fact that the market-adjusted return performance of individual investors is positive ~albeit unreliably so!, while Jensen’s alpha ~CAPM intercept! and the intercept test from the Fama–French three-factor model are negative. The style preferences of individual investors complement those of institu- tions. Institutional investors have a clear preference for large stocks. Gomp- ersandMetrick~1998!documentthispreferenceforlargeinstitutions;Carhart ~1997! and Falkenstein ~1996! document a similar bias for mutual funds.As is the case for individual investors, the growth or value preference of insti- tutions is less obvious. Gompers and Metrick ~1998! document that large institutions prefer value stocks, but Carhart ~1997, Table III! documents that mutual fund holdings tilt toward growth stocks.17 16Aggregatemeasuresweighteachhouseholdbythevalueofthathousehold’scommonstocks. Average household measures weight each household equally. 17KangandStulz~1997!documentthatforeigninvestorsinJapaneseequitymarketsprefer large growth stocks. It is likely that these foreign investors are predominantly institutions.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 34,
    "chunk_index": 23,
    "word_count": 406,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "is less obvious. Gompers and Metrick ~1998! document that large institutions prefer value stocks, but Carhart ~1997, Table III! documents that mutual fund holdings tilt toward growth stocks.17 16Aggregatemeasuresweighteachhouseholdbythevalueofthathousehold’scommonstocks. Average household measures weight each household equally. 17KangandStulz~1997!documentthatforeigninvestorsinJapaneseequitymarketsprefer large growth stocks. It is likely that these foreign investors are predominantly institutions. Trading Is Hazardous to Your Wealth 787 TableII Summary of the Percentage Monthly Abnormal Return Measures for the Average Household and Aggregate Household Returnsarebasedonmonth-endpositionstatementsfor66,465householdsatalargediscount brokeragefirmfromJanuary1991toDecember1996.PanelA~PanelC!presentsresultsforthe gross~net!returnonaportfoliothatmimicstheaggregateinvestmentofallhouseholds.Panel B~PanelD!presentsresultsforthegross~net!returnonaportfoliothatmimicstheinvestment of the average household. Own-benchmark abnormal return is the return on the household portfoliominusthereturnontheportfoliothehouseholdheldattheendofthepreviousJan- uary. Market-adjusted return is the return on the household portfolio less the return on a value-weightedNYSE0AMEX0Nasdaqindex.CAPMistheresultsfromatime-seriesregression of the household excess return on the market excess return ~R 2R !. Fama–French three- mt ft factor is the results from time-series regression of household excess return on the market ex- cess return, a zero-investment book-to-market portfolio ~HML !, and a zero-investment size t portfolio ~SMB !. p-values are presented in parentheses. t CoefficientEstimateon: Excess Adjusted Return ~R 2R ! HML SMB R2 mt ft t t PanelA:GrossPercentageMonthlyReturnsinAggregate Own-benchmarkabnormalreturn 20.049** ~0.013! Market-adjustedreturn 0.038 ~0.723! CAPM 20.067 1.100*** 92.9 ~0.543! ~0.007! Fama–Frenchthree-factor 20.076 1.082*** 20.035 0.231*** 96.3 ~0.357! ~0.005! ~0.324! ~0.000! PanelB:GrossPercentageMonthlyReturnsfortheAverageHousehold Own-benchmarkabnormalreturn 20.048** ~0.010! Market-adjustedreturn 0.078 ~0.672! CAPM 20.014 1.087 80.3 ~0.944! ~0.177! Fama–Frenchthree-factor 20.154 1.120*** 0.140*** 0.516*** 93.0 ~0.205! ~0.005! ~0.008! ~0.000! PanelC:NetPercentageMonthlyReturnsinAggregate Own-benchmarkabnormalreturn 20.155*** ~0.000! Market-adjustedreturn 20.073 ~0.496! CAPM 20.175 1.096*** 93.0 ~0.113! ~0.009! Fama–Frenchthree-factor 20.180** 1.077*** 20.040 0.225*** 96.3 ~0.031! ~0.009! ~0.251! ~0.000! PanelD:NetPercentageMonthlyReturnsfortheAverageHousehold Own-benchmarkabnormalreturn 20.194*** ~0.000! Market-adjustedreturn 20.090 ~0.621! CAPM 20.177 1.082 80.7 ~0.360! ~0.194! Fama–Frenchthree-factor 20.311** 1.113*** 0.131** 0.506*** 93.0 ~0.011! ~0.008! ~0.012! ~0.000! ***, **, and * indicate significance at the 1, 5, and 10 percent levels, respectively ~two-tailed!. The null hypothesisforbeta~thecoefficientestimateonthemarketexcessreturn!isH :b51. o",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 34,
    "chunk_index": 24,
    "word_count": 288,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "0.225*** 96.3 ~0.031! ~0.009! ~0.251! ~0.000! PanelD:NetPercentageMonthlyReturnsfortheAverageHousehold Own-benchmarkabnormalreturn 20.194*** ~0.000! Market-adjustedreturn 20.090 ~0.621! CAPM 20.177 1.082 80.7 ~0.360! ~0.194! Fama–Frenchthree-factor 20.311** 1.113*** 0.131** 0.506*** 93.0 ~0.011! ~0.008! ~0.012! ~0.000! ***, **, and * indicate significance at the 1, 5, and 10 percent levels, respectively ~two-tailed!. The null hypothesisforbeta~thecoefficientestimateonthemarketexcessreturn!isH :b51. o",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 34,
    "chunk_index": 25,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "788 The Journal of Finance TableIII Descriptive Statistics, Gross Returns, and Net Returns for Household Quintiles formed on Beginning Position Value The sample is account records for 66,465 households at a large discount brokerage firm from January 1991 to December 1996. Households are sorted into quintiles based on the market valueofcommonstocksinthefirstmonththatahouseholdappearsduringoursampleperiod. Quintile1containshouseholdswiththesmallestmarketvalueofcommonstockholdings,quin- tile5containshouseholdswiththelargestvalue.Beginningpositionvalueisthemarketvalue ofcommonstocksheldinthefirstmonththatthehouseholdappearsduringoursampleperiod. Meanmonthlyturnoveristheaverageofsalesandpurchaseturnover.Coefficientestimatesare thosefromatime-seriesregressionofthegrossaveragehouseholdexcessreturnonthemarket excess return ~R 2 R !, a zero-investment book-to-market portfolio ~HML !, and a zero- mt ft t investment size portfolio ~SMB !. Raw return is the average monthly return for the average t household.Own-benchmarkabnormalreturnisthereturnonthehouseholdportfoliominusthe returnontheportfoliothehouseholdheldattheendofthepreviousJanuary.Market-adjusted return is the return on the household portfolio less the return on a value-weighted NYSE0 AMEX0Nasdaqindex.CAPMinterceptistheestimatedinterceptfromatime-seriesregression ofthehouseholdexcessreturnonthemarketexcessreturn~R 2R !.Fama–Frenchintercept mt ft istheestimatedinterceptfromtime-seriesregressionsofhouseholdexcessreturnonthemar- ket excess return, a zero-investment book-to-market portfolio ~HML !, and a zero-investment t size portfolio ~SMB !. p-values are presented in parentheses. t Quintile 1 5 Difference: ~Small! 2 3 4 ~Large! Lrg2Sml PanelA:DescriptiveStatistics Meanbeginningpositionvalue 1,581 4,653 8,599 16,725 149,710 N.A. Meanmonthlyturnover~%! 6.68 6.35 6.31 6.13 6.33 20.35*** ~0.000! Coefficientestimateon: ~R 2R ! 1.21*** 1.13*** 1.11*** 1.11*** 1.06** 20.15*** mt ft ~0.004! ~0.005! ~0.009! ~0.005! ~0.035! ~0.006! HML 0.36*** 0.12** 0.09* 0.09* 0.06* 20.30*** t ~0.000! ~0.022! ~0.067! ~0.053! ~0.079! ~0.000! SMB 0.97*** 0.56*** 0.45*** 0.39*** 0.27*** 20.70*** t ~0.000! ~0.000! ~0.000! ~0.000! ~0.000! ~0.000! AdjustedR2 86.1 92.8 93.2 94.3 95.8 68.4 PanelB:GrossAverageHouseholdPercentageMonthlyReturn Rawreturn 1.722 1.511 1.473 1.424 1.400 20.322 Own-benchmark 20.071 20.051** 20.038* 20.038* 20.037* 0.034 abnormalreturn ~0.101! ~0.022! ~0.070! ~0.061! ~0.077! ~0.487! Market-adjustedreturn 0.302 0.091 0.053 0.004 20.020 20.322 ~0.370! ~0.648! ~0.755! ~0.980! ~0.857! ~0.185! CAPMintercept 0.182 20.015 20.043 20.089 20.072 20.253 ~0.612! ~0.942! ~0.811! ~0.570! ~0.541! ~0.328! Fama–Frenchintercept 20.137 20.152 20.149 20.186* 20.140 0.003 ~0.510! ~0.227! ~0.206! ~0.082! ~0.101! ~0.983! PanelC:NetAverageHouseholdPercentageMonthlyReturn Rawreturn 1.478 1.328 1.313 1.280 1.279 20.199 Own-benchmark 20.270*** 20.206*** 20.178*** 20.169*** 20.150*** 0.120** abnormalreturn ~0.000! ~0.000! ~0.000! ~0.000! ~0.000! ~0.023! Market-adjustedreturn 0.059 20.092 20.107 20.140 20.141 20.199 ~0.860! ~0.635! ~0.521! ~0.339! ~0.200! ~0.404! CAPMintercept 20.056 20.193 20.198 20.229 20.189 20.133 ~0.875! ~0.350! ~0.264! ~0.140! ~0.105! ~0.602! Fama–Frenchintercept 20.366* 20.323** 20.298** 20.319*** 20.254*** 0.112 ~0.079! ~0.011! ~0.013! ~0.003! ~0.004! ~0.450! ***, **, and * indicate significance at the 1, 5, and 10 percent levels, respectively ~two-tailed!. The null hypothesisforbeta~thecoefficientestimateonthemarketexcessreturn!isH :b51exceptinthedifference column,wherethenullhypothesisisH :b50. o o",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 34,
    "chunk_index": 26,
    "word_count": 362,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "CAPMintercept 20.056 20.193 20.198 20.229 20.189 20.133 ~0.875! ~0.350! ~0.264! ~0.140! ~0.105! ~0.602! Fama–Frenchintercept 20.366* 20.323** 20.298** 20.319*** 20.254*** 0.112 ~0.079! ~0.011! ~0.013! ~0.003! ~0.004! ~0.450! ***, **, and * indicate significance at the 1, 5, and 10 percent levels, respectively ~two-tailed!. The null hypothesisforbeta~thecoefficientestimateonthemarketexcessreturn!isH :b51exceptinthedifference column,wherethenullhypothesisisH :b50. o o",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 34,
    "chunk_index": 27,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "Trading Is Hazardous to Your Wealth 789 The more interesting findings of our analysis are contained in Panels C and D of Table II. Net of transaction costs, individual investors perform poorly. Both the market-adjusted return and the CAPM intercepts are neg- ative, though unreliably so. The own-benchmark abnormal return and the Fama–French intercept provide the most compelling evidence of underper- formance. These performance measures indicate significant underperfor- manceof15to31basispointspermonth~1.8percentto3.7percentperyear, witht-statisticsrangingfrom22.20to210.21!.Thesetwoperformancemea- sures are most appropriate in our setting because they control for the style preference of individual investors: small stocks with above-average market risk.Inparticular,theown-benchmarkabnormalreturnsindicateindividual investors would have increased their annual return by about two percent hadtheymerelyheldtheirbeginning-of-yearportfolio.Incombination,these results indicate that the net return performance of individual investors is reliably negative. One might wonder whether our results are driven by a short sample pe- riod coinciding with an unusual stock market. Though the market returned about 18 percent per year during our sample period, the market return was negative in 20 of the 72 months. When we compare the performance of in- dividual investors during the 20 months when the market was down to the 52 months in which the market was up, the performance measures pre- sented in Table II are virtually identical. B. Sorting on Portfolio Size We test the robustness of our results across different position sizes by partitioning the households into quintiles on the basis of portfolio size. We define portfolio size as the market value of common stocks held in the first month for which there is a position statement.18 Each quintile represents the common stock investments of more than 12,000 households. Descriptive statistics on the partition by portfolio size are presented in Table III, Panel A. The largest portfolios have a mean beginning position marketvalueof$149,750,thesmallestportfoliosaverage$1,581.Smallport- folios have slightly higher monthly turnover ~6.68 percent! than large port- folios ~6.33 percent!. As before, we estimate the parameters of the Fama– Frenchthree-factormodel,wherethedependentvariableisthemonthlymean gross household excess return for each quintile.19 The coefficient estimates on the market, size, and book-to-market factors reveal that small portfolios tiltmoreheavilytowardhigh-beta,small,valuestocksthandolargeportfolios. 18IfthefirstpositionstatementappearsafterJanuary1991,wedonotdiscountthemarket valueofthecommonstockstoJanuary1991inourrankings.Ourresultsarevirtuallyidentical ifwediscountthemarketvalueofthesecommonstocksusingthereturnonthevalue-weighted market index. 19In the interest of parsimony, here and in the remainder of the paper we do not report resultsfortheaggregateperformanceofeachpartition.Wenotewhenconclusionsaredifferent using the aggregate performance.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 34,
    "chunk_index": 28,
    "word_count": 361,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "Frenchthree-factormodel,wherethedependentvariableisthemonthlymean gross household excess return for each quintile.19 The coefficient estimates on the market, size, and book-to-market factors reveal that small portfolios tiltmoreheavilytowardhigh-beta,small,valuestocksthandolargeportfolios. 18IfthefirstpositionstatementappearsafterJanuary1991,wedonotdiscountthemarket valueofthecommonstockstoJanuary1991inourrankings.Ourresultsarevirtuallyidentical ifwediscountthemarketvalueofthesecommonstocksusingthereturnonthevalue-weighted market index. 19In the interest of parsimony, here and in the remainder of the paper we do not report resultsfortheaggregateperformanceofeachpartition.Wenotewhenconclusionsaredifferent using the aggregate performance.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 34,
    "chunk_index": 29,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "790 The Journal of Finance The gross and net returns for each quintile are presented in Table III, Panels B and C. Focusing first on the gross performance ~Panel B!, we find that small portfolios ~quintile 1! earn higher average returns than large portfolios ~quintile 5!, though the difference is not reliably different from zero.Thisdifferenceislikelyattributabletothefactthatsmallportfoliostilt more heavily toward small value stocks, which performed well during our sample period. The net performance results are presented in Panel C. The market-adjusted return and Jensen’s alpha are similar to those re- ported for the full sample for each quintile. Though the point estimates are consistently negative, they are not reliably so. Of course, these risk- adjustments ignore the fact that investors are tilting toward small value stocks. In contrast, the own-benchmark abnormal returns and the intercept tests from the Fama–French three-factor model indicate significant under- performance, ranging from 15 to 37 basis points per month, in each of the quintiles. In sum, after a reasonable accounting for the size and value tilts of small investors, we document that both small and large portfolios underperform. C. Cross-Sectional Variation in Performance We should emphasize that the aggregate performance and average house- holdperformance,thoughgermaneandinteresting,maskconsiderablecross- sectionalvariationintheperformanceacrosshouseholds.Foreachhousehold, wecalculatethemeanmonthlymarket-adjustedabnormalreturn.Wepresent the distribution of these means in Table IV.20 Consistent with the results presented in Table II, the median household earns a gross monthly market- adjusted return of 20.01 percent and a net return of 20.14 percent. Though 49.3percentofhouseholdsoutperformavalue-weightedmarketindexbefore transaction costs, only 43.4 percent outperform the index after costs. None- theless, many households perform very well: 25 percent of all households beat the market, after accounting for transaction costs, by more than 0.50 percentpermonth~morethansixpercentannually!.Conversely,manyhouse- holds perform very poorly: 25 percent of all households underperform the market, after accounting for transaction costs, by more than 0.73 percent per month ~more than eight percent annually!. IV. Overconfidence and Performance Itiswelldocumentedthatpeopletendtobeoverconfident~e.g.,Alpertand Raiffa ~1982!, Griffin and Tversky ~1992!; see Odean ~1998b! for a more detailedreview!.Odean~1998b!,GervaisandOdean~1998!,andCaballéand Sákovics ~1998! develop theoretical models of financial markets where in- 20We omit from this analysis accounts that held common stocks for fewer than 12 months during our 72-month sample period.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 34,
    "chunk_index": 30,
    "word_count": 349,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "percent annually!. IV. Overconfidence and Performance Itiswelldocumentedthatpeopletendtobeoverconfident~e.g.,Alpertand Raiffa ~1982!, Griffin and Tversky ~1992!; see Odean ~1998b! for a more detailedreview!.Odean~1998b!,GervaisandOdean~1998!,andCaballéand Sákovics ~1998! develop theoretical models of financial markets where in- 20We omit from this analysis accounts that held common stocks for fewer than 12 months during our 72-month sample period.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 34,
    "chunk_index": 31,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "Trading Is Hazardous to Your Wealth 791 TableIV Cross-Sectional Distribution of Percentage Monthly Gross and Net Market-Adjusted Household Returns The sample is account records for 66,465 households at a large discount brokerage firm from January 1991 to December 1996. Households with position statements in 12 or fewer months are omitted from this analysis. Though the median values are virtually identical when these households are included, more extreme values are observed. Gross Monthly Net Monthly Market-Adjusted Return Market-Adjusted Return ~%! ~%! Minimum 219.46 220.85 1st percentile 24.32 24.86 5th percentile 22.12 22.45 10th percentile 21.34 21.60 25th percentile 20.57 20.73 Median 20.01 20.14 75th percentile 0.66 0.50 90th percentile 1.62 1.40 95th percentile 2.41 2.15 99th percentile 4.86 4.44 Maximum 48.53 48.35 Total households 62,439 62,439 Percentage . 0 49.3%*** 43.4%*** Binomial Z-statistic 23.38 233.13 *** indicates significant difference from 50 percent at the 1% level. vestors suffering from overconfidence trade too much ~i.e., trading, at the margin,reducestheirexpectedutility!.Incontrast,inarationalexpectation framework, Grossman and Stiglitz ~1980! argue that investors will trade when the marginal benefit of doing so is equal to or exceeds the marginal costofthetrade~includingthecostofacquiringinformation!.Odean~1998b! analyzesavariationofGrossmanandStiglitz’smodelinwhichinvestorsare overconfident. The two models yield different predictions about the gains of trading. The rational expectations model predicts that investors who trade more ~i.e., those whose expected trading is greater! will have the same ex- pected utility as those who trade less. The overconfidence model predicts that investors who trade more will have lower expected utility. Consider the implications of these two models in our empirical setting. Theoverconfidencemodelpredictsthatthenetreturnperformanceofhouse- holds with high turnover will be lower than that of households with low turnover, while making no prediction about the differences in gross returns. InGrossman–Stiglitz,activeandpassiveinvestorshaveequivalentexpected utilities.Active traders must earn higher expected gross returns in order to",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 34,
    "chunk_index": 32,
    "word_count": 286,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "expected utility. Consider the implications of these two models in our empirical setting. Theoverconfidencemodelpredictsthatthenetreturnperformanceofhouse- holds with high turnover will be lower than that of households with low turnover, while making no prediction about the differences in gross returns. InGrossman–Stiglitz,activeandpassiveinvestorshaveequivalentexpected utilities.Active traders must earn higher expected gross returns in order to",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 34,
    "chunk_index": 33,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "792 The Journal of Finance offset their greater trading costs.21 The Grossman–Stiglitz model therefore predicts that the gross risk-adjusted return performance of households with high turnover will be higher than that of households with low turnover, but there will be little difference in the net risk-adjusted returns. To test these competing models, we partition our sample of households intoquintilesonthebasisofmeanmonthlyturnover~definedastheaverage of purchase and sale turnover!. Each quintile represents the common stock investments of more than 12,000 households. Descriptive statistics for each of the quintiles are presented in Table V, PanelA. The households with low turnover average 0.19 percent turnover per month, those with high turnover average 21.49 percent. To qualify as a high turnover portfolio, a household would need to turn over at least 8.7 percent of its portfolio in an average month. Households with low turnover also tend to have larger accounts. As before, we estimate the parameters of the Fama–French three-factor model, where the dependent variable is the monthly mean gross household excess return for each turnover quintile. The coefficient estimates on the market,size,andbook-to-marketfactorsrevealthatthehighturnoverhouse- holds tilt more heavily toward high-beta, small, growth stocks than do the low turnover households. The gross and net returns for each turnover quintile are presented in Table V, Panels B and C. Focusing first on the gross performance ~Panel B!, we find that high turnover households ~quintile 5! do not significantly out- performlowturnoverhouseholds~quintile1!.Infact,theintercepttestbased on the Fama–French three-factor model, which accounts for the tendency of thehighturnoverportfoliototiltmoreheavilytowardhigh-beta,small,growth stocks, indicates that the two high turnover quintiles ~quintiles 4 and 5! underperform by 24 and 36 basis points per month. Though marginally sta- tistically significant ~p-values of 0.143 and 0.104, respectively!, we believe these figures to be economically large ~approximately three to four percent annually!. Regardless of whether one accepts these results as statistically significant, the prediction of the Grossman and Stiglitz model is not sup- ported; those who trade most do not earn higher gross returns. The analysis of net returns ~Panel C! is quite interesting. Regardless of themethodusedtomeasureperformance,thehighturnoverhouseholds~quin- tile 5! underperform the low turnover households ~quintile 1!. The under- performance ranges from 46 basis points per month ~5.5 percent per year, t 5 21.56! using market-adjusted returns to an astoundingly high 80 basis points per month ~9.6 percent per year, t 5 24.59! based on the Fama– French intercept. The own-benchmark abnormal returns indicate that the 21Ratherthanincreasingtheirgrossreturns,activetraderscouldalternativelyachievethe sameexpectedutilityaslessactivetradersbyloweringtheirvolatilitythroughtrading.Wefind no evidence of this however. For example, the average ~net! Sharpe ratio of the quintile that trades most actively ~0.092! is one-half that of the quintile that trades least actively ~0.180!. ThoughtheseSharperatiosdonotconsiderinvestors’totalportfoliosofassets~seefootnote9!, they indicate that active traders do not have higher volatility adjusted returns within the ob- served equity portfolios.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 34,
    "chunk_index": 34,
    "word_count": 442,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "no evidence of this however. For example, the average ~net! Sharpe ratio of the quintile that trades most actively ~0.092! is one-half that of the quintile that trades least actively ~0.180!. ThoughtheseSharperatiosdonotconsiderinvestors’totalportfoliosofassets~seefootnote9!, they indicate that active traders do not have higher volatility adjusted returns within the ob- served equity portfolios.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 34,
    "chunk_index": 35,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "Trading Is Hazardous to Your Wealth 793 TableV Descriptive Statistics, Gross Returns, and Net Returns for Household Quintiles Formed on Mean Turnover The sample is account records for 66,465 households at a large discount brokerage firm from January1991toDecember1996.Householdsaresortedintoquintilesbasedonmonthlyturn- over~theaverageofsalesandpurchaseturnover!duringoursampleperiod.Quintile1contains households with the lowest turnover, quintile 5 contains households with the highest. Begin- ning position value is the market value of common stocks held in the first month that the household appears during our sample period. Mean monthly turnover is the average of sales and purchase turnover. Coefficient estimates are those from a time-series regression of the grossaveragehouseholdexcessreturnonthemarketexcessreturn~R 2R !,~HML !,anda mt ft t zero-investmentsizeportfolio~SMB !.Rawreturnistheaveragemonthlyreturnfortheaver- t agehousehold.Own-benchmarkabnormalreturnisthereturnonthehouseholdportfoliominus the return on the portfolio the household held at the end of the previous January. Market- adjusted return is the return on the household portfolio less the return on a value-weighted NYSE0AMEX0Nasdaq index. CAPM intercept is the estimated intercept from a time-series regression of the household excess return on the market excess return ~R 2 R !. Fama– mt ft French intercept is the estimated intercept from time-series regressions of household excess returnonthemarketexcessreturn,azero-investmentbook-to-marketportfolio~HML !,anda t zero-investment size portfolio ~SMB !. p-values are presented in parentheses. t Quintile 1 5 Difference: ~Low! 2 3 4 ~High! High2Low PanelA:DescriptiveStatistics Meanmonthlyturnover~%! 0.19 1.24 2.89 5.98 21.49 N.A. Meanbeginningpositionvalue 34,169 26,046 22,945 19,102 21,560 212,609*** ~0.000! Coefficientestimateon ~R 2R ! 1.03 1.06* 1.11** 1.18*** 1.29*** 0.26*** mt ft ~0.199! ~0.090! ~0.015! ~0.002! ~0.000! ~0.000! HML 0.20*** 0.10*** 0.13** 0.13* 0.12 20.08 t ~0.000! ~0.012! ~0.020! ~0.065! ~0.195! ~0.333! SMB 0.24*** 0.29*** 0.51*** 0.72*** 1.02*** 0.78*** t ~0.000! ~0.000! ~0.000! ~0.000! ~0.000! ~0.000! AdjustedR2 96.1 94.7 92.2 90.4 87.6 71.8 PanelB:GrossAverageHouseholdPercentageMonthlyReturn Rawreturn 1.483 1.472 1.489 1.511 1.548 0.065 Own-benchmark 20.009 20.026* 20.052** 20.079*** 20.096* 20.087 abnormalreturn ~0.156! ~0.064! ~0.014! ~0.007! ~0.093! ~0.116! Market-adjustedreturn 0.063 0.052 0.069 0.091 0.128 0.065 ~0.534! ~0.660! ~0.710! ~0.726! ~0.728! ~0.832! CAPMintercept 0.090 0.022 20.015 20.078 20.167 20.257 ~0.409! ~0.865! ~0.936! ~0.774! ~0.663! ~0.407! Fama–Frenchintercept 20.048 20.072 20.149 20.237 20.359 20.311* ~0.526! ~0.448! ~0.242! ~0.143! ~0.104! ~0.086! PanelC:NetAverageHouseholdPercentageMonthlyReturn Rawreturn 1.470 1.411 1.361 1.267 1.009 20.460 Own-benchmark 20.021*** 20.079*** 20.167*** 20.300*** 20.587*** 20.566*** abnormalreturn ~0.000! ~0.000! ~0.000! ~0.000! ~0.000! ~0.000! Market-adjustedreturn 0.050 20.009 20.059 20.153 20.411 20.460 ~0.625! ~0.937! ~0.749! ~0.547! ~0.253! ~0.124! CAPMintercept 0.077 20.038 20.140 20.314 20.692* 20.768** ~0.480! ~0.764! ~0.474! ~0.242! ~0.066! ~0.012! Fama–Frenchintercept 20.061 20.130 20.269** 20.464*** 20.864*** 20.803*** ~0.422! ~0.172! ~0.037! ~0.005! ~0.000! ~0.000! ***, **, and *indicate significance at the 1, 5, and 10 percent levels, respectively ~two-tailed!. The null hypothesisforbeta~thecoefficientestimateonthemarketexcessreturn!isH :b51exceptinthedifference o column,wherethenullhypothesisisH :b50. o",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 34,
    "chunk_index": 36,
    "word_count": 417,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "~0.124! CAPMintercept 0.077 20.038 20.140 20.314 20.692* 20.768** ~0.480! ~0.764! ~0.474! ~0.242! ~0.066! ~0.012! Fama–Frenchintercept 20.061 20.130 20.269** 20.464*** 20.864*** 20.803*** ~0.422! ~0.172! ~0.037! ~0.005! ~0.000! ~0.000! ***, **, and *indicate significance at the 1, 5, and 10 percent levels, respectively ~two-tailed!. The null hypothesisforbeta~thecoefficientestimateonthemarketexcessreturn!isH :b51exceptinthedifference o column,wherethenullhypothesisisH :b50. o",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 34,
    "chunk_index": 37,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "794 The Journal of Finance trading of high turnover households costs them 57 basis points per month ~6.8 percent per year! relative to the returns earned by low turnover house- holds. Again, these differences are not consistent with the Grossman and Stiglitz model, but are consistent with the predictions of the overconfidence models. Insum,differencesingrossreturnsacrosstheturnoverquintilesaresmall. An investment mimicking that of the average household in each quintile would have earned a gross annualized mean geometric return that ranged from 18.5 percent ~for quintile 2! to 18.7 percent ~for quintile 1!. However, there are dramatic differences in the net returns across the turnover quin- tiles. An investment mimicking the average household of the high turnover quintile would have earned a net annualized mean geometric return of 11.4 percent,whileaninvestmentthatmimickedthelowturnoverquintilewould have earned 18.5 percent. These returns are graphed in Figure 1. V. Price Momentum Some authors have identified price momentum effects in stock returns— that is, stocks that have performed well recently tend to earn higher returns than those that have not ~Jegadeesh and Titman ~1993!!. It is unlikely, how- ever, that individual investors view momentum as a risk factor. Thus, we do not include momentum when calculating risk-adjusted returns. Nonetheless, it is interesting to consider how momentum affects the per- formance of individual investors. In general, the sampled investors are an- timomentuminvestors;thatis,onaveragetheytendtoholdstocksthathave recently underperformed the market. This is consistent with the evidence that individual investors tend to hold their losers and sell their winning investments ~Odean ~1998a!!. To investigate the effect of price momentum on the performance of indi- vidual investors, we add a zero-investment price-momentum portfolio to the Fama–French three-factor regressions described in Section II.C.22 This port- folio is long stocks that have performed well recently and short those that have performed poorly. We then estimate time-series regressions for each of the sample partitions described in the main text. In all sample partitions, the estimated coefficient estimate on the zero-investment price-momentum portfolio is negative; individuals tend to tilt their investments toward stocks that have performed poorly recently. The net performance of individual investors in aggregate ~on average! is 20.053 ~20.041! percent per month when price momentum is included as an additional characteristic. Though still negative, these intercepts are smaller in magnitude than those from the Fama–French three-factor regressions and are not statistically significant. 22Theconstructionofthezero-investmentprice-momentumportfolioisdescribedinCarhart ~1997!. We thank Mark Carhart for providing us with the returns data.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 34,
    "chunk_index": 38,
    "word_count": 393,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "average! is 20.053 ~20.041! percent per month when price momentum is included as an additional characteristic. Though still negative, these intercepts are smaller in magnitude than those from the Fama–French three-factor regressions and are not statistically significant. 22Theconstructionofthezero-investmentprice-momentumportfolioisdescribedinCarhart ~1997!. We thank Mark Carhart for providing us with the returns data.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 34,
    "chunk_index": 39,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "Trading Is Hazardous to Your Wealth 795 Our principal finding—that those investors who trade most actively re- alize, on average, the lowest net returns—is unaffected by the inclusion of a momentum characteristic in the regressions. These time-series regres- sions result in an intercept of 20.398 percent per month for those who trade most actively ~quintile 5! and 0.070 percent per month for those who trade least ~quintile 1!. Thus, when one controls for their tendency to hold poorly performing stocks, those investors who trade least actively achieve reasonable performance. More important, however, is the finding that ac- tive investors continue to underperform less active investors. The differ- ences in the intercepts remains large and statistically significant: 20.468 percent per month. VI. Liquidity, Rebalancing, and Tax-Motivated Trading To this point, we have focused on information-motivated versus over- confidence-motivatedtrading.Theempiricalevidencewehavepresentedsol- idly favors overconfidence as the major motivation for trading, since trading unambiguously hurts investor performance; however, there are other moti- vations for trading, which we consider in this section. A. Liquidity Investors who face liquidity shocks over time will trade as a rational re- sponse to those shocks. Thus, liquidity shocks can explain some trading ac- tivity.But,theyseemimplausibleasanexplanationofthe75percentannual turnover that we document for the average individual investor and belie common sense as an explanation of the more than 250 percent annual turn- over of the households who trade most. Investors facing rapidly fluctuating liquidityneedscan,inmostcases,findlessexpensivemeanstofinancethese than rapid trading in and out of stocks. Moreover, the trading that results from liquidity shocks can be accom- plished at a much lower cost by investing in mutual funds than by investing in individual common stocks. To illustrate this point, we analyze the returns on the Vanguard Index 500 mutual fund, a large passive mutual fund that claims to match the performance of the Standard and Poor’s 500. Investors can move in and out of this fund at no cost. In contrast to the performance of the average or aggregate household, this index fund does not underper- form when compared to any of the standard performance benchmarks. Dur- ingoursampleperiod,thisfundearnedanannualizedgeometricmeanreturn of 17.8 percent while the value-weighted market index earned 17.9 percent. The market-adjusted return, the CAPM intercept, and the Fama–French intercept for the Vanguard Index 500 were 20.002, 20.004, and 0.009 per- cent,respectively.Apassivelymanagedmutualfundclearlyprovidesalower cost means of managing liquidity shocks than does investment in individual common stocks.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 34,
    "chunk_index": 40,
    "word_count": 386,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "performance benchmarks. Dur- ingoursampleperiod,thisfundearnedanannualizedgeometricmeanreturn of 17.8 percent while the value-weighted market index earned 17.9 percent. The market-adjusted return, the CAPM intercept, and the Fama–French intercept for the Vanguard Index 500 were 20.002, 20.004, and 0.009 per- cent,respectively.Apassivelymanagedmutualfundclearlyprovidesalower cost means of managing liquidity shocks than does investment in individual common stocks.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 34,
    "chunk_index": 41,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "796 The Journal of Finance B. Rebalancing Investors who desire a portfolio with certain risk characteristics will ra- tionally rebalance their portfolio to maintain this risk profile. With an av- erage holding of four common stocks, we believe that risk-based rebalancing is not a significant motivation for trading in the households that we study. Risk-based rebalancing as an explanation of the 75 percent annual turnover that we document for the average household belies common sense. Investors can manage the risk composition of their portfolio at much lower cost by carefully selecting a portfolio of mutual funds. C. Taxes The single most compelling reason for investors to hold individual com- mon stocks in lieu of mutual funds is taxes. Investors who hold stocks that have lost value since their purchase can realize those losses. These losses can be used to shelter gains and thereby reduce the investor’s tax liability.23 Tax-loss selling cannot completely explain the results that we document here for three reasons. First, it is implausible that tax-motivated trading would yield an annual turnover rate of 75 percent. A simple example illus- trates this point: Consider an investor who buys the value-weighted market index on January 1 of each year 1991 to 1996. In December of the average year, this investor would be able to sell 24 percent of her portfolio for a loss. Of course, this example assumes a holding period of 12 months. The turn- overresultingfromtax-losssellingwilldeclineasthisholdingperiodincreases. Second, we find high turnover and significant underperformance in both taxable and tax-deferred accounts. If tax-loss selling is the major motivation for trading we would expect to find little trading in tax-deferred accounts. On the other hand, if overconfidence is the major motivation for trading, we would expect to find, as we do, active trading and significant underperfor- mance in both taxable and tax-deferred accounts. We partition the accounts in our sample into taxable and tax-deferred accounts ~i.e., Individual Retire- ment Accounts and Keogh Accounts!. In Table VI, Panel A, we present de- scriptive statistics for the taxable and tax-deferred accounts. Turnover in tax-deferred accounts is high: 67.6 percent annually ~monthly turnover of 5.63 percent times 12!, though not as high as in taxable accounts: 89.4 per- cent annually ~monthly turnover of 7.45 percent times 12!. The difference in turnover may result from tax-motivated trading or it may be that investors associate their retirement accounts with future safety and therefore trade less speculatively in these accounts. In Table VI, Panels B and C, we present the gross and net return perfor- mances of taxable and tax-deferred accounts. The gross returns earned by taxable and tax-deferred accounts are quite similar ~see Panel B!. The net 23Though losses on mutual funds can also be used to reduce an investor’s tax liability, the probabilityofhavingalossonamutualfundislessthantheprobabilityofobservingatleast one losing investment in a well-diversified portfolio of common stocks.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 34,
    "chunk_index": 42,
    "word_count": 469,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "mances of taxable and tax-deferred accounts. The gross returns earned by taxable and tax-deferred accounts are quite similar ~see Panel B!. The net 23Though losses on mutual funds can also be used to reduce an investor’s tax liability, the probabilityofhavingalossonamutualfundislessthantheprobabilityofobservingatleast one losing investment in a well-diversified portfolio of common stocks.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 34,
    "chunk_index": 43,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "Trading Is Hazardous to Your Wealth 797 TableVI Descriptive Statistics, Gross Return, and Net Return for Taxable and Tax-Deferred Accounts The sample is account records for 66,465 households at a large discount brokerage firm from January 1991 to December 1996. Accounts are partitioned as either taxable or tax deferred ~IRA,Keogh,SEP-IRA!.Beginningpositionvalueisthemarketvalueofcommonstocksheldin thefirstmonththatthehouseholdappearsduringoursampleperiod.Meanmonthlyturnover is the average of sales and purchase turnover. Coefficient estimates are those from a time- series regression of the gross average household excess return on the market excess return ~R 2 R !, a zero-investment book-to-market portfolio ~HML !, and a zero-investment size mt ft t portfolio ~SMB !. Raw return is the average monthly return for the average household. Own- t benchmark abnormal return is the return on the household portfolio minus the return on the portfoliothehouseholdheldattheendofthepreviousJanuary.Market-adjustedreturnisthe return on the household portfolio less the return on a value-weighted NYSE0AMEX0Nasdaq index. CAPM intercept is the estimated intercept from a time-series regression of the house- hold excess return on the market excess return ~R 2 R !. Fama–French intercept is the mt ft estimated intercept from time-series regressions of household excess return on the market excess return, a zero-investment book-to-market portfolio ~HML !, and a zero-investment size t portfolio ~SMB !. p-values are presented in parentheses. t Tax Taxable Deferred Difference PanelA:DescriptiveStatistics Numberofhouseholds 54,434 30,554 N0A. Meanbeginningpositionvalue 26,303 14,042 12,261*** ~0.000! Meanmonthlyturnover~%! 7.45 5.63 1.82*** ~0.000! Coefficientestimateon: ~R 2R ! 1.13*** 1.12*** 0.01 mt ft ~0.004! ~0.007! ~0.346! HML 0.14*** 0.18*** 20.04*** t ~0.010! ~0.001! ~0.000! SMB 0.56*** 0.52*** 0.04*** t ~0.000! ~0.000! ~0.000! AdjustedR2 92.6 92.2 46.7 PanelB:GrossAverageHouseholdPercentageMonthlyReturn Rawreturn 1.496 1.532 20.036 Own-benchmarkabnormalreturn 20.048*** 20.037* 20.010 ~0.009! ~0.055! ~0.107! Market-adjustedreturn 0.076 0.112 20.036 ~0.702! ~0.555! ~0.185! CAPMintercept 20.027 0.031 20.058** ~0.899! ~0.156! ~0.039! Fama–Frenchintercept 20.174 20.133 20.041* ~0.174! ~0.298! ~0.059! PanelC:NetAverageHouseholdPercentageMonthlyReturn Rawreturn 1.313 1.379 20.066** Own-benchmarkabnormalreturn 20.203*** 20.166*** 20.036*** ~0.000! ~0.000! ~0.000! Market-adjustedreturn 20.107 20.042 20.066** ~0.583! ~0.823! ~0.012! CAPMintercept 20.204 20.119 20.085*** ~0.326! ~0.547! ~0.002! Fama–Frenchintercept 20.344*** 20.278** 20.066*** ~0.008! ~0.030! ~0.002! ***, **, and *indicate significance at the 1, 5, and 10 percent levels, respectively ~two-tailed!. The null hypothesisforbeta~thecoefficientestimateonthemarketexcessreturn!isH :b51exceptinthedifference o column,wherethenullhypothesisisH :b50. o",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 34,
    "chunk_index": 44,
    "word_count": 347,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "20.203*** 20.166*** 20.036*** ~0.000! ~0.000! ~0.000! Market-adjustedreturn 20.107 20.042 20.066** ~0.583! ~0.823! ~0.012! CAPMintercept 20.204 20.119 20.085*** ~0.326! ~0.547! ~0.002! Fama–Frenchintercept 20.344*** 20.278** 20.066*** ~0.008! ~0.030! ~0.002! ***, **, and *indicate significance at the 1, 5, and 10 percent levels, respectively ~two-tailed!. The null hypothesisforbeta~thecoefficientestimateonthemarketexcessreturn!isH :b51exceptinthedifference o column,wherethenullhypothesisisH :b50. o",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 34,
    "chunk_index": 45,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "798 The Journal of Finance returns earned by taxable and tax-deferred accounts are both poor, after a reasonableaccountingforthesmallstocktiltoftheseindividuals~seePanelC!. Thetax-deferredaccountsoutperformthetaxableaccountsbyaboutsixbasis points per month. In short, the general tenor of our results is similar for the taxable and tax-deferred accounts. Third, Odean ~1998a, 1999! documents that most investor trading activity is inconsistent with tax-motivated trading. He observes that investors at a discountbrokeragesellprofitableinvestmentstwiceasoftenasunprofitable investments ~during the period 1987 to 1993! and that, relative to their op- portunities to do so, these investors are about one and one-half times more likely to realize any gain than any loss. They do engage in tax-loss selling late in the year, but December is the only month in which they realize losses at as fast a rate as they do gains. Finally, we should emphasize that trading not associated with tax-loss selling will further hurt the after-tax returns of individual investors. Not only does this trading incur trading costs, when done in a taxable account it also accelerates the payment of capital gain taxes that could be otherwise deferred. D. Gambling To what extent may a desire to gamble account for the excessive trading we observe? Many people appear to enjoy gambling. Some buy lottery tick- ets. Others gamble at casinos. We consider two distinct aspects of gambling: risk-seeking and entertainment. Risk-seeking is when one demonstrates a preference for outcomes with greater variance but equal or lower expected return. In equity markets the simplest way to increase variance without increasing expected return is to underdiversify. Excessive trading has a re- lated, but decidedly different, effect; it decreases expected returns without decreasingvariance.Thusrisk-seekingmayaccountforunderdiversification ~though underdiversification could also result from simple ignorance of its benefits!, but it does not explain excessive trading. A second aspect of gambling is the entertainment derived from placing and realizing bets. When coupled with the overconfident belief that these bets are expected-wealth enhancing, it is easy to see that the entertain- ment utility of gambling will fuel greater trading. There is also the possi- bility that people may trade for entertainment while fully realizing that each trade is more likely than not to reduce their personal future wealth. ~Note that this is different from realizing that the trades of others are wealth reducing.! We favor the hypothesis that most investors trade exces- sively because they are overconfident, or because they are overconfi- dent and they enjoy trading, over the hypothesis that they trade purely for entertainment and expect thereby to lower their wealth. Many studies have established that people are overconfident. We know of no study dem- onstrating that ordinary investors expect to lower their wealth through trading.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 34,
    "chunk_index": 46,
    "word_count": 433,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "because they are overconfi- dent and they enjoy trading, over the hypothesis that they trade purely for entertainment and expect thereby to lower their wealth. Many studies have established that people are overconfident. We know of no study dem- onstrating that ordinary investors expect to lower their wealth through trading.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 34,
    "chunk_index": 47,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "Trading Is Hazardous to Your Wealth 799 It is possible that some investors set aside a small portion of their wealth with which they trade for entertainment, while investing the majority more prudently. If “entertainment accounts” are driving our findings, we would expect turnover and underperformance to decline as the common stocks in the accounts we observe represent a larger proportion of a household’s total wealth. We are able to test this hypothesis directly and find no support for it. For approximately one-third of our sample, the households reported their net worth at the time they opened their accounts. We calculate the propor- tion of net worth invested at the discount broker as the beginning value of ahousehold’scommonstockinvestmentsscaledbyitsself-reportednetworth.24 We then analyze the turnover and investment performance of 2,333 house- holds with at least 50 percent of their net worth in common stock invest- ments at this discount broker. These households have similar turnover ~6.25 percent per month, 75 percent annually! to our full sample ~see Table I!. Furthermore, these households earn gross and net returns that are very similar to the full sample. The monthly net return, own-benchmark abnor- mal return, market-adjusted return, CAPM intercept, and Fama–French in- tercept for these households are 1.285, 20.173, 20.135, 20.221, and 20.285 percent, respectively. Finally,itisworthnotingthatthenegativerelationbetweenturnoverand net returns that we document for individual investors also exists in mutual funds ~Carhart ~1997!!. It is unlikely that mutual fund managers buy and sell stocks for the pure joys of trading despite the fact that this trading lowers the expected returns of their shareholders.25 VII. Conclusion We analyze the returns earned on common stock investments by 66,465 households at a large discount brokerage firm for the six years ending in January 1997. We document that the gross returns ~before accounting for transaction costs! earned by these households are quite ordinary, on aver- age. Unfortunately, the net returns ~after accounting for the bid-ask spread and commissions paid by these investors! earned by these households are poor. The average household underperforms a value-weighted market index by about 9 basis points per month ~or 1.1 percent annually!. After account- ing for the fact that the average household tilts its common stock invest- mentstowardsmallvaluestockswithhighmarketrisk,theunderperformance averages 31 basis points per month ~or 3.7 percent annually!. The average householdturnsoverapproximately75percentofitscommonstockportfolio annually. The poor performance of the average household can be traced to the costs associated with this high level of trading. 24Thisestimateisupwardlybiasedbecausetheaccountopeningdategenerallyprecedesour first portfolio position observation and net worth is likely to have increased in the interim. 25Lakonishoketal.~1992!reportapositiverelationbetweenturnoverandperformancefor 769 all-equity pension funds, though this finding puzzles the authors.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 34,
    "chunk_index": 48,
    "word_count": 424,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "average householdturnsoverapproximately75percentofitscommonstockportfolio annually. The poor performance of the average household can be traced to the costs associated with this high level of trading. 24Thisestimateisupwardlybiasedbecausetheaccountopeningdategenerallyprecedesour first portfolio position observation and net worth is likely to have increased in the interim. 25Lakonishoketal.~1992!reportapositiverelationbetweenturnoverandperformancefor 769 all-equity pension funds, though this finding puzzles the authors.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 34,
    "chunk_index": 49,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "800 The Journal of Finance Our most dramatic empirical evidence is provided by the 20 percent of households that trade most often. With average monthly turnover of in ex- cess of 20 percent, these households turn their common stock portfolios over more than twice annually. The gross returns earned by these high-turnover households are unremarkable, and their net returns are anemic. The net returns lag a value-weighted market index by 46 basis points per month ~or 5.5 percent annually!. After a reasonable accounting for the fact that the average high-turnover household tilts its common stock investments toward small value stocks with high market risk, the underperformance averages 86 basis points per month ~or 10.3 percent annually!. The investment experience of individual investors is remarkably similar to the investment experience of mutual funds. As do individual investors, theaveragemutualfundunderperformsasimplemarketindex~Jensen~1969! and Malkiel ~1995!!. Mutual funds trade often and their trading hurts per- formance ~Carhart ~1997!!. But trading by individual investors is even more deleterioustoperformancebecauseindividualsexecutesmalltradesandface higher proportional commission costs than mutual funds. Our main point is simple: Trading is hazardous to your wealth. Why then do investors trade so often? The aggregate turnover of the individual inves- tor portfolios we analyze is about 70 percent; the average turnover is about 75 percent. The NewYork Stock Exchange reports that the annual turnover of stocks listed on the exchange hovered around 50 percent during our sam- ple period. Mutual funds average an annual turnover of 77 percent ~Carhart ~1997!!. We believe that these high levels of trading can be at least partly explained by a simple behavioral bias: People are overconfident, and over- confidence leads to too much trading. Based on rational agents free from such behavioral biases, the efficient markets hypothesis has been central to both the theory and practice of in- vestment management. The efficiency research posits that private informa- tion is rare. Thus, active investment strategies will not outperform passive investment strategies. Both the theoretical and empirical work on efficiency supporting this view have led to a rise of passive investment strategies that simply buy and hold diversified portfolios ~Fama ~1991!!. Behavioral finance models that incorporate investor overconfidence ~e.g., Odean~1998b!!provideanevenstrongerprediction:Activeinvestmentstrat- egies will underperform passive investment strategies. Overconfident inves- tors will overestimate the value of their private information, causing them to trade too actively and, consequently, to earn below-average returns. Con- sistent with these behavioral models of investor overconfidence, we provide empirical evidence that households, which hold about half of U.S. equities, trade too much, on average. Those who trade the most are hurt the most. Appendix A. The Analysis of Trade Timing In this appendix, we analyze the timing of purchases and sales within a month. The timing of trades within a month is ignored in our main analy- sis where we assume all purchases and sales are made at month end.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 34,
    "chunk_index": 50,
    "word_count": 469,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "hurt the most. Appendix A. The Analysis of Trade Timing In this appendix, we analyze the timing of purchases and sales within a month. The timing of trades within a month is ignored in our main analy- sis where we assume all purchases and sales are made at month end.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 34,
    "chunk_index": 51,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "Trading Is Hazardous to Your Wealth 801 TableAI The Gross Abnormal Returns for Stocks Bought and Sold from the Trade Date to the End of the Month The sample is account records for 66,465 households at a large discount brokerage firm from January 1991 to December 1996. Purchase turnover is the average value of stocks purchased divided by the average value of stocks held in each month. The purchase abnormal return is calculatedbycompoundingthedailyreturnsonthepurchasedsecurityfromthedayfollowing thepurchasetotheendofthemonthlessthecompoundreturnonthevalue-weightedNYSE0 AMEX0Nasdaq market index. Sales turnover and sales abnormal return are analogously cal- culated. The estimated effect on the monthly abnormal return is the purchase turnover times the purchase abnormal return minus the sale turnover times the sale abnormal return. Estimated Effect on Monthly Purchase Monthly Sale Monthly Purchase Abnormal Sale Abnormal Abnormal Turnover Return Turnover Return Return Sample ~%! ~%! ~%! ~%! ~%! PanelA:Aggregate All households 4.92 20.472 4.93 0.021 20.0242 Panel B: Households Partitioned by Beginning Position Value 1 ~Small! 6.85 20.650 6.06 20.116 20.0375 2 5.83 20.381 5.16 20.019 20.0213 3 5.82 20.386 5.25 0.437 20.0454 4 5.55 20.445 5.25 0.030 20.0263 5 ~Large! 4.41 20.486 4.23 20.035 20.0199 Panel C: Households Partitioned by Turnover 1 ~Low! 0.26 20.184 0.23 0.068 20.0006 2 1.37 20.176 1.14 20.089 20.0014 3 3.07 20.126 2.57 0.041 20.0049 4 6.46 20.234 6.13 0.102 20.0214 5 ~High! 21.81 20.674 20.75 20.003 20.1464 Consistent with the results reported in Odean ~1999!, we document that the stocks investors buy subsequently underperform the stocks they sell. In aggregate, we estimate that an exact accounting for the timing of pur- chases and sales would reduce the performance of individual investors by more than two basis points per month ~or approximately 0.29 percent annually!. For each account with a beginning-of-month position statement in month t, we identify all purchases in month t 2 1 and sales in month t. For both purchases and sales, we calculate the compound return on the stock from the day following the trade to the last day of the month. For purchases this return is excluded from our main results; for sales this return is included. Note that in our main results, we account for the intraday return on the trade day in our estimate of the bid-ask spread.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 34,
    "chunk_index": 52,
    "word_count": 370,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "day following the trade to the last day of the month. For purchases this return is excluded from our main results; for sales this return is included. Note that in our main results, we account for the intraday return on the trade day in our estimate of the bid-ask spread.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 34,
    "chunk_index": 53,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "802 The Journal of Finance FigureA1.Timelineofreturnscalculations.Thetimeofpurchase(sale)ist (t ).The b s closeonthepurchase~sale!dayistcl~tcl!.Thecloseonthelastdayofthepurchase~sale!month b s is t ~t !. 1 3 The results of our analysis are presented in Table AI. The second ~fourth! columns of this table present aggregate purchase ~sale! turnover calculated as the aggregate dollar value of purchases ~sales! divided by the aggregate dollar value of positions held. ~This turnover measure is slightly different from that used in the main text, where turnover is cal- culated based on market values contained in position statements and is thus capped at 100 percent per month for each household.! Abnormal re- turns are calculated for purchases and sales by subtracting the com- pound return on the CRSP NYSE0AMEX0Nasdaq value-weighted index. The trade-weighted mean abnormal returns are presented in columns 3 ~for purchases! and 5 ~for sales! of Table AI. In aggregate ~Panel A!, from the day following the trade to the end of the month, the stocks that investors buy underperform the value-weighted market index by 47 basis points, and those they sell outperform the index by two basis points. Based on these abnormal returns and our estimates of aggregate turnover, we calculate that the results we present in the main text over- estimate the performance of individual investors by 2.42 basis points per month. We also analyze the timing of trades by partitioning households on the basis of account size ~Panel B! and turnover ~Panel C!. In each of the sample partitions, the timing of their trades hurts investors. In short, the results in the main text overestimate the performance of individual investors by ig- noring the exact timing of purchases and sales. Consider how the accounting for the exact timing of trades relates to the return calculations contained in the main text. In FigureA1, we present an example of a security that is purchased in month 1 and sold in month 3. A time line for these transactions is depicted in Figure A1. In the main text, we calculate the return for this security from t to t . In 1 3 this appendix, we calculate the return from timing as the return from tcl to b t minus the return from tcl to t . Our estimate of the bid-ask spread is the 1 s s return from t to tcl minus the return from t to tcl. When the return from s s b b timing is added to the main calculation and the spread is subtracted, one gets the ~approximate! return from t to t , the period in which the investor b s held the stock.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 34,
    "chunk_index": 54,
    "word_count": 430,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "to tcl minus the return from t to tcl. When the return from s s b b timing is added to the main calculation and the spread is subtracted, one gets the ~approximate! return from t to t , the period in which the investor b s held the stock.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 34,
    "chunk_index": 55,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "Trading Is Hazardous to Your Wealth 803 Appendix B. The Analysis of Intramonth Trades Inthisappendix,weanalyzetheperformanceofstocksthatareboughtand thensoldwithinacalendarmonth~e.g.,purchasedonJanuary3andsoldon January 10!. These intramonth trades are excluded from our main analyses, sincethoseanalysesarebasedonmonthlypositionstatements.Inaggregate, we estimate that intramonth trades would improve the performance of indi- vidualinvestorsbylessthanonebasispointpermonth~orapproximately0.06 percentannually!.Thoughprofitable,theaggregatevalueofintramonthtrades accounts for less than one percent of the aggregate value of positions held. For each account, we identify all purchases followed by a sale within the same month. In accounting for multiple purchases and sales, we assume that the first securities purchased are the first sold. Over our 72-month sample period, we identify 87,095 round-trip intramonth trades worth ap- proximately $27 million per month, on average. In contrast, the average beginning-of-month value of positions held, which we analyze in the main text, is over $2.7 billion. We calculate the gross returns on these round-trip transactions using the CRSP daily return files assuming the security is purchased and sold at the close of trading on the purchase and sale dates, respectively. We calculate the net returns on these round-trip transactions by subtracting estimates of the bid-ask spread and commissions as is done in the main text for the case of monthly returns. The average round-trip trade involves a purchase of $22,275, is held for 6.16 days, and costs 2.08 percent in commissions and 0.30 percent for the bid-ask spread. ~In aggregate, these round-trip trades cost 0.87 percent in commissions and 0.27 percent for the bid-ask spread.! Note that the bid-ask spread is lower than that documented for trades that weanalyzeinthemaintext,whichhaveanaverageround-tripbid-askspread of one percent ~see Table I!. This lower spread is likely a result of the in- traday return earned by investors from the transaction price through the end of the trading day ~which is included in our estimate of the spread! rather than a smaller bid-ask spread for these intramonth trades. InTableBI,wesummarizeouranalysisofthegrossandnetreturnsearned on intramonth trades. In this table, we calculate market-adjusted abnormal returnsbysubtractingthedailyvalue-weightedNYSE0AMEX0NasdaqCRSP market index from the return earned on each intramonth trade. Both the grossandnetabnormalreturnsinthistableareweightedbythesizeofeach trade, so that we can estimate the aggregate impact of these intramonth trades on the performance of individual investors. Panel A presents results for all households. In aggregate, the intramonth trades earn impressive gross abnormal returns of 1.64 percent. The net ab- normalreturnsare0.50percent.Sincetheseintramonthtradesaverage0.99 percent of the average value of positions held, we estimate that these intra- monthtradeswouldimprovetheperformanceofindividualinvestorsby0.49 basis points per month ~0.0050 times 0.0099! in aggregate. This small im- provement in performance does not affect any of the conclusions that we present in the main text.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 34,
    "chunk_index": 56,
    "word_count": 412,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "of 1.64 percent. The net ab- normalreturnsare0.50percent.Sincetheseintramonthtradesaverage0.99 percent of the average value of positions held, we estimate that these intra- monthtradeswouldimprovetheperformanceofindividualinvestorsby0.49 basis points per month ~0.0050 times 0.0099! in aggregate. This small im- provement in performance does not affect any of the conclusions that we present in the main text.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 34,
    "chunk_index": 57,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "804 The Journal of Finance TableBI The Gross and NetAbnormal Returns earned on Intramonth Trades The sample is account records for 66,465 households at a large discount brokerage firm from January1991toDecember1996.Thegrossabnormalreturnonintramonthtradesiscalculated as the compound return from the day following the purchase to the day of the sale less the compoundreturnonavalue-weightedNYSE0AMEX0Nasdaqindex.Thenetabnormalreturnis thegrossabnormalreturnadjustedforthereturnearnedonthedayofthepurchaseorsale,the bid-askspread,andthecommissioncost.Theintramonthtradesasapercentageoftotalposi- tionvaluearetheaveragemonthlyvalueofintramonthpurchasesdividedbytheaveragemonthly valueofallstocksheld.Theestimatedeffectonmonthlyabnormalreturnisthenetabnormal return times the intramonth trades as a percentage of total position value. Intramonth Estimated Trades as a Change in Gross Net Percentage Monthly Mean Abnormal Abnormal of Total Abnormal Trade Return Return Position Return Sample Size ~%! ~%! Value ~%! PanelA:Aggregate All households $22,275 1.636 0.496 0.99 0.0049 Panel B: Households Partitioned by Beginning Position Value 1 ~Small! 17,459 2.376 0.904 1.42 0.0128 2 12,579 2.082 0.248 0.92 0.0023 3 17,173 1.757 0.486 1.17 0.0057 4 20,255 1.363 0.351 1.33 0.0046 5 ~Large! 28,387 1.563 0.526 0.86 0.0045 Panel C: Households Partitioned by Turnover 1 ~Low! 10,638 20.003 20.026 0.00 0.0000 2 12,876 3.006 0.200 0.02 0.0000 3 11,886 1.843 0.220 0.08 0.0002 4 13,838 2.925 1.378 0.36 0.0050 5 ~High! 23,702 1.545 0.451 6.92 0.0312 Wealsoanalyzetheprofitabilityofintramonthtradesbypartitioninghouse- holdsonthebasisofaccountsize~PanelB!andturnover~PanelC!.Inshort, none of these results are so dramatic that they would lead us to qualify any oftheresultsthatwepresentinourmaintext.Thosewhobenefitmostfrom intramonth trades are those who trade most. Their intramonth trades im- prove their performance by 3.12 basis points per month ~last row and last column of Panel C!.Yet, we estimate that these investors underperform by a whopping 86 basis points per month ~last row, Table V!. In conclusion, we emphasize that the positive net returns earned on in- tramonth trades do not necessarily imply that individual investors have su- periorshort-termtradingability.Ifinvestorshaveadispositiontosellwinning investments and ride losing investments ~as proposed by Shefrin and Stat- man~1985!!,wewouldexpecttoobservepositiveabnormalreturnsonshort- term round-trip trades.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 34,
    "chunk_index": 58,
    "word_count": 283,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "a whopping 86 basis points per month ~last row, Table V!. In conclusion, we emphasize that the positive net returns earned on in- tramonth trades do not necessarily imply that individual investors have su- periorshort-termtradingability.Ifinvestorshaveadispositiontosellwinning investments and ride losing investments ~as proposed by Shefrin and Stat- man~1985!!,wewouldexpecttoobservepositiveabnormalreturnsonshort- term round-trip trades.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 34,
    "chunk_index": 59,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "Trading Is Hazardous to Your Wealth 805 REFERENCES Alpert,Marc,andHowardRaiffa,1982,Aprogressreportonthetrainingofprobabilityasses- sors; in Daniel Kahneman, Paul Slovic, andAmos Tversky, eds.: Judgment Under Uncer- tainty: Heuristics and Biases ~Cambridge University Press, Cambridge!. Barber,BradM.,ReuvenLehavy,MaureenMcNichols,andBrettTrueman,1998,Caninvestors profitfromtheprophets?Consensusanalystrecommendationsandstockreturns,Working paper, Graduate School of Management, University of California, Davis. Beebower,Gilbert,andWilliamPriest,1980,Thetricksofthetrade,JournalofPortfolioMan- agement 6, 36–42. Benos, Alexandros V., 1998, Overconfident speculators in call markets: Trade patterns and survival, Journal of Financial Markets 1, 353–383. Caballé, Jordi, and József Sákovics, 1998, Overconfident speculation with imperfect competi- tion, Working paper, UniversitatAutònoma de Barcelona, Spain. Carhart, Mark M., 1997, On persistence in mutual fund performance, Journal of Finance 52, 57–82. Daniel,Kent,DavidHirshleifer,andAvanidharSubrahmanyam,1998,Investorpsychologyand security market under- and overreactions, Journal of Finance 53, 1839–1885. Falkenstein, Eric G., 1996, Preferences for stock characteristics as revealed by mutual fund portfolio holdings, Journal of Finance 51, 111–135. Fama, Eugene F., 1991, Efficient capital markets II, Journal of Finance 46, 1575–1618. Fama,EugeneF.,andKennethR.French,1993,Commonriskfactorsinreturnsonstocksand bonds, Journal of Financial Economics 33, 3–56. Gervais,Simon,andTerranceOdean,1998,Learningtobeoverconfident,Workingpaper,Whar- ton School, University of Pennsylvania. Gompers, Paul, and Andrew Metrick, 1998, How are large institutions different from other investors? Why do these differences matter?, Working paper, Harvard Business School. Griffin,Dale,andAmosTversky,1992,Theweighingofevidenceandthedeterminantsofcon- fidence, Cognitive Psychology 24, 411–435. Grinblatt,Mark,andSheridanTitman,1993,Performancemeasurementwithoutbenchmarks: An examination of mutual fund returns, Journal of Business 66, 47–68. Grossman, Sanford J., and Joseph E. Stiglitz, 1980, On the impossibility of informationally efficient markets, American Economic Review 70, 393–408. Holthausen,Robert,RichardLeftwich,andDavidMayers,1987,Theeffectoflargeblocktrans- actions of security prices: A cross-sectional analysis, Journal of Financial Economics 19, 237–267. Jegadeesh, Narisimhan, and Sheridan Titman, 1993, Returns to buying winners and selling losers: Implications for stock market efficiency, Journal of Finance 48, 65–91. Jensen, Michael C., 1969, Risk, the pricing of capital assets, and evaluation of investment portfolios, Journal of Business 42, 167–247. Kang, Jun-Koo, and René Stulz, 1997, Why is there a home bias?An analysis of foreign port- folio equity ownership in Japan, Journal of Financial Economics 46, 3–28. Keim,Donald,andAnanthMadhavan,1998,Thecostofinstitutionalequitytrades,Financial Analysts Journal 54, 50–69. Kraus,Alan, and Hans Stoll, 1972, Price impacts of block trading on the NewYork Stock Ex- change, Journal of Finance 27, 569–588. Kyle,AlbertS.,andF.AlbertWang,1997,Speculationduopolywithagreementtodisagree:Can overconfidence survive the market test?, Journal of Finance 52, 2073–2090. Lakonishok,Josef,AndreiShleifer,andRobertW.Vishny,1992,Thestructureandperformance ofthemoneymanagementindustry;inMartinNeilBailyandCliffordWinston,eds.:Brook- ingsPapersonEconomicActivity:Microeconomics,~BrookingsInstitution,Washington,D.C.!. LaPlante,Michele,andChrisMuscarella,1997,Doinstitutionsreceivecomparableexecutionin theNYSEandNasdaqmarkets?Atransactionsstudyofblocktrades,JournalofFinancial Economics 45, 97–134. Lyon,JohnD.,BradM.Barber,andChih-LingTsai,1999,Improvedmethodsfortestsoflong- run abnormal stock returns, Journal of Finance 54, 165–201.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 34,
    "chunk_index": 60,
    "word_count": 355,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  },
  {
    "text": "Kraus,Alan, and Hans Stoll, 1972, Price impacts of block trading on the NewYork Stock Ex- change, Journal of Finance 27, 569–588. Kyle,AlbertS.,andF.AlbertWang,1997,Speculationduopolywithagreementtodisagree:Can overconfidence survive the market test?, Journal of Finance 52, 2073–2090. Lakonishok,Josef,AndreiShleifer,andRobertW.Vishny,1992,Thestructureandperformance ofthemoneymanagementindustry;inMartinNeilBailyandCliffordWinston,eds.:Brook- ingsPapersonEconomicActivity:Microeconomics,~BrookingsInstitution,Washington,D.C.!. LaPlante,Michele,andChrisMuscarella,1997,Doinstitutionsreceivecomparableexecutionin theNYSEandNasdaqmarkets?Atransactionsstudyofblocktrades,JournalofFinancial Economics 45, 97–134. Lyon,JohnD.,BradM.Barber,andChih-LingTsai,1999,Improvedmethodsfortestsoflong- run abnormal stock returns, Journal of Finance 54, 165–201. 806 The Journal of Finance Malkiel,BurtonG.,1995,Returnsfrominvestinginequitymutualfunds1971to1991,Journal of Finance 50, 549–572. Odean,Terrance,1998a,Areinvestorsreluctanttorealizetheirlosses?,JournalofFinance53, 1775–1798. Odean, Terrance, 1998b, Volume, volatility, price, and profit when all traders are above aver- age, Journal of Finance 53, 1887–1934. Odean, Terrance, 1999, Do investors trade too much?, American Economic Review 89, 1279– 1298. Schlarbaum, Gary G., Wilbur G. Lewellen, and Ronald C. Lease, 1978a, The common-stock- portfolioperformancerecordofindividualinvestors:1964–70,JournalofFinance33,429–441. Schlarbaum, Gary G., Wilbur G. Lewellen, and Ronald C. Lease, 1978b, Realized returns on commonstockinvestments:Theexperienceofindividualinvestors,JournalofBusiness51, 299–325. SecurityIndustryAssociation,1997,SecuritiesIndustryFactBook~SecurityIndustryAssocia- tion, New York!. Shefrin, Hersh, and Meir Statman, 1985, The disposition to sell winners too early and ride losers too long: Theory and evidence, Journal of Finance 40, 777–790. Womack,KentL.,1996,Dobrokerageanalysts’recommendationshaveinvestmentvalue?,Jour- nal of Finance 51, 137–167.",
    "title": "Trading Is Hazardous to Your Wealth",
    "source_type": "pdf",
    "document_id": "4781e7184d1f",
    "source_file": "Trading Is Hazardous to Your Wealth.pdf",
    "section": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 34,
    "chunk_index": 61,
    "word_count": 162,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "THEJOURNALOFFINANCE•VOL.LV,NO.2•APRIL2000 (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000315095127Z",
    "duration": null
  }
]