[
  {
    "text": "Bull and bear markets — historical trends and portfolio impact With market volatility a central concern among investors, it is important to review historical trends to put market volatility concerns into perspective. As shown in the chart below, bull/rising markets (shown in dark blue) have been longer and more sustained than bear/ declining markets (shown in light blue). The effect that market volatility has on your portfolio may be minimized with a long-term outlook and investment plan. Bull and bear facts1 Bull market Bear market Average gain in bull market: +180.04% A prolonged market period in which an A prolonged market period in which an investment has prices that rise faster investment has prices that fall. It is typically Average length of bull market: 1,764 days than the historical average. It is typically characterized by a stock market that has Average loss in bear market: -36.34% characterized by a stock market rise of at fallen at least 20% from its previous high.2 Average length of bear market: 349 days least 20% from its previous low.2 The historical performance of the S&P 500 Index during US bull and bear markets Bull markets Bear markets The bold numbers calculate the duration of months for the market, either being bull or bear, and the percentages cover the total return for the time period.1 73.8 147.7 3.4 1.5 125.63% 582.15% 21.40% 24.22% 62.5 131.3 60.4 96.21% 400.52% 228.81% 20.5 6.6 2.1 -27.11% -31.97% -27.62% 20.7 3.3 17.9 13.4 -48.20% -33.51% -36.77% -51.93% Not a Deposit Not FDIC Insured Not Guaranteed by the Bank May Lose Value Not Insured by any Federal Government Agency )%( snruteR 11/6812/70 12/75 12/80 12/85 12/90 12/95 12/00 12/05 12/10 12/15 12/20 600 500 9.3 67.88% 400 31.5 73.53% 300 200 100 0 17.9 1.1 -100 -36.06% -33.92% In the chart above, the dark blue time periods indicate bull markets when the S&P 500 rose 20% or more from its previous low. The light blue time periods indicate bear markets when the S&P 500 declined 20% or more from its previous high. On average, when the market is evaluated from 11/29/68–12/31/20, there were bear markets or losses for 349 days, while the bull markets or gains were for 1,764 days. Data shown is as of the last bull market through 12/31/2020. 1. Source: Bloomberg L.P. Returns from 11/29/68–12/31/20. The S&P 500 Index is an unmanaged index of 500 stocks used to measure large-cap US stock market performance. Investors cannot invest directly in an index. Index returns do not reflect any fees, expenses, or sales charges. This chart is for illustrative purposes only and not indicative of any actual investment. These returns were the result of certain market factors and events which may not be repeated in the future. Past performance is no guarantee of future results. 2. S ource: Invesco.",
    "title": "US bull and bear markets - historical trends and portfolio impact",
    "source_type": "pdf",
    "document_id": "1b3b1c2bde75",
    "source_file": "US bull and bear markets - historical trends and portfolio impact.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 2,
    "chunk_index": 0,
    "word_count": 470,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210503164823-04'00'",
    "duration": null
  },
  {
    "text": "fees, expenses, or sales charges. This chart is for illustrative purposes only and not indicative of any actual investment. These returns were the result of certain market factors and events which may not be repeated in the future. Past performance is no guarantee of future results. 2. S ource: Invesco. About risk Stock and other equity securities values fluctuate in response to activities specific to the company as well as general market, economic, and political conditions. This does not constitute a recommendation of any investment strategy or product for a particular investor. Investors should consult a financial professional before making any investment decisions. invesco.com BULLBEAR-FLY-1 05/21 NA3478 Invesco Distributors, Inc.",
    "title": "US bull and bear markets - historical trends and portfolio impact",
    "source_type": "pdf",
    "document_id": "1b3b1c2bde75",
    "source_file": "US bull and bear markets - historical trends and portfolio impact.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 2,
    "chunk_index": 1,
    "word_count": 110,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210503164823-04'00'",
    "duration": null
  }
]