[
  {
    "text": "A Guide to Investment and Trading Features Matthew T. Moran and Berlinda Liu Statement of Purpose CFA Institute Research Foundation is a not-for- profit organization established to promote the development and dissemination of relevant research for investment practitioners worldwide. Neither CFA Institute Research Foundation, CFA Institute, nor the publication’s edi- torial staff is responsible for facts and opinions presented in this publication. This publication reflects the views of the author(s) and does not represent the official views of CFA Institute Research Foundation. CFA®, Chartered Financial Analyst®, and GIPS® are just a few of the trademarks owned by CFA Institute. To view a list of CFA Institute trademarks and the Guide for the Use of CFA Institute Marks, please visit our website at www.cfainstitute.org. © 2020 CFA Institute Research Foundation. All rights reserved. No part of this publication may be reproduced, stored in a retrieval system, or transmitted, in any form or by any means, electronic, mechanical, photocopying, recording, or otherwise, without the prior written permission of the copyright holder. This publication is designed to provide accurate and authoritative information in regard to the subject matter covered. It is sold with the understanding that the publisher is not engaged in rendering legal, accounting, or other professional service. If legal advice or other expert assistance is required, the services of a competent professional should be sought. Cover photo credit: Roland Shainidze Photography / Moment / Getty Images ISBN 978-1-944960-95-7",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "TRADING INSTRUMENTS",
    "page_number": 1,
    "page_range": "p.1-4",
    "total_pages": 32,
    "chunk_index": 0,
    "word_count": 237,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "TRADING INSTRUMENTS (p.1-4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "is sold with the understanding that the publisher is not engaged in rendering legal, accounting, or other professional service. If legal advice or other expert assistance is required, the services of a competent professional should be sought. Cover photo credit: Roland Shainidze Photography / Moment / Getty Images ISBN 978-1-944960-95-7 Foreword ............................................................................................................................v The VIX Index: A Gauge of Expected Future Volatility ..........................................................2 Futures and Options on the VIX ..........................................................................................5 Benchmark Indexes for Futures and Options on the VIX. ......................................................7 Adding VIX Futures Indexes to Portfolios...........................................................................12 Conclusion .......................................................................................................................18 References ........................................................................................................................19 This publication qualifies for 2 CE credits under the guidelines of the CFA Institute Continuing Education Program.",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "CONTENTS",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 32,
    "chunk_index": 1,
    "word_count": 106,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "CONTENTS (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "Gauge of Expected Future Volatility ..........................................................2 Futures and Options on the VIX ..........................................................................................5 Benchmark Indexes for Futures and Options on the VIX. ......................................................7 Adding VIX Futures Indexes to Portfolios...........................................................................12 Conclusion .......................................................................................................................18 References ........................................................................................................................19 This publication qualifies for 2 CE credits under the guidelines of the CFA Institute Continuing Education Program.",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "FOREWORD",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 32,
    "chunk_index": 2,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "FOREWORD (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "My tenure on Wall Street began at the bottom who never use futures and options. The origi- of the bull market in August 1982, just before nal VIX Index, launched in 1993, was based the 1983 launch of options on the S&P 100 and on S&P 100 options, but it has developed its S&P 500 indexes. As a research analyst covering methodology to become the VIX we know index and stock options, I did my best to extract today. It measures implied or expected volatil- implied volatility metrics from their prices. At ity of the S&P 500 over the next 30 days, as cal- that time this meant using spreadsheet tools culated from near-term S&P 500 option prices (VisiCalc and Lotus 1-2-3) and computer for a range of stock prices. The VIX calculation programming languages such as Fortran and methodology is used for VIX-type indexes in Pascal. Forecasts of volatility for equities were equity benchmarks around the world that have highly valued by investors as a measure of trad- active options trading. ers’ uncertainty about a stock or index price for As vice chair and head of the Research a specific time frame. Committee for the CFA Institute Research As it turned out, S&P 100 implied volatility was Foundation, I am excited to share with you the one of the few indicators suggesting height- publication of this primer—“The VIX Index and ened investor risk expectations just prior to the Volatility-Based Global Indexes and Trading now infamous October 1987 crash. In the days Instruments.” Futures on the VIX began trad- just before the crash, it moved up to a record ing in 2004 on the Cboe Options Exchange 30% level. On 19 October the S&P 500 fell an and options in 2006. Indexes constructed from unheard of 20.5% and shaken investors sent these futures prices serve as benchmarks for implied volatility that day and week for both the exchange-traded funds, exchange-traded notes, S&P 100 and S&P 500 soaring to levels well in and other fund products that investors turn to excess of 100%. For the rest of my long career as for risk management and for taking views on a derivatives strategist, I was always grateful for changes in the volatility expectations of broad the lessons learned by studying implied volatil- equity indexes. The co-authors, Matthew Moran ity in those early years. It taught me about how of Cboe and Berlinda Liu of S&P Dow Jones “storms” can develop rapidly in quiet equity Indices, have been educating investors about markets and how investor psychology and the VIX and VIX futures and indexes almost liquidity pressures can be major factors driving since the inception of these products. We are equity prices. fortunate to have them write this Brief to help broaden and deepen the knowledge of investors The VIX Index, together with its derivative trad- in this complex and critical area of the financial ing products and indexes, was an outgrowth of marketplace. the attention focused on market barometers of uncertainty during and after the market tur- The many investors that regularly follow the bulence in 1987. As the world’s most widely VIX and volatility-trading products are inter- followed measure of investor sentiment and ested in obtaining a deeper understanding of expected equity market risk, the VIX is moni- how the products behave in various market tored by a wide range of investors—even those conditions. This publication covers all of these CFA Institute Research Foundation | v",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "FOREWORD",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 32,
    "chunk_index": 3,
    "word_count": 575,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "FOREWORD (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "inter- followed measure of investor sentiment and ested in obtaining a deeper understanding of expected equity market risk, the VIX is moni- how the products behave in various market tored by a wide range of investors—even those conditions. This publication covers all of these CFA Institute Research Foundation | v",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "FOREWORD",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 32,
    "chunk_index": 4,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "FOREWORD (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "FoRewoRd topics. The distribution of the VIX is positively 50%, compared with its average of 15% in 2019 skewed: It may stay below average for long peri- and 14% in 2020 through February 19. ods but will rise to multiples of average and Similar equity market declines and VIX-like median levels. VIX index levels exhibit mean surges were occurring globally. In Europe, the reversion over time and reflect volatility expec- VSTOXX, which measures implied volatility tations that are, on average, higher than realized of EURO STOXX 50 Index options, closed at S&P 500 volatility. (This difference is called the 86% on 16 March 2020, its second highest daily “volatility risk premium.”) close ever. VIX futures and associated indexes reflect As is typical in highly uncertain market condi- expectations for 30-day index volatility out in tions, investors from 20 February to 26 March time. Their returns are correlated with the VIX 2020 turned to volatility-trading products. VIX but can be significantly above (in contango) or futures volume over the that period was 77% below (in backwardation) spot VIX levels. VIX higher than the 2019 level, and options activity futures indexes have unique return drivers, was up as much as 161%. By the end of the week including the cost of rolling VIX futures posi- beginning 27 March 2020, central bankers and tions, which can be a significant component of governments around the globe had responded returns over time. Investors appreciate that VIX with policy initiatives, and equity markets had futures and futures indexes have returns that rebounded somewhat. But the VIX was still are negatively correlated with equities and real- high—66%. ize that how the futures products perform in a portfolio context is key to using them effectively. The public health, economic, and financial mar- ket picture is still evolving as I write this fore- Few of us expected to see anything like the word. We have seen such extremes in investor extreme levels of October 1987 equity volatility uncertainty infrequently, thank goodness. For again in our lifetimes, but in early 2020, a global decades, investors have understood that finan- pandemic and its economic fallout descended cial markets reward risk taking but that risk can upon us—just the type of event that can instill change dramatically from one economic cycle sufficient uncertainty in investors to set new to another and as new information emerges records for indexes like the VIX. As this publi- unexpectedly. Index option prices are set in cation was going to press (with data ending in competitive and open markets and will continue December 2019), financial markets were react- to serve as valuable measures of the changing ing to the developing news of the spread of the perceptions of risk to broad market indexes. global COVID-19 pandemic. Between the S&P Understanding the VIX Index and the trading 500’s high on 19 February 2020 and its low on and investment products based on it is highly 23 March 2020, the S&P 500 fell almost 34%. valuable for anyone who wishes to assess or The VIX moved from 14% to 62%, and the S&P manage equity risk. 500 VIX Short-Term Futures Index moved up more than 300%. During this period, the VIX Joanne M. Hill reached its highest closing level ever (83%) on 16 Vice Chair, CFA Institute Research Foundation March, a day when the S&P 500 fell some 12%. 30 March 2020 Over the full turbulent 26 trading days between 20 February and 26 March, the VIX averaged vi | CFA Institute Research Foundation",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "FOREWORD",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 32,
    "chunk_index": 5,
    "word_count": 585,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "FOREWORD (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "reached its highest closing level ever (83%) on 16 Vice Chair, CFA Institute Research Foundation March, a day when the S&P 500 fell some 12%. 30 March 2020 Over the full turbulent 26 trading days between 20 February and 26 March, the VIX averaged vi | CFA Institute Research Foundation",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "FOREWORD",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 32,
    "chunk_index": 6,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "FOREWORD (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "Matthew T. Moran and Berlinda Liu Matthew T. Moran is head of Global Benchmark Indexes Advancement at Cboe Global Markets, Chicago. Berlinda Liu is director of Global Research & Design at S&P Dow Jones Indices, New York City. The Cboe Volatility Index® (VIX® Index) mea- volatility-based trading products, and the use sures the market’s expectation of future volatility of VIX futures in portfolio construction. These conveyed by S&P 500 Index option prices. The questions include the following: VIX is recognized as a premier gauge of expected 1. What does the VIX Index measure, and US equity market volatility. The 2000–09 decade what does a VIX level signify? experienced two deep bear markets for equities that saw numerous short-term periods of high 2. What are some indexes that measure levels of investor uncertainty. Most investors expected volatility of European or Asian recall how during the financial crisis of 2008– stock indexes? 2009, the correlations between equities rose glob- ally and traditional diversification goals became 3. How do features such as convexity and neg- difficult to achieve. Exchange-listed VIX futures ative correlation make the VIX an intriguing were launched in 2004, and VIX options were investment gauge? launched in 2006. During the 2008–09 financial 4. Is the VIX Index tradable, and if not, why? crisis, VIX futures and VIX options experienced tremendous growth, as interest in and use of such 5. What tradable volatility-based futures and index-based products as exchange-traded notes options products are available? and exchange-traded funds grew. These products 6. How do contango and backwardation have become widely used in investors’ strategies affect the returns of VIX futures-based ranging from trading tactical views on volatility strategies? to incorporating volatility trades and hedges in risk management and multiasset strategies. 7. What volatility benchmark indexes are available, and what is their impact when This study addresses several questions inves- added to S&P 500 portfolios? tors have asked related to the VIX Index, CFA Institute Research Foundation | 1",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 32,
    "chunk_index": 7,
    "word_count": 326,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "to incorporating volatility trades and hedges in risk management and multiasset strategies. 7. What volatility benchmark indexes are available, and what is their impact when This study addresses several questions inves- added to S&P 500 portfolios? tors have asked related to the VIX Index, CFA Institute Research Foundation | 1",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 32,
    "chunk_index": 8,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "The VIX IndeX And VoLATILITy-BAsed GLoBAL IndeXes And TRAdInG InsTRuMenTs THE VIX INDEX: A GAUGE OF options, this methodology transformed the VIX EXPECTED FUTURE VOLATILITY from an abstract concept into a practical stan- dard for trading and hedging volatility.1 Volatility is a key consideration for many trad- The VIX Index (often referred to as the “spot ers and investors. Historical volatility mea- VIX”) is not itself investable. Rather, it is sures the extent of return fluctuations over a designed to reflect volatility expectations at a historical period—for example, the annualized future time based on SPX options. Because the standard deviation of the day-to-day (closing VIX is always measuring expected volatility price) returns on a set number of past trading 30 days ahead, directly from option prices, the days, expressed as an annualized percentage. composition of the strip of SPX options used to Implied volatility is derived from a market’s cur- calculate the VIX level often changes through- rent price of an options contract and reflects out the trading day. This ever-changing basket expectations of future volatility. Investors look of SPX options used to calculate the VIX makes at historical volatility to gain insights into past it impractical and expensive to hold on an ongo- market movements, but investors also analyze ing basis. volatility indexes, such as the VIX, to gain real- time updates on market sentiment and expecta- In 2014, Cboe enhanced the VIX to include SPX tions of future volatility. The VIX, introduced weekly options expirations in its calculation. in 1993, measures the market’s expectation Only SPX options with Friday expirations (stan- of future 30-day volatility. Like conventional dard and weekly expirations) are used to calcu- indexes, the VIX uses rules for selecting the late the VIX. (Cboe lists SPX options that expire component options and a formula for calculat- on days other than Friday, but non-Friday SPX ing index values. expirations are not used to calculate the VIX.) The inclusion of SPX weekly options allows the In 1993, the Chicago Board Options Exchange® VIX to be calculated with SPX option series that (now known as Cboe®) introduced the origi- more precisely match the 30-day target time nal version of the VIX Index to measure the frame for expected volatility that the VIX is market’s expectation of 30-day volatility of intended to represent. Using SPX options with the S&P 100 Index as implied by the prices of more than 23 days and fewer than 37 days to at-the-money options (see Whaley 1993). The expiration ensures that the VIX always reflects VIX soon became a leading gauge for US stock an interpolation of two points along the S&P market volatility. In 2003, the VIX methodology 500 volatility term structure.2 was revised to reflect a new way of measuring expected volatility. The changes to its meth- odology were intended to make it more robust and relevant to volatility traders and hedgers. Specifically, since 2003, the VIX has been based 1The price history for the Cboe S&P 100 Volatility Index on options on the S&P 500 Index (SPX), the (ticker VXO), using the original 1993 methodology based core index for US equities. The VIX estimates on S&P 100 options, is available from 1986 to the present, expected volatility by aggregating the weighted and the price history for the current version of the VIX prices of SPX puts and calls over a wide range of (based on SPX options since 2003) is available from 1990 to the present. strike prices. By supplying a means of replicat- 2Detailed information regarding the VIX methodology is ing volatility exposure with a portfolio of SPX available on the Cboe website: www.cboe.com/vix. 2 | CFA Institute Research Foundation",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 32,
    "chunk_index": 9,
    "word_count": 610,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "range of (based on SPX options since 2003) is available from 1990 to the present. strike prices. By supplying a means of replicat- 2Detailed information regarding the VIX methodology is ing volatility exposure with a portfolio of SPX available on the Cboe website: www.cboe.com/vix. 2 | CFA Institute Research Foundation",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 32,
    "chunk_index": 10,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "The VIX IndeX And VoLATILITy-BAsed GLoBAL IndeXes And TRAdInG InsTRuMenTs How VIX Levels Translate related to strong returns from the technology into Expected Risk sector but the expected volatility of the S&P 500 (as measured by the VIX) indicated that inves- In the 30-year period from 1990 through 2019, tors perceived rising uncertainty about sustain- the daily closing values of the VIX have fluctu- ing the gains from this sector. ated in a wide range, as shown in Figure 1, with short-term surges to levels well above the mean Correlations and Worldwide and median values. Volatility Over this period, the daily closing levels of the A key feature of the VIX that often attracts VIX had a median value of 17.2 and an average attention is that its movements have usually had value of 19.1, with daily closing levels ranging a negative correlation with price movements of from a low of 9.14 on 3 November 2017 to a the key global stock indexes. Moreover, these high of 80.86 on 20 November 2008. The VIX correlations have generally become even more also tended to be higher than realized volatil- negative in times of market turbulence, such ity (measured over 20 subsequent trading days) as during the year 2008. When stock market except when historical volatility was very indexes suffer sharp declines, expected volatility high. In addition, almost all spikes in the VIX tends to rise, reflecting an increase in demand occurred during periods of steep declines in the for protecting a stock portfolio with SPX put S&P 500. The only exception was during 1998– options and the associated increase in option 1999, when the S&P 500 was in an uptrend prices as a result of heightened risk aversion. FIGURE 1. VIX INDEX, HISTORICAL VOLATILITY, AND STOCK INDEX PRICES, 1990–2019 VIX and Historical Volatility of SPX S&P 500 (SPX) 90 3300 Historical Volatility of SPX* (avg. 15.3) S&P 500 60 2200 VIX (avg. 19.1) 30 1100 0 0 Jan/90 Dec/93 Dec/97 Dec/01 Dec/05 Dec/09 Dec/13 Jan/18 *20-trading-day historical volatility. Notes: daily closing values. The VIX Index and historical volatility are measured on the left axis; the s&P 500 is measured on the right axis. Sources: Bloomberg and Cboe. CFA Institute Research Foundation | 3",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 32,
    "chunk_index": 11,
    "word_count": 372,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "30 1100 0 0 Jan/90 Dec/93 Dec/97 Dec/01 Dec/05 Dec/09 Dec/13 Jan/18 *20-trading-day historical volatility. Notes: daily closing values. The VIX Index and historical volatility are measured on the left axis; the s&P 500 is measured on the right axis. Sources: Bloomberg and Cboe. CFA Institute Research Foundation | 3",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 32,
    "chunk_index": 12,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "The VIX IndeX And VoLATILITy-BAsed GLoBAL IndeXes And TRAdInG InsTRuMenTs A challenge for investors who try to diversify in Australia, the HSI Volatility Index (VHSI) is across global equity markets is that the correla- based on the Hang Seng in Hong Kong, the India tions of the global stock indexes have generally VIX reflects expected volatility of India’s NIFTY risen over the past three decades. During the 50 Index, and the EURO STOXX 50 Volatility 2007–09 crisis, a number of indexes—including Index (VSTOXX) is based on the EURO STOXX the S&P 500, EURO STOXX 50 Index, Hang 50. The negative correlations of many volatility Seng Index for Hong Kong stocks, and the S&P indexes have helped stimulate interest in explor- GSCI (Goldman Sachs Commodity Index)—all ing the possibility of using volatility-related experienced drawdowns of worse than 50%. As products for portfolio diversification. For an a result, the desired diversification benefit of overview of 30 volatility indexes and worldwide owning global equities and commodities failed volatility, please see Moran (2014). to materialize. The Volatility Risk Premium: Conversely, as shown in Table 1, in 2008, five of the world’s leading volatility indexes all rose by Implied minus Historical Volatility at least 50%, and the correlations of the weekly A number of studies have noted that key index returns of the volatility indexes versus the local options markets have supplied a volatility risk stock indexes were negative. For four of the premium since the 1990s. Specifically, for SPX five volatility indexes, the correlations in 2008 options, implied volatilities usually have been were even more negative than they were dur- higher than historical (or realized) volatilities ing the 12-year period. All five volatility indexes for the S&P 500 (Feldman and Roy 2005; Hill, have somewhat similar methodologies but are Balasubramanian, Gregory, and Tierens 2006; based on stock index options traded in various He, Hsu, and Rue 2015; Black and Szado 2016; world markets. The S&P/ASX 200 VIX reflects Wilshire Analytics Applied Research Group expected volatility of the S&P/ASX 200 Index 2019). In 29 of the 30 years from 1990 through TABLE 1. FIVE GLOBAL VOLATILITY INDEXES OVER 12 YEARS, 2008–2019 Correlations of Weekly Returns % With Local With Local With Maximum Minimum Change Stock Index Stock Index VIX over Index Daily Close Daily Close in 2008 in 2008 over 12 Years 12 Years VIX Index 80.86 9.14 77.8% –0.82 –0.71 1.00 AXVI [s&P/AsX 200 VIX] 66.72 7.39 81.6% –0.75 –0.65 0.58 VhsI [hsI Volatility Index] 104.29 11.36 51.6% –0.66 –0.51 0.51 nVIX [India VIX] 85.13 10.45 69.8% –0.20 –0.37 0.32 VsToXX [euRo sToXX 50 87.51 10.68 142.9% –0.83 –0.73 0.78 Volatility] Note: The five local stock indexes are the s&P 500, s&P/AsX 200, hang seng, nIFTy 50, and euRo sToXX 50. Sources: Bloomberg and Cboe. 4 | CFA Institute Research Foundation",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 32,
    "chunk_index": 13,
    "word_count": 467,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "nVIX [India VIX] 85.13 10.45 69.8% –0.20 –0.37 0.32 VsToXX [euRo sToXX 50 87.51 10.68 142.9% –0.83 –0.73 0.78 Volatility] Note: The five local stock indexes are the s&P 500, s&P/AsX 200, hang seng, nIFTy 50, and euRo sToXX 50. Sources: Bloomberg and Cboe. 4 | CFA Institute Research Foundation",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 32,
    "chunk_index": 14,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "The VIX IndeX And VoLATILITy-BAsed GLoBAL IndeXes And TRAdInG InsTRuMenTs 2019, the average daily closing level for the VIX VIX provide market participants with a vehicle was higher than the subsequent 30-day realized to trade expected volatility. VIX futures were volatility of the S&P 500. launched in March 2004 for trading on the Cboe Futures Exchange, are traded electronically with The existence of a volatility risk premium can also a $1,000 multiplier, and are regulated by the US be seen in the legend in Figure 1, which shows Commodity Futures Trading Commission. VIX that the average daily VIX closing values were 19.1 options were launched in February 2006 with a (compared with an average of 15.3 for the histori- $100 multiplier, are regulated by the US SEC, and cal volatility of the S&P 500) over the 1990–2019 are traded both electronically and on an open- period. This premium can be attributed to several outcry trading floor at Cboe. Expiration and cash factors, including (1) an imbalance in the number settlement for VIX futures and options usually of investors who want to buy protection and those occur on Wednesday mornings in the United who want to sell protection and (2) the tendency States. In 2019, the total annual volume was for index levels to move quickly and sharply in 127 million contracts for VIX options, 62 million response to significant new information, which for VIX futures, 16 million for VSTOXX mini- accounts for short-horizon traders’ tendency to futures, and 7 million for VSTOXX options. use options to capitalize on these moves. VIX futures and VIX options reflect the market’s The persistence of a volatility risk premium estimate of the value of the VIX on various expira- priced into SPX options can facilitate higher tion dates in the future, and the contracts provide returns for option-selling strategies over option- market participants with a variety of opportuni- buying strategies with similar market exposure. ties to implement their views by using volatility- An index that sells index options—the Cboe trading strategies, including risk management, S&P 500 30-Delta BuyWrite Index (BXMDSM)— alpha generation, and portfolio diversification. generated higher returns and higher risk-adjusted returns than both the S&P 500 and the Cboe S&P VIX Futures: Pricing, 500 5% Put Protection Index (PPUTSM) over a period of more than 32 years (Wilshire Analytics Term Structure, Contango, Applied Research Group 2019), but none of these and Backwardation indexes are guaranteed such outperformance in the future. Also, the returns of volatility-selling VIX futures are contracts on future, 30-day, SPX strategies tend to be negatively skewed; perfor- option-implied volatilities that are expected mance during periods of sharp volatility increases on the future expiration date. For example, in can be negative, so investors must be aware of the March, a June VIX futures contract is a contract potential for losses in these periods when decid- on what 30-day implied SPX option volatility ing whether such strategies are consistent with will be on the June expiration date, and a July their risk preferences. VIX futures contract reflects the expectation of what the 30-day implied volatility will be on the FUTURES AND OPTIONS July expiration date. ON THE VIX The rapid growth in the volume of VIX options and futures has been driven by these products’ As noted, the VIX Index is not itself investable. use not only as short-term tactical tools for seek- Exchange-listed futures and options on the ing profit from short-term moves in expected CFA Institute Research Foundation | 5",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 32,
    "chunk_index": 15,
    "word_count": 580,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "the volume of VIX options and futures has been driven by these products’ As noted, the VIX Index is not itself investable. use not only as short-term tactical tools for seek- Exchange-listed futures and options on the ing profit from short-term moves in expected CFA Institute Research Foundation | 5",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 32,
    "chunk_index": 16,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "The VIX IndeX And VoLATILITy-BAsed GLoBAL IndeXes And TRAdInG InsTRuMenTs volatility, but also as a means for investors to to expiration; futures are in backwardation when incorporate more enduring long- or short-term longer-term futures have lower prices than short- volatility exposures into their hedge fund and term futures. A comparison of the prices of front- multiasset strategies. VIX futures and options month VIX futures with second-month VIX strategies include (1) the buying of VIX futures or futures from 2007 through 2019 indicates that VIX call options by investors who are concerned (1) the daily closing prices for VIX futures were about stock market tail risk and believe that near- in contango on approximately 80% of the days term volatility could skyrocket and (2) the selling during the 13-year period, but (2) the daily clos- of VIX futures if the futures are “in contango,” as ing prices for VIX futures were in backwardation explained in the following paragraphs. on most days in the months of October 2008 and August 2011, when the level of the VIX generally For investors who wish to invest in futures con- was higher than its long-term average. tracts related to commodities, interest rates, or volatility, key concepts to understand are contango Figure 2 presents examples of contango and and backwardation. Futures are said to be in con- backwardation. As Panel A shows, on the after- tango when futures with more time to expiration noon of 23 February 2017, the VIX futures were have higher prices than those with a shorter time in contango: The VIX futures term structure was FIGURE 2. PRICING, TERM STRUCTURE, CONTANGO, AND BACKWARDATION: EXAMPLES A. VIX and Select VIX Futures on 23 February 2017 VIX Price 20 18.35 17.18 14.40 15 13.45 12.50 11.90 10 VIX Index VIX Future VIX Future VIX Future VIX Future VIX Future Exp. 1 Mar Exp. 14 Mar Exp. 29 Mar Exp. 19 Jul Exp. 15 Nov B. VIX and Select VIX Futures on 6 February 2018 VIX Price 35 29.98 30 25 21.50 21.00 20 19.33 18.72 18.00 15 VIX Index VIX Future VIX Future VIX Future VIX Future VIX Future Exp. Feb Exp. Mar Exp. May Exp. Aug Exp. Oct Note: In Panel A, the last reported prices were at approximately 2:40 PM us Central Time. Source: Cboe Futures exchange. 6 | CFA Institute Research Foundation",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 32,
    "chunk_index": 17,
    "word_count": 391,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "18.00 15 VIX Index VIX Future VIX Future VIX Future VIX Future VIX Future Exp. Feb Exp. Mar Exp. May Exp. Aug Exp. Oct Note: In Panel A, the last reported prices were at approximately 2:40 PM us Central Time. Source: Cboe Futures exchange. 6 | CFA Institute Research Foundation",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 32,
    "chunk_index": 18,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "The VIX IndeX And VoLATILITy-BAsed GLoBAL IndeXes And TRAdInG InsTRuMenTs BENCHMARK INDEXES upward sloping, with VIX longer-dated futures priced higher than the near-term VIX futures FOR FUTURES AND OPTIONS prices and the value of the VIX. In contrast, ON THE VIX Panel B shows an example of backwardation that occurred on 6 February 2018: That day, the On 22 January 2009, S&P Dow Jones Indices VIX closed at 29.98 while all listed VIX futures launched the first index based on rolled closed more than 8 points lower than the clos- positions in VIX futures, the S&P 500 VIX ing VIX value; the resulting VIX term structure Short-Term Futures Index. The investment was generally downward sloping. community quickly adopted this index as a To expand understanding of volatility instru- benchmark of hypothetical short-term VIX ments, we now show how the VIX Index moves futures performance. compared with VIX futures in response to The concept behind VIX futures indexes is simi- a major event that is a shock to the financial lar to that used in commodity futures indexes, markets. Events with negative implications for with the rolling of positions incorporated into future equity earnings or risk can have a big the index. Although commodity futures indexes impact on the next month’s expected volatility; have rules-based strategies for rolling futures the event’s impact on 30-day expected volatility close to expiration, the VIX futures indexes several months into the future, however, tends rolled an equivalent portion each trading day to to be more muted. Panel A of Figure 3 shows smooth out the rolling process over a calendar the price movements for the VIX and select VIX month. A suite of benchmark indexes based on futures in August 2011. On 5 August, Standard VIX futures and options was subsequently cre- & Poor’s downgraded US Treasury debt to AA+, ated to address various investment demands. and as the graph shows, on 8 August, the VIX rose 50% to close at 48. Panel B depicts price Methodology movements for the VIX and VIX futures in August 2015, when many financial market par- The widely followed S&P 500 VIX Short-Term ticipants were concerned about a possible cool- Futures Index replicates a hypothetical VIX ing of the Chinese stock market. In three trading futures portfolio that continuously reflects VIX days ending 24 August, the SPX Index fell 9%; the expectations one month out by rolling approxi- VIX Index rose 167%, VIX Week 35 futures rose mately 5% of its positions daily from the first- 147%, and VIX September futures rose 60%. month futures contract to the second-month During the big VIX upward moves shown in contract. This index is used by investment Figure 3, near-term VIX futures saw upward products that seek to provide long exposure and moves that were not quite as large as those of leveraged long exposure to the index as well as the VIX Index, and the longer-dated VIX futures inverse index exposure. had smaller upward moves. This is because the The S&P 500 VIX Mid-Term Futures Index was futures were pricing volatility expectations for launched at the same time as the S&P 500 VIX the 30 days subsequent to their expiration date Short-Term Futures Index and aims to capture rather than volatility over the next 30 days. VIX expectations continuously five months out. Studies with more information on the use of It replicates a hypothetical VIX futures port- VIX futures and options include Moran and folio that holds the fourth-, fifth-, sixth-, and Dash (2007), Szado (2009), and Hill (2013). CFA Institute Research Foundation | 7",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 32,
    "chunk_index": 19,
    "word_count": 594,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "days. VIX expectations continuously five months out. Studies with more information on the use of It replicates a hypothetical VIX futures port- VIX futures and options include Moran and folio that holds the fourth-, fifth-, sixth-, and Dash (2007), Szado (2009), and Hill (2013). CFA Institute Research Foundation | 7 The VIX IndeX And VoLATILITy-BAsed GLoBAL IndeXes And TRAdInG InsTRuMenTs FIGURE 3. PRICE MOVEMENTS OF VIX FUTURES IN VOLATILE MONTHS A. VIX and Select Futures in August 2011 VIX Price 50 48.0 45 40 35 30 25 20 15 1/Aug 5/Aug 9/Aug 13/Aug 17/Aug 21/Aug 25/Aug 29/Aug VIX VIX Aug. Futures (exp. 17 Aug) VIX Sep. Futures (exp. 21 Sep) VIX Mar. Futures (exp. 21 Mar 2012) B. VIX and Select Futures in August 2015 VIX Price 45 47.04 40 35 30 25 20 15 10 5 19/Aug 20/Aug 21/Aug 24/Aug 25/Aug 26/Aug VIX VIX Week 35 Futures (exp. 26 Aug) VIX Sep. Futures (exp. 16 Sep) VIX Oct. Futures (exp. 22 Oct) Notes: shown in each panel are daily closing values for VIX and daily settlement values for select VIX futures. Past performance is not predictive of future returns. Source: Cboe Futures exchange. 8 | CFA Institute Research Foundation",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 16,
    "page_range": "p.16-17",
    "total_pages": 32,
    "chunk_index": 20,
    "word_count": 200,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.16-17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "Aug) VIX Sep. Futures (exp. 16 Sep) VIX Oct. Futures (exp. 22 Oct) Notes: shown in each panel are daily closing values for VIX and daily settlement values for select VIX futures. Past performance is not predictive of future returns. Source: Cboe Futures exchange. 8 | CFA Institute Research Foundation The VIX IndeX And VoLATILITy-BAsed GLoBAL IndeXes And TRAdInG InsTRuMenTs seventh-month VIX futures. It maintains a con- measured as the ratio between the VIX and the stant five-month maturity by rolling a portion of Cboe 3-Month Volatility Index (VIX3M), and positions continuously from the fourth month allocates between the S&P 500 VIX Short-Term to the seventh month. Futures Index and the S&P 500 VIX Mid-Term Futures Index accordingly. When the curve As mentioned, the VIX futures curve is usually steepens, implying a relatively high probabil- in contango, meaning the short-term futures ity of market downturn, the VIX3M increases contracts are typically less expensive than the its exposure to the two underlying VIX futures long-term ones. As a result, both the S&P 500 indexes to implement the hedge. When the VIX Short-Term Futures Index and the S&P 500 curve flattens, implying a relatively stable mar- VIX Mid-Term Futures Index have tended to ket environment, the VIX3M holds a long posi- decline over the long term because of roll costs tion in the S&P 500 VIX Mid-Term Futures (that is, to borrow a term from commodity trad- Index and finances this long exposure by short- ing, “negative roll yield”). The S&P 500 Dynamic ing the S&P 500 VIX Short-Term Futures Index. VIX Futures Index was created to offer long VIX Generally, the VIX3M holds a neutral or long exposure at a reduced hedging cost. exposure to volatility. The S&P 500 Dynamic VIX Futures Index moni- Exhibit 1 provides a summary of benchmark tors the steepness of the implied volatility curve, indexes that incorporate VIX futures or VIX EXHIBIT 1. METHODOLOGIES FOR SELECT VIX-RELATED PERFORMANCE BENCHMARK INDEXES Ticker Description Web Page VIX Futures Indexes sPVIXsTR The s&P 500 VIX short-Term Futures Index replicates a http://us.spindices.com/ position that rolls the nearest month VIX futures to the indices/strategy/sp-500- next month on a daily basis in equal fractional amounts. vix-short-term-index- The result is a constant one-month rolling long position mcap in first- and second-month VIX futures contracts. sPVIXMTR The s&P 500 VIX Mid-Term Futures Index replicates a http://us.spindices.com/ hypothetical portfolio that takes long positions in the fourth-, indices/strategy/sp-500- fifth-, sixth-, and seventh-month VIX futures contracts. It rolls vix-mid-term-futures- the fourth-month VIX futures to the seventh-month figures index on a daily basis in equal fractional amounts. The result is a constant five-month rolling long position. sPVXsPIT The s&P 500 VIX® short-Term Futures Inverse daily Index http://us.spindices.com/ is designed to measure the performance of the inverse indices/strategy/sp-500- of the s&P 500 VIX short-Term Futures Index. vix-short-term-futures- inverse-daily-index-tr (continued) CFA Institute Research Foundation | 9",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 32,
    "chunk_index": 21,
    "word_count": 476,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "equal fractional amounts. The result is a constant five-month rolling long position. sPVXsPIT The s&P 500 VIX® short-Term Futures Inverse daily Index http://us.spindices.com/ is designed to measure the performance of the inverse indices/strategy/sp-500- of the s&P 500 VIX short-Term Futures Index. vix-short-term-futures- inverse-daily-index-tr (continued) CFA Institute Research Foundation | 9",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 32,
    "chunk_index": 22,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "The VIX IndeX And VoLATILITy-BAsed GLoBAL IndeXes And TRAdInG InsTRuMenTs EXHIBIT 1. METHODOLOGIES FOR SELECT VIX-RELATED PERFORMANCE BENCHMARK INDEXES (CONTINUED) Ticker Description Web Page sPVXMPIT The s&P 500 VIX Mid-Term Futures Inverse daily Index http://us.spindices.com/ is designed to measure the performance of the inverse indices/strategy/sp-500- of the s&P 500 VIX Mid-Term Futures Index. vix-mid-term-futures- inverse-daily-index-tr sPdVIXT The s&P 500 dynamic VIX Futures Index dynamically http://us.spindices.com/ allocates between the s&P 500 VIX short-Term Futures indices/strategy/sp-500- Index and s&P 500 Mid-Term Futures Index by monitoring dynamic-vix-futures-tr the steepness of the implied volatility curve and provides a cost-efficient exposure to forward implied volatility. VIX Allocation Strategy Indexes sPVQdTId The s&P 500 dynamic VeQToR Index tracks a strategy that http://us.spindices.com/ dynamically allocates long-only exposure between the indices/multi-asset/ s&P 500, the s&P VIX short-Term Futures Index, and cash sp-500-dynamic-veqtor- to measure broad equity market exposure with an implied index-total-return volatility hedge. The strategy is designed with the potential to help mitigate downside risk in volatile markets. VPd The Cboe VIX Premium strategy Index tracks a strategy that www.cboe.com/VPd overlays a sequence of short, one-month VIX futures on a money market account; the short VIX futures positions are held until expiration, and new VIX futures are then sold. VPn The Cboe Capped VIX Premium strategy Index tracks the www.cboe.com/VPn performance of a strategy that systematically sells one-month VIX futures, capped by the purchase of a VIX call option; the short VIX futures position is capped with long VIX calls struck approximately 25 points higher than the VIX futures price. VsTG The Cboe VIX strangle Index is a premium capture index www.cboe.com/VsTG that tracks a strategy that overlays short VIX call and put options with a capped long VIX call option position. The position is collateralized by fixing the number of strangles such that 80% of capital is reserved. VXTh The Cboe VIX Tail hedge Index tracks a strategy that buys www.cboe.com/VXTh and holds s&P 500 stocks and also often buys 30-delta VIX call options. Sources: s&P Global and Cboe. 10 | CFA Institute Research Foundation",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 32,
    "chunk_index": 23,
    "word_count": 339,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "by fixing the number of strangles such that 80% of capital is reserved. VXTh The Cboe VIX Tail hedge Index tracks a strategy that buys www.cboe.com/VXTh and holds s&P 500 stocks and also often buys 30-delta VIX call options. Sources: s&P Global and Cboe. 10 | CFA Institute Research Foundation",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 32,
    "chunk_index": 24,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "The VIX IndeX And VoLATILITy-BAsed GLoBAL IndeXes And TRAdInG InsTRuMenTs options exposure, including descriptions and VIX-related products. It buys and holds S&P website references. In addition to the rolled VIX 500 stocks and also often buys call options on futures indexes just described, several strategy the VIX. indexes allocate between VIX futures and VIX options and other asset classes. The purpose of Performance Impact of Rolling these indexes is to provide a packaged invest- Costs/Benefits in VIX ment solution that meets specific investment goals and addresses issues in volatility invest- Before we investigate the performance of VIX- ment such as hedge ratio and roll cost. related benchmark indexes, we will look at the cost of rolling long VIX futures exposure Two indexes for risk reduction are of particu- because this cost has a significant impact on lar interest. The first is the S&P 500 Dynamic index performance, especially over long holding VEQTOR, which allocates among VIX futures, periods. equity, and cash to provide a hedged equity market exposure at reduced cost. It monitors Consider the widely followed S&P 500 VIX the implied-volatility trend as well as the real- Short-Term Futures Index as an example. It rolls ized volatility of the S&P 500. The long-only continuously from the first-month futures to exposure to the S&P 500 VIX Short-Term the second-month futures. Figure 4 shows the Futures Index is adjusted accordingly. A goal price difference between these two contracts of the index is to hedge tail risk while reducing since 3 January 2005, calculated as the second- roll costs. month VIX futures price minus the first-month VIX futures price. Thus, a positive number The second is the Cboe VIX Tail Hedge Index, means contango, and a negative number means also designed to provide a tail-risk hedge with backwardation. FIGURE 4. PRICE DIFFERENCE BETWEEN FIRST- AND SECOND-MONTH VIX FUTURES, 3 JANUARY 2005–31 DECEMBER 2019 Price Difference (US$) 10 5 0 –5 –10 –15 –20 –25 Jan/05 Jan/07 Jan/09 Jan/11 Jan/13 Jan/15 Jan/17 Jan/19 Source: Bloomberg. CFA Institute Research Foundation | 11",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 32,
    "chunk_index": 25,
    "word_count": 338,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "designed to provide a tail-risk hedge with backwardation. FIGURE 4. PRICE DIFFERENCE BETWEEN FIRST- AND SECOND-MONTH VIX FUTURES, 3 JANUARY 2005–31 DECEMBER 2019 Price Difference (US$) 10 5 0 –5 –10 –15 –20 –25 Jan/05 Jan/07 Jan/09 Jan/11 Jan/13 Jan/15 Jan/17 Jan/19 Source: Bloomberg. CFA Institute Research Foundation | 11",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 32,
    "chunk_index": 26,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "The VIX IndeX And VoLATILITy-BAsed GLoBAL IndeXes And TRAdInG InsTRuMenTs We can quantify the VIX futures curve on any VIX futures may be hoping that a future payoff given day, t, as its slope, S, between the first- when the equity index declines—which often is t and second-month contracts: associated with upward VIX moves and rolling costs of less than zero—will be high enough to − S = UX2 t UX1 t , offset the more frequent but lower rolling costs t UX1 of carrying a long VIX futures position. t Variation in Annualized where UX1 and UX2 refer, respectively, to the first- and second-month VIX futures closing Volatilities of VIX Spot price on day t. and Futures Of the 3,776 trading days in the period shown in Figure 4, contango between the first- and Market participants should also be aware of second-month VIX futures contracts occurred variations in annualized volatility levels of the on 3,102 days (82.15% of the time). Given that VIX futures short-term and mid-term indexes approximately 5% of the portfolio of the S&P and of the strategy indexes. The VIX at 83% 500 VIX Short-Term Futures Index is rolled on volatility was almost six times as volatile as the a daily basis, the median daily roll cost on a per- S&P 500 over the 2005–19 period. The S&P 500 centage basis, calculated as 5% of the position VIX Short-Term Futures Index and Mid-Term times slope S, was 28 bps. This amount may Futures Index had lower volatility than the VIX t seem tiny, but it represents a median monthly because the futures market tends to be less sensi- (not annual) rolling cost of 5.66%, so the cumu- tive to market movements than is the spot price. lative performance impact may be sizable over a long period. If the VIX were to remain ADDING VIX FUTURES unchanged for a year, the benchmark index INDEXES TO PORTFOLIOS could lose approximately half of its value from the continuous daily roll. The VIX is not directly tradable, but an inves- Although some analysts interpret this rolling tor can use VIX futures and options to gain cost as a “drag” on performance, it is, in fact, exposure to expected volatility. In the follow- similar to the cost of rolling put options, another ing discussion, we examine the portfolio impact type of risk management tool. The cost of an of using the S&P 500 VIX Short-Term Futures ongoing risk control strategy such as using long Index as a benchmark index for the buying of VIX futures or SPX protective put options can VIX futures exposure and the S&P 500 VIX be high if the S&P 500 does not have significant Short-Term Futures Inverse Daily Index (hereaf- downside moves. As Figure 4 shows, the very ter, Inverse Daily) as a benchmark index for the negative levels of the rolling cost (that is, the selling of VIX futures exposure. To understand large gain from backwardation) in high-volatility their applications to portfolios, an investor periods in 2008 and 2011 provided protection needs to consider both the negative correlation against the stock market declines. The payoff of of the VIX with the equity market and the VIX long exposure to VIX futures as a risk reduction futures term structure. strategy, then, can be high in turbulent market Table 2, using monthly returns between periods. Many investors with long positions in March 2006 and December 2019, shows the 12 | CFA Institute Research Foundation",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 32,
    "chunk_index": 27,
    "word_count": 577,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "market and the VIX long exposure to VIX futures as a risk reduction futures term structure. strategy, then, can be high in turbulent market Table 2, using monthly returns between periods. Many investors with long positions in March 2006 and December 2019, shows the 12 | CFA Institute Research Foundation",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 32,
    "chunk_index": 28,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "The VIX IndeX And VoLATILITy-BAsed GLoBAL IndeXes And TRAdInG InsTRuMenTs TABLE 2. CORRELATION OF MONTHLY RETURNS OF SELECTED INDEXES, 31 MARCH 2006–31 DECEMBER 2019 S&P 500 VIX Index VIX Short-Term Futures Inverse Daily s&P 500 –0.69 –0.79 0.75 VIX 1.00 0.81 –0.78 s&P 500 VIX short-Term Futures 1.00 –0.93 Inverse daily 1.00 Notes: All indexes except the VIX are total-return indexes. Past performance is not predictive of future returns. Sources: Bloomberg and s&P Global. correlations between the broad equity market, in the case of rolling, the investor has to pay VIX values, and two VIX futures indexes. the price difference to roll to the next futures contract. Either way, the investor incurs a loss The correlation analysis shows the following: as a result of contango. Similarly, when the VIX • a strong negative correlation between the futures market is in backwardation, a market S&P 500 and the VIX, participant with a long VIX futures position benefits from the VIX futures term structure • a strong positive correlation between the upon expiration of the futures contract, whether VIX and the S&P 500 VIX Short-Term the market participant chooses to let the con- Futures Index, and tract expire or to roll to the next one. This ben- • efit is called “roll yield.” Neither roll cost nor a strong positive correlation between the roll yield is unique to VIX futures; commodity S&P 500 and the Inverse Daily. futures investors also confront the roll costs and Although the correlation analysis confirms that roll yields. VIX futures often move in the same direction The VIX futures term structure (Figure 4) is the as the VIX, the magnitude of their moves in primary reason that holding and rolling a long response to a percentage change in the S&P 500 position in VIX futures over the long term has is lower, and the shape of the VIX futures curve tended to produce losses. dictates whether rolling futures over time incurs a cost or a benefit for an investor. For example, Long VIX Futures and Options assume a market participant holds a long VIX futures position when the VIX futures curve is Exposure for Risk Management in contango. Upon the expiration of the current VIX futures contract, the market participant Tail risk can cause portfolios to suffer large may choose to either let the contract expire or losses in steep equity market declines and is thus roll to the next contract. In the case of expira- of special interest to portfolio managers. Given tion, the futures price is likely to drop because it the strong negative correlation between the S&P is expected to converge to the value of the VIX; 500 VIX Short-Term Futures Index and the S&P CFA Institute Research Foundation | 13",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 32,
    "chunk_index": 29,
    "word_count": 457,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "of expira- of special interest to portfolio managers. Given tion, the futures price is likely to drop because it the strong negative correlation between the S&P is expected to converge to the value of the VIX; 500 VIX Short-Term Futures Index and the S&P CFA Institute Research Foundation | 13",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 32,
    "chunk_index": 30,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "The VIX IndeX And VoLATILITy-BAsed GLoBAL IndeXes And TRAdInG InsTRuMenTs 500, VIX futures may hold tail risk–hedging or higher). For this comparison, we ran two opportunities for portfolios. Given the typically simple backtests: high volatility of long VIX futures and their ten- • Static allocation: Allocating a small static dency to go into backwardation in volatile peri- weight of 5% to VIX futures in an equity ods, even a small position in these futures can portfolio and rebalancing monthly. help manage risk during periods of steep S&P 500 declines. As mentioned, the rolling cost, • Dynamic allocation: Dynamically allocating however, for the majority of time periods when 5% of the portfolio to VIX futures in periods contango is in place may create a sizable per- when the VIX reached a high level, which formance drag, which a market participant who often coincided with volatile and declining wishes to institute a cost-efficient tail-risk hedge S&P 500 periods. At each month’s end, if the via VIX futures should take into consideration. VIX spot was ≥25, 5% of the portfolio was The dynamic allocation strategies implemented allocated to VIX futures in the next month. by the S&P 500 Dynamic VEQTOR Index and If the VIX spot at month’s end was <25, the the Cboe VIX Tail Hedge Index both attempt to allocation to VIX futures was zero. capture market signals and adjust the allocation For the dynamic allocation, the trigger level of of the long VIX futures or options positions. 25 was selected on the basis of historical long- Both indexes had higher returns than the S&P term statistics for the VIX spot index. Between 500 in 2008 and 2011. 2 January 1990 and 31 March 2018, the VIX To evaluate the effectiveness and cost of apply- daily closing levels ranged from 9.14 to 80.86. ing a long VIX futures strategy for risk reduc- Because we were interested in the hedging tion, we considered both a static strategy with property of VIX futures for tail risk, we set the the VIX futures index at a small weight and a trigger close to the 80th percentile of the dis- tactical or dynamic strategy that used the index tribution of historical VIX values (24.25). The at a higher weight but only when expected vola- actual allocation to VIX futures in the test- tility was at high levels (i.e., the spot VIX at 25% ing period is shown in Figure 5. Note that the FIGURE 5. DYNAMIC ALLOCATION TO VIX SHORT-TERM FUTURES INDEX, 2005–2019 Allocation to VIX Futures (%) 100 20 0 Dec/05 Dec/07 Dec/09 Dec/11 Dec/13 Dec/15 Dec/17 Dec/19 Source: s&P Global. 14 | CFA Institute Research Foundation",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 32,
    "chunk_index": 31,
    "word_count": 443,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "the spot VIX at 25% ing period is shown in Figure 5. Note that the FIGURE 5. DYNAMIC ALLOCATION TO VIX SHORT-TERM FUTURES INDEX, 2005–2019 Allocation to VIX Futures (%) 100 20 0 Dec/05 Dec/07 Dec/09 Dec/11 Dec/13 Dec/15 Dec/17 Dec/19 Source: s&P Global. 14 | CFA Institute Research Foundation",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 32,
    "chunk_index": 32,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "The VIX IndeX And VoLATILITy-BAsed GLoBAL IndeXes And TRAdInG InsTRuMenTs FIGURE 6. PERFORMANCE OF VIX FUTURES INDEX RISK MANAGEMENT STRATEGIES, 30 DECEMBER 2005–31 DECEMBER 2019 Dec. 2005 = 1.0 4.0 3.5 3.0 2.5 2.0 1.5 1.0 0.5 0 Dec/05 Dec/07 Dec/09 Dec/11 Dec/13 Dec/15 Dec/17 Dec/19 $3.56 (Equity + Dynamic VIX Allocation) $3.47 (S&P 500) $2.77 (60/40 Equity/FI Portfolio) $2.63 (95/5 Equity/VIX Futures) Note: Past performance is not predictive of future returns. Sources: Bloomberg and s&P Global. strategy allocated to the VIX futures index on equity/fixed-income (FI) portfolio. We used the a regular basis over the 2007–11 period but S&P 500 as the proxy for the broad equity mar- showed almost no investment in VIX futures in ket and the Bloomberg Barclays US Aggregate the 2012–19 period. This pattern is consistent Total Return Index as the proxy for the FI mar- with volatility shifting between high and low ket. The results, showing backtested, hypotheti- “regimes” that last for several years. cal performance, are in Figure 6 and Table 3. We then compared these two strategies with a From the perspective of volatility reduc- pure equity portfolio as well as a typical 60/40 tion, Table 3 shows that even a small, static TABLE 3. PERFORMANCE DATA FOR VIX FUTURES INDEX RISK MANAGEMENT STRATEGIES, 30 DECEMBER 2005–31 DECEMBER 2019 Annualized Annualized Return/ Correlation Maximum Strategy Return Volatility Volatility with S&P 500 Drawdown equity + dynamic VIX allocation 9.50% 12.88% 0.74 0.99 –46.32% s&P 500 9.30% 14.14% 0.66 1.00 –50.96% 60/40 equity/FI 7.54% 8.57% 0.88 0.99 –32.54% 95/5 equity/VIX futures 7.15% 10.99% 0.65 0.98 –43.97% Note: Past performance is not predictive of future returns. Sources: Bloomberg and s&P Global. CFA Institute Research Foundation | 15",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 32,
    "chunk_index": 33,
    "word_count": 282,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "dynamic VIX allocation 9.50% 12.88% 0.74 0.99 –46.32% s&P 500 9.30% 14.14% 0.66 1.00 –50.96% 60/40 equity/FI 7.54% 8.57% 0.88 0.99 –32.54% 95/5 equity/VIX futures 7.15% 10.99% 0.65 0.98 –43.97% Note: Past performance is not predictive of future returns. Sources: Bloomberg and s&P Global. CFA Institute Research Foundation | 15",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 32,
    "chunk_index": 34,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "The VIX IndeX And VoLATILITy-BAsed GLoBAL IndeXes And TRAdInG InsTRuMenTs hypothetical allocation that included a long the roll cost of the futures position in low- and position in VIX futures reduced annualized vol- normal-volatility market conditions. Even a atility and lessened the severity of the maximum small allocation to VIX futures may produce a drawdown when compared with an equity port- sizable performance drag over a long horizon. folio. Performance drag was significant in a bull market with low volatility, however, because of Short-Term Volatility Exposure the roll cost of even a small VIX futures position. for Income and as an Equity Also, over this period, the overall diversification Alternative benefit of allocating just 5% of an S&P 500 equity portfolio to VIX futures would have under- Selling volatility can be a source of portfolio performed the traditional 60%/40% equity/FI income that does not rely on interest rates or portfolio and had higher volatility. That said, dividends. Historically, investors have used we also note that the static VIX futures strategy covered option selling strategies to generate still would have outperformed the 60/40 equity/ income. Selling VIX futures may be an opera- FI portfolio by more than 1 percentage point in tionally simple strategy that provides short-term years when the equity market had strong perfor- volatility exposure through exchange-traded liq- mance—2009 (19.65% vs. 18.40%), 2013 (24.89% uid instruments. Because VIX futures indexes vs. 17.56%), 2014 (11.95% vs. 10.62%), and 2017 are generally negatively correlated with the S&P (16.69% vs. 13.11%)—because equity was the 500, inverse exposure also brings in a position dominant source of return in the portfolio. that benefits from higher S&P 500 returns and that can, in effect, be considered a form of long- The data in Table 3 show that a dynamic allo- term equity market exposure. cation with the same size VIX futures position during high-volatility regimes, rebalanced at As shown in Figure 5, the VIX futures curve month end, would have provided downside has been in contango approximately 80% of the protection and lessened portfolio drawdown. time, which creates the insurance-like premium Compared with a pure equity portfolio, return that is paid by a long position and received by per unit of risk (the Sharpe ratio) would have a short position. In a stressed market, the term improved from 0.66 to 0.74, and maximum structure can invert and create a negative roll drawdown would have been reduced from return for the short position. This characteris- –50.95% to –46.32%. These results suggest that tic delivers the potential to capture significant dynamic exposure to long positions in short- returns over long horizons, with infrequent term VIX futures based on a regime-dependent sharp losses, through a small allocation to a approach can be a valuable risk reduction strat- short VIX futures position. When using short- egy. Triggers identifying high-volatility regimes term VIX futures, a critical step is to size the and using monthly or weekly rebalancing may position appropriately because short positions be considered for investors concerned about in volatility are susceptible to large and sudden mitigating tail risk in their portfolios without a losses in the event of volatility spikes when neg- large sacrifice in returns. ative news appears for equities. The key to incorporating a long position in VIX To illustrate the pros and cons of short-term futures in an equity portfolio is to be aware of VIX positions, we backtested a hypothetical the potential performance drag attributable to (monthly rebalanced) portfolio that allocated 16 | CFA Institute Research Foundation",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 32,
    "chunk_index": 35,
    "word_count": 583,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "The key to incorporating a long position in VIX To illustrate the pros and cons of short-term futures in an equity portfolio is to be aware of VIX positions, we backtested a hypothetical the potential performance drag attributable to (monthly rebalanced) portfolio that allocated 16 | CFA Institute Research Foundation",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 32,
    "chunk_index": 36,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "The VIX IndeX And VoLATILITy-BAsed GLoBAL IndeXes And TRAdInG InsTRuMenTs FIGURE 7. PERFORMANCE OF SHORT VOLATILITY STRATEGIES, 30 DECEMBER 2005–31 DECEMBER 2019 Dec. 2005 = 1.0 4.5 4.0 3.5 3.0 2.5 2.0 1.5 1.0 0.5 0 Dec/05 Dec/07 Dec/09 Dec/11 Dec/13 Dec/15 Dec/17 Dec/19 $4.02 (95% S&P 500 + 5% Short VIX) $3.47 (S&P 500) $2.46 (Cboe S&P 500 PutWrite Index, PUT) $2.14 (Cboe S&P 500 BuyWrite Index, BXM) Sources: Bloomberg and s&P Global. 95% to the S&P 500 and 5% to the Inverse Daily. that holds a stock position and sells SPX call We then compared the hypothetical portfolio’s options every month; the PUT represents a performance with that of a pure equity portfolio strategy that holds US T-bills and sells SPX put and two popular option-writing strategies, rep- options every month. The results are shown in resented by the Cboe S&P 500 BuyWrite Index Figure 7 and Table 4. (BXMSM) and the Cboe S&P 500 PutWrite Index (PUTSM). The BXM represents a strategy Figure 7 shows that selling VIX futures could have a financial impact completely different TABLE 4. PERFORMANCE DATA FOR SHORT VOLATILITY STRATEGIES, 30 DECEMBER 2005–31 DECEMBER 2019 Annualized Annualized Return/ Correlation Maximum Strategy Return Volatility Volatility with S&P 500 Drawdown 95% s&P 500 + 5% short VIX 10.45% 16.07% 0.65 0.99 –52.68% s&P 500 9.30% 14.14% 0.66 1.00 –50.95% PuT 6.65% 10.47% 0.64 0.86 –32.66% BXM 5.60% 10.36% 0.54 0.89 –35.81% Note: Past performance is not predictive of future returns. Sources: Bloomberg and s&P Global. CFA Institute Research Foundation | 17",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 32,
    "chunk_index": 37,
    "word_count": 256,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "s&P 500 + 5% short VIX 10.45% 16.07% 0.65 0.99 –52.68% s&P 500 9.30% 14.14% 0.66 1.00 –50.95% PuT 6.65% 10.47% 0.64 0.86 –32.66% BXM 5.60% 10.36% 0.54 0.89 –35.81% Note: Past performance is not predictive of future returns. Sources: Bloomberg and s&P Global. CFA Institute Research Foundation | 17",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 32,
    "chunk_index": 38,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "The VIX IndeX And VoLATILITy-BAsed GLoBAL IndeXes And TRAdInG InsTRuMenTs from that of selling index options on an equity spiked, even a 5% allocation to the Inverse Daily portfolio: VIX futures position would have caused a sharp loss in the portfolio. For example, in February • Selling VIX futures at a 5% weight with a 2018, the equity market lost 3.69%. Option pre- 95% exposure to the S&P 500 would have miums collected from the option-writing strat- increased both annualized return and vola- egies would have moderately reduced the loss tility. Writing put or call options would tend (the BXM return was down 1.42%, and the PUT to reduce portfolio volatility by forgoing return was down 2.16%), whereas the portfolio part of the returns. with a 5% allocation to the inverse VIX futures • Despite the increased drawdown caused by strategy would have more than doubled the loss the strategy, shorting VIX futures would (down 8.27%). have increased the long-term annualized The key to incorporating a short-term VIX return of the equity portfolio by more than futures strategy into a portfolio is to remem- 1 percentage point. The trade-off is that ber that sharp negative returns may occur. This it also would have elevated the portfolio’s strategy is not suitable for large portfolio alloca- annualized volatility from 14.14% to 16.07%. tions. Investors must be aware that the futures • Risk-adjusted returns, measured by return curve may flip from contango to backwardation per unit of volatility, would have been com- when a volatility event hits the market, which parable in all four portfolios. will further increase the loss from a short VIX futures position. • Investors looking to have risk and draw- down at or below levels of the S&P 500 CONCLUSION while selling VIX futures might consider combining the position with a shift of some During the past two decades, the Cboe Volatility S&P 500 exposure into cash equivalents to Index, a key measure of investor sentiment and reduce the equity risk. near-term volatility expectations known as the VIX Index, has generated much investor atten- Unlike a buy–write strategy that sells a cov- tion because of its unique and powerful fea- ered call, shorting VIX futures performs best tures. The introduction of VIX futures in 2004, in a bull market and suffers the most in a tur- VIX options in 2006, and other volatility-related bulent bear market. The reason is that shorting trading instruments provided traders and inves- VIX futures involves selling volatility across all tors access to exchange-traded vehicles for strike prices and essentially adds long exposure taking long and short exposures to expected to the equity market as a result of the negative S&P 500 volatility for a particular time frame. correlation between the VIX and equities and Certain VIX-related tradable products have the between VIX futures and equities. In contrast, potential to provide benefits when used as tools a buy–write strategy limits the upside potential for tail-risk hedging, diversification, risk man- of the equity market and incurs a performance agement, or alpha generation, but before invest- drag in a strong bull market. The option pre- ing, investors should closely study the pricing, mium received, however, mitigates the loss, roll cost, and volatility features of VIX-related and the buy–write index generally outperforms tradable products and read the applicable pro- when the market goes down. Over the period spectus and risk disclosure statements. depicted in Figure 7, when market volatility 18 | CFA Institute Research Foundation",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 32,
    "chunk_index": 39,
    "word_count": 577,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "however, mitigates the loss, roll cost, and volatility features of VIX-related and the buy–write index generally outperforms tradable products and read the applicable pro- when the market goes down. Over the period spectus and risk disclosure statements. depicted in Figure 7, when market volatility 18 | CFA Institute Research Foundation",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 32,
    "chunk_index": 40,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "The VIX IndeX And VoLATILITy-BAsed GLoBAL IndeXes And TRAdInG InsTRuMenTs Feldman, Barry, and Dhruv Roy. 2005. “Passive The authors thank Joanne Hill for her valuable sug- Options-Based Investment Strategies: The Case gestions for this Brief. of the CBOE S&P 500 BuyWrite Index.” Journal Disclosures of Investing 14 (2): 66–83. Past performance is not predictive of future returns. S&P He, Donald X., Jason C. Hsu, and Neil Rue. Dow Jones Indices and Cboe Exchange, Inc., do not spon- 2015. “Option-Writing Strategies in a Low- sor, endorse, sell, promote, or manage any investment fund Volatility Framework.” Journal of Investing or other investment vehicle that is offered by third parties and that seeks to provide an investment return based on the 24 (3): 116–28. performance of any index. S&P Dow Jones Indices and Cboe Hill, Joanne. 2013. “The Different Faces of Exchange, Inc., make no assurance that investment products based on an index will accurately track index performance Volatility Exposure in Portfolio Management.” or provide positive investment returns. Options involve risk Journal of Alternative Investments l5 (3): 9–31. and are not suitable for all investors. Prior to buying or sell- ing an option, a person must receive a copy of Characteristics Hill, Joanne, Venkatesh Balasubramanian, and Risks of Standardized Options (the “ODD”). The ODD Krag (Buzz) Gregory, and Ingrid Tierens. 2006. and supporting documentation for any claims, compari- “Finding Alpha via Covered Index Writing.” sons, recommendations, statistics, or other technical data Financial Analysts Journal 62 (5): 29–46. in these materials are available by calling 1-888-OPTIONS or contacting Cboe at www.Cboe.com/Contact. Futures Moran, Matthew T. 2014. “Thirty Volatility trading is not suitable for all investors and involves the risk Indexes: Worldwide Tools to Gauge Sentiment of loss. The risk of loss in futures can be substantial. You and Diversify Portfolios.” Journal of Index should, therefore, carefully consider whether such trading is suitable for you in light of your circumstances and finan- Investing 4 (4): 69–87. cial resources. For additional information regarding futures Moran, Matthew T., and Srikant Dash. 2007. trading risks, see the Risk Disclosure Statement set forth in US Commodity Futures Trading Commission Regulation “VIX Futures and Options: Pricing and Using §1.55(b). The information in this article is provided solely Volatility Products to Manage Downside Risk for general education and information purposes and, there- and Improve Efficiency in Equity Portfolios.” fore, should not be considered complete, precise, or current. Journal of Trading 2 (3): 96–105. The methodologies of many of the indexes in this article are owned by Cboe Exchange, Inc. or S&P Dow Jones Indices, Szado, Edward. 2009. “VIX Futures and the indexes may be covered by one or more patents or and Options: A Case Study of Portfolio pending patent applications. S&P® and S&P 500® are regis- tered trademarks of Standard & Poor’s Financial Services, Diversification during the 2008 Financial LLC, and are licensed for use by Cboe Exchange, Inc., and Crisis.” Journal of Alternative Investments Cboe Futures Exchange, LLC. Cboe Volatility Index®, VIX®, 12 (2): 68–85. Cboe®, and Chicago Board Options Exchange® are registered trademarks, and BXM and PUT are service marks of Cboe Whaley, Robert E. 1993. “Derivatives on Market Exchange, Inc. All other trademarks and service marks are Volatility: Hedging Tools Long Overdue.” the property of their respective owners. Journal of Derivatives 1 (1): 71–84. REFERENCES Wilshire Analytics Applied Research Group. 2019. “Options-Based Benchmark Indexes: Black, Keith, and Edward Szado. 2016. Performance, Risk and Premium Capture (June “Performance Analysis of Options-Based 1986–December 2018): An Update.” Wilshire Equity Mutual Funds, Closed-End Funds, and Associates Incorporated. Exchange-Traded Funds.” Journal of Wealth Management 19 (1): 51–69. CFA Institute Research Foundation | 19",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 32,
    "chunk_index": 41,
    "word_count": 601,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "Research Group. 2019. “Options-Based Benchmark Indexes: Black, Keith, and Edward Szado. 2016. Performance, Risk and Premium Capture (June “Performance Analysis of Options-Based 1986–December 2018): An Update.” Wilshire Equity Mutual Funds, Closed-End Funds, and Associates Incorporated. Exchange-Traded Funds.” Journal of Wealth Management 19 (1): 51–69. CFA Institute Research Foundation | 19",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "AND TRADING FEATURES",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 32,
    "chunk_index": 42,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "AND TRADING FEATURES (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "CFA Institute Research Foundation acknowledges with sincere gratitude the generous contributions of the Named Endowment participants listed below. Gifts of at least US$100,000 qualify donors for membership in the Named Endowment category, which recognizes in perpetuity the commitment toward unbiased, practitioner-oriented, relevant research that these firms and individuals have expressed through their generous support of the CFA Institute Research Foundation. Ameritech Miller Anderson & Sherrerd, LLP Anonymous John B. Neff, CFA Robert D. Arnott Nikko Securities Co., Ltd. Theodore R. Aronson, CFA Nippon Life Insurance Company of Japan Asahi Mutual Life Insurance Company Nomura Securities Co., Ltd. Batterymarch Financial Management Payden & Rygel Boston Company Provident National Bank Boston Partners Asset Management, L.P. Frank K. Reilly, CFA Gary P. Brinson, CFA Salomon Brothers Brinson Partners, Inc. Sassoon Holdings Pte. Ltd. Capital Group International, Inc. Scudder Stevens & Clark Concord Capital Management Security Analysts Association of Japan Dai-Ichi Life Insurance Company Shaw Data Securities, Inc. Daiwa Securities Sit Investment Associates, Inc. Mr. and Mrs. Jeffrey Diermeier Standish, Ayer & Wood, Inc. Gifford Fong Associates State Farm Insurance Company John A. Gunn, CFA Sumitomo Life America, Inc. Investment Counsel Association of America, Inc. T. Rowe Price Associates, Inc. Jacobs Levy Equity Management Templeton Investment Counsel Inc. Jon L. Hagler Foundation Frank Trainer, CFA Long-Term Credit Bank of Japan, Ltd. Travelers Insurance Co. Lynch, Jones & Ryan, LLC USF&G Companies Meiji Mutual Life Insurance Company Yamaichi Securities Co., Ltd. Senior Research Fellows Financial Services Analyst Association For more on upcoming CFA Institute Research Foundation publications and webcasts, please visit www.cfainstitute.org/research/foundation.",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "Named Endowments",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 32,
    "chunk_index": 43,
    "word_count": 257,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Named Endowments (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "Foundation Frank Trainer, CFA Long-Term Credit Bank of Japan, Ltd. Travelers Insurance Co. Lynch, Jones & Ryan, LLC USF&G Companies Meiji Mutual Life Insurance Company Yamaichi Securities Co., Ltd. Senior Research Fellows Financial Services Analyst Association For more on upcoming CFA Institute Research Foundation publications and webcasts, please visit www.cfainstitute.org/research/foundation. CFA Institute Research Foundation Board of Trustees 2019–2020 Chair JT Grier, CFA* Aaron Low, CFA Ted Aronson, CFA Virginia Retirement System LUMIQ AJO Joanne Hill Mauro Miranda, CFA Heather Brilliant, CFA CBOE Vest Financial Panda Investimentos AAI Ltda. Diamond Hill Roger Ibbotson* Lotta Moberg, PhD, CFA Margaret Franklin, CFA Yale School of Management William Blair CFA Institute Joachim Klement, CFA Sophie Palmer, CFA Bill Fung, PhD Independent Jarislowsky Fraser Aventura, FL Vikram Kuriyan, PhD, CFA Dave Uduanu, CFA Daniel Gamba, CFA GWA and Indian School of Sigma Pensions Ltd BlackRock Business *Emeritus Officers and Directors Executive Director Secretary Bud Haslett, CFA Jessica Lawson CFA Institute CFA Institute Gary P. Brinson Director of Research Treasurer Laurence B. Siegel Kim Maynard Blue Moon Communications CFA Institute Associate Research Director Luis Garcia-Feijóo, CFA, CIPM Coral Gables, Florida Research Foundation Review Board William J. Bernstein Paul D. Kaplan, CFA Krishna Ramaswamy Efficient Frontier Advisors Morningstar, Inc. University of Pennsylvania Elroy Dimson Robert E. Kiernan III Andrew Rudd London Business School Advanced Portfolio Management Advisor Software, Inc. Stephen Figlewski Andrew W. Lo Stephen Sexauer New York University Massachusetts Institute of Allianz Global Investors Solutions Technology William N. Goetzmann Lee R. Thomas Yale School of Management Alan Marcus Pacific Investment Management Boston College Company Elizabeth R. Hilpman Barlow Partners, Inc. Paul O’Connell FDO Partners",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "Named Endowments",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 32,
    "chunk_index": 44,
    "word_count": 268,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Named Endowments (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  },
  {
    "text": "Management Advisor Software, Inc. Stephen Figlewski Andrew W. Lo Stephen Sexauer New York University Massachusetts Institute of Allianz Global Investors Solutions Technology William N. Goetzmann Lee R. Thomas Yale School of Management Alan Marcus Pacific Investment Management Boston College Company Elizabeth R. Hilpman Barlow Partners, Inc. Paul O’Connell FDO Partners",
    "title": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features",
    "source_type": "pdf",
    "document_id": "d10ab06ec967",
    "source_file": "VIX Index and Volatility Based Indexes - Guide to Investment and Trading Features.pdf",
    "section": "Named Endowments",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 32,
    "chunk_index": 45,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Named Endowments (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200416215329+05'30'",
    "duration": null
  }
]