[
  {
    "text": "VIX® Index Future & Options Turn Volatility to Your Advantage U.S. Futures and Options The Cboe Volatility Index® (VIX® Index) is a leading measure of market expectations of near-term volatility conveyed by S&P 500 Index® (SPX) option prices. Since its introduction in 1993, the VIX® Index has been considered by many to be the world’s premier barometer of investor sentiment and market volatility. To learn more, visit cboe.com/VIX. VIX Futures and Options Strategies VIX futures and options have unique characteristics and behave differently than other financial-based commodity or equity products. Understanding these traits and their implications is important. VIX options and futures enable investors to trade volatility independent of the direction or the level of stock prices. Whether an investor’s outlook on the market is bullish, bearish or somewhere in-between, VIX futures and options can provide the ability to diversify a portfolio as well as hedge, mitigate or capitalize on broad market volatility. Portfolio Hedging One of the biggest risks to an equity portfolio is a broad market decline. The VIX Index has had a historically strong inverse relationship with the S&P 500® Index. Consequently, a long exposure to volatility may offset an adverse impact of falling stock prices. Market participants should consider the time frame and characteristics associated with VIX futures and options to determine the utility of such a hedge. Risk Premium Yield Over long periods, index options have tended to price in slightly more uncertainty than the market ultimately realizes. Specifically, the expected volatility implied by SPX option prices tends to trade at a premium relative to subsequent realized volatility in the S&P 500 Index. Market participants have used VIX futures and options to capitalize on this general difference between expected (implied) and realized (actual) volatility, and other types of volatility arbitrage strategies. Long/Short Volatility VIX futures provide a pure play on the level of expected volatility. Expressing a long or short sentiment may involve buying or selling VIX futures. Alternatively, VIX options may provide similar means to position a portfolio for potential increases or decreases in anticipated volatility. Term Structure Trading One of the unique properties of volatility – and the VIX Index – is that its level is expected to trend toward a long-term average over time, a property commonly known as “mean-reversion.” The mean reverting nature of volatility is a key driver of the shape of the VIX futures term structure and the way it can move in response to changes in perceived risk. CFE lists nine standard (monthly) VIX futures contracts, and six weekly expirations in VIX futures. As such, there is a wide variety of potential calendar spreading opportunities depending on expectations for implied volatility. Cboe.com | @Cboe | /Cboe | /Company/Cboe © 2022 Cboe Exchange, Inc. All Rights Reserved. USO_v1.2",
    "title": "VIX fact sheet",
    "source_type": "pdf",
    "document_id": "b30476102db8",
    "source_file": "VIX_fact_sheet.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 3,
    "chunk_index": 0,
    "word_count": 459,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220926132510-05'00'",
    "duration": null
  },
  {
    "text": "risk. CFE lists nine standard (monthly) VIX futures contracts, and six weekly expirations in VIX futures. As such, there is a wide variety of potential calendar spreading opportunities depending on expectations for implied volatility. Cboe.com | @Cboe | /Cboe | /Company/Cboe © 2022 Cboe Exchange, Inc. All Rights Reserved. USO_v1.2",
    "title": "VIX fact sheet",
    "source_type": "pdf",
    "document_id": "b30476102db8",
    "source_file": "VIX_fact_sheet.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 3,
    "chunk_index": 1,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220926132510-05'00'",
    "duration": null
  },
  {
    "text": "Futures & Options on the VIX® Index Turn Volatility to Your Advantage Page 2 U.S. Futures and Options Summary Product Specifications Cboe Volatility Index® (VX) Futures Cboe Volatility Index® (VIX®) Options VIX and VX01 through VX53 (Embedded numbers denote the VIX (Monthly Expirations) Ticker specific week of a calendar year during which a contract is settled) VIXW (Weekly Expirations) The Cboe Volatility Index - more commonly referred to as the “VIX Index” - is an up-to-the-minute market estimate of expected volatility that is calculated by using real-time prices of options on the S&P 500® Index listed on Cboe Exchange, Inc. (“Cboe Options”) (Symbol: SPX). Only SPX options with more than 23 days and less than 37 days to Description the Friday SPX expiration are used to calculate the VIX Index. The VIX Index is calculated between 2:15 a.m. CT and 8:15 a.m. CT and between 8:30 a.m. CT and 3:15 p.m. CT. These SPX options are then weighted to yield a constant, 30-day measure of the expected volatility of the S&P 500 Index. Contract Multiplier $1000 $100 Stated in points and fractions, one point equals Stated in points and fractions, 0.05 points equal to $50.00 per $100. VIX: Minimum tick for series trading below Minimum Price contract. The individual legs and net prices of spread trades $3 is $0.01 ($1.00); above $3 is $0.05 ($5.00). Intervals in the VX futures contract may be in increments of 0.01 index VIXW: Minimum tick for all series, regardless of points, which has a value of $10.00. price level, is 0.01 ($1.00). Regular Hours: 8:30 am to 3:15 p.m. (Chicago) Regular Hours: 8:30 a.m. to 3:15 p.m. (Chicago). Extended Hours: 5:00 p.m. (previous day) to Global Hours: 7:15 p.m. to 8:15 a.m. Trading Hours 8:30 a.m. and 3:30 p.m. to 4:00 p.m. Expiring VIX/VIXW options do not trade during Trading hours for expiring VX futures contracts end global trading hours on their Expiration Date. at 8:00 a.m. (Chicago) on the final settlement date. The exercise-settlement value will be rounded to Settlement of VX futures contracts will result in the delivery of the nearest $0.01. Exercise will result in delivery a cash settlement amount on the business day immediately of cash on the business day following expiration. Final Settlement following the final settlement date. The cash settlement amount The exercise-settlement amount is equal to the Value on the final settlement date shall be the final mark to market difference between the exercise-settlement value amount against the final settlement value of the VX futures and the exercise price of the option, multiplied multiplied by $1000. by $100. The final settlement date for a contract with the “VX” ticker symbol is on the Wednesday that is 30 days prior to the third Friday of the calendar month immediately following the month The business day prior to the Expiration Date of Final Settlement in which the contract expires. The final settlement date for each contract expiration. Date a futures contract with the “VX” ticker symbol followed by a number denoting the specific week of a calendar year is on the Wednesday of the week specifically denoted in the ticker symbol. Cboe.com | @Cboe | /Cboe | /Company/Cboe © 2022 Cboe Exchange, Inc. All Rights Reserved. USO_v1.2",
    "title": "VIX fact sheet",
    "source_type": "pdf",
    "document_id": "b30476102db8",
    "source_file": "VIX_fact_sheet.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 3,
    "chunk_index": 2,
    "word_count": 538,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220926132510-05'00'",
    "duration": null
  },
  {
    "text": "Date a futures contract with the “VX” ticker symbol followed by a number denoting the specific week of a calendar year is on the Wednesday of the week specifically denoted in the ticker symbol. Cboe.com | @Cboe | /Cboe | /Company/Cboe © 2022 Cboe Exchange, Inc. All Rights Reserved. USO_v1.2",
    "title": "VIX fact sheet",
    "source_type": "pdf",
    "document_id": "b30476102db8",
    "source_file": "VIX_fact_sheet.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 3,
    "chunk_index": 3,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220926132510-05'00'",
    "duration": null
  },
  {
    "text": "Futures & Options on the VIX® Index Turn Volatility to Your Advantage Page 3 U.S. Futures and Options How the VIX Index Moves Inverse Relationship Mean-Reverting Generally, the VIX Index tends to have an inverse relationship with As a forward-looking indicator, the VIX Index tends to be mean the S&P 500 Index. Expected volatility typically increases when reverting. Unlike equity indices that can rise indefinitely, the markets are turbulent. In contrast, if stock prices are rising the VIX VIX Index, over time, will generally return or move back to its Index tends to fall or remain steady. But this may not always hold historical average. Volatility cannot move higher in perpetuity. true 100% of the time. It also cannot move to zero and historically has not gone below nine, which is distinct from equity prices. • The inverse correlation of the VIX Index makes the tradeable futures and options contracts potentially attractive risk • VIX futures and options should not be used as long-term, management or hedging vehicles. buy-and-hold investments. Cboe.com | @Cboe | /Cboe | /Company/Cboe © 2022 Cboe Exchange, Inc. All Rights Reserved. USO_v1.2 xednI XIV xednI 005 P&S For contract specifications and more details, visit Cboe.com/VIX Sales Trade Desk sales@cboe.com +1.913.815.7001 tradedesk@cboe.com *Under section 1256 of the Tax Code, profit and loss on transactions in certain exchange-traded options, including SPX Options, are entitled to be taxed at a rate equal to 60% long-term and 40% short-term capital gain or loss, provided that the investor involved and the strategy employed satisfy the criteria of the Tax Code. Investors should consult with their tax advisors to determine how the profit and loss on any particular option strategy will be taxed. Tax laws and regulations change from time to time and may be subject to varying interpretations. ** Cboe Regulatory Circular RG15-183 notes that Cboe rules allow a short position in a cash-settled-index option established and carried in a margin account to receive covered margin treatment if the short option position is offset in the same account by an equivalent or greater position in an index-tracking ETF that is based on the same index that underlies the short option(s) and provided the investor’s brokerage firm has such policies in place. Options involve risk and are not suitable for all investors. Prior to buying or selling an option, a person must receive a copy of Characteristics and Risks of Standardized Options. Copies are available from your broker or from The Options Clearing Corporation, One North Wacker Drive, Suite 500, Chicago, Illinois 60606. The information in this document is provided solely for general education and information purposes. Past performance is not indicative of future results. No statement within this document should be construed as a recommendation to buy or sell a security or futures contract or to provide investment advice. Supporting documentation for any claims, comparisons, statistics, or other technical data, will be supplied upon request. Cboe® is a registered trademark of Cboe Exchange, Inc. S&P® and S&P 500® are registered trademarks of Standard & Poor’s Financial Services, LLC and are licensed for use by Cboe.",
    "title": "VIX fact sheet",
    "source_type": "pdf",
    "document_id": "b30476102db8",
    "source_file": "VIX_fact_sheet.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 3,
    "chunk_index": 4,
    "word_count": 514,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220926132510-05'00'",
    "duration": null
  },
  {
    "text": "to provide investment advice. Supporting documentation for any claims, comparisons, statistics, or other technical data, will be supplied upon request. Cboe® is a registered trademark of Cboe Exchange, Inc. S&P® and S&P 500® are registered trademarks of Standard & Poor’s Financial Services, LLC and are licensed for use by Cboe.",
    "title": "VIX fact sheet",
    "source_type": "pdf",
    "document_id": "b30476102db8",
    "source_file": "VIX_fact_sheet.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 3,
    "chunk_index": 5,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220926132510-05'00'",
    "duration": null
  }
]