[
  {
    "text": "Volatility Regimes and Global Equity Returns Luis Catão* Research Department, IMF Allan Timmermann UC, San Diego Revised: April 2007 Abstract We develop a regime switching framework to jointly address three important questions in international finance – namely, whether global equity returns display well-defined volatility regimes, to what extent equity market volatility is accounted for by global, country- and sector-specific shocks, and what implications this has for global risk diversification. The proposed framework consists of a two-step approach whereby portfolios mimicking “pure” country and sectoral factors are first constructed from a large panel of firms, reducing the dimensionality of the problem and allowing joint dynamics to be modeled as regime-switching processes in a second stage. Estimates spanning over three decades of international firm-level data reveal well-defined volatility states in stock returns and show that the contribution of country factors dramatically drops when that of the global factor is high and during major sector-specific shocks with a global reach, such as oil shocks. After controlling for differences in volatility regimes and industry specialization across countries, we also find that international stock return correlations are systematically tighter among certain country groups as predicted by informational gravity models of cross-border equity flows. An implication of this is that the risk-diversification incentive behind such flows shifts over time, and more proportionately so among certain country groups. JEL Classification Numbers: C1, F36, G11, G15 Keywords: Stock market volatility, cross-border equity flows, risk diversification, regime switching. ___________________ * Corresponding author. Address: 700 19th Street, Washington DC 20431. Phone: (202) 6234936; FAX: (202) 6236334. Email: lcatao@imf.org. We thank seminar participants at the European econometric society meetings, IMF, and Monash University, as well as innumerous colleagues on both sides of the Atlantic, for many helpful comments on earlier drafts. The usual caveats apply. An early version of this paper was circulated as a CEPR discussion paper (no.4368) under the title “Country and Industry Dynamics in Stock Returns: A Regime Switching Approach”.",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 45,
    "chunk_index": 0,
    "word_count": 322,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "as well as innumerous colleagues on both sides of the Atlantic, for many helpful comments on earlier drafts. The usual caveats apply. An early version of this paper was circulated as a CEPR discussion paper (no.4368) under the title “Country and Industry Dynamics in Stock Returns: A Regime Switching Approach”.",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 45,
    "chunk_index": 1,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "2 The stock market burst of the early 2000s and widespread perception of tighter international co- movements in stock prices over the past boom and burst cycle have renewed interest in patterns of equity market volatility and their sources. Three important questions arise in this connection: First, does market volatility in fact display well-characterized temporary switches that can nevertheless quite persistent? Second, to what extent is such volatility accounted for by global, country- or sector- specific factors and how do these factor contributions evolve across distinct volatility states (if any)? Third, what implications follow for international risk diversification? Each of these questions has been addressed in distinct literatures. A first body of literature has looked at the question of whether stock return volatility is time-varying using a variety of econometric models capable of gauging rich asset pricing dynamics which have been applied to broad stock market indices (see Campbell et al. 1997 for a comprehensive survey). It is typically found that stock returns have been strongly time-varying, with evidence for the US showing stock market volatility to have risen in the run-up to the 1987 crash, then dropped to unusually low levels through 1996/97 before rising markedly since, although some controversy remains as to whether stock return volatility has been trendless (Schwert, 1989) or U-shaped over longer horizons (Eichengreen and Tong, 2004). While the above studies do not decompose such time-varying stock return volatility into its country-, sector-, and firm-specific components, other researchers have used international firm-level data to try to measure the relative importance of these factors. The employed econometric apparatus in the earlier strand of this literature has generally been much simpler, consisting of cross-sectional regressions of firms’ stock returns on a set of country and industry dummies for each period. Since these dummies are orthogonal in each cross-section, and their estimated coefficients represent the excess return associated with belonging to a given sector and country relative to a global average (the regression’s intercept), the contribution of each factor can then be computed in two ways: either by the time-series variance of the coefficients estimated in the successive cross-sectional regressions over fixed or rolling time windows of arbitrarily specified lengths, or by the average absolute sum of the coefficients on the sector and country dummies over the chosen window. On this basis, it has been concluded that the country factor typically explains most of the cross-sectional variation in stock returns, with sector- or industry-specific factors accounting for less than ten percent on average (Heston and Rouwenhorst 1994; Beckers et al., 1992; Griffins and Karolyi, 1998), albeit rising in the more recent period (Brooks and Catão, 2000; Brooks and del Negro, 2002; Cavaglia et al., 2000; L’Her et al., 2002). Underlying this approach is thus the assumption that factors driving country and industry-affiliation effects have very limited dynamics, being either constant or changing only very gradually over time. While more recent work has overcome some of these limitations by using an arbitrage pricing theory (APT) model where APT factors are extracted from the covariance matrix of returns and re-estimated over fixed intervals (Bekaert, Hodrick, and Zhang, 2005), or by using a GARCH framework (Baele and Inghelbrecht, 2005), this strand of the literature has continued to rely on linear factor specifications. In light of evidence that country factors have been typically important in driving stock returns, a third strand of the literature has focused on the issue of how they correlate over time and, hence, what scope there is for international equity risk diversification arising from the covariance patterns of equity returns across the various national markets. It has generally been found that such covariances display considerable time variation (King, Sentana, and Wadhwani, 1994; Lin, Engle, and Ito, 1994; Longin and Solnik, 1995; Bekaert and Harvey, 1995; Karolyi and Stultz, 1996). Further, it also found that informational proximity and common institutional factors play a role (Portes and Rey, 2005). While Portes and Rey (2005) use disaggregated data on equity flows to test the informational gravity",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 45,
    "chunk_index": 2,
    "word_count": 665,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "Engle, and Ito, 1994; Longin and Solnik, 1995; Bekaert and Harvey, 1995; Karolyi and Stultz, 1996). Further, it also found that informational proximity and common institutional factors play a role (Portes and Rey, 2005). While Portes and Rey (2005) use disaggregated data on equity flows to test the informational gravity",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 45,
    "chunk_index": 3,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "3 view, the bulk of this literature on time-varying national market correlations has typically been obtained using broad stock indices. Among other things, this does not allow one to disentangle how much of these correlations are due to “pure” country-specific factors or differences in the sector composition across the various national market indices – an issue that is better addressed with firm level data and consistent sector classification across countries. By the same token, the important question of how risk diversification possibilities evolve as the various country and industry factors move into distinct (and not necessarily coincident) volatility regimes is also overlooked in this literature. Against this background, the contribution of this paper is twofold. First, we develop a dynamically flexible econometric framework that is capable of addressing the above questions about patterns and sources of international equity market volatility. We do so without imposing unwarranted restrictions featuring in previous work, including the assumption of a single volatility regime, that the contribution of sector or country-specific factors cannot discretely change across regimes, or by making use of arbitrarily specified rolling-windows that are well-known since Frisch (1933) to be capable of inducing spurious dynamics in the data. There are clear reasons for why relaxing these assumptions is important. National policies which influence country risk may display non-gradual changes that have been deemed as one culprit for the time-varying nature of stock return volatility (Eichengreen and Tong, 2004) and are also a well-known source of non-linearities in macroeconomic and financial data (Engel and Hamilton, 1990; Driffill and Sola, 1994). By the same token, widely studied supply shocks such as oil shocks are known to have potentially large and discrete (or not-so-gradual) effects on equity market volatility, and so can the emergence of new technologies – a well-known source of business cycle asymmetries (Hamilton, 1989). Both are thus potentially capable of radically changing the industry-specific dynamics of stock returns and generate significant differences in persistence of high vs. low volatility regimes, which cannot be typically accounted for by linear models and/or GARCH-type specifications. All this underscores the need for greater flexibility in modeling the factor dynamics driving stock returns. The approach we propose consists of two-steps. In the first step we form “pure” country and “pure” industry (or sector) portfolios from a large cross-section of firms. Such a country-industry decomposition yields an important benefit relative to the practice of measuring international correlations using broad national indices in that it permits disentangling the extent to which a given variation in country X’s stock index is due to country X’s specific (institutional or policy related) factor or, instead, due to say an information technology (IT) shock that affects the country disproportionally simply because of a large weight of the IT sector in that country. No less importantly, this standard procedure of forming portfolios is instrumental for achieving the dimensionality reduction required in the application of richly parameterized models such as ours to large unbalanced panels. By summarizing the relevant firm-level information into a much smaller and hence manageable number of time-series, we can then model the dynamics of returns on the various country and sector portfolios in a possibly non-linear fashion in a second stage, allowing for regime switches in volatility processes. As shown below, once country-, industry- and global factors are each allowed to be in a different volatility regime at any given point in time, this will permit the characterization of a broader array of diversification possibilities than those considered in previous studies. The second contribution of the paper lies in applying this methodology to a uniquely long firm- level dataset so as to shed light on the substantive questions pertaining to the distinct strands of the literature referred to above. Our sample spans thirteen countries over nearly 30 years, compared with at most 15-20 years or so of data in previous studies.1 As it accounts for around 80 percent of",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 45,
    "chunk_index": 4,
    "word_count": 648,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "so as to shed light on the substantive questions pertaining to the distinct strands of the literature referred to above. Our sample spans thirteen countries over nearly 30 years, compared with at most 15-20 years or so of data in previous studies.1 As it accounts for around 80 percent of",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 45,
    "chunk_index": 5,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "4 advanced countries’ stock market capitalization towards the end of the period and between 56 to 73 percent of world stock market capitalization over 1973-2002, our dataset is thus broadly representative of global stock market developments. We use this data to answer the following questions. First, does the “stylized fact” that country factors overwhelmingly dominate sectoral- affiliation effects hold uniformly or change only very slowly/rapidly over time? Second, what is the strength of the various individual country and sectoral return correlations within the distinct volatility states (if more than one)? In particular, do we observe tighter equity return correlations within certain groups even after allowing for distinct volatility states and distinct sectoral compositions of the various national indices, consistent with informational gravity models of equity holdings? Finally, what are the implications for international portfolio diversification? The main results are as follows. First, we find strong evidence of nonlinear dynamic dependencies in both sector and country portfolios, indicating that the dynamic “mixtures of normals” model underlying the Markov-switching approach is superior to the single state model; we corroborate this evidence through a variety of tests on model residuals as well as by comparing our model’s smoothed probability estimates with non-parametric volatility measures spanning our entire sample. Second, we use this purportedly more accurate gauge provided by our model to estimate that the country factor explains about 50 percent of market volatility over the entire period on average, as opposed to 16 percent accounted for by the sector- or industry-specific factor. Thus, while this average contribution of the industry factor is substantially lower than that of the country factor, it is well above that estimated in earlier studies (less than 10 percent). No less importantly, these relative factor contributions are shown to vary widely across volatility states. The sectoral factor contribution typically rises sharply during major industry-specific shocks (such as the oil shocks of the early and late 1970s and mid-1980s, and IT boom and bust more recently), the direct counterpart of which is a marked drop in the country factor contribution down to the 30-35 percent range. Third, we provide a new set of measures of international portfolio correlations. Since these are model implied estimates calculated over the various portfolio pairs and conditional upon the entire time series information up to that point, they are not marred by biases affecting unconditional estimates discussed in Forbes and Rigobon (2001), nor affected by potential biases arising from relying on a small number of observations from a particular volatility state. We find that such volatilities vary markedly across states and, in particular, that when both the global and industry factors are in the high volatility state, correlations between country portfolios typically become tighter than correlations across industry portfolios. A key implication is that the sharp rise in country portfolio correlations during high global volatility states undermines the benefits of cross-border diversification during those periods. This effect is further compounded by the finding that such correlations are generally tighter across certain groups of countries (such as Anglo-Saxon countries and some European markets), thus lending support to an information gravity view of cross-border equity flows a la Portes and Rey (2005). Thus, our findings highlight a potentially important connection between global stock market volatility and both levels and the geographic distribution of international equity flows – an issue which, to our knowledge, is yet to be explored in the literature on the determinants of international capital flows. The remainder of the paper is structured as follows. Section 1 lays out the econometric methodology, while section 2 discusses the data. The empirical characterization of the single and joint dynamics of country and industry portfolios and of the global factor is provided in section 3. Section 4 presents variance decomposition results on the relative contribution of each factor to overall stock return volatility. Section 5 provides an economic interpretation of our model characterization of the volatility states, linking it to the existing literature on the determinants of stock market volatility.",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 45,
    "chunk_index": 6,
    "word_count": 662,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "is provided in section 3. Section 4 presents variance decomposition results on the relative contribution of each factor to overall stock return volatility. Section 5 provides an economic interpretation of our model characterization of the volatility states, linking it to the existing literature on the determinants of stock market volatility.",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 45,
    "chunk_index": 7,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "5 Section 6 examines the within-state portfolio correlations and examines the respective implications for global risk diversification. Section 7 concludes. 1. Econometric Methodology A. Constructing “Pure” Country and Industry Portfolios Panels of individual stock returns are typically highly unbalanced due to the fact that some firms die while others are “born” at some point within any reasonably long time series data. To deal with this problem without having to resort to potentially distorting procedures dropping the observations of both newly-born and dead firms to balance the panel and make estimation feasible, we present an approach that does not entail losing information contained in the time series dynamics of individual country or industry stock return series, nor in the whole cross-sectional dimension of the data. Specifically, we propose a two-stage approach where, in the first stage, we follow Heston and Rouwenhorst (1994) and extract the industry and country returns for a given time period through cross-sectional regressions in which each firm’s stock returns is defined as: R =α+β +γ +ε , (1) ijkt t jt kt it where R stands for the return at time t of the ith firm in the jth industry and the kth country, α is a ijkt t global factor common to all firms, β is an “excess” return owing to the firm’s belonging to industry jt j, γ is an “excess” return associated with the firm’s location in country k, and ε is an idiosyncratic kt it firm-specific factor. This factor structure has been a work-horse in much of the literature on equity market volatility and co-movements, both among studies using firm-level data as well as among those using aggregate country indices (see, e.g., Forbes and Chinn, 2004).2 What has differed among recent studies is whether country and industry factor loads are assumed to be fixed, cross-sectionally varying, time-varying, or both. While there are advantages of letting the loads vary both across firms and over time as in Bekaert, Hodrick, and Zhang’s (2005), this choice needs to be traded off against the benefits of modeling the dynamics of factor loadings as a regime- switching process. For lettingβ and γ vary both cross-sectionally and over time for each firm would be unfeasible (even for reasonably long time series such as ours) given the already large number of parameters to be estimated with only time-varying loadings, as discussed below. Clearly, fixing the cross-sectional factor loads has the drawback that individual firms may differ in their degree of exposure to the global factor. However, this cost appears to be less consequential in the present context since we rely on this load homogeneity assumption only to construct country and sector portfolios consisting of hundreds of firms, so that the effect of idiosyncratic factor loadings is largely washed out in the aggregate.3 Further, one other major advantage of doing so – besides that of making the subsequent regime-switching estimation feasible – is to facilitate comparability between our results and those from a large body of the literature which also uses decomposition schemes based on firm-level homogeneity of factor loads. This allows us to isolate the contribution of our approach relative to earlier studies. Generalizing to J industries and K countries, equation (1) can be written as:",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 45,
    "chunk_index": 8,
    "word_count": 536,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "our results and those from a large body of the literature which also uses decomposition schemes based on firm-level homogeneity of factor loads. This allows us to isolate the contribution of our approach relative to earlier studies. Generalizing to J industries and K countries, equation (1) can be written as:",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 45,
    "chunk_index": 9,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "6 J K R =α+∑e β +∑e γ +ε , (2) ijkt t ijβ jt ikγ kt it j=1 k=1 where e is a dummy variable defined as 1 for the ith firm’s industry and zero otherwise, while ijβ e is a dummy defined as 1 for the ith firm’s country and zero otherwise. Since each firm can only ikγ belong to one industry and one country at a time, the various industry dummies in (2) will be orthogonal to each other within the cross-section. Likewise, the various country dummies will also be orthogonal to each other. We can re-write (2) more succinctly by defining the excess return vectors as: ⎛β ⎞ ⎛γ ⎞ 1t 1t ⎜ ⎟ ⎜ ⎟ β γ β = ⎜ 2t⎟ , γ = ⎜ 2t ⎟ , t ⎜ (cid:35) ⎟ t ⎜ (cid:35) ⎟ ⎜ ⎟ ⎜ ⎟ ⎜ ⎟ ⎜ ⎟ β γ ⎝ ⎠ ⎝ ⎠ Jt Kt so that: R =α+e′ β +e′ γ +ε. (3) ijkt t iβ t iγ t it where e is a J ×1 vector of zeros with a one in the ith firm’s industry, while e is aK ×1 vector iβ iγ of zeros with a one in the ith firm’s country. Since equation (3) cannot be estimated as it stands because of perfect multicollinearity (since every company belongs to both an industry and a country whereas the industry and country effects can only be measured relative to a benchmark), we follow the literature by imposing the restriction that the weighted sum of industry and country effects equals zero at every point in time; so, the industry and country effects are estimated as deviations from a common benchmark, the return on the global factor captured by the intercept α. Subject to these zero sum restrictions, equation (3) can be estimated using weighted least squares, with each stock return being weighted by its beginning-of- period share x of the global stock market capitalization (computed as a sum of the market i capitalization of all the N firms comprising the cross-section). An advantage of constructing country and industry portfolios this way is that the number of firms in each cross-section can vary and yet the panel of portfolios of country and sector or industry specific excess returns is balanced. This procedure therefore effectively summarizes the relevant information from the original unbalanced panel. B. Modeling Stock Return Dynamics While the earlier literature has not attempted to link the individual industry (β) and country t components (γ) over time, we will allow for such dependencies in these components in a flexible t manner which does not impose linearity or serial independence a priori. In doing so, we follow the large empirical literature that has documented the presence of persistent regimes in a variety of financial time series (Ang and Bekaert, 2002; Engel and Hamilton, 1990; Driffill and Sola, 1994;",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 45,
    "chunk_index": 10,
    "word_count": 481,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "a flexible t manner which does not impose linearity or serial independence a priori. In doing so, we follow the large empirical literature that has documented the presence of persistent regimes in a variety of financial time series (Ang and Bekaert, 2002; Engel and Hamilton, 1990; Driffill and Sola, 1994;",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 45,
    "chunk_index": 11,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "7 Hamilton, 1988; Kim and Nelson, 1999; Perez-Quiros and Timmermann, 2000). Typically these studies capture periods of high and low volatility in univariate series or in pairs of series (e.g. Ang and Bekaert, 2002; Perez-Quiros and Timmermann, 2000). In what follows we extend this approach to multi-country/multi-sector portfolios. Lets ,s ,s be separate state variables driving returns on the global, industry, and country αt βt γt j k portfolios, respectively. We show in the empirical section that the data justifies this assumption. If, furthermore, these state variables are industry and country specific, we can write returns on the global, industry and country portfolios as: α =μ +σ ε , t αs αs αt αt αt β =μ +σ ε , (4) jt βs βs βjt j βjt j βjt γ =μ +σ ε kt γs γs γkt. kγkt kγkt Suppose, for example, that there are two states for the global return process so s = 1 or s = 2. αt αt Then the mean of the global return component in any given period, t, is either μ or μ , while its α1 α2 volatility is either σ or σ . Similarly, if the jth industry state variable can take two values, s = 1 or α1 α2 βjt s = 2, then the jth industry’s mean return at time t is either μ or μ while its volatility is either σ βjt βj1 βj2 βj1 or σ . βj2 How the state processes alternate between states is obviously important. We follow conventional practice and assume constant state transition probabilities for the global return process as well as for the individual country and industry return processes: Pr(S =s |S = s )= p , αt α αt−1 α αs s αα Pr(S = s |S =s )= p , (5) βjt β β βj βjs s j jt−1 βj βj Pr(S = s |S = s )= p . γkt γk γkt−1 γk γks s γkγk Here p is the probability that the global return process remains in state 1 if it is already in this α11 state, p is the probability that the jth industry state variable remains in state 1 and so forth. This βj11 means that the regimes are generated by a discrete state homogenous Markov chain. We will be interested in studying the state probabilities implied by our models given the current information set, Γ , which comprises all information up to time t, i.e., π =Pr(S = s |Γ ), t sαt αt α t π =Pr(S = s |Γ ), π =Pr(S = s |Γ ). As we shall see in the empirical section, the sβt βt β t sγt γt γ t j j j k k time series of these probabilities extracted from the data provide information about high and low volatility states. Finally, we assume that the innovation terms, ε , ε and ε are normally distributed. αt βjt γkt This implies that the return process will be a mixture of normal random variables, the resulting distribution of which is capable of accommodating features such as skews and fat tails that are frequently found in financial data, c.f. Timmermann (2000). Under this model, the return on the ith company in industry j and country k is affected by separate global, industry and country regimes plus an idiosyncratic error term",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 45,
    "chunk_index": 12,
    "word_count": 559,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "is capable of accommodating features such as skews and fat tails that are frequently found in financial data, c.f. Timmermann (2000). Under this model, the return on the ith company in industry j and country k is affected by separate global, industry and country regimes plus an idiosyncratic error term",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 45,
    "chunk_index": 13,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "8 R =μ +μ +μ +σ ε +σ ε +σ ε +ε . (6) ijkt αs βs γs αs αt βs βjt γs γkt it αt j βjt kγkt αt j βjt kγkt It is possible, however, that the state variable driving the industry and country returns shares an important common component across industries and country returns. This could be induced, for example, by an oil shock to the extent that the latter tends to have a large differential effect across industries and a far more homogenous effect across countries. Similarly, one can think of a number of common shocks of political origins, for instance, such as a war or a large scale terrorist attack that spread mainly along country lines as opposed to industry lines. If so, a more efficient way to gain information about the underlying state variable is to estimate a multivariate regime-switching model jointly for several portfolios. To account for the possibility that a common state factor is driving the individual industry returns on the one hand and the individual country returns on the other hand, we consider the following model: α = μ +ε , t αs αs αt αt β = μ +ε , (7) t βs βs βt βt γ = μ +ε , t γs γs γt γt whereμ is the scalar global mean return in state s ,μ is a J-vector of industry means in state αs αt βs αt βt s , μ is a K-vector of country means in state s . Furthermore, the innovations to returns are βt γs γt γt assumed to be Gaussian with zero mean and state-specific variances ε ~ ( 0,σ2 ) αs αs αt αt ( ) ( ) ε ~ 0,Ω , ε ~ 0,Ω , where σ2 is the scalar variance of global return in state s , βs βs γs γs αs αt βt βt γt γt αt Ω is the JxJ variance-covariance matrix of industry returns in state s , Ω is the KxK βs βt γs βt γt variance-covariance matrix of country returns in state s . γt State transitions for this common factor case are still assumed to be time-invariant: Pr(S = s |S = s ) = p , αt α αt−1 α αs s αα Pr(S = s |S = s ) = p , (8) βt β βt−1 β βs s ββ Pr(S = s |S = s ) = p . γt γ γt−1 γ γs s γγ The regime switching model is fully specified by the state transitions (8), the return equations (3) and (7) and the assumed “mixture of normals” density. However, estimation of the model is complicated by the fact that the state variable is unobserved or latent. We deal with this by obtaining maximum likelihood estimates based on the EM algorithm (see Hamilton, 1994, for details). A major advantage of our common nonlinear factor approach is that it allows us to extract volatility estimates of portfolio strategies involving an arbitrary number of countries or industries in addition to the global component. As discussed in Solnik and Roulet (2000), the standard way to capture time-variation in market volatility and correlations is by using a fixed-length rolling window",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 45,
    "chunk_index": 14,
    "word_count": 537,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "that it allows us to extract volatility estimates of portfolio strategies involving an arbitrary number of countries or industries in addition to the global component. As discussed in Solnik and Roulet (2000), the standard way to capture time-variation in market volatility and correlations is by using a fixed-length rolling window",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 45,
    "chunk_index": 15,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "9 of, say, 36 or 60 months of returns data and estimate cross-correlations for pairs of countries. This approach has three major disadvantages compared to our approach. One is that of not relying on the full data sample, likely leading to imprecise estimates of volatilities and correlations which typically require relative large data samples for precise estimation. Second, by construction as they present moving averages of volatilities, rolling window estimates cannot capture relatively short-lived volatility bursts that may be important for investment risk. Third, rolling window estimates provide unconditional estimates of volatilities and correlations and do not exploit any dynamic structures in the covariance of portfolio returns other than indirectly as the parameter estimates get updated over time. In contrast, the proposed regime switching framework can capture richer dynamics: while the mean and variance of returns are constant within each state, the state probabilities vary over time either gradually (if the filtered state probabilities change slowly) or rapidly (if filtered state probabilities move more suddenly). 2. Data The data cover monthly total returns and market capitalizations for up to 3,951 firms in developed stock markets over the period February 1973 to February 2002.4 Country coverage spans Australia, Belgium, Canada, Denmark, France, Germany, Ireland, Italy, Japan, Netherlands, Switzerland, the United Kingdom and the United States. While data are available for other advanced stock markets (notably Austria, Norway and Sweden) from the late 1970s/early 1980s, this would entail a shorter estimation period and attendant degrees of freedom constraints would turn the estimation infeasible. The exclusion of emerging markets in particular from our sample does not seem capable of altering the main results. Recent work that includes both mature and emerging markets in (value weighted) regressions for the post-1985 period finds that trends in the relative contribution of country and industry factors are basically the same regardless of whether one includes or excludes the emerging market sub-sample (Brooks and Catão, 2000; Brooks and del Negro, 2002). Firms in these 13 countries are then grouped into one of 11 FTSE industry sectors: resources, basic industries, general industries, cyclical consumer goods, non-cyclical consumer goods, cyclical services, non-cyclical services, utilities, information technology, financials and others. While some recent papers argue in favor of a finer industry classification, the level of aggregation used here is sufficient not only because it follows the traditional industry breakdown used by portfolio managers and much of the academic literature, but also because it clearly distinguishes new industries which appear to have distinct time series dynamics of stock returns (such as information technology).5 A desirable feature of this data is that it be a realistic and unbiased representation of the global stock market. As of December 1999, the total capitalization of the sample comes to $26.3 trillion or 80 percent of stock market capitalization in advanced countries as measured by the IFC yearbook and 73 percent of the world market capitalization (i.e. including developing countries). Coverage deteriorates somewhat towards the beginning of the sample but because the data comprises the largest and internationally most actively traded firms in key markets such as the United States, Japan, and the United Kingdom throughout, the sample can be deemed as quite representative from the viewpoint of a global investor. It should be noted, however, that the deterioration in coverage reflects two deficiencies of the data set. First, it is subject to survivorship bias, meaning that only firms surviving over the full sample period are covered. While this bias no doubt affects average rates of return, it does not seem to be too consequential for the analysis of relative factor contributions to market volatility, which is this paper’s central concern. This can be gauged from the very small differences in the results obtained from an application of the Heston-Rouwenhorst decomposition scheme to a sub- sample that includes dead firms for the post-1986 period (when such a list is available) and the",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 45,
    "chunk_index": 16,
    "word_count": 645,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "to market volatility, which is this paper’s central concern. This can be gauged from the very small differences in the results obtained from an application of the Heston-Rouwenhorst decomposition scheme to a sub- sample that includes dead firms for the post-1986 period (when such a list is available) and the",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 45,
    "chunk_index": 17,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "1 0 counterpart in our data which does not include such firms.6 The second deficiency of the data is that of including only post-merger companies, dropping companies that go into the merger. The most likely effect of this is to bias the estimates in favor of finding more pronounced global industry effects in the more recent years in the sample; but since this problem applies only to a few firms, it is also likely to have a very limited effect on the estimates. On the positive side, our sample stretches over a much longer time period than those in the studies referred to above. This is a crucial advantage required for precise estimation of regime switching processes. As we shall see, most regimes tend to be quite persistent so identifying them requires a time series as long as that considered in our study. No single country is represented by less than 28 firms on average (Ireland and Denmark) and, in the case of large economies such as the US and Japan, coverage approaches 1,000 firms towards the end of the sample from a minimum of 377 firms at the beginning of the sample (February 1973). This reasonably large time series and cross-sectional dimension of the data probably eliminates any significant distortion in the econometric results arising from the deficiencies mentioned above 3. Global Stock Return Dynamics Table 1 presents some summary statistics for the distribution of the country—industry and world portfolios. All country and industry portfolio returns are measured in excess of the world portfolio so the mean returns on these portfolios are close to zero on average.7 Standard deviations average 4.89 percent per month for the country portfolios and 2.96 percent for the industry portfolios, thus verifying the finding in the literature that, on average, country factors matter more than industries for explaining variations in stock returns. Country portfolios tend to be slightly more positively skewed than the industry portfolios while, interestingly, returns on the global portfolio are not skewed. There is also strong evidence of excess kurtosis in most of the portfolios. Accordingly, Jarque-Bera test statistics for normality rejected the null of normally distributed returns for all portfolios except for Switzerland and Japan.8 This is the type of situation where mixtures of normals may better capture the underlying return distribution. A. Nonlinearity in Returns Previous studies of country- and industry effects in international stock returns have been based on the assumption of a single state, so it is important to investigate the validity of this assumption. To determine whether a regime switching model is appropriate for our analysis, we first verify that two or more states characterize the return generating process of the individual industry and country portfolios. For this purpose we report the outcome of the statistical test proposed by Davies (1977) which, unlike standard likelihood ratio tests, has the advantage of taking into account the problem associated with unidentified nuisance parameters under the null hypothesis of a single regime. The results are shown in Table 2. For 10 out of 13 countries and 10 of 11 industries, the null of a single state is rejected at the 1 percent critical level. Linearity is also strongly rejected for the global portfolio. Hence there is overwhelming evidence of nonlinear dynamics in the form of multiple regimes in country, industry and global returns. These results suggest that there are at least two regimes in the vast majority of return series. However they do not tell us if two, three or even more states are needed to model the return dynamics. To choose among model specifications with multiple states, Table 3 reports the results of tthhrreeee standard information criteria that are designed to trade off fit (which automatically grows with",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 45,
    "chunk_index": 18,
    "word_count": 620,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "series. However they do not tell us if two, three or even more states are needed to model the return dynamics. To choose among model specifications with multiple states, Table 3 reports the results of tthhrreeee standard information criteria that are designed to trade off fit (which automatically grows with",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 45,
    "chunk_index": 19,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "1 1 the number of parameters and thus with the number of underlying states) against parsimony (as measured by the total number of parameters). We report results using the Akaike (AIC), the Schwarz Bayesian (BIC) and the Hannan-Quinn (HQ) information criteria. For the 13 country portfolios, the three criteria unanimously point to a single state for Canada and Switzerland and three states for the UK, and at least two of the above criteria suggest that stock returns in all other countries are better modeled as a two-state process.9 Turning to the industry portfolios, the results are even more homogenous, with the BIC and HQ criteria selecting a two-state model for 9 industries out of 11. At the same time, all three criteria indicate that stock returns in Resources are best captured through a three-state model. Only for cyclical services is there considerable difference—the BIC and HQ choosing a single-state model while the AIC selects a three-state specification. Finally, regarding the global portfolio, AIC and HQ choose a two-state specification, while the BIC marginally selects a single-state specification. Overall, therefore, the results in Table 3 strongly indicate the presence of two states in the dynamics of the various portfolio returns. Accordingly, the subsequent analysis is based on this specification. B. Joint Portfolio Dynamics Addressing the question of the overall importance of industry and country effects requires studying common country and common industry effects. As discussed in section 2, we do this using a nonlinear dynamic common factor specification, which is distinct from the vast majority of recent work on dynamic factor models (cf. Stock and Watson, 1998) in that it does not impose a linear factor structure. This distinction is particularly important when the main interest lies in extracting common factors in the volatility of returns on various portfolios, given overwhelming empirical evidence of time-varying volatilities in stock returns. We estimate the proposed joint regime switching model for the return series on the 13 country portfolios and 11 industry portfolios. To our knowledge, regime switching models on such large systems of variables have not previously been estimated. The joint estimation of the parameters of a highly nonlinear model for such a large system is a nontrivial exercise. Yet, it can yield valuable insights into the joint dynamics of portfolio returns, as discussed below. Table 4 presents estimates of the transition probabilities and average state durations and the outcome of the Davies test for multiple states. Volatility estimates are shown in Table 5 which also presents results for the global portfolio.10 As expected, the null hypothesis of a linear model with a single state is strongly rejected for the country, industry, and world models. All three information criteria support a two-state model over the single-state model in the case of the joint industry and joint country models, while both the AIC and the HQ criterion support the two-state specification over the one-state model for the global return model. Table 4 also shows that the two states identified in country returns have persistence parameters of 0.975 and 0.976, implying that the durations of the two states are high at 40 and 42 months, respectively. Clearly the model is picking up long-lasting regimes in the common component of the country portfolios. The average volatility is around 4.9 percent in both states, so the states are no longer defined along high and low volatility on average. Different results emerge from the parameter estimates for the joint industry model. In the low volatility state (state 2) the average volatility is 2.27 percent while it is more than twice as high in the high volatility state (4.67). Average correlations are now negative in the low volatility state and zero in the high volatility state. State transition probabilities for the industry returns listed in Table 4 at",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 45,
    "chunk_index": 20,
    "word_count": 629,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "2) the average volatility is 2.27 percent while it is more than twice as high in the high volatility state (4.67). Average correlations are now negative in the low volatility state and zero in the high volatility state. State transition probabilities for the industry returns listed in Table 4 at",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 45,
    "chunk_index": 21,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "1 2 0.87 and 0.96 are quite high and imply average duration of 27 months in regime 1 and 26 months in regime 2. Consequently the steady state probabilities are 23 and 77 percent, so that three times as much time is spent by the industry portfolios in the low volatility regime (state 2). Figure 1 plots the time series of the smoothed probabilities for the high volatility state identified by the common country and common industry models as well as the model for global returns. The high persistence in the common country component stands out. For example, the common country effect stays in the same regime over the period 1986–1997, although it is difficult to interpret in terms of periods of high and low volatility. The common industry regime identifies four high volatility periods around the early seventies (1974) and 1979-80, a spell from 1986 to September 1987 followed by the more recent period from late 1997. The global return component follows shorter cyclical movements that nevertheless are well identified by the model. The finding that the global return component is the least persistent factor bodes well with the interpretation that it captures a variety of large, common economic shocks typically associated with the global business cycle. In contrast, common country components are likely to undergo less frequent shifts as they tend to be more based on structural relations that are more slowly evolving, especially in countries with relatively stable institutions such as the advanced countries comprising our dataset. The economic interpretation of these results is further discussed in Section V. C. Robustness Checks A simple way of gauging the robustness of our estimates is to compare our smoothed probability estimates in the upper panel of Figure 1 as well as the associated measures of market volatility (computed as discussed below) against a simple non-parametric measure of global stock return volatility – the intra-month (capitalization weighted) variance of daily stock returns in the thirteen countries that we consider. This comparison is plotted in Figure 2. Our model clearly appears to do a very good job in picking up the major volatility shifts: the correlation between our model estimates and such high-frequency non-parametric measures is reasonably high at 0.4. We also performed a series of tests on the properties of the residuals that attest the suitability of our model specification. The main results are as follows. For the world portfolio, the coefficient of excess kurtosis goes from 0.79 in the raw return data to -0.10 for the data normalized by the weighted state means and standard deviation. The Jarque-Bera test for normality (which has a critical value of 5.99) goes from 9.11 to 0.24. For the country portfolios, the average coefficient of excess kurtosis in the raw returns data is 2.38. This drops to 0.16 after standardizing by the regime moments. Moreover, the average normality test drops from 297 to 1.53 and, when standardized by the regime moments, the number of rejections drops from 11 to only one rejection. For the industry portfolios, the average coefficient of excess kurtosis drops from 2.91 to 0.56 and the average value of the normality test declines from 180 to 18.6 upon standardizing by state moments. The upshot is that these tests clearly suggest that the proposed model is fitting the data well in that the residuals from the two-state specification are close to being normally distributed for the vast majority of portfolios, despite the evidence of very strong non-normality prior to accounting for distinct volatility regimes. 4. Variance Decompositions A central question in the literature on the sources of stock return volatility is the relative volatility of geographically or industrially diversified portfolios. To get a first measure of how the total market",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 45,
    "chunk_index": 22,
    "word_count": 619,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "despite the evidence of very strong non-normality prior to accounting for distinct volatility regimes. 4. Variance Decompositions A central question in the literature on the sources of stock return volatility is the relative volatility of geographically or industrially diversified portfolios. To get a first measure of how the total market",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 45,
    "chunk_index": 23,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "1 3 variance evolves over time, we simply sum the global variance, the average country variance and the average industry variance (all based on conditional moment information reflecting the time-varying state probabilities) as follows: σ2 =∑π (σ2 +(μ −μ )2) t s s αs αt αt αt αt s αt +∑π (ω' Ω ω +ω' (μ −μ )2) (9) s βt βs βt βt βs βt βt βt βt S βt +∑π (ω' Ω ω +ω' (μ −μ )2), s γt γs γt γt γs γt γt γt γt S γt where ω is the vector of weights for the industry portfolios and ω is the vector of weights of βt γt country portfolios.μ =∑ π μ is the conditional expectations of the global portfolio returns, αt s αt s αt αs αt μ =∑ π μ and μ =∑ π μ are Jx1 and Kx1 vectors of conditionally expected βt s βt s βt βs βt γt s γt s γt γs γt returns on the industry and country portfolios, respectively. The first component in (9) accounts for the total variance of the global return component. The second component is the value-weighted industry variance, while the third component is the value-weighted country variance. Besides accounting for state-dependent covariances, there is an extra component in each of these terms arising from variations in the means across states. Notice that this measure of total market variance changes over time due to time-variations in the state probabilities.11 Figure 3 plots the time-series of the market volatility component computed from (9). Volatility varies considerably over time from a low point around 2.8 percent to a peak around 5.5 percent per month. It was very high around 1974/75, 1980, 1987, 1991, and from late 1997 onward. At these times, the market volatility component was close to twice as large as during the low volatility regimes that occurred in the late seventies and mid-nineties. Recalling that the volatility of the country component does not vary much across the two states, while conversely the volatility of the industry and global portfolio returns are about twice as high in the high volatility state as they are in the low volatility state, it is easy to understand the figure. Systematic volatility tends to be high when the common industry component and the global component are both in the high volatility state at the same time, i.e. in 1974, 1980, 1987 and from 1998 to 2002. Conversely, if they are simultaneously in the low volatility state, then systematic volatility will be low.12 The measure of market variance in (9) readily lends itself to a decomposition into its three constituents. Figure 4 shows the fraction of total market variance represented by the average country, industry and global components scaled by the sum of these. Time variation in the (average) country fraction is very large and ranges from about two-thirds to one-third as in recent years. In particular, the importance of the country factor has been noticeably lower in periods such as the 1974-75 oil shock, the 1987 stock market crash and the information technology boom of the late 1990’s. Likewise, the fraction of total market volatility due to the industry component also varies considerably as shown in the middle panel of Figure 4. It rises to about thirty percent in the immediate aftermath of the two oil shocks of the 1970s (1974 and 1980/81), during the stock market crash of 1987, and during the IT boom and bust cycle from 1997/98 onwards. In the context of the",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 45,
    "chunk_index": 24,
    "word_count": 587,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "the middle panel of Figure 4. It rises to about thirty percent in the immediate aftermath of the two oil shocks of the 1970s (1974 and 1980/81), during the stock market crash of 1987, and during the IT boom and bust cycle from 1997/98 onwards. In the context of the",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 45,
    "chunk_index": 25,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "1 4 existing literature, the estimated average level in the 10 to 15 percent range is slightly higher than the 7 percent figure of Heston and Rouwenhorst (1994) and more than twice as high as the estimates in Griffin and Karolyi (1998)—both based on linear single-state models.13 Figure 4 clearly unveils significant changes in the relative importance of the industry factor and shows that its recent rise has in fact been the most persistent of all over the past thirty years, though not quite yet to the point where its contribution to volatility has surpassed that of the country factor. As shown in the bottom panel of Figure 4, this is partly due to the concomitant rise of the global factor contribution to overall stock return volatility in recent years which has filled some of the gap arising from the decline in country- specific volatility. It is instructive to compare these results with those obtained through the widespread practice of estimating relative contributions by the time-series variances of the estimated β and γ , computed jt kt over a rolling window. We follow the common practice of using a window length of 3 years, but also experimented with 4- and 5-year rolling windows and found the trends to be very similar. To facilitate comparison with our results, Figure 5 plots the 3-year rolling window results together with our regime switching estimates previously plotted in Figure 4. Clearly, the rolling window approach smoothes out the shifts in factor volatilities and their relative contributions. The respective states become less clearly defined and the approach overlooks the important spikes associated with the oil shocks of 1973-74 and 1979-80. Finally, we also consider an alternative and complementary measure of the relative significance of the industry and country contributions to portfolio returns, which was proposed by Griffin and Karolyi (1998). Our two-stage econometric methodology allows us to extend the Griffin and Karolyi decomposition scheme by both letting the relative contributions of each factor vary across states and taking into account the various industry covariances within each state. As in Griffin and Karolyi (1998), let the excess return on the national stock market or portfolio of country k (over and above the global portfolio return αˆ) be decomposed into country k’s unique industry weights times the industry J returns summed across industries (i.e., ∑ωββ ˆ ) plus a “pure” country effect γˆ :14 jkt jt kt j=1 J R −αˆ =∑ωββ ˆ +γˆ , (10) kt t jkt jt kt j=1 where ωβ is the jthindustry’s weight in country k. The variance of this excess return conditional on jkt the country state being s and the industry state being s is γt βt Var(R −αˆ |s ,s )=(ωβ)'Ω ωβ+e'Ω e +2(ωβ)'Cov(β ,γ |s ,s ), (11) kt t βt γt kt kt k k kt jt kt βt yt βsβ γsγ where ωβ is the J-vector of market capitalization weights of the industries in country k. kt Similarly, the excess return on the portfolio of industry j(over and above the global portfolio) can be decomposed into industry j'sunique country weights times the country returns summed ˆ across countries plus a pure industry effect, β : jt",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 45,
    "chunk_index": 26,
    "word_count": 530,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "of market capitalization weights of the industries in country k. kt Similarly, the excess return on the portfolio of industry j(over and above the global portfolio) can be decomposed into industry j'sunique country weights times the country returns summed ˆ across countries plus a pure industry effect, β : jt",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 45,
    "chunk_index": 27,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "1 5 K R −αˆ =∑ωγγˆ +β ˆ , (12) jt t jkt kt jt k=1 where ωγ is the kthcountry’s weight in industry j. The variance of this excess return conditional on jkt the country state being s and the industry state being s is γt βt Var(R −αˆ |s ,s )=(ωγ)'Ω ωγ +e'Ω e (ωγ)'+2Cov(β ,γ |s ,s ), (13) jt t βt γt jt jt j βs j jt jt kt βt yt γsγ β where ωγ is the K-vector of market capitalization weights of the countries in industry j. kt Panel A in Table 6 reports the time-series variances of the “pure” country effects and the cumulative sum of the industry effects in the 13 country portfolios, while Panel B reports the time- series variances of the pure industry effects and the cumulative sum of country effects in the 11 industry portfolios. In both cases, these variances are expressed as a ratio relative to the total variances of the excess returns. Their sum is therefore close, but not exactly equal to one due to the presence of the extra covariance term in (11) and (13) between the industry and country effects. Since country volatility does not vary greatly over the two states, to save space Table 6 simply presents results separately for the high and low industry volatility state. While a number of individual country and sector results are of interest in their own right, looking at the overall means, two findings stand out. First, the 3.3 percent figure reported in the upper right panel is the overall measure of the industry factor contribution in the low industry volatility state, which is well within the range previously estimated by Griffin and Karolyi (1998) (2 and 4 percent depending on the level of industry aggregation—see tables 2 and 3 of their paper). Turning to the left panel, however, one can see that the same measure yields a much higher estimate of the aggregate industry component in the country portfolios (22.3 percent on average). In both the high and low industry volatility states, the average pure country volatility accounts for over 90 percent of the total country volatility—the fact that the right- and the left-hand side estimates in Panel A add to 120 percent being due to the higher negative covariance between the pure country and the composite industry effect during the high industry volatility state. Moving to the breakdown of the industry portfolios shown in the bottom panels of Table 6, it is clear that the aggregate contribution of country effects to industry portfolios is also state sensitive, being much lower (17 percent) in the high industry volatility state than in the low industry volatility state where it more than doubles (41 percent). Similarly, the pure industry contribution accounts for 91 percent of the total industry portfolio volatility in the high industry volatility state but only for 69 percent in the low industry volatility state. These results therefore suggest that decomposition averages reported in previous studies do vary considerably over economic states. 5. Economic Interpretation: Oil, Money, and Tech Shocks The existence of distinct volatility regimes in stock returns and shifts in the factor contributions therein beg the question of what drives them. While the construction of a multivariate global risk model capable of identifying the various underlying shocks and their propagation into stock pricing is beyond this paper’s scope, it is important to relate the above findings to key global economic developments in light of an existing literature on the drivers of stock market volatility. Furthermore, this provides an additional robustness check on the reasonableness of our estimates.",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 45,
    "chunk_index": 28,
    "word_count": 602,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "and their propagation into stock pricing is beyond this paper’s scope, it is important to relate the above findings to key global economic developments in light of an existing literature on the drivers of stock market volatility. Furthermore, this provides an additional robustness check on the reasonableness of our estimates.",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 45,
    "chunk_index": 29,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "1 6 A glance at the top and bottom panels of Figure 1 as well as Figure 3 is suggestive of one key determinant of the three main spikes in global market volatility identified by our model – 1973-75, 1979-80, and 1986-87. These were periods when the probability of being in the high volatility state for the common industry factor peaked relative to the rest of the sample (bottom panel of Figure 1), and the industry factor’s contribution to overall global market volatility rose (middle panel of Figure 4). This clearly coincided with large oil shocks: oil prices tripled in 1974, more than doubled in 1979, and underwent a sharp decline in 1986, when the spot price of oil reached an in-sample trough below $10/barrel. These periods coincided with spells of substantial short-run volatility in oil prices and marked profitability shifts across industries depending on their oil-intensity, leading to greater uncertainty about future earnings growth that were also reflected in current stock prices (Guo and Kliesen, 2005; Kilian and Park, 2007). Similar evidence that industry-specific shocks contributed to drive up global stock return volatility from 1997 is also evident from our estimates, which highlight the higher contribution of the industry factors during that period. Yet, a more complex set of circumstances appears to have been at play. To gain insight into those, Figure 7 plots the smoothed transition probabilities for the different industries. Earlier explanations of the rise in volatility and co-movement across mature stock markets during 1997-2001 focus on the IT sector (Brooks and Catão, 2000; Brooks and del Negro, 2004). This is not only because IT stock volatility rose sharply during those years but also because the weight of the sector in the global market portfolio more than doubled – from 10 percent in mid-1997 to 25 percent at the market peak in March 2000. As discussed by Ohlin and Sichel (2000), this coincided with efficiency gains in the information technology sector, an associated shift in the relative profitability across industries and frequent revisions in earnings growth expectations, all of which only became tangible – and not so gradually so – in the late 1990s because of a sharp rise in the sector’s weight. This is starkly picked up by our smoothed transition probability estimates shown in the second panel of Figure 7B. However, our estimates indicate that such a transition into a higher volatility state is not the preserve of the IT sector. The post-1997 period was also characterized by rising volatility in oil prices: the world oil price tripled between end-1998 and end-2000, before dropping sharply through 2001 and shooting up subsequently. This is clearly captured by the transition probability estimates for the resource industry in Figure 7A. In addition, other industries also witnessed a volatility bout and these are not limited to media and telecom firms–industries with closer ties to the IT sector (grouped under cyclical and non-cyclical services, respectively – see footnote 5). Some of this generalized volatility rise no doubt reflects the well-known tightening in world monetary conditions and financial distress in Asian emerging markets and Russia, particularly affecting the financial service sector (which was more heavily exposed to those markets – cf.. the widely publicized collapse of the US- based hedge fund Long-Term Capital Management), but also large chunks of the general industry in the US, Japan and Europe which also exported heavily to those emerging markets (see Forbes and Chinn, 2004 on related evidence). Hence, it is not surprising that the model is picking up such a strong common industry component rapidly transitioning from a low to a high volatility state. In a nutshell, while previous work has emphasized the role of the IT sector in driving up global market volatility between 1997 and 2002, our industry estimates and the model’s allowance for a common industry factor indicate that the phenomenon was more widespread than previous work may suggest. Our estimates also suggest that industry-specific shocks are not the whole story behind the successive ups and downs in global stock return volatility during 1973-2002. Specifically, industry- specific shocks do not seem able to account for two other volatility shifts which we identify – the",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 45,
    "chunk_index": 30,
    "word_count": 693,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "than previous work may suggest. Our estimates also suggest that industry-specific shocks are not the whole story behind the successive ups and downs in global stock return volatility during 1973-2002. Specifically, industry- specific shocks do not seem able to account for two other volatility shifts which we identify – the",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 45,
    "chunk_index": 31,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "1 7 volatility upturns of 1982-83 and 1985. Both occasions, however, were marked by substantial volatility in a well-known determinant of stock returns such as the short-term (risk-free) interest rate (see Eichengreen and Tong (2004) and the various references therein). Reflecting monetary policy shocks in the US and also in countries like the UK – to which global real interest rates responded by rising to unprecedented levels (see Bernanke and Blinder, 1992 for a discussion on the “exogeneity” of such shocks), volatility in the 3-month US Treasury bill market rose sharply during those episodes.15 This is illustrated in Figure 6, which plots the intra-month volatility in the Treasury bond yields (calculated from daily data), together with the volatility of returns on the stock market indices of the thirteen countries comprising our sample. The correlation between the two indices is reasonably tight at such high frequencies, yielding a correlation coefficient of 0.42 between end-1981 and end-1985. The fact that such monetary policy shocks were dramatic and not-so-gradual is consistent the behavior of the smoothed state transition probability which clearly display changes in volatility states around those episodes that were discrete and non-gradual. 6. Implications for Global Portfolio Allocation Our decompositions of market variance are based on the average country and industry-specific variances. As such, they are statistical measures that do not represent the payoffs from a portfolio investment strategy since they ignore covariances between the returns on the underlying country, industry, and global equity portfolios. The advantage of such measures is that they provide a clear idea of the relative size of the variances of returns on the three components (global, industry and country). International investors, however, will be interested in economic measures of volatility and risk that represent feasible investment strategies and hence account for covariances between returns on the different portfolios involved. Further, changes in these covariances have important implications. For instance, when such covariances increase, domestic risk becomes less diversifiable which in turn tends to raise the equity premium and drive up the cost of capital. The large literature on the links between national stock markets finds that the covariance of (excess) returns between national stock indices displays considerable variation over time (King, Sentana, and Wadhwani, 1994; Lin, Engle, and Ito, 1994; Bekaert and Harvey, 1995; Longin and Solnik, 1995; Karolyi and Stultz, 1996; Hartmann et al., 2004). In this section, we use firm level data and the methodology laid out in the previous sections to characterize the behavior of country portfolio covariances. Like King, Sentana, and Wadhwani (1994) and others, we let such time variation in country covariances be driven by an unobserved latent variable but, unlike those authors, we characterize such variations in terms of relatively lengthy historical periods or “states” and allow for differences in industry composition across countries to play a role. Likewise, the same approach is used to characterize the covariance patterns of the various industry portfolios. Because the estimated covariances/correlations within volatility states are conditional upon the entire time series information up to that point, they are not subject to the type of biases affecting unconditional estimates which have been highlighted by Forbes and Rigobon (2001). Moreover, an important spin-off of the proposed approach that, to be best of our knowledge has not been explored in the literature, is the possibility that the country and industry portfolios may be in different states at a given point in time, thus raising interesting possibilities for risk diversification. To see this, recall that the joint models ((9)—(10)) assume separate state processes for the global return factor (which affects all stocks in every period) and for the country or industry returns. Each of these state variables can be in the high or low volatility state. The return on a geographically diversified portfolio invested in industry j will be α + β , while the return on an industrially t jt",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 45,
    "chunk_index": 32,
    "word_count": 644,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "stocks in every period) and for the country or industry returns. Each of these state variables can be in the high or low volatility state. The return on a geographically diversified portfolio invested in industry j will be α + β , while the return on an industrially t jt",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 45,
    "chunk_index": 33,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "1 8 diversified country portfolio is α + γ . For such portfolios there are thus four possible state t kt combinations. For the industry portfolios the four states are: high industry volatility, high global volatility (s = 1; s = 1) βt αt high industry volatility, low global volatility (s = 1; s = 2) βt αt low industry volatility, high global volatility (s = 2; s = 1) βt αt low industry volatility, low global volatility (s = 2; s = 2) βt αt The correlation between geographically diversified industry portfolios is likely to vary strongly according to the underlying combination of global and industry state variables. By construction, the global component is common to all stocks. Thus, when the global return variable is in the high volatility state, it will contribute relatively more to variations in the returns of such portfolios and correlations will increase. In contrast, when the global return component is in the low volatility state, correlations between country or industry portfolios will tend to be lower. Similarly, when the industry component is in the low volatility state, the relative significance of the common global return component is larger so that correlations between industry portfolios will be stronger compared to when the industry return process is in the high volatility state. Given the very large differences between volatilities in the high and low volatility states observed for the global and industry portfolios, these effects are likely to give rise to large differences between correlations of geographically diversified industry portfolios in the four possible states. A complication arises when computing these correlations as they depend on the correlation between the global and industry or country portfolio returns. Terms such as Cov(α,γ |s ,s ) can t kt t γt be consistently estimated as follows: ∑T π π (α−αˆ )(β −β ˆ ) Cov(α,β |s ,s )= t=1 s αt sβt t s αt jt js βt , t jt αt βt ∑T π π t=1 s αt s βt ∑T π π (α−αˆ )(γ −γˆ ) Cov(α,γ |s ,s )= t=1 s αt sγk t s αt kt ks γt , (14) t kt αt γt ∑T π π t=1 s αt sγt ∑T π π (β −β ˆ )(γ −γˆ ) Cov(β,γ |s ,s )= t=1 s βt s γt jt js βt kt ks γt . t t βt γt ∑T π π t=1 s βt sγt To investigate just how different these correlations and volatilities are, Table 7 presents the estimated covariances and correlations in the two possible states for the industrially diversified country portfolios, while Table 8 presents the estimated covariances and correlations for the geographically diversified industry portfolios. Variances are presented on the diagonals, covariances above the diagonal, and correlations are below. For the country portfolios, the key findings are as follows. First, correlations across countries vary substantially, even after allowing for cross-country differences in industry composition. In particular, correlations are generally higher among the Anglo-Saxon countries (notably between Canada, the United States, and the United Kingdom) and lowest between the United States and much of continental Europe and Japan. This result is consistent with the evidence of other studies using",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 45,
    "chunk_index": 34,
    "word_count": 530,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "for cross-country differences in industry composition. In particular, correlations are generally higher among the Anglo-Saxon countries (notably between Canada, the United States, and the United Kingdom) and lowest between the United States and much of continental Europe and Japan. This result is consistent with the evidence of other studies using",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 45,
    "chunk_index": 35,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "1 9 different methodologies and measures (see, e.g., IMF, 2000) and our estimates show that it broadly holds across states.16 Second, correlations change markedly across states. Since there is not much difference between the variance of country returns in the high and low volatility states, the main driver of the results will be whether the global portfolio is in the high or low volatility state. The average correlation between the country portfolios is 0.30 in the low global volatility state and 0.56 in the high global volatility state. Thus, as other studies using distinct econometric methodologies and data series have found (see e.g. Solnik and Roulet, 2000; Bekaert, Harvey, and Ng, 2005), the state process for the global return component clearly makes a big difference to the average correlations between the country portfolios – our estimates for 13 mature markets indicating that such correlations almost double in the high volatility state. Turning to the geographically diversified industry portfolios listed in Table 8, a richer menu of possible combinations emerges since the global high and low volatility states are now supplemented by the high and low industry volatility states. When the industry process is in the high volatility state while the global process is in the low volatility state, the average correlation across industry portfolios is only 0.19. This rises to 0.50 when the industry and global processes are both in the high volatility state or both are in the low volatility state. Finally, when the industry state process is in the low volatility state while the global process is in the high volatility state, the average correlation across the geographically diversified industry portfolios is 0.81. These results show that the average correlations between geographically diversified industry portfolios vary substantially according to the state process driving the common industry component and the global component, with the non-negligible differences in industry factor correlations within each state being especially magnified in the high industry volatility state. Finally we note how different the average volatility level is in the high and low volatility states. For the country portfolios the variation in volatility is, unsurprisingly, somewhat smaller. The mean volatility is 6.4 percent per month in the high global volatility state and 5.3 percent in the low volatility state. The mean volatility of the industry portfolios is 6.6 percent per month in the high industry-, high global volatility state as compared with an average volatility of these portfolios of 3.6 percent in the low industry-, low global volatility state. Important implications follow from these results. Generally, it will be more difficult to reduce equity risk through cross-border diversification when the global volatility process is in the high volatility state. On a macro level, this suggests that international capital flows should be expected to rise or accelerate during periods of low global stock market volatility and to web during high volatility states. Moreover, as the gains to cross-border diversification appear to be especially meager when global and industry factors both simultaneously lie in a high volatility state, this suggests that cross-border risk diversification should not be so beneficial during those sub-periods. Provided that a country has a sufficiently diversified domestic industrial structure that allows residents to diversify risk along broad industry lines without having to go abroad, international equity flows will tend to be dampened as a result. This raises the question of whether these patterns are actually observed in the data. A systematic testing of this relationship is no mean task – not only because international capital flows are driven by a number of effects at play (see, e.g. Tesar and Werner, 1994), but also because of considerable data problems even if we were to limit the analysis to US data. Yet, it clearly warrants attention by future research. 7. Conclusion This paper has developed a regime switching modeling framework and applied it to 30-year long firm-level data to address three main questions – whether global stock return volatility displays well-",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 45,
    "chunk_index": 36,
    "word_count": 656,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "if we were to limit the analysis to US data. Yet, it clearly warrants attention by future research. 7. Conclusion This paper has developed a regime switching modeling framework and applied it to 30-year long firm-level data to address three main questions – whether global stock return volatility displays well-",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 45,
    "chunk_index": 37,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "2 0 defined volatility regimes, the extent to which equity market volatility is accounted for by global, country- or sector-specific factors, and what implication this has for national equity market correlations and international risk diversification. Our results reveal strong evidence of regimes in international stock returns characterized by different levels of volatility, with the low volatility regime being two to three times more persistent once we average over the various individual country and industry portfolios. The robustness of these results is not only butressed by a variety of statistical tests on the model’s residuals but also by an identification of volatility regimes which is broadly consistent with estimates from alternative non- parametric measures, as well as with what we know about the timing of major shocks deemed to affect stock market volatility. At the very least, this suggests that the single-state assumption underlying the linear models used in previous studies can be improved upon. As discussed above and further stressed below, the inadequacy of the single-state assumption is not only a technical econometric issue: it also leads one to gloss over important shifts in portfolio diversification possibilities as the various factors switch between high and low volatility regimes over time. To the extent that such states are persistent enough to allow the respective probabilities to be estimated with reasonable precision, market participants should thus be able to reap significant benefits from monitoring the underlying state probabilities as well as cross-country and -industry portfolio correlations within them. Since allowing for time- varying factor contributions appears to characterize the data better than linear models with similar factor structure, this should also deliver more accurate estimates of the various factor contributions. Over the entire period 1973-2002 period, the country factor contribution averaged some 50 percent as opposed to 16 percent for the industry factor. Yet, these contributions have witnessed important variations across volatility states, with the country factor contribution dropping sharply at times, to as low as under 35 percent as around 1973-74, 1986-87 and 2000-01. Further, since each factor in the model is allowed to be in one of two states at any point in time, we also show that economically interesting state combinations arise as each combination gives rise to a stronger or weaker pattern of correlations between the various portfolios. In general, the correlations among the various country and industry portfolios are stronger in the high global volatility state than in the low global volatility state; in the case of industrially diversified country-specific portfolios, those correlations nearly double on average. Hence the diversification benefits of investing abroad tend to be considerably smaller when global volatility is high. Further, and also after accounting for different industrial make-ups across countries and differences in volatility regimes, pair-wise correlations between the various country portfolios indicate that international diversification benefits are even smaller when confined to certain subsets of countries, such as the Anglo-Saxon nations or within continental Europe. These results speak directly to various strands of the literature. First, our findings suggest that the apparently greater potential for industry diversification arising from the greater contribution of industry factors to stock return volatility between 1997 and 2002 is likely to be, at least in part, temporary: global stock market volatility typically goes through ups and downs and the contribution of country-factors typically declines (rises) during high (low) global volatility states; so, the incentive for global equity diversification along industry lines (as opposed to country lines) should shift accordingly – rather than being a permanent phenomenon. A similar inference follows from the evidence presented in Brooks and del Negro (2004) and Bekaert et al (2005) using different econometric approaches and distinct levels of industry disagregation in their discussion of the IT bubble of the late 1990s.",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 45,
    "chunk_index": 38,
    "word_count": 620,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "should shift accordingly – rather than being a permanent phenomenon. A similar inference follows from the evidence presented in Brooks and del Negro (2004) and Bekaert et al (2005) using different econometric approaches and distinct levels of industry disagregation in their discussion of the IT bubble of the late 1990s.",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 45,
    "chunk_index": 39,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "2 1 Second, related inferences can be drawn about the role of “globalization” in driving down the contribution of country factors in stock returns. While a number of studies have pointed to a decline in home bias and noted that firm operations (particularly among advanced countries) have grown more international (cf. Diermeier and Solnik, (2001)), our finding that the contribution of country factors have fluctuated throughout the period cautions against seeing the 1997-2002 decline as permanent due to “globalization” forces. This is not to exclude that this shift may have a sizeable permanent component especially for certain country sub-groups – notably in Europe (cf. Baele and Inghelbrecht, 2005). What our look at the historical evidence on regime shifts simply suggests is that the estimated longer stay in a low country volatility state plus the attendant decline in the contribution from the country factor from the mid-1990s may be picking up temporary as well as permanent factors. More definitely, our estimates also suggest that, in any event, greater globalization has not yet resulted in the industry factor becoming more important than the country factor. More time series data, together with richer structural models that pin down the various sources of market integration, are clearly needed before firmer inferences can be made about how permanent such shifts turn out to be. Third, our estimates of “pure” country portfolio correlations across national stock markets are consistent with the findings of an emerging literature on information frictions or institutional-based “gravity” views of international equity flows (Portes and Rey, 2005). Because our estimates are conditional upon the distinct volatility states and use all the time series information up to that point, they are robust to the bias affecting unconditional correlations discussed in Forbes and Rigobon (2001), which plagues unconditional correlations reported in much of the literature. As in such gravity-type models, these conditional correlation estimates clearly show that market correlations tend to be systematically higher – both during high and low volatility states – among Anglo-Saxon countries and across much of continental Europe. An open question for future research is to which extent higher “pure” country correlations among European countries have intensified over time and on a permanent basis since the introduction of the euro in 1999 and of other regional harmonization policies – rather than resulting from the rise in the global factor-driven volatility since 1997. Finally, interesting implications for the pattern of cross-border capital flows also follow. For one thing, evidence that over the long run average stock return volatility has been mainly determined by country-specific factors suggests that equity risk can be greatly reduced by diversifying portfolios across national borders. This provides an important rationale for the observed dramatic growth in gross cross-border equity holdings which, in turn, has important implications for international macroeconomic adjustment (Lane and Milesi-Ferretti, 2001). Conversely, however, during high global and high industry volatility regimes (such as those historically associated with large sector- specific shocks such as oil), the risk diversification incentive to cross-border flows is therefore weakened and perceived home bias is strengthened. Even granting that risk diversification is simply one among other potential drivers of cross-border flows, one’s allowance for the existence of such regime shifts may shed new light on the question of what drives the massive swings in the growth of cross-border equity holdings observed in the data. While further research considering a host of other factors and based on better equity flow data is clearly needed before any robust inference is drawn, this hypothesis emerges as an interesting spin-off of this paper’s results.",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 45,
    "chunk_index": 40,
    "word_count": 590,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "the massive swings in the growth of cross-border equity holdings observed in the data. While further research considering a host of other factors and based on better equity flow data is clearly needed before any robust inference is drawn, this hypothesis emerges as an interesting spin-off of this paper’s results.",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 45,
    "chunk_index": 41,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "2 2 References Ammer, John and Jon Wongswan, 2004, “Cash Flows and Discount Rates, Industry and Country Effects, and Co-Movement in Stock Returns,” Board of Governors of the Federal Reserve System, International Finance Discussion Papers 818. Ang, Andrew and Geert Bekaert, 2002, “International Asset Allocation with Regime Shifts,” Review of Financial Studies, 15, 1137-87. Baele, Lieven and Koen Inghelbrecht, 2005, “Time-Varying Integration and International Diversification Strategies”, Tilburg University, unpublished manuscript. Bekaert, Geert and Campbell Harvey, 1995, “Time-Varying World Market Integration,” Journal of Finance 50, 403-44. ________, Campbel Harvey, and Angela Ng, 2005, “Market Integration and Contagion,” Journal of Business 78, 39-70. ________, Robert Hodrick, and Xiaoyan Zhang, 2005, “International Stock Return Comovements,” NBER working paper 11906 Beckers, Stan, R. Grinold, A. Rudd, and D. Stefek, 1992, “The Relative Importance of Common Factors Across the European Equity Markets,” Journal of Banking and Finance, Vol. 16, pp. 75–95. Bernanke, Ben and Alan Blinder, 1992, “The Federal Funds Rate and the Channels of Monetary Transmission”, American Economic Review, 82(4), pp. 901-921. Brooks, Robin and Luis Catão, 2000, “The New Economy and Global Stock Returns”, IMF working paper 00/216, Washington: International Monetary Fund. ______ and Marco del Negro, 2002,”International Diversification Strategies”, Working paper 2002- 23, Federal Reserve Bank of Atlanta. Campbell, John, Andrew W. Lo and A. Craig Mackinlay, 1997, The Econometrics of Financial Markets, Princeton. Cavaglia, Stefano, C. Brightman and M. Aked, 2000, “The Increasing Importance of Industry Factors”, Financial Analysts Journal, pp.41-54. Davies, R., 1977, “Hypothesis Testing When a Nuisance Parameter is Present Only Under the Alternative,” Biometrica, Vol. 64, p. 247–254. Diemeier, J. and Bruno Solnik, 2001, “Global Pricing of Equity”, Financial Analysts Journal 57, pp. 37-47. Driffill, John and Martin Sola, 1994, “Testing the Term Structure of Interest Rates from a Stationary Switching Regime VAR,” Journal of Economic Dynamics and Control Vol. 18, pp. 601–628.",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 45,
    "chunk_index": 42,
    "word_count": 305,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "Biometrica, Vol. 64, p. 247–254. Diemeier, J. and Bruno Solnik, 2001, “Global Pricing of Equity”, Financial Analysts Journal 57, pp. 37-47. Driffill, John and Martin Sola, 1994, “Testing the Term Structure of Interest Rates from a Stationary Switching Regime VAR,” Journal of Economic Dynamics and Control Vol. 18, pp. 601–628.",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 45,
    "chunk_index": 43,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "2 3 Eichengreen, Barry and Hui Tong, 2004, “Stock Market Volatility and Monetary Policy: What the Historical Record Shows,” Paper presented at the Central Bank of Australia. Engel, Charles and James D. Hamilton, 1990, “Long Swings in the Dollar: Are they in the Data and do the Markets Know it?”, American Economic Review 80, 689-713. Frisch, Ragnar, 1933, “Propagation and Impulse Problems in Dynamic Economics,” Essays in Honor of Gustav Cassel, London. Forbes, Kristin and Roberto Rigobon, 2001, “No Contagion, Only Interdependence: Measuring Stock Market Co-Movements,” Journal of Finance 57, Number 5, pp 2223-2261. _________ and Menzie Chinn, 2004, “A Decomposition of Global Linkages in Financial Markets Over Time”, Review of Economics and Statistics, 86(3), pp.705-722. Griffin, John and G. Andrew Karolyi, 1998, “Another Look at The Role of Industrial Structure of Markets for International Diversification Strategies,” Journal of Financial Economics 50, pp. 351–373. Griffin, John and Rene Stultz, 2001, “International Competition and Exchange Rate Shocks: A Cross- country Industry Analysis,” Review of Financial Studies 14, pp.215-241. Guo, Hui and Kevin Kliesen, 2005, “Oil Price Volatility and U.S. Macroeconomic Activity”, Federal Reserve Bank of St. Louis Review, Nov/Dec., pp. 669-683. Hamilton, James, 1988, “Rational Expectations Econometric Analysis of Changes in Regime: An Investigation of the Term Structure of Interest Rates,” Journal of Economic Dynamics and Control, Vol. 12, pp. 365–423. ———, 1989, “A New Approach to the Economic Analysis of Nonstationary Time Series and the Business Cycle,” Econometrica 57, 357–384. ———, 1994, Time Series Analysis, Princeton. Hartmann, P., Straetmans, S., and de Vries, C. G., 2004, “Asset market linkages in crisis periods”, Review of Economics and Statistics, 86(1), pp.313-326. Heston, Steven L. and K. Geert Rouwenhorst, 1994, “Does Industrial Structure Explain the Benefits of International Diversification,” Journal of Financial Economics 36, 3–27. International Monetary Fund, 2000, “World Economic Outlook – Asset Prices and the Business Cycle,” Washington D.C.: International Monetary Fund. Karolyi, Andrew and René Stultz, 1996, “Why do Markets Move Together? An Investigation of U.S.- Japan Stock Return Comovements”, Journal of Finance 51, 951–86. Kilian, Lutz and Chealbeam Park, “The Impact of Oil Prices on the US Stock Market,” CEPR discussion paper 6166.",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 45,
    "chunk_index": 44,
    "word_count": 354,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "Business Cycle,” Washington D.C.: International Monetary Fund. Karolyi, Andrew and René Stultz, 1996, “Why do Markets Move Together? An Investigation of U.S.- Japan Stock Return Comovements”, Journal of Finance 51, 951–86. Kilian, Lutz and Chealbeam Park, “The Impact of Oil Prices on the US Stock Market,” CEPR discussion paper 6166.",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 45,
    "chunk_index": 45,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "2 4 Kim, Chang-Jin and Charles R.Nelson, 1999, State-Space Models with Regime Switching. Classical and Gibb-Sampling Approaches with Applications, Cambridge, Mass. King, Mervin, Enrique Sentana, and Sushil Wadhwani, 1994, “Volatility and Links Between National Stock Markets,” Econometrica 62, 901–33. Lane, Philip R. and Gian Maria Milesi-Ferretti, 2001, The external wealth of nations: measures of foreign assets and liabilities for industrial and developing countries,” Journal of International Economics 55, 263-294 L’Her, J.F., O. Sy, and Y.Tnani, 2002, “Country, Industry, and Risk Factor Loadings in Portfolio Management, Journal of Portfolio Management,28, 70-79. Lin, Weng-Ling, Robert F. Engle, and Ito Takatoshi, 1994, “Do Bull and Bears Move Across Broders? Transmission of International Stock Returns and Volatility,” Review of Financial Studies 7, 507–538. Longin, François and Bruno Solnik, 1995, “Is the Correlation in International Equity Returns Constant: 1970-1990,” Journal of International Money and Finance 14, 3-26. Oliner, Stephen and Daniel Sichel''The Resurgence of Growth in the late 1990s: Is Information Technology the Story?'', Journal of Economic Perspectives, vol. 14 (Fall 2000), pp. 3-22. Pagan, Adrian and G.William Schwert, 1990, “Alternative Models for Conditional Stock Volatility,” Journal of Econometrics 92, 307–28. Perez-Quiros, Gabriel and Allan Timmermann, 2000, “Firm Size and Cyclical Variations in Stock Returns,” Journal of Finance 55, 1229–62. Portes, Richard and Helène Rey, 2005, “The Determinants of Cross-Border Equity Flows,” Journal of International Economics 65, 269-96. Rigobon, Roberto and Brian Sack, 2003, “Measuring the Reaction of Monetary Policy to the Stock Market”, Quarterly Journal of Economics, pp.639-669. Schwert, William, G., 1989, “Why Does Stock Market Volatility Change Over Time?”, Journal of Finance 44, pp. 1115–1153. Solnik, Bruno, and Jacques Roulet, 2000, “Dispersion as Cross-Sectional Correlation,” Financial Analysts Journal 56, 54–61. Stock, James and Mark Watson, 1998, “Diffusion Indexes,” NBER working paper 6702, Cambridge, Mass.: National Bureau of Economic Research. Tesar, Linda and Werner, I, 1994, “International Equity Transactions and U.S. Portfolio Choice,” in Frankel, J. (ed.), The Internationalization of Equity Markets, Chicago. Timmermann, Allan, 2000, “Moments of Markov Switching Models,” Journal of Econometrics 96, 75–111.",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 45,
    "chunk_index": 46,
    "word_count": 332,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "1998, “Diffusion Indexes,” NBER working paper 6702, Cambridge, Mass.: National Bureau of Economic Research. Tesar, Linda and Werner, I, 1994, “International Equity Transactions and U.S. Portfolio Choice,” in Frankel, J. (ed.), The Internationalization of Equity Markets, Chicago. Timmermann, Allan, 2000, “Moments of Markov Switching Models,” Journal of Econometrics 96, 75–111.",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 45,
    "chunk_index": 47,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "2 5 Notes to Main Text: 1 The two studies using the longest time series that we are aware of are Brooks and del Negro (2002) and Bekaert, Hodrick, and Zhang (2005). The sample coverage is 1985:1 to 2002:2 in the former, and 1980:1 to 2003:12 in the latter. Thus, none of these studies incorporates in their estimates the effects of the large shifts in stock market volatility and relative factor contribution following the oil shocks and monetary disturbances of the 1970s, which we document. We return to this issue below. 2 Besides its popularity, there are three particular reasons why we retain this three-factor specification. First, we are interested in country and industry effects in their own right and we know that a model with both country and industry factors systematically dominates one with country- or with industry factors alone (see Bekaert, Hoddrick, and Zhang, 2005 for a comparison of models with distinct factors). Second, adding a “small cap” factor or a similar proxy related to firm size has been shown to have negligible effects on country-industry decompositions for a similar sample of international firms (Catão and Brooks, 2000). Third, while regional factors are deemed to be important – in particular for Europe (cf. Baele and Inghelbrecht, 2005) – augmenting the model with various regional dummies would be infeasible due to degrees of freedom limitations arising from the richly parameterized nature of our regime switching specification in the second stage estimation. As time goes by and longer time series data become available, however, augmenting the model with regional factors could become a feasible extension to this model. 3 This is clear from the evidence presented in Brooks and del Negro (2002) who, after allowing for distinct firm-specific loadings, obtain very similar inferences about the relative factor contributions as those yielded when the homogeneity of factor loadings is imposed. As elsewhere in this literature, their results are based on the assumption of a single volatility state. Another important trade-off of allowing for firm-specific factor loadings (which are estimated by a maximum likelihood algorithm as in their study), is that of having to balance the panel since the algorithm cannot handle missing observations. As discussed above, by eliminating new firm entry and exit from the sample, this panel- balancing proceedure is an additional source of potential estimation biases. More recently, Bekaert, Hodrick and Zhang (2005) compared the performance of several models, including the Heston and Rouwenhorst (1994) model with fixed cross-sectional and time-series loads over shorter sub-periods. While Bekaert, Hodrick and Zhang (2005) find that an APT model incorporating both global and local factors fits the covariance structure of stock returns best, their results are restricted to the linear (one-state) version of the model. No less importantly, their study also finds that differences in the measurement of country vs. industry contributions between other (one-state) models and the Heston and Rouwenhorst one are mainly due to the time dimension of the sample, rather than to the assumption of unit beta loadings across firms. 4 Monthly total returns are computed in local currency using data from Datastream/Primark. The return calculation assumes immediate reinvestment of dividends. These local currency returns are converted to U.S. dollars using end-of-month spot exchange rates. The beginning-of-month stock market capitalizations are converted into U.S. dollars using the beginning-of-month dollar price of one unit of local currency. Expressing all returns and market cap data in US dollars implicitly reflects the perspective of a currency unhedged equity investor whose objective is to maximize U.S. dollar returns. To the extent that changes in equity returns overwhelm those associated with currency fluctuations, expressing returns and market caps in the distinct national currencies should not change the thrust of the results, as earlier work using a subset of this data has found (Brooks and Catão, 2000). This is consistent with what other researchers have also found using other datasets (Heston and Rouwenhorst, 1994; Griffin and Karolyi, 1998; Griffin and Stultz, 2001). One possible reason lies in",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 45,
    "chunk_index": 48,
    "word_count": 662,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "the thrust of the results, as earlier work using a subset of this data has found (Brooks and Catão, 2000). This is consistent with what other researchers have also found using other datasets (Heston and Rouwenhorst, 1994; Griffin and Karolyi, 1998; Griffin and Stultz, 2001). One possible reason lies in",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 45,
    "chunk_index": 49,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "2 6 exchange rate hedging used by many large firms in developed countries with extensive international operations, which comprise a sizeable portion of those datasets. Developing country firms were excluded from the sample altogether because none of those reported in the Datastream/Primark dataset had sufficiently long series, entailing a too short time span for the respective country portfolio to be included the estimation of the Markov-switching regressions. 5 While Griffin and Karolyi (1998) note that a finer industry disaggregation may yield a more accurate measure of industry effects, their main result – the far greater dominance of country-specific effects—hardly changes with the move to a finer industry breakdown. An alternative breakdown which groups IT with media and telecoms under a broader TMT group has been considered in Brooks and Catão (2000) and Brooks and del Negro (2004) which show that the dynamics of the broader TMT group is largely dominated by the IT sector from 1990s. In the FTSE industry classification used in this paper, media is grouped under cyclical services and telecomunications under non-cyclical services. 6 For a sub-sample including dead firms, Brooks and del Negro (2002) obtain the following figures for the capitalization-weighted time-series variance of country effects (also gauged by the same parameter γ in the Heston-Rouwenhorst decomposition scheme): 18.47 over 1986:3 to 1990:2; kt 21.08 over 1990:3 to 1994:2; and 9.12 between 1994:3 and 1998:2. Using the same 4-year fixed windows and a similar group of mature markets but without including dead stocks, our respective estimates are 19.21, 22.10, and 8.80. So, the differences are small and have no discernable effect on trends. 7 The only reason the averages are not exactly equal to zero is that we are reporting arithmetic averages whereas the world portfolio is based on capitalization-weighted returns. 8 Section 3.C below reports the results of the normality tests for our fitted model, which show that residuals become broadly normal once conditioned on the regime moments, thus providing strong support for the proposed regime switching approach. 9 The finding of a single state for Canada and Switzerland is consistent with the Davies’ tests in Table 2 which could not reject linearity for these two countries. 10 Since the joint country model has 210 parameters while the joint industry model has 156 parameters (most of which measure the covariance between industry returns in the two states), we do not report all the estimates and instead concentrate on the standard deviations. 11 The squared terms in the variance expression enter due to the binomial nature of the state variable, c.f. Timmermann (2000). 12 Overall, our estimates plotted in Figure 3 suggest that systematic volatility is about trendless: if a trend is fitted into this measure of market variance (which excludes firm-level idiosyncratic variance as in equation (9)), it is very mildly positive and its statistical significance is quite sensitive to end point. A similar inference obtains when applying the non-parametric measure of intra-monthly volatility discussed in Section 3.C and plotted in Figure 2: the respective slope of regressing this volatility measure on a linear trend is positive (0.0001) but not statistically significant at 5%. This is consistent with Schwert’s (1989) finding for the US that market volatility does not display a significant long-term trend. Using, however, aggregate stock price data spanning over a century for",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 45,
    "chunk_index": 50,
    "word_count": 550,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "slope of regressing this volatility measure on a linear trend is positive (0.0001) but not statistically significant at 5%. This is consistent with Schwert’s (1989) finding for the US that market volatility does not display a significant long-term trend. Using, however, aggregate stock price data spanning over a century for",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 45,
    "chunk_index": 51,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "2 7 various advanced countries, Eichengreen and Tong (2004) suggest that stock market volatility displays a U-shape in most countries. It remains to be established whether this result stems from their use of much longer data series, the effects of idiosyncratic variance (which they do not filter out), or due to their methodology based on rolling standard deviations of stock price changes and univariate Garch(1,1) regressions. 13 Griffin and Karolyi (1998) present two sets of estimates, one using a nine-sector breakdown and the other using a 66 industry breakdown. They find that the mean industry factor contribution to total return variance are 2 and 4 percent respectively, a lot lower therefore than the above estimates. One possible reason for the lower estimate of Griffin and Karolyi (1998) relative to Heston and Rouwenhorst (1994) as well as ours is the inclusion of emerging markets in their sample. As country- specific shocks have been shown to play a greater role in the determination of stock returns in emerging markets, this is to be expected. However, we show below that much of the difference appears to be model and time dependent. Furthermore, Griffin and Karolyi consider a much shorter sample of weekly returns so differences in estimates are not all that surprising. 14 It is straightforward to show that this decomposition follows from re-writing equation (2) for each individual country portfolio, where the individual firm’s weight is the share of that firm in total market capitalization of the respective country portfolio. 15 Other high global volatility spells which overlap with changes in monetary policy stances and higher money market volatility are observed following the 1998 Russias crisis, the March 2000 stock market crash, and between late 2001 and early 2002, in the wake of September 11th terrorist attacks. As shown in Figure 6, however, none of these money market volatility bouts were of similar magnitude as those of the late 1970s and early 1980s. In this more recent period, there is also some evidence that monetary policy has become more reactive to the stock market (cf. IMF, 2000; Rigobon and Sack, 2003) and therefore a less independent driver of stock market volatility. This plausibly reflects the much greater weight of the stock market in aggregate wealth from the 1990s (relative to the 1970s and early 1980s), calling for greater attention of policy makers to stock market developments and their impact on aggregate spending and hence on price stability. 16 Among continental European countries, a main exception is the Netherlands whose country factor volatility is highly correlated with those of the US and the UK.",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 45,
    "chunk_index": 52,
    "word_count": 431,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "early 1980s), calling for greater attention of policy makers to stock market developments and their impact on aggregate spending and hence on price stability. 16 Among continental European countries, a main exception is the Netherlands whose country factor volatility is highly correlated with those of the US and the UK. 2 8 Figure 1. Smoothed State Probabilities for Common Components (High Volatility State) Global 1. 00 0. 80 0.60 0.40 0.20 0.00 1973 1974 1976 1977 1978 1979 1981 1982 1983 1984 1986 1987 1988 1989 1991 1992 1993 1994 1996 1997 1998 1999 2001 2002 Common Country 1.00 0.80 0.60 0.40 0.20 0.00 1973 1974 1976 1977 1978 1979 1981 1982 1983 1984 1986 1987 1988 1989 1991 1992 1993 1994 1996 1997 1998 1999 2001 2002 Common Industry 1.00 0.80 0.60 0.40 0.20 0.00 1973 1974 1976 1977 1978 1979 1981 1982 1983 1984 1986 1987 1988 1989 1991 1992 1993 1994 1996 1997 1998 1999 2001 2002 29 setamitsE SM dna snruteR kcotS fo ecnairaV ylhtnom-artnI lautcA .2 erugiF 0.6 0.5 0.4 0.3 0.2 0.1 0.0 2 0 -raM 1 0 -raM 0 0 -raM 9 9 -raM 8 9 -raM 7 9 -raM 6 9 -raM 5 9 -raM 4 9 -raM 3 9 -raM 2 9 -raM 1 9 -raM 0 9 -raM 9 8 -raM 8 8 -raM 7 8 -raM 6 8 -raM 5 8 -raM 4 8 -raM 3 8 -raM 2 8 -raM 1 8 -raM 0 8 -raM 9 7 -raM 8 7 -raM 7 7 -raM 6 7 -raM 5 7 -raM 1 ecnairav ylhtnom-artnI ecnairaV labolG SM 9.0 )sixa thgir( ytilibaborp dehtoomS SM 8.0 7.0 6.0 5.0 4.0 3.0 2.0 1.0 0",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 28,
    "page_range": "p.28-29",
    "total_pages": 45,
    "chunk_index": 53,
    "word_count": 284,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.28-29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "8 -raM 3 8 -raM 2 8 -raM 1 8 -raM 0 8 -raM 9 7 -raM 8 7 -raM 7 7 -raM 6 7 -raM 5 7 -raM 1 ecnairav ylhtnom-artnI ecnairaV labolG SM 9.0 )sixa thgir( ytilibaborp dehtoomS SM 8.0 7.0 6.0 5.0 4.0 3.0 2.0 1.0 0 30 ytilitaloV tekraM .3 erugiF ytilitaloV citametsyS 03.5 08.4 03.4 08.3 03.3 08.2 1002 0002 9991 8991 7991 5991 4991 3991 2991 1991 0991 8891 7891 6891 5891 4891 3891 1891 0891 9791 8791 7791 6791 4791 3791 3 1 Figure 4. Decomposition of Systematic Variance into Country, Industry and Global Factors 0.65 Variance due to country factor 0.60 0.55 0.50 0.45 0.40 0.35 0.30 197319741975197619781979198019811983198419851986198819891990199119931994199519961998199920002002 0.45 Variance due to industry factor 0.40 0.35 0.30 0.25 0.20 0.15 0.10 0.05 0.00 1973 1974 1976 1977 1979 1981 1982 1984 1985 1987 1988 1990 1992 1993 1995 1996 1998 2000 2002 0.50 Variance due to global factor 0.45 0.40 0.35 0.30 0.25 0.20 0.15 197319741975197619781979198019811983198419851986198819891990199119931994199519961998199920002002 32 Figure 5. Comparison of Variance Decomposition Results between the Proposed Model and the 36-Month Rolling Window Approach 0.65 Variance due to country factor 0.60 0.55 0.50 0.45 0.40 0.35 0.30 0.25 0.20 0.15 197319741975197619781979198019811983198419851986198819891990199119931994199519961998199920002002 0.45 Variance due to industry factor 0.40 0.35 0.30 0.25 0.20 0.15 0.10 0.05 0.00 197319741975197619781979198019811983198419851986198819891990199119931994199519961998199920002002 0.60 Variance due to global factor 0.55 0.50 0.45 0.40 0.35 0.30 0.25 0.20 0.15 197319741975197619781979198019811983198419851986198819891990199119931994199519961998199920002002 33 dleiy lliB yrusaerT htnom-3 eht fo dna snruteR kcotS fo ecnairaV ylhtnoM-artnI .6 erugiF 0.1 01 9.0 9 snruteR kcotS 8.0 )sixa thgir( lliBT htnom-3 8 7.0 7 6.0 6 5.0 5 4.0 4 3.0 3 2.0 2 1.0 1 0.0 0 21M1002 1M0002 2M8991 3M6991 4M4991 5M2991 6M0991 7M8891 8M6891 9M4891 01M289111M089121M8791 1M7791 2M5791",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 30,
    "page_range": "p.30-33",
    "total_pages": 45,
    "chunk_index": 54,
    "word_count": 287,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.30-33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "fo dna snruteR kcotS fo ecnairaV ylhtnoM-artnI .6 erugiF 0.1 01 9.0 9 snruteR kcotS 8.0 )sixa thgir( lliBT htnom-3 8 7.0 7 6.0 6 5.0 5 4.0 4 3.0 3 2.0 2 1.0 1 0.0 0 21M1002 1M0002 2M8991 3M6991 4M4991 5M2991 6M0991 7M8891 8M6891 9M4891 01M289111M089121M8791 1M7791 2M5791 3 4 Figure 7.A. Smoothed State Probabilities for Individual Industries (High Volatility State) 1.00 Resources 0.80 0.60 0.40 0.20 0.00 197319751976197719791980198219831985198619871989199019921993199419961997199920002002 1.00 Basic 0.80 0.60 0.40 0.20 0.00 197319751976197719791980198219831985198619871989199019921993199419961997199920002002 1.00 General Industry 0.80 0.60 0.40 0.20 0.00 197319751976197719791980198219831985198619871989199019921993199419961997199920002002 1.00 Cyclical Consumer Durables 0.80 0.60 0.40 0.20 0.00 197319751976197719791980198219831985198619871989199019921993199419961997199920002002 1.00 Non-Cyclical Consumer Durables 0.80 0.60 0.40 0.20 0.00 197319751976197719791980198219831985198619871989199019921993199419961997199920002002 35 Figure 7.B. Smoothed State Probabilities for Individual Industries (High Volatility State) 1.00 Utilities 0.80 0.60 0.40 0.20 0.00 197319751976197719791980198219831985198619871989199019921993199419961997199920002002 1.00 Information Technology 0.80 0.60 0.40 0.20 0.00 197319751976197719791980198219831985198619871989199019921993199419961997199920002002 1.00 Financials 0.80 0.60 0.40 0.20 0.00 197319751976197719791980198219831985198619871989199019921993199419961997199920002002 1.00 Non-cyclical Services 0.80 0.60 0.40 0.20 0.00 197319751976197719791980198219831985198619871989199019921993199419961997199920002002 1.00 Cyclical Services 0.80 0.60 0.40 0.20 0.00 197319751976197719791980198219831985198619871989199019921993199419961997199920002002",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 34,
    "page_range": "p.34-36",
    "total_pages": 45,
    "chunk_index": 55,
    "word_count": 163,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.34-36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "Probabilities for Individual Industries (High Volatility State) 1.00 Utilities 0.80 0.60 0.40 0.20 0.00 197319751976197719791980198219831985198619871989199019921993199419961997199920002002 1.00 Information Technology 0.80 0.60 0.40 0.20 0.00 197319751976197719791980198219831985198619871989199019921993199419961997199920002002 1.00 Financials 0.80 0.60 0.40 0.20 0.00 197319751976197719791980198219831985198619871989199019921993199419961997199920002002 1.00 Non-cyclical Services 0.80 0.60 0.40 0.20 0.00 197319751976197719791980198219831985198619871989199019921993199419961997199920002002 1.00 Cyclical Services 0.80 0.60 0.40 0.20 0.00 197319751976197719791980198219831985198619871989199019921993199419961997199920002002 36 Table 1: Summary Statistics for the Country, Industry, and World Portfolio Returns mean s.d. skew kurtosis A. Country portfolios US -0.12 2.77 -0.42 2.48 UK 0.07 5.07 1.81 14.8 France 0.10 5.25 0.27 1.32 Germany -0.29 5.02 -0.09 0.81 Italy -0.12 7.28 0.38 1.71 Japan 0.11 4.63 0.02 0.58 Canada -0.29 3.85 -0.34 0.55 Australia -0.15 6.27 -0.25 1.67 Belgium -0.22 4.65 0.60 1.87 Denmark -0.10 5.32 0.33 1.33 Ireland 0.18 6.11 0.55 2.72 Netherlands -0.12 3.31 -0.04 1.02 Switzerland -0.28 4.04 -0.02 0.09 Average -0.09 4.89 0.22 2.38 B. Industry portfolios Resources -0.12 3.74 0.03 0.88 Basic -0.19 2.52 0.06 3.71 General industry -0.05 1.78 -0.40 1.24 Cyclical durables -0.09 3.24 -0.30 1.22 Non-cycl. durables -0.05 2.45 -0.51 4.27 Cyclical services -0.06 1.61 0.01 0.68 Non-cycl. Services -0.17 3.72 0.88 3.11 Utilities -0.28 4.07 0.93 6.46 Information technology 0.18 4.34 0.50 3.01 Financials 0.00 2.28 -0.16 4.78 Others -0.51 2.79 0.21 2.62 Average -0.12 2.96 0.11 2.91 C. World: 1.71 4.34 -0.04 0.79 Notes: This table reports descriptive statistics for the country, industry and global portfolios using the decomposition (2) subject to the constraints (3), (4). Returns are measured at the monthly frequency over the period February 1973 –February 2002 and are based on a data set covering up to 3,951 firms in developed stock markets.",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 45,
    "chunk_index": 56,
    "word_count": 268,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "reports descriptive statistics for the country, industry and global portfolios using the decomposition (2) subject to the constraints (3), (4). Returns are measured at the monthly frequency over the period February 1973 –February 2002 and are based on a data set covering up to 3,951 firms in developed stock markets. 3 7 setatS elpitluM rof stseT :2 elbaT soiloftroP yrtnuoC .A adanaC napaJ ylatI ynamreG ecnarF KU SU 253.0 500.0 000.0 400.0 000.0 000.0 000.0 eulav-p dnalreztiwS sdnalrehteN dnalerI kramneD muigleB ailartsuA 143.0 170.0 000.0 000.0 000.0 000.0 eulav-p soiloftroP yrtsudnI .B .vres .cyc-noN .vres .cyC .snoC .cyc-noN sdoog .snoc .cyC .dni lareneG cisaB secruoseR 000.0 172.0 000.0 000.0 000.0 000.0 600.0 eulav-p rehtO slaicnaniF ygolonhceT .fnI seitilitU 000.0 000.0 000.0 000.0 eulav-p rotcaF labolG .C 000.0 eulav-p ecnasiun deifitnedinu rof gnitnuocca ,etats elgnis a fo tset eht rof seulav-p )7791( 'seivaD stroper elbat sihT :setoN .etats eno naht erom fo ecneserp eht etacidni 50.0 woleb seulav-P .etats elgnis a fo sisehtopyh llun eht rednu sretemarap",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 37,
    "page_range": "p.37-38",
    "total_pages": 45,
    "chunk_index": 57,
    "word_count": 166,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.37-38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": ".fnI seitilitU 000.0 000.0 000.0 000.0 eulav-p rotcaF labolG .C 000.0 eulav-p ecnasiun deifitnedinu rof gnitnuocca ,etats elgnis a fo tset eht rof seulav-p )7791( 'seivaD stroper elbat sihT :setoN .etats eno naht erom fo ecneserp eht etacidni 50.0 woleb seulav-P .etats elgnis a fo sisehtopyh llun eht rednu sretemarap 38 soiloftroP labolG dna ,yrtsudnI ,yrtnuoC laudividnI rof airetirC noitceleS :3 elbaT Q-H CIB CIA 3 = k 2 = k 1 = k 3 = k 2 = k 1 = K 3 = k 2 = k 1 = k soiloftroP yrtnuoC .A 087.4 727.4 198.4 068.4 767.4 409.4 827.4 007.4 288.4 SU 377.5 928.5 101.6 258.5 968.5 511.6 027.5 308.5 390.6 KU 201.6 170.6 271.6 281.6 111.6 581.6 050.6 540.6 361.6 ecnarF 121.6 570.6 380.6 102.6 511.6 690.6 960.6 940.6 470.6 ynamreG 208.6 857.6 628.6 288.6 897.6 938.6 057.6 137.6 718.6 ylatI 749.5 219.5 919.5 720.6 259.5 239.5 498.5 688.5 019.5 napaJ 316.5 575.5 255.5 396.5 516.5 565.5 955.5 945.5 345.5 adanaC 805.6 164.6 625.6 785.6 105.6 045.6 554.6 534.6 815.6 ailartsuA 419.5 388.5 829.5 499.5 329.5 249.5 168.5 658.5 029.5 muigleB 402.6 061.6 791.6 482.6 991.6 112.6 151.6 331.6 981.6 kramneD 953.6 453.6 774.6 834.6 393.6 094.6 603.6 723.6 864.6 dnalerI 303.5 162.5 052.5 383.5 103.5 362.5 052.5 532.5 142.5 sdnalrehteN 317.5 276.5 946.5 397.5 217.5 366.5 066.5 646.5 046.5 dnalreztiwS soiloftroP yrtsudnI .B 904.5 884.5 394.5 884.5 825.5 705.5 653.5 264.5 584.5 secruoseR 345.5 145.4 607.4 326.4 185.4 917.4 094.4 415.4 796.4 cisaB 069.3 029.3 900.4 040.4 959.3 220.4 709.3 398.3 000.4 yrtsudni lareneG 361.5 541.5 902.5 242.5 581.5 222.5 011.5 021.5 002.5 sdoog remusnoc lacilcyC 214.4 763.4 746.4 294.4 704.4 066.4 953.4 043.4 836.4 sdoog remusnoc lacilcyc-noN 128.3 528.3 308.3 009.3 568.3 718.3 867.3 897.3 597.3 secivres lacilcyC 624.5 224.5 284.5 605.5 264.5 594.5 373.5 693.5 374.5 secivres lacilcyc-noN 615.5 474.5 266.5 595.5 415.5 576.5 364.5 844.5 356.5 seitilitU 315.5 015.5 297.5 395.5 055.5 508.5 064.5 484.5 387.5 ygolonhcet noitamrofnI 772.4 252.4 005.4 753.4 292.4 315.4 422.4 522.4 494.4 slaicnaniF 578.4 538.4 709.4 459.4 578.4 129.4 228.4 908.4 898.4 srehtO 208.5 867.5 097.5 188.5 808.5 308.5 947.5 147.5 187.5 labolG .C a ro ,)2 = k( etats-owt a ,)1 = k( etats-elgnis a rehtehw enimreted ot desu airetirc noitamrofni suoirav fo seulav eht swohs elbat sihT :setoN ,noiretirc noitamrofni ekiakA eht fo eulav eht sevig CIA .soiloftrop labolg dna yrtsudni ,yrtnuoc eht rof nesohc si ledom )3 = k( etats-eerht .derreferp eb dluohs )dlob ni( seulav tsewoL .noiretirc noitamrofni nniuQ-nannaH eht QH dna noiretirc noitamrofni naiseyaB s’zrawhcS eht CIB",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 45,
    "chunk_index": 58,
    "word_count": 425,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "suoirav fo seulav eht swohs elbat sihT :setoN ,noiretirc noitamrofni ekiakA eht fo eulav eht sevig CIA .soiloftrop labolg dna yrtsudni ,yrtnuoc eht rof nesohc si ledom )3 = k( etats-eerht .derreferp eb dluohs )dlob ni( seulav tsewoL .noiretirc noitamrofni nniuQ-nannaH eht QH dna noiretirc noitamrofni naiseyaB s’zrawhcS eht CIB 3 9 sledoM tnenopmoC nommoC eht rof stluseR noitamitsE :4 elbaT tset seivaD noitaruD .borP cidogrE .borP reyatS 2 etatS 1 etatS 2 etatS 1 etatS 2 etatS 1 etatS 0000.0 5.24 1.04 415.0 684.0 679.0 579.0 yrtnuoC 0000.0 4.62 7.7 477.0 622.0 269.0 078.0 yrtsudnI 4000.0 9.9 9.21 534.0 565.0 998.0 229.0 labolG ledom gnihctiws emiger eht fo sretemarap ytilibaborp noitisnart eht fo setamitse doohilekil mumixam stroper elbat sihT :setoN evig seitilibaborp noitisnart etats ehT .oiloftrop labolg eht ro seirtsudni ,seirtnuoc rof ledom etats nommoc eht ot dettif )01( ,)9( emit egareva eht edivorp seitilibaborp cidogre ro etats ydaetS .ylevitcepser ,2 etats dna 1 etats ni gniniamer fo seitilibaborp eht ehT .)shtnom ni( setats eht morf gnitixe tuohtiw tneps emit egareva eht era snoitarud etats eht elihw ,setats owt eht ni tneps .setats elpitlum fo evitanretla eht susrev etats elgnis a fo llun eht rof si tset seivaD",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 39,
    "page_range": "p.39-40",
    "total_pages": 45,
    "chunk_index": 59,
    "word_count": 199,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.39-40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "ydaetS .ylevitcepser ,2 etats dna 1 etats ni gniniamer fo seitilibaborp eht ehT .)shtnom ni( setats eht morf gnitixe tuohtiw tneps emit egareva eht era snoitarud etats eht elihw ,setats owt eht ni tneps .setats elpitlum fo evitanretla eht susrev etats elgnis a fo llun eht rof si tset seivaD 4 0 sledoM tnenopmoC nommoC eht rof setamitsE ytilitaloV :5 elbaT tnenopmoc labolG .C tnenopmoc yrtsudni nommoC .B tnenopmoc yrtnuoc nommoC .A 2 etatS 1 etatS 2 etatS 1 etatS 2 etatS 1 etatS 76.2 72.5 99.2 66.5 secruoseR 58.1 74.3 SU 59.1 69.3 cisaB 40.6 67.3 KU 74.1 06.2 yrtsudni lareneG 49.4 45.5 ecnarF 26.2 08.4 sdoog remusnoc lacilcyC 48.4 41.5 ynamreG 26.1 52.4 sdoog remusnoc lacilcyc-noN 99.6 65.7 ylatI 64.1 10.2 secivres lacilcyC 67.4 64.4 napaJ 89.2 56.5 secivres lacilcyc-noN 57.3 29.3 adanaC 79.2 96.6 seitilitU 31.6 93.6 ailartsuA 99.2 14.7 ygolonhcet noitamrofnI 83.4 09.4 muigleB 86.1 07.3 slaicnaniF 64.5 41.5 kramneD 97.2 67.2 srehtO 57.6 23.5 dnalerI 65.3 10.3 sdnalrehteN 98.3 61.4 dnalreztiwS 72.2 76.4 egarevA 59.4 88.4 egarevA dettif )01( ,)9( ledom gnihctiws emiger eht fo sretemarap ytilitalov eht fo setamitse doohilekil mumixam stroper elbat sihT :setoN eht ssorca nommoc elbairav-etats raenilnon a tcartxe suht sledom ehT .seirtsudni ro seirtnuoc rof ledom etats nommoc eht ot .soiloftrop yrtsudni eht ssorca ro yrtnuoc",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 40,
    "page_range": "p.40-41",
    "total_pages": 45,
    "chunk_index": 60,
    "word_count": 216,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.40-41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "72.2 76.4 egarevA 59.4 88.4 egarevA dettif )01( ,)9( ledom gnihctiws emiger eht fo sretemarap ytilitalov eht fo setamitse doohilekil mumixam stroper elbat sihT :setoN eht ssorca nommoc elbairav-etats raenilnon a tcartxe suht sledom ehT .seirtsudni ro seirtnuoc rof ledom etats nommoc eht ot .soiloftrop yrtsudni eht ssorca ro yrtnuoc 41 Table 6. Relative Contribution of \"Pure\" Country and Industry Factors to the Variance of Stock Returns High Industry Volatility State Low Industry Volatility State Pure Country Acc. Industry Pure Country Acc. Industry A. Country Portfolios US 0.955 0.091 0.992 0.011 UK 0.825 0.169 1.010 0.020 France 1.297 0.114 1.003 0.009 Germany 0.983 0.153 1.023 0.017 Italy 0.988 0.102 1.014 0.014 Japan 0.969 0.112 1.028 0.012 Canada 0.907 0.213 1.020 0.029 Australia 0.956 0.212 0.993 0.039 Belgium 1.092 0.300 1.028 0.033 Denmark 1.008 0.115 1.033 0.025 Ireland 0.922 0.227 1.053 0.026 Netherlands 0.626 0.471 0.973 0.107 Switzerland 0.971 0.438 1.033 0.049 Average 0.974 0.223 1.018 0.033 B. Industry Portfolios Resources 0.920 0.161 0.725 0.453 Basic 0.928 0.080 0.721 0.254 General industry 0.621 0.101 0.684 0.346 Cyclical cons. goods 1.168 0.114 0.941 0.309 Non-cycl. Cons. goods 0.772 0.138 0.435 0.532 Cyclical services 0.532 0.182 0.594 0.384 Non-cycl. Services 1.370 0.221 0.708 0.410 Utilities 1.345 0.060 0.894 0.200 Information technology 0.895 0.059 0.667 0.270 Financials 1.104 0.128 0.726 0.409 Others 0.349 0.647 0.511 0.923 Average 0.910 0.172 0.691 0.408 Notes: Panel A of this table shows the contribution of the “pure” country effect and the cumulated industry effect of the excess return (computed relative to the global return) on the individual country portfolios, using the decomposition (13) in the paper. Panel B shows the contribution of the “pure” industry effect and the cumulated country effect of the excess return (computed relative to the global return) on the individual industry portfolios using the decomposition (15) in the paper. The reported figures are ratios of the variance of each component to the variance of their sum (including their covariance).",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 45,
    "chunk_index": 61,
    "word_count": 325,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "“pure” industry effect and the cumulated country effect of the excess return (computed relative to the global return) on the individual industry portfolios using the decomposition (15) in the paper. The reported figures are ratios of the variance of each component to the variance of their sum (including their covariance).",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 45,
    "chunk_index": 62,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "42 soiloftroP yrtnuoC deifisreviD yllairtsudnI rof snoitalerroC dna secnairavoC .7 elbaT etatS ytilitaloV labolG hgiH .A WS LN RI ED EB UA AC PJ TI EG RF KU SU 835.31 357.51 940.02 494.9 123.41 616.61 940.71 115.71 814.21 254.11 184.51 770.12 675.22 SU 659.42 321.62 312.43 876.02 924.32 430.82 399.02 207.43 285.72 283.32 433.72 435.24 086.0 KU 371.42 983.22 129.03 318.81 639.82 168.71 368.31 165.63 263.03 219.92 736.35 275.0 544.0 RF 469.42 365.22 974.42 307.71 128.42 269.41 803.11 304.42 462.22 400.73 176.0 985.0 693.0 EG 409.61 996.91 111.72 757.02 326.02 172.81 930.61 174.53 383.77 614.0 174.0 184.0 792.0 TI 931.82 122.52 274.73 038.22 192.72 718.32 820.91 948.17 674.0 374.0 985.0 826.0 534.0 PJ 595.31 265.41 335.02 068.01 420.31 850.32 585.22 274.0 483.0 193.0 893.0 776.0 557.0 AC 451.81 652.61 221.62 830.41 427.71 595.35 366.0 483.0 482.0 633.0 333.0 785.0 874.0 UA 229.12 726.02 634.03 771.61 648.73 493.0 544.0 325.0 183.0 366.0 246.0 485.0 094.0 EB 901.81 330.41 729.42 414.13 964.0 243.0 804.0 184.0 124.0 915.0 854.0 665.0 753.0 ED 756.62 500.52 540.75 985.0 556.0 274.0 275.0 585.0 804.0 335.0 955.0 596.0 955.0 RI 626.02 585.22 796.0 725.0 607.0 764.0 546.0 626.0 174.0 087.0 346.0 348.0 896.0 LN 825.13 377.0 926.0 575.0 536.0 244.0 905.0 195.0 243.0 137.0 885.0 186.0 705.0 WS etatS ytilitaloV labolG woL .B WS LN RI ED EB UA AC PJ TI EG RF KU SU 141.3 943.6 123.4 453.3 670.4 909.8 638.9 585.5- 580.0- 504.2 541.4 802.6 018.31 SU 654.8 616.01 383.21 634.8 280.7 422.41 876.7 405.5 679.8 332.8 698.9 265.12 063.0 KU 702.11 614.01 526.21 401.01 221.61 485.7 180.4 698.01 092.51 692.81 337.93 833.0 771.0 RF 682.41 878.21 274.8 282.11 592.41 479.6 518.3 620.1 084.9 676.72 255.0 733.0 321.0 EG 077.2 855.6 746.7 088.01 146.6 628.6 090.5 836.8 341.16 032.0 013.0 742.0 300.0- TI 114.3 784.1 514.7 953.2 717.2 087.1 415.2- 224.43 881.0 330.0 592.0 202.0 652.0- PJ 157.4 217.6 063.6 372.6 333.4 409.61 629.61 401.0- 851.0 671.0 751.0 204.0 346.0 AC 618.8 119.7 454.11 659.8 835.8 749.64 006.0 440.0 721.0 391.0 671.0 744.0 053.0 UA 640.01 547.9 032.31 855.8 321.62 442.0 602.0 190.0 661.0 235.0 005.0 892.0 512.0 EB 733.01 552.7 528.11 998.72 713.0 742.0 982.0 670.0 362.0 604.0 303.0 443.0 171.0 ED 992.9 046.8 753.43 283.0 244.0 582.0 462.0 612.0 761.0 572.0 243.0 554.0 891.0 RI 195.9 345.21 614.0 883.0 835.0 623.0 164.0 270.0 732.0 196.0 764.0 646.0 284.0 LN 005.91 316.0 953.0 344.0 544.0 192.0 162.0 231.0 080.0 516.0 304.0 214.0 191.0 WS wol dna ytilitalov labolg hgih :setats owt rof nwohs era stluseR .soiloftrop yrtnuoc deifisrevid yllairtsudni no snruter eht neewteb snoitalerroc dna secnairavoc eht fo setamitse stroper elbat sihT :setoN .snoitalerroc eht fo setamitse era lanogaid eht woleb srebmun elihw ,setamitse ecnairav wohs lanogaid eht no srebmun ,setamitse ecnairavoc wohs lanogaid eht evoba srebmuN .ytilitalov labolg",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 45,
    "chunk_index": 63,
    "word_count": 466,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": ":setats owt rof nwohs era stluseR .soiloftrop yrtnuoc deifisrevid yllairtsudni no snruter eht neewteb snoitalerroc dna secnairavoc eht fo setamitse stroper elbat sihT :setoN .snoitalerroc eht fo setamitse era lanogaid eht woleb srebmun elihw ,setamitse ecnairav wohs lanogaid eht no srebmun ,setamitse ecnairavoc wohs lanogaid eht evoba srebmuN .ytilitalov labolg",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 45,
    "chunk_index": 64,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "43 soiloftroP yrtsudnI deifisreviD yllacihpargoeG rof snoitalerroC dna secnairavoC .8 elbaT ytilitaloV yrtsudnI hgiH ,ytilitaloV labolG hgiH .A REHTO NANIF HCETI SLITU RSYCN RESYC GCYCN DGCYC NINEG CISAB ROSER 920.62 789.32 557.22 965.5 971.7 412.71 600.01 618.71 620.32 784.72 896.44 ROSER 707.92 842.23 027.13 669.6 205.11 676.62 779.51 185.43 711.13 942.93 656.0 CISAB 298.33 598.82 771.35 367.1 139.31 066.92 573.51 069.63 290.73 618.0 665.0 NINEG 228.23 448.23 585.35 722.3 115.61 528.33 392.31 679.45 818.0 447.0 953.0 DGCYC 004.71 592.02 667.81 779.2 903.5 737.31 469.91 104.0 565.0 175.0 533.0 GCYCN 774.92 463.72 548.94 182.2 439.81 583.13 945.0 418.0 968.0 067.0 064.0 RESYC 950.81 239.51 820.93 875.3- 088.24 615.0 181.0 043.0 943.0 082.0 461.0 RSYCN 592.6 305.31 599.2- 436.52 801.0- 080.0 231.0 680.0 750.0 022.0 561.0 SLITU 735.25 003.43 843.721 250.0- 825.0 887.0 273.0 046.0 477.0 944.0 203.0 HCETI 968.13 131.24 864.0 114.0 573.0 357.0 007.0 286.0 137.0 397.0 355.0 NANIF 502.14 567.0 527.0 491.0 034.0 028.0 706.0 096.0 768.0 937.0 706.0 REHTO ytilitaloV yrtsudnI hgiH ,ytilitaloV labolG woL .B REHTO NANIF HCETI SLITU RSYCN RESYC GCYCN DGCYC NINEG CISAB ROSER 145.41 915.21 855.3- 437.31 850.2 277.7 788.7 336.2 735.21 910.81 315.64 ROSER 539.6 694.9 678.5- 648.3 409.4- 949.5 475.2 311.8 443.9 694.81 416.0 CISAB 990.01 221.5 065.41 773.2- 594.3- 219.7 159.0 274.9 992.41 575.0 684.0 NINEG 433.4 673.4 372.01 706.5- 016.5- 283.7 628.5- 397.22 525.0 593.0 180.0 DGCYC 779.1 298.4 284.11- 702.7 747.3- 063.0 119.31 723.0- 760.0 061.0 013.0 GCYCN 137.6 836.4 472.21 318.0- 355.2 486.01 030.0 374.0 046.0 324.0 943.0 RESYC 763.0- 474.2- 877.5 053.2- 028.03 141.0 181.0- 212.0- 761.0- 502.0- 450.0 RSYCN 651.1 483.8 859.22- 841.04 760.0- 930.0- 503.0 581.0- 990.0- 141.0 813.0 SLITU 129.21 792.5- 709.27 424.0- 221.0 044.0 163.0- 252.0 154.0 061.0- 160.0- HCETI 790.7 973.71 941.0- 713.0 701.0- 043.0 513.0 022.0 523.0 035.0 044.0 NANIF 314.61 024.0 473.0 540.0 610.0- 805.0 131.0 422.0 956.0 893.0 625.0 REHTO",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 45,
    "chunk_index": 65,
    "word_count": 311,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "450.0 RSYCN 651.1 483.8 859.22- 841.04 760.0- 930.0- 503.0 581.0- 990.0- 141.0 813.0 SLITU 129.21 792.5- 709.27 424.0- 221.0 044.0 163.0- 252.0 154.0 061.0- 160.0- HCETI 790.7 973.71 941.0- 713.0 701.0- 043.0 513.0 022.0 523.0 035.0 044.0 NANIF 314.61 024.0 473.0 540.0 610.0- 805.0 131.0 422.0 956.0 893.0 625.0 REHTO",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 45,
    "chunk_index": 66,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": "44 )dedulcnoc( 9 elbaT ytilitaloV yrtsudnI woL ,ytilitaloV labolG hgiH .C REHTO NANIF HCETI SLITU RSYCN RESYC GCYCN DGCYC NINEG CISAB ROSER 905.72 983.62 861.32 752.22 514.12 252.42 467.32 740.32 856.52 482.62 488.13 ROSER 947.23 380.13 970.92 269.42 000.42 620.13 298.82 413.82 435.13 736.53 087.0 CISAB 505.13 647.92 179.92 793.32 308.32 773.92 459.72 094.92 421.23 239.0 208.0 NINEG 588.82 873.72 332.82 429.02 819.12 785.72 447.52 658.23 809.0 728.0 217.0 DGCYC 683.92 142.92 430.62 048.32 844.32 365.82 258.92 228.0 309.0 688.0 077.0 GCYCN 156.03 935.03 393.72 341.42 615.32 683.13 339.0 958.0 529.0 829.0 767.0 RESYC 012.52 256.42 791.22 515.22 285.82 587.0 308.0 517.0 687.0 257.0 907.0 RSYCN 343.62 801.62 119.91 781.92 087.0 897.0 808.0 676.0 467.0 477.0 037.0 SLITU 022.92 084.72 749.53 516.0 296.0 618.0 597.0 228.0 288.0 218.0 486.0 HCETI 849.13 469.33 687.0 928.0 197.0 539.0 819.0 028.0 109.0 398.0 208.0 NANIF 679.93 768.0 177.0 177.0 647.0 568.0 158.0 797.0 978.0 868.0 177.0 REHTO ytilitaloV yrtsudnI woL ,ytilitaloV labolG woL .D REHTO NANIF HCETI SLITU RSYCN RESYC GCYCN DGCYC NINEG CISAB ROSER 373.7 365.6 095.5 371.5 428.4 382.5 089.4 471.5 384.6 969.5 969.41 ROSER 312.9 658.7 101.8 874.4 800.4 656.8 807.6 040.7 959.8 229.11 744.0 CISAB 901.9 066.7 331.01 450.4 259.4 841.8 119.6 853.9 096.01 497.0 315.0 NINEG 197.7 395.6 796.9 388.2 863.4 956.7 200.6 520.41 467.0 445.0 753.0 DGCYC 283.7 645.7 885.6 888.4 889.4 527.7 102.9 825.0 796.0 046.0 424.0 GCYCN 164.8 856.8 167.7 500.5 968.4 263.01 197.0 536.0 477.0 977.0 424.0 RESYC 893.5 051.5 249.4 557.5 413.21 134.0 964.0 233.0 234.0 133.0 553.0 RSYCN 930.6 311.6 561.2 539.11 574.0 054.0 664.0 322.0 953.0 573.0 783.0 SLITU 124.8 199.6 607.71 941.0 533.0 375.0 615.0 516.0 737.0 855.0 343.0 HCETI 109.8 722.11 694.0 825.0 834.0 308.0 347.0 525.0 996.0 976.0 605.0 NANIF 026.61 256.0 194.0 924.0 773.0 546.0 795.0 015.0 386.0 556.0 764.0 REHTO era stluseR .soiloftrop yrtsudni deifisrevid yllacihpargoeg no snruter eht neewteb snoitalerroc dna secnairavoc eht fo setamitse stroper elbat sihT :setoN labolg hgih ;)B lenaP( ytilitalov yrtsudni hgih ,ytilitalov labolg wol ;)A lenaP( ytilitalov yrtsudni hgih ,ytilitalov labolg hgih :setats ruof rof nwohs ,setamitse ecnairavoc wohs lanogaid eht evoba srebmuN .)D lenaP( ytilitalov yrtsudni wol ,ytilitalov labolg wol ;)C lenaP( ytilitalov yrtsudni wol ,ytilitalov .snoitalerroc eht fo setamitse era lanogaid eht woleb srebmun elihw ,setamitse ecnairav wohs lanogaid eht no srebmun",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 45,
    "chunk_index": 67,
    "word_count": 384,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  },
  {
    "text": ";)A lenaP( ytilitalov yrtsudni hgih ,ytilitalov labolg hgih :setats ruof rof nwohs ,setamitse ecnairavoc wohs lanogaid eht evoba srebmuN .)D lenaP( ytilitalov yrtsudni wol ,ytilitalov labolg wol ;)C lenaP( ytilitalov yrtsudni wol ,ytilitalov .snoitalerroc eht fo setamitse era lanogaid eht woleb srebmun elihw ,setamitse ecnairav wohs lanogaid eht no srebmun",
    "title": "Catao - Timmer Volatility Regimes 12April2007",
    "source_type": "pdf",
    "document_id": "884ade8d31cb",
    "source_file": "Volatility Regimes and Global Equity Returns.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 45,
    "chunk_index": 68,
    "word_count": 50,
    "author": "lleon",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070412174929-04'00'",
    "duration": null
  }
]