[
  {
    "text": "What Makes the VIX Tick? Warren Bailey, Lin Zheng, and Yinggang Zhou * Cornell University, City College of New York, and Chinese University of Hong Kong 27th February 2014 Abstract We study minute-by-minute behavior of the VIX index and trading activity in the underlying S&P 500 options to understand the impact of macro and microeconomic forces on risk neutral volatility. VIX often increases with macroeconomic news, reflects the credibility of Fed monetary stimulus, and behaves differently before, during, and after the financial crisis. Comparing VIX to its estimated variance risk premium reveals divergences between uncertainty and risk aversion. The most prominent feature of the dynamics of VIX is mean reversion. This is consistent with liquidity provision which weakens during the financial crisis and is partly related to news arrival. Keywords: VIX, implied volatility, volatility risk premium, macroeconomic news, policy uncertainty JEL classifications: G11, G12, G13 * Cornell University, Johnson Graduate School of Management, 387 Sage Hall, Ithaca NY 14850 U.S.A., (607) 2554627, wbb1@cornell.edu; NAC 7/113A, Department of Economics. City College of New York. New York, NY 10031 U.S.A., (212) 650-6142, lz56@cornell.edu; and Chinese University of Hong Kong, Faculty of Business Administration, Room 718, 7/F, No.12, Chak Cheung Street, Shatin, N.T., Hong Kong, P.R.C., (852) 3943 8780, ygzhou@baf.cuhk.edu.hk. We thank Murillo Campello, Mancang Dong, George Gao, Andrew Karolyi, Alok Kumar, Edith Liu, Pamela Moulton, David Ng, Yonghao Pu, Andrei Ukhov, Fan Yu, Xiaoyan Zhang, and seminar participants at the 8th conference of the Asia-Pacific Association of Derivatives at Pusan, Korea (Best Paper Award), Cheung Kong Graduate School of Business, 2013 China International Conference in Finance, City College of New York, Erasmus University, Hong Kong Institute for Monetary Research, Laval University, 2012 Northern Finance Association conference, Peking University HSBC business school, Shanghai Advanced Institute of Finance, Shanghai University of Finance and Economics, Sun Yat-Sen University, and Syracuse University for helpful discussions, comments on earlier drafts, and other assistance. We are particularly grateful to Peter Carr, Eric Jacquier, Bob Jarrow, Gideon Saar, and Xiaofei Zhao for many detailed suggestions. © 2012, 2013, 2014,Warren Bailey, Lin Zheng, and Yinggang Zhou.",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 61,
    "chunk_index": 0,
    "word_count": 346,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "of Finance and Economics, Sun Yat-Sen University, and Syracuse University for helpful discussions, comments on earlier drafts, and other assistance. We are particularly grateful to Peter Carr, Eric Jacquier, Bob Jarrow, Gideon Saar, and Xiaofei Zhao for many detailed suggestions. © 2012, 2013, 2014,Warren Bailey, Lin Zheng, and Yinggang Zhou.",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 61,
    "chunk_index": 1,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "Why does stock volatility change over time? Classic studies find that the volatility of macroeconomic fundamentals explains only a fraction of stock index volatility.1 The only robust finding seems to be that the stage of the business cycle affects stock market volatility. A potential limitation to explaining stock volatility is the low frequency of observations dictated by the use of daily stock returns to compute realized volatility and by the monthly frequency of typical macroeconomic series. Our study takes a fresh look at the underlying causes of volatility using high frequency data from markets for index option derivatives, equities, and futures contracts. Today’s capital markets feature frequent or even automated trading, high liquidity, and rapid rebalancing across asset classes by participants ranging from hedge funds to proprietary trading desks of institutions. In this environment, high frequency data allows us to uncover relationships between volatility and fundamentals that cannot be observed at lower frequencies. We construct intraday variables and use them to test hypotheses that relate minute-by-minute changes in volatility to proxies for underlying financial, macroeconomic, and microeconomic conditions. Ross (1989) argues that stock return volatility is directly related to the flow of information. Early studies of the impact of macroeconomic news examine daily stock, bond, and currency returns around money supply and other government economic announcements. Schwert (1981) finds that daily stock prices respond to the surprise component of inflation announcements. Cornell (1983) successfully tests competing predictions about monetary policy with stock, bond, and currency responses to weekly money supply announcements. Ederington and Lee (1993) explain a large portion of intraday and day-of-the-week volatility patterns in interest rate and exchange rate futures with macroeconomic announcements. Andersen and Bollerslev (1998) examine the effect of public news shocks on high frequency exchange rate volatility. They find that dummy variables for time-of-day and announcement 1 See Schwert (1989). R-squared coefficients in his Table XII, for example, range from 2% to 20%. 1",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 61,
    "chunk_index": 2,
    "word_count": 319,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "exchange rate futures with macroeconomic announcements. Andersen and Bollerslev (1998) examine the effect of public news shocks on high frequency exchange rate volatility. They find that dummy variables for time-of-day and announcement 1 See Schwert (1989). R-squared coefficients in his Table XII, for example, range from 2% to 20%. 1",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 61,
    "chunk_index": 3,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "time effects are more important than ARCH effects, and report significant but brief responses to the content of macroeconomic announcements. Andersen, Bollerslev, Diebold, and Vega, (2003, 2007) document the real-time impact of macroeconomic announcement surprises on futures price changes and volatility. They find price responses to many announcements are often significant and vary with the sign of the announcement surprise and the business cycle. Employment and inflation measures are particularly important. Early works pioneering the study of volatility inferred from option prices find little change in implied volatility of individual stocks at news events (Cornell, 1978) but some evidence that earnings releases (Patell and Wolfson, 1979) and macroeconomic announcements (Bailey, 1988) reduce uncertainty. Ederington and Lee (1996) find that implied volatilities for interest rates and currencies appear related to the timing of scheduled macroeconomic releases. Pastor and Veronesi (2012) apply the policy uncertainty index of Baker, Bloom, and Davis (2011) to monthly SP500 realized and implied volatilities. They find evidence consistent with their model of stock returns and political uncertainty. Studying the VIX index is valuable for several reasons. First, VIX is widely reported by the financial press and financial web sites, and even appears on the ticker of the CNBC financial news cable television network during trading hours. It is part of the information set that investors condition decisions on, and forms the basis for a growing variety of derivatives, ETFs, and other financial products. Furthermore, VIX is well-accepted in the academic literature as a measure of the market’s price of future stock index volatility and is increasingly used as a control variable in empirical work. It is important to understand the intraday evolution of this almost continuously-observed factor which is of growing use to both practitioners and researchers. More broadly, VIX is an ex ante measure of aggregate stock market volatility. Economic theory and intuition suggest that VIX can be used to learn more about the fundamental economic forces that drive financial markets. Recent research has begun to relate macroeconomic conditions to VIX and more insights are likely to result 2",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 61,
    "chunk_index": 4,
    "word_count": 343,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "is an ex ante measure of aggregate stock market volatility. Economic theory and intuition suggest that VIX can be used to learn more about the fundamental economic forces that drive financial markets. Recent research has begun to relate macroeconomic conditions to VIX and more insights are likely to result 2",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 61,
    "chunk_index": 5,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "from studying very high frequency observations. Finally, VIX is a composite of prices for heavily-traded stock index options and, as a consequence, VIX changes very frequently during trading hours. Economic theory views the evolution of a financial price like VIX as the result of trading by heterogeneously informed investors with differing goals, preferences, and information processing skills. The extent to which we can explain the forces that move the VIX from minute to minute contributes to the debate on whether securities prices largely reflect fundamentals or are excessively volatile in some sense. A risk neutral volatility like VIX can be computed using either parametric or nonparametric methods. Parametric implied volatilities are inferred from market prices of options or other derivatives with a pricing model such as the Black and Scholes (1973) model. For example, the Chicago Board Option Exchange’s first implied volatility index, VXO, was computed from S&P100 index option prices. The evidence on the information content of VXO is mixed (Harvey and Whaley, 1992; Canina and Figlewski, 1993; Blair, Poon, and Taylor, 2001), perhaps because VXO concentrates on near-the-money options. Nonparametric implied variances approximate prices of variance swaps (derived by Carr and Madan, 1998; Demeterfi, Derman, Kamal, and Zou, 1999; Britten-Jones and Neuberger, 2000; Jiang and Tian, 2005; Carr and Wu, 2006, 2009; and others) and, therefore, rely on no-arbitrage conditions and many option strike prices traded at a particular time. The information content of nonparametric implied volatility is superior to that of its parametric counterparts (Jiang and Tian, 2005). The Chicago Board Option Exchange replaced VXO with an S&P500 volatility index, VIX, which is the square root of a weighted average of mid-point prices of out-of-the-money put and call and approximates the price of a portfolio of options that replicates the payoff on a variance swap. It parallels the square root of the model-free implied variance of Britten-Jones and Neuberger (2000) and the risk-neutral expected value of return variance of Carr and Wu (2009) over a 30-day horizon (Chicago Board Options Exchange, 2009). The 3",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 61,
    "chunk_index": 6,
    "word_count": 337,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "portfolio of options that replicates the payoff on a variance swap. It parallels the square root of the model-free implied variance of Britten-Jones and Neuberger (2000) and the risk-neutral expected value of return variance of Carr and Wu (2009) over a 30-day horizon (Chicago Board Options Exchange, 2009). The 3",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 61,
    "chunk_index": 7,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "VIX index also allows us to study an interesting component, its volatility risk premium (VRP), defined as the difference between risk neutral volatility and the expected quadratic variation of the underlying return series. Carr and Wu (2009) shows that VRP for major U.S. stock indexes is consistent with a significant premium for exposure to stochastic variance risk. Bollerslev, Tauchen, and Zhou (2010) find that VRP explains a large fraction of the variation in quarterly stock returns from 1990 to 2005. The model of Drechsler and Yaron (2011) shows how aversion to long-run risks generates a VRP that can predict stock returns. Bollerslev and Todorov (2011) show that, on average, “disaster risk” drives most of the variation in VRP. Bali and Zhou (2013) shows that equity portfolios that mimic the variance risk premium earn a substantial monthly risk premium. Put another way, the risk neutral probability puts more weight on the bad state and that induces additional risk neutral variance, that is, a positive variance risk premium. We use data sampled at one minute intervals2 from January 2005 to June 2010 to measure associations between economic forces, risk neutral volatility measured with the VIX index, and the volatility risk premium implicit in VIX. Our findings serve several purposes. First, we document the high frequency univariate behavior of VIX. Second, we measure in great detail the high-frequency linkages between volatility and economic and financial fundamentals that academics and practitioners have studied since the dawn of financial markets centuries ago. One-minute intervals allow us to measure precisely associations between VIX and other variables and the speed with which the index options market digests information. Given the rapid trading in financial markets that is enhanced by modern trading technologies, associations are likely to evolve very rapidly and can be obscured in less frequently observed data.3 Third, our decomposition of VIX allows us to compute the 2 See Aït-Sahalia, Mykland,, and Zhang (2005) on interval lengths for studying high frequency financial series. 3 Pagan and Schwert (1990) discuss how non-stationarity can blur studies of volatility sampled at low frequency over very long time periods. Ederington and Lee (1993) find that the impact of macroeconomic news on interest 4",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 61,
    "chunk_index": 8,
    "word_count": 363,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "Aït-Sahalia, Mykland,, and Zhang (2005) on interval lengths for studying high frequency financial series. 3 Pagan and Schwert (1990) discuss how non-stationarity can blur studies of volatility sampled at low frequency over very long time periods. Ederington and Lee (1993) find that the impact of macroeconomic news on interest 4",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 61,
    "chunk_index": 9,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "variance risk premium and increase our understanding by contrasting its behavior with that of the raw VIX. Under habit-based preferences, Bekaert, Engstrom, and Xing (2009) find that risk aversion plays a relatively larger role in equity-related risk premiums while fundamental uncertainty is more important for asset price volatility.4 Therefore, we can interpret our findings for risk aversion versus expected volatility. Finally, very few studies examine the economic determinants of mean-reversion in stochastic volatility, which is substantial in the high frequency evolution of VIX. We offer some preliminary evidence that ascribes some of this behavior to liquidity provision. Thus, our high frequency approach documents several facets of the relationship between stock volatility and macro and microeconomic conditions. The balance of this paper is organized as follows. Section 2 describes our testable hypotheses, data, and empirical methodology. Sections 3 and 4 discuss empirical results. Section 5 summarizes, concludes, and sketches ideas for subsequent work. 2. Empirical design 2.1 Testable hypotheses To organize our exploration of the minute-by-minute evolution of the VIX index, we present several testable propositions. They are not mutually exclusive, but serve to formalize predictions about associations between VIX and several dimensions of the economic environment, rather than validating a particular complete theory of VIX fluctuations. First, stock prices equal the present value of corporate cash flows which, in turn, evolve with macroeconomic conditions. Thus, the risk neutral volatility embedded in index option prices reflects the expected volatility of macroeconomic conditions. For example, Bekaert, rate and currency realized volatility occurs within a minute. Jacquier and Okou (2012) show how the effect of jumps on excess returns weakens at longer horizons. 4 Consistent evidence includes Giesecke, Longstaff, Schaefer, and Strebulaev (2011), who find that credit spreads primarily reflect risk premiums, rather than the probability of default, and. Stanton and Wallace (2011) on the relationship between mortgage related credit spreads and the fundamentals of the underlying mortgages. 5",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 61,
    "chunk_index": 10,
    "word_count": 316,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "weakens at longer horizons. 4 Consistent evidence includes Giesecke, Longstaff, Schaefer, and Strebulaev (2011), who find that credit spreads primarily reflect risk premiums, rather than the probability of default, and. Stanton and Wallace (2011) on the relationship between mortgage related credit spreads and the fundamentals of the underlying mortgages. 5 Hoerova, and Lo Duca (2013) document significant monthly associations between VIX and measures of monetary policy and macroeconomic conditions. Bekaert and Hoerova (2013) find that daily measures of the ex ante variance and risk premium components of VIX predict stock returns, economic activity, and indicators of financial stress.5 We begin with the idea that macroeconomic news can either increase or resolve uncertainty (Patell and Wolfson, 1979; Bailey, 1988): H1a: VIX squared increases at times of macroeconomic announcements because such news increases uncertainty. H1b: VIX squared decreases at times of macroeconomic announcements because such news resolves uncertainty. Competing patterns in the behavior of VIX around macroeconomic announcements are possible, and detecting these responses allows us to better understand links between risk neutral stock volatility and economic fundamentals. Second, monetary policy is among the macroeconomic factors that can affect corporate cash flows. Continuously evolving short-term money market interest rates reflect expectations of monetary policy actions and their consequences, in addition to the business cycle, aggregate wealth and consumption, risk aversion, and other fundamentals. Therefore, we offer competing predictions for associations between changes in the VIX index and changes in short term interest rates: 5 For additional evidence of associations between monthly VIX, its risk premium, and macroeconomic and financial conditions, see Corradi, Distaso, and Mele (2013) and Andreou and Ghysels (2013). 6",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 61,
    "chunk_index": 11,
    "word_count": 270,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "fundamentals. Therefore, we offer competing predictions for associations between changes in the VIX index and changes in short term interest rates: 5 For additional evidence of associations between monthly VIX, its risk premium, and macroeconomic and financial conditions, see Corradi, Distaso, and Mele (2013) and Andreou and Ghysels (2013). 6",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 61,
    "chunk_index": 12,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "H2a: Changes in VIX are negatively correlated with short term interest rates if central bank stimulus is expected to be ineffective. H2b: Changes in VIX are positively correlated with short term interest rates if central bank stimulus is expected to be effective. The relationship between changes in VIX and information about short-term interest rates (reflected in the price of Eurodollar futures) depends on whether monetary easing signaled by a lower short term interest rate increases or reduces uncertainty. Interpreting associations between VIX and information about short-term interest rates is particularly interesting for a time period of great economic turmoil and disagreement about how the government should respond.6 Third, uncertainty about forthcoming government policies and regulatory actions that affect economic conditions and corporate cash flows can affect uncertainty about stock returns (Pastor and Veronesi, 2011): H3: Changes in VIX are positively correlated with uncertainty about forthcoming government policies and regulations. As detailed later, we construct an intraday measure of the frequency of policy uncertainty news following monthly and daily measures constructed by Baker, Bloom, and Davis (2011). 6 Expected ineffective monetary policy, H2a, is difficult to distinguish from flight-to-quality. However, the funding of traders affects securities market liquidity (Brunnermeier and Pedersen, 2009) and monetary easing, whether effective or ineffective in achieving its broader goals, can increase funding for securities market liquidity provision. Theory suggests many channels for positive correlation between volatility and securities liquidity such as market maker’s cost of holding inventory (Copeland and Galai, 1983) or the solvency of large traders (Brunnermeier and Pedersen, 2005; Carlin, Lobo, and Viswanathan, 2007). 7",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 61,
    "chunk_index": 13,
    "word_count": 261,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "broader goals, can increase funding for securities market liquidity provision. Theory suggests many channels for positive correlation between volatility and securities liquidity such as market maker’s cost of holding inventory (Copeland and Galai, 1983) or the solvency of large traders (Brunnermeier and Pedersen, 2005; Carlin, Lobo, and Viswanathan, 2007). 7",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 61,
    "chunk_index": 14,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "We include controls for other potential influences on VIX in our empirical tests. First, much previous work has documented associations between stock index volatility and the direction of the stock market. By the leverage argument (Merton, 1974; Black, 1976; Christie, 1982), a decrease in stock index value increases corporate leverage and the expected volatility of the index. By the risk premium (French, Schwert, and Stambaugh, 1987) or volatility feedback arguments (Bekaert and Wu, 2000), the expected stock market risk premium is positively correlated with expected stock index volatility. Therefore, realized market risk premiums are negatively correlated with index volatility surprises, and changes in VIX are negatively correlated with stock index returns. Second, VIX is perceived by practitioners as both a price for portfolio insurance and a measure of fear (Whaley, 2000; 2009). If investors turn to gold at times of turmoil in the stock market and economy generally,7 its price should be positively correlated with both the expected volatility and risk premium components of VIX. Third, trading volume, order flow imbalances, and liquidity in the stock market can reflect private information, information processing and disagreement, and the cost of trading. While private information may not be very significant for the index-related securities that we study (Subrahmanyam, 1991), private information features in much finance literature, ranging from early formulations of market efficiency (Fama, 1965) to models of informed and liquidity-motivated traders (Admati and Pfleiderer, 1988). Order flow imbalances reveal private information for stocks (Hasbrouck, 1991; Berry and Howe, 1994), foreign exchange (Evans and Lyons, 2008), and Treasury bonds (Brandt and Kavajecz, 2004;Pasquariello and Vega, 2007), and are correlated with economic and financial conditions (Beber, Brandt, and Kavajecz, 2011). 7 For a summary of fundamental and sentiment influences on gold, see “Gilt-edged argument: The battle to explain the remorseless rise of the bullion price”, The Economist 28th April 2011. 8",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 61,
    "chunk_index": 15,
    "word_count": 308,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "and Kavajecz, 2004;Pasquariello and Vega, 2007), and are correlated with economic and financial conditions (Beber, Brandt, and Kavajecz, 2011). 7 For a summary of fundamental and sentiment influences on gold, see “Gilt-edged argument: The battle to explain the remorseless rise of the bullion price”, The Economist 28th April 2011. 8",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 61,
    "chunk_index": 16,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "2.2 Data The time period we study is January 2005 to the end of June 2010. Every 15 seconds, CBOE samples S&P500 index option quotes, computes the spot VIX as described in Chicago Board Options Exchange (2009), and disseminates the spot VIX publicly. We purchase these 15-second ticks from the Chicago Board Options Exchange’s Market Data Express service. They represent the spot value of the VIX, that is, the implied volatility average itself, rather than the VIX futures contracts traded on it. Note that the spot VIX measures the market’s current risk-neutral expectation of future stock index volatility over the next 30 days. In contrast, VIX futures measure the expectation of 30-day volatility starting at the point in the future when the contract matures. We construct a minute-by-minute series by taking the closest 15-second value prior to the end of each minute. To measure the impact of macroeconomic news, we collect principal US macroeconomic announcements 8 from Bloomberg. Many previous authors have shown that such announcements evoke significant responses in returns on stocks and other financial assets, presumably because changes in economic conditions affect expected corporate cash flows, risk exposures, and risk premiums that underlie asset prices. To measure the intraday evolution of information about interest rates and monetary policy, we use the rate of change of short maturity Eurodollar futures contract prices at the Chicago Mercantile Exchange. The rate of change of the Eurodollar futures contract price 9 represents short term interest rates which, in turn, reflect the state of the business cycle and actual and expected monetary policy. This series is purchased through www.tickdata.com. 8 Pasquariello and Vega (2007) select ten macroeconomic announcements from 9:30 to 16:00. However, we do not exclude announcements that occur before NYSE trading hours since a few important announcements occur prior to market opening and as described later, we use close-to-open changes in VIX to study them. We exclude announcements which are not significant for SP500 index returns. 9 This is essentially 100 minus the annualized yield. See http://www.cmegroup.com/trading/interest-rates/stir/eurodollar_contract_specifications.html. 9",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 61,
    "chunk_index": 17,
    "word_count": 337,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "before NYSE trading hours since a few important announcements occur prior to market opening and as described later, we use close-to-open changes in VIX to study them. We exclude announcements which are not significant for SP500 index returns. 9 This is essentially 100 minus the annualized yield. See http://www.cmegroup.com/trading/interest-rates/stir/eurodollar_contract_specifications.html. 9",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 61,
    "chunk_index": 18,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "We measure the flow of policy uncertainty news as follows. Baker, Bloom, and Davis (2011) construct a daily index of economic policy uncertainty news from ten major US newspapers (www.policyuncertainty.com). We construct an intraday variation on their news index as follows. The Factiva database is searched for time-stamped news stories from news wires services Dow Jones News Service, Reuters News, and Business Wires using key words following Baker, Bloom, and Davis (2011)10 and excluding duplicates. The resulting number of news stories is aggregated into a series which indicates the number of such stories in each minute of our sample period. Beyond the variables above that address our testable hypotheses, we need to measure the evolution of the stock index series underlying VIX both to compute (detailed below) the variance risk premium and to control for leverage and risk premium effects. We use intraday trade returns on the SPDR S&P 500 exchange traded fund (SPY) from TAQ.11 SPY returns represent broad movement in stock prices and, more broadly, the market’s estimate of changes in future economic growth. Given the structure of the SPY ETF which allows arbitrage by certain traders, SPY tracks the S&P 500 index very closely.12 To control for fear and hedging, we use the rate of change of short maturity gold futures contract prices at COMEX. The rate of change of the price of gold futures reflects changes in the demand for gold due to inflation expectations, consumption demand, and hedging against 10 (economy OR economic) AND (uncertain OR uncertainty) AND (policy OR regulation OR “Federal Reserve” OR tax OR spend OR budget OR deficit). 11 TAQ trade records are filtered for condition codes and a tiny number of large immediate reversals. 12 Drechsler and Yaron (2011) suggest that the volatility of the spot S&P500 provides forecasts that are inferior to those based on S&P500 futures. SPY, however, is extremely heavily traded. Each share is worth ten cents per S&P500 index point, and volume averages about 200 million shares per day. Dollar turnover is larger in E-mini S&P500 futures, which are worth $50 per S&P 500 index point and trade about two million contracts per day (CME Group, 2011). However, SPY offers the advantage of full trade and quote data to measure several dimensions of market activity. 10",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 61,
    "chunk_index": 19,
    "word_count": 380,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "shares per day. Dollar turnover is larger in E-mini S&P500 futures, which are worth $50 per S&P 500 index point and trade about two million contracts per day (CME Group, 2011). However, SPY offers the advantage of full trade and quote data to measure several dimensions of market activity. 10",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 61,
    "chunk_index": 20,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "economic and political uncertainty around the world.13 This series is purchased through www.tickdata.com. To measure dimensions of the trading environment for the stock index, we collect or compute SPY trading volume, the price-setting or aggressive buy-sell imbalance of SPY, and the bid-ask spread of SPY from the TAQ database. Given that we study very high frequency data, it is interesting to include the behavior of other dimensions of index volatility trading. Recent research typically introduces trading conditions into empirical tests by thinking of the observed price of a security as equal to the true unobservable value plus a noise term attributed to microstructure.14 For a more detailed view of such effects, we compute several minute-by-minute indicators of the direction and intensity of SPX options trading from records of quotes and trades purchased from the CBOE. The records are screened to remove any record which the CBOE excludes from the computation of VIX because its time to expiration is too long or it is in-the-money (CBOE, 2009). Given the size and cost of the options data, we obtain data for two six month periods, one (July to December 2006) prior to the credit crisis and one (September 2008 to February 2009) during the crisis. We construct the following variables from the index options data. “Quotes” sums the quantity of SPX puts and calls in the quotes submitted during the interval. “Put-Call” is the ratio of SPX put quotes to SPX call quotes. “Spread” is the average of bid - ask spread divided by midpoint across puts and calls weighted by the size of the quote. Volume is trading volume per minute. Imbalance is “positive volume” (calls traded at ask and puts traded at bid) minus “negative volume” (puts traded at ask and calls traded at bid) following Easley, O’Hara, and Srinivas (1998). Bollen and Whaley (2004) find that changes in implied volatility are related to net buying pressure, particularly for index puts. 13 There is evidence of similar time-series patterns in VIX and the number of weekly google searches for “gold price” in 2011. See “2011 Revisited: Charting the Year”, The Economist, 31st December 2011, page 60. 14 See, for example, Aït-Sahalia, Mykland, and Zhang (2005) and Aït-Sahalia and Yu (2009). 11",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 61,
    "chunk_index": 21,
    "word_count": 371,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "13 There is evidence of similar time-series patterns in VIX and the number of weekly google searches for “gold price” in 2011. See “2011 Revisited: Charting the Year”, The Economist, 31st December 2011, page 60. 14 See, for example, Aït-Sahalia, Mykland, and Zhang (2005) and Aït-Sahalia and Yu (2009). 11",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 61,
    "chunk_index": 22,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "Our use of high frequency SPX options data in part of our paper can be compared to Andersen, Bondarenko, and Gonzalez-Perez (2012). They focus on noise and bias in the calculation of VIX that masks the behavior of the true unobserved process for spot volatility. A particular concern is distortions induced by jumps in the range of option strikes used in computing VIX. In contrast, our use of trade and quote data from the S&P 500 index options market is intended to clarify the observed behavior of the VIX index. 2.3 Methodology 2.3.1 Measuring the variance risk premium Because the variance risk premium is not directly observable, we must infer it using the VIX index and other information. The variance risk premium (VRP) is the difference between VIX squared index (expressed in annualized terms) and expected annualized realized return variance 15 over the same 30-day horizon as VIX: VRP VIX2 E (RV ) (1a) t t t t,tNT Note that VIX can be interpreted as the price of a volatility swap (that is, a swap that pays based on the realized standard deviation of the underlying) while VIX squared approximates the price of a variance swap (Carr and Wu, 2006, page 15). Thus, VRP can be thought of as the variance swap rate risk premium.16 15 Realized returns include ex post risk premiums from the stock market, which is distinct from VRP, the ex ante premium for exposure to stochastic volatility risk paid by the derivatives market. 16 Carr and Wu (2009) study realized volatility minus risk neutral volatility, so their risk premiums are opposite in sign from ours. They find negative risk premiums for all stock indexes and for most stocks. 12",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 61,
    "chunk_index": 23,
    "word_count": 283,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "ex ante premium for exposure to stochastic volatility risk paid by the derivatives market. 16 Carr and Wu (2009) study realized volatility minus risk neutral volatility, so their risk premiums are opposite in sign from ours. They find negative risk premiums for all stock indexes and for most stocks. 12",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 61,
    "chunk_index": 24,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "We estimate the expected annualized realized volatility in (1a) with a linear forecast of realized volatility with one lag of VIX squared and the most recent value of monthly realized volatility as follows:17 E (RV )    VIX2   RV (1b) t t,tNT t tNT,t where the annualized realized variance at t over the past 30 days (typically 22 trading days) horizon to t is measured by: NT RV { f 2 }12 (1c) tNT,t tNTn n1 t represents a particular date and interval in the sample. N times T is the number of intraday returns used to estimate realized volatility from t to 30 days beyond. N-1 is the number of intraday intervals from 9:30am to 16:15pm (Eastern Standard Time) in a trading day, the Nth interval is overnight, and T is the number of trading days in a month, which is typically 22. f 2 is the square of the log rate of change of the forward price of the underlying stock basket expressed in percent to parallel the scale of VIX squared. We follow Carr and Wu (2009) and estimate the forward price using the cost-of-carry model.18 The multiplier 12 annualizes 17 Table 2 in Drechsler and Yaron (2011) suggests that this method has good forecast power. 18 f is estimated as the midpoint price of the SPY S&P500 ETF times one plus the Eurodollar yield divided by 1200, minus the expected dividend from t to (t+22N). SPY pays dividends quarterly, so we set the expected dividend to the actual dividend, if any, paid between (t-66N) and (t-44N). Aït-Sahalia, Mykland, and Zhang (2005) describe and measure the microstructural biases associated with high frequency variance computations. However, even if we used SPY trades rather than midpoints, the resulting bias is likely small given the high liquidity of SPY. For example, if we adopt the simple microstructure model of Roll (1984) and the two basis point median bid-ask spread of SPY during our sample period, the proportion of microstructure noise in a variance calculation is, by Aït-Sahalia, Mykland, and Zhang (2005), about 4 ½ percent. 13",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 61,
    "chunk_index": 25,
    "word_count": 350,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "liquidity of SPY. For example, if we adopt the simple microstructure model of Roll (1984) and the two basis point median bid-ask spread of SPY during our sample period, the proportion of microstructure noise in a variance calculation is, by Aït-Sahalia, Mykland, and Zhang (2005), about 4 ½ percent. 13",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 61,
    "chunk_index": 26,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "monthly realized volatility. Note that VRP is in terms of basis points while VIX is in terms of percentage. The regression that produces fitted values (equation 1b) is estimated in-sample with all available data points and yields an r-squared of 52.2% and strongly significant positive slopes on both terms. Carr and Wu (2006) note that the “…VIX index squared …can be regarded…as an approximation of the variance swap rate up to the discretization error and the error induced by jumps.” The realized volatility observed at time t, (1c), reflects both diffusion and jump components of the actual path taken by the forward price from t-NT to t. Thus, VIX squared equals the risk neutral ex ante variance plus additional risk neutral ex ante higher order cumulants due to jump risk (Martin, 2013, equation 10). Jump risks are particularly important for the period we study because it includes the recent global credit crisis. Carr and Lee (2009) note “The cataclysm that hit almost all financial markets in 2008 had particularly pronounced effects on volatility derivatives.…In particular, sharp moves in the underlying highlighted exposures to cubed and higher-order daily returns...[T]he market for single-name variance swap[s] has evaporated in 2009.” Jumps pose a challenge to empiricists attempting to decompose the VIX index into expectations and risk premium terms. The decomposition, (1a), requires a forecast of realized variation in the underlying asset, but, as under a peso problem, jumps are not always observed and their contribution to realized variation can be large (Todorov and Tauchen, 2011) and difficult to forecast (Bollerslev and Todorov, 2011). To address this issue, we adapt the method for incorporating both diffusion and jump elements into forecasts of realized variation in Andersen, Bollerslev, and Diebold (2007). Begin with their equation (5) for realized daily intraday bi-power variation: N BV  BV 2{ f f } (2a) t tN,t tNn tN(n1) n2 14",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 61,
    "chunk_index": 27,
    "word_count": 312,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "this issue, we adapt the method for incorporating both diffusion and jump elements into forecasts of realized variation in Andersen, Bollerslev, and Diebold (2007). Begin with their equation (5) for realized daily intraday bi-power variation: N BV  BV 2{ f f } (2a) t tN,t tNn tN(n1) n2 14 where μ is defined as the square root of (2/π). The expression converges to the estimated diffusion component of total variation with intraday data for one day. Therefore, the realized intraday jump component over one day equals total realized variation minus BV, with a correction for estimation errors in BV that could yield a negative estimated jump component (Andersen, Bollerslev, and Diebold, 2007, equation 8): J  max{(DRV BV ),0} (2b) t t t where: N DRV  DRV  f 2 (2c) t tN,t tNn n1 This computes total intraday variation for the day prior to day t as in equation 3 of Andersen, Bollerslev, and Diebold (2007). Next, define realized variation over arbitrary intervals: K ARV (1/K){DRV } (2d) t,tKN t(k1)N,tkN k1 This measure sums the daily realized intraday variation, (2c), over K, days following equation 9 in Andersen, Bollerslev, and Diebold (2007). To compute realized variation over a month, set K equal to T. While our goal is a variance forecast that extends out one month, the forecast procedure to be described presently also requires realized intraday variation over other numbers of days. We implement the HAR-RV-J model (equation 11 of Andersen, Bollerslev, and Diebold, 2007) with the following regression: 15",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 61,
    "chunk_index": 28,
    "word_count": 254,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "equal to T. While our goal is a variance forecast that extends out one month, the forecast procedure to be described presently also requires realized intraday variation over other numbers of days. We implement the HAR-RV-J model (equation 11 of Andersen, Bollerslev, and Diebold, 2007) with the following regression: 15",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 61,
    "chunk_index": 29,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "ARV   DRV  ARV  ARV J OJ  t,t22N 0 D tN,t W t5N,t M t22N,t J t o t t,tN (2e) The average monthly intraday variation is regressed on the most recent lag of the daily intraday variation, the average weekly intraday variation over the previous week, the average monthly intraday variation over the previous month, the most recent lag of the daily intraday jump, and a term to pick up the overnight close-to-open jump: OJ max{f 2 ,0} (2f) t t1_last,t2_first where t1_last is the last interval of day t and t2_first is the first interval of the next trading day. Equation (2e) is estimated in-sample with all available data points and yields results that are broadly similar to those reported by Andersen, Bollerslev, and Diebold (2007) for lower frequency data: an r-squared of 60.8%, strongly significant positive slopes on RV terms, and significantly negative slope on contemporaneous jump term, plus an insignificant coefficient on the overnight jump term. The negative sign indicates that the forecast removes any very recent jump from realized quadratic variance since jumps are unusual. Expected variation is the fitted value from the estimated regression coefficients from (2e), which is then annualized and adjusted from average volatility over the month to total volatility over the month:  E (RV )22*ARV *12 (2g) t t,t22N t,t22N This, in turn, is subtracted from VIX squared as in (2a) to produce an estimate of the variance risk premium, VRP_Jump, which accounts for the effect of jumps on realized quadratic 16",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 61,
    "chunk_index": 30,
    "word_count": 256,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "over the month to total volatility over the month:  E (RV )22*ARV *12 (2g) t t,t22N t,t22N This, in turn, is subtracted from VIX squared as in (2a) to produce an estimate of the variance risk premium, VRP_Jump, which accounts for the effect of jumps on realized quadratic 16",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 61,
    "chunk_index": 31,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "utility.19 We present subsequent results on the variance risk premium using the VRP_Jump measure rather than the simple VRP defined by equations (2a), (2b), and (2c).20 2.3.2 Explaining the high frequency evolution of VIX and its risk premium VIX squared is the risk neutral expected variance and reflects both expected uncertainty and expected variance risk premium (Carr and Wu, 2009): VIX2 = E (m ·RV ) = E (RV ) + Cov (m ,RV ) (3) t t t,T t,T t t,T t t,T t,T In (3), m is the scaled pricing kernel, and expectations are taken with the physical distribution, rather than the risk neutral distribution. The joint distribution of consumption, wealth, and marginal utility is implicit in the risk premium term. These variables are, in turn, related to fundamental economic conditions including economic news.21 Furthermore, VIX squared is approximately the price of a variance swap while the covariance term is the variance risk premium that we will estimate and examine. To understand the minute-by-minute evolution of VIX squared and its risk premium, we adopt two basic approaches. First, some of our data consists of macroeconomic news announcements which occur only rarely among our sample period which consists of over half a million one-minute intervals. Therefore, we adopt an event study approach to capture the associations between these information events and VIX. Second, the balance of our data 19 Bollerslev, Tauchen, and Zhou (2010) find (footnote 30) that a simpler HAR-RV forecast produces a monthly expected variance risk premium which has a correlation of 85% with the monthly realized variance risk premium (the swap rate minus the realized volatility). 20 Unreported results indicate that findings for VRP are similar to those for VRP_Jump but are less distinct from those for VIX. This suggests that the jump-adjusted risk premium more precisely isolates the risk premium component of VIX. 21 For example, a pricing kernel under the Arbitrage Pricing Theory can be a linear function of macroeconomic and financial surprises that are relevant to consumption, wealth, and marginal utility. 17",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 61,
    "chunk_index": 32,
    "word_count": 339,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "those for VIX. This suggests that the jump-adjusted risk premium more precisely isolates the risk premium component of VIX. 21 For example, a pricing kernel under the Arbitrage Pricing Theory can be a linear function of macroeconomic and financial surprises that are relevant to consumption, wealth, and marginal utility. 17",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 61,
    "chunk_index": 33,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "consists of continuously-observable financial market indicators and our measure of policy uncertainty news flows. Therefore, we adopt a regression approach to capture associations between these variables and VIX squared, as detailed below. Lacking the form of the pricing kernel and other structure, our regression specification assumes linear associations among changes in VIX squared (or changes in VRP_Jump) and proxies for the economic forces and controls previously described. We adopt the vector autoregressive model (VAR) of Sims (1980): J X μB 'X e (4) t j tj t j1 X is a vector of random endogenous variables observed at time t. The key element in the t vector is ΔVIX2, the change in VIX squared from the close of intraday interval t-1 to t, or t changes in its estimated risk premium series, VRP_Jump. As we document later, the 1-minute VIX series is highly serially correlated and, therefore, we work with first-differences in VIX and VRP_Jump rather than their levels. Given that VIX is approximately the price of a variance swap, first differences can also be interpreted as price changes. Other elements of X are financial and information measures such as the rate of t change of the Eurodollar futures price, the rate of change of the gold futures price, the flow of policy uncertainty news, and facets (return, buy-sell imbalance, change in trading volume, and change in bid-ask spread) of trading of the SPY ETF basket.22 µ is a vector of intercepts. The coefficient matrix, B, measures relationships between variables at lag j. j 22 SPY returns capture leverage and risk premium effects and changes in the market value of aggregate future corporate cash flows. The SPY buy-sell imbalance reflects the direction of the market. The changes in SPY trading volume and spread reflect changes in the level of market activity and liquidity. See Andersen (1996) for a discussion and treatment of trends and heteroskedasticity in volume. 18",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 61,
    "chunk_index": 34,
    "word_count": 318,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "value of aggregate future corporate cash flows. The SPY buy-sell imbalance reflects the direction of the market. The changes in SPY trading volume and spread reflect changes in the level of market activity and liquidity. See Andersen (1996) for a discussion and treatment of trends and heteroskedasticity in volume. 18",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 61,
    "chunk_index": 35,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "Because the individual dynamic coefficients of B do not have a straightforward interpretation, we use the innovation accounting method to summarize the dynamic structure and provide appropriate economic interpretation (Sims, 1980). Specifically, we can rewrite equation (4) as an infinite moving average process:  X A , t = 1, 2, …,T. (5) t i ti i0 Thus, the matrix A can be interpreted intuitively as the so-called impulse response. It is the i response of a variable at time t+i, to a one-time impulse in another variable or itself at time t, holding all other innovations at period t or earlier constant. Furthermore, the error from the n-step-ahead forecast of X conditional on information available at t-1,  is: t t1 n  A . (6) t,n l tnl l0 This leads to the forecast error variance decomposition, which measures how each innovation contributes to the variance of the total n-step-ahead forecast error for each element inX . t While impulse responses capture the statistical significance of dynamic causal linkages, variance decomposition can quantify the economic significance and relative importance of each variable. A fundamental problem of the traditional VAR is that the underlying shocks are recursively orthogonalized using the Cholesky decomposition. This imposes a causal ordering restriction: the first variable in the VAR system has a contemporary effect on other variables, the second variable has effects on the others except for the first one, and so on. Therefore, the orthogonalized impulse responses and the associated variance decomposition are sensitive to the ordering of the variables in the VAR. Economic theories rarely provide guidance for recursively causal orderings, making the imposed restrictions at least as arbitrary as what Sims (1980) called “incredible” identifying restrictions. 19",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 61,
    "chunk_index": 36,
    "word_count": 286,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "and so on. Therefore, the orthogonalized impulse responses and the associated variance decomposition are sensitive to the ordering of the variables in the VAR. Economic theories rarely provide guidance for recursively causal orderings, making the imposed restrictions at least as arbitrary as what Sims (1980) called “incredible” identifying restrictions. 19",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 61,
    "chunk_index": 37,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "To overcome this problem, we use the ordering-free generalized impulse responses and variance decompositions proposed by Pesaran and Shin (1998).23 In their method, a shock to a single variable in the system has both a direct subsequent effect on another variable and an indirect effect on that variable through its eventual impact on shocks to other variables. Put another way, the procedure integrates over all possible subsequent paths and cross-correlations with other variables to assess the total impact of a shock. In contrast, the standard recursive VAR’s shock in a particular equation is constrained to be independent of the contemporaneous shock in the preceding equation of the system but can affect contemporaneous shocks in other equations, while all future shocks are constrained to be zero. Thus, our use of the generalized VAR improves on Cholesky decomposition-based impulse responses by isolating the impact of a particular shock while imposing no constraints on its subsequent propagation through the system. 3. Empirical results and discussion 3.1 An overview of the data Table 1 summarizes the scheduled macro news announcement series collected. To assess the importance of each announcement series, we regress SPY returns on announcement surprises. The standardized announcement surprise (actual minus forecast, all divided by standard deviation of surprise; see Andersen et al; 2003) is computed for each of the 23 mostly monthly macroeconomic series. Of the twenty-five series, twelve show evidence of statistically significant correlation at the 5% level with contemporaneous returns on the SPY exchange-traded fund based on the S&P 500 index basket. Surprises are typically more significant during the financial crisis period. Correlation coefficients for significant series range from 20% to 80% in absolute value. The signs of the coefficients are often consistent 23 For an application of the generalized VAR, see Cheung, Lai, and Bergman (2004). 20",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 61,
    "chunk_index": 38,
    "word_count": 299,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "S&P 500 index basket. Surprises are typically more significant during the financial crisis period. Correlation coefficients for significant series range from 20% to 80% in absolute value. The signs of the coefficients are often consistent 23 For an application of the generalized VAR, see Cheung, Lai, and Bergman (2004). 20",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 61,
    "chunk_index": 39,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "with whether the series is cyclical or countercyclical. For example, measures of economic growth (quarterly final GDP, retail sales, personal income, personal consumption, factory orders, construction spending, business inventories) exhibit positive statistically significant correlations with SPY returns. Surprises in a countercyclical indicator (unemployment claims) are significantly negatively correlated with SPY returns. An employment indicator predicted to be pro-cyclical, nonfarm payroll employment, is found to be negatively correlated with SPY returns, perhaps due to the dominance of discount rate effects over cash flow effects (Boyd, Jagannathan, and Hu, 2005). Surprises to the government budget deficit, producer prices, and the Fed funds target have positive correlation with SPY returns, perhaps because they represent economic stimulus or expected recovery. We group the announcements which have a significant association with SPY returns for use in subsequent event studies. The “cyclical” group consists of the measures of economic growth (quarterly final GDP, retail sales, personal income, personal consumption, factory orders, construction spending, business inventories) and producer prices. Unemployment claims is strongly countercyclical plus is weekly rather than monthly so it serves as a “countercyclical” group. “Fiscal policy” consists of government budget deficit announcements while “monetary policy” consists of Fed funds target rate announcements. We place nonfarm payroll in its own group given the negative sign of its strong correlation with SPY returns is counterintuitive. Figure 1 shows 1-minute ticks of VIX squared and VRP_Jump during our sample period 9:30 to 16:00 of each trading day from the beginning of 2005 to the end of June 2010. All series are expressed in basis points of variance. It is clear that VIX squared peaked during the 2008 financial crisis. Similarly, the risk premium has fluctuated a lot since the summer of 2007. There are 530,124 1-minute VIX observations. Among the explanatory variables, only the Eurodollar (269,902 available observations) and gold (425,275 available observations) futures price rates of change series have substantially fewer observations than 21",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 61,
    "chunk_index": 40,
    "word_count": 318,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "the 2008 financial crisis. Similarly, the risk premium has fluctuated a lot since the summer of 2007. There are 530,124 1-minute VIX observations. Among the explanatory variables, only the Eurodollar (269,902 available observations) and gold (425,275 available observations) futures price rates of change series have substantially fewer observations than 21",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 61,
    "chunk_index": 41,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "the number for VIX. To make best use of our intraday data, missing values of continuous explanatory variables (that is, not the macroeconomic news announcements) are replaced with zero.24 Table 2 reports summary statistics for VIX squared and its risk premium at 1-minute intervals. The average VIX squared is 617.38 basis points. The average VRP_Jump is 38.03 basis points, meaning that the expected annualized variance risk premium over the coming 30 calendar days is 0.3803%. On average, the risk premium comprises only a small component, about 6%, of VIX squared. Also, levels of VIX squared and VRP_Jump exhibit very large and significant serial correlation approaching one, strongly suggesting a unit root. While levels of these variables are quite persistent, their first-differences are much less so. Thus, we conduct subsequent analysis with first-differences, rather than levels, of VIX squared and VRP_Jump as dependent variables. Table 2 also presents statistics for three subsamples, “Pre Crisis” from January 2005 to January 2007, “Crisis” from February 2007 to March 2009, and “Post Crisis” from April 2009 to June 2010. Average VIX squared is several times larger and becomes many times more volatile after the Pre Crisis period. The average VRP_Jump switches from negative to positive after the Pre Crisis period, suggesting relatively greater demand to hedge long volatility and less speculative buying of volatility. High values of VIX squared and its risk premium in the Post Crisis period suggests continuing high uncertainty in financial markets, perhaps due to the emerging crisis in the euro area. It is also evident that there is substantial negative first order serial correlation in first-differences of VIX squared and its risk premium. 24 See Hotchkiss and Ronen (2002) and Downing, Underwood, and Xing (2009). Other authors suggest interpolation schemes for filling in missing values (Andersen, Bollerslev, and Diebold, 2007, bottom of page 703) or use of lagged values (Andersen, Bollerslev, Diebold. and Vega, 2007, top of page 255). Filling missing trade indicator observations with zeros is not problematic because zero represents precisely the trading activity in an interval with no trades. 22",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 61,
    "chunk_index": 42,
    "word_count": 343,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "missing values (Andersen, Bollerslev, and Diebold, 2007, bottom of page 703) or use of lagged values (Andersen, Bollerslev, Diebold. and Vega, 2007, top of page 255). Filling missing trade indicator observations with zeros is not problematic because zero represents precisely the trading activity in an interval with no trades. 22",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 61,
    "chunk_index": 43,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "Negative first order serial correlation for changes in VIX squared is -0.194 for the entire sample period, and ranges from -0.037 in the Post Crisis sub period to -0.327 in the Pre Crisis sub period.25 Table 3 presents summary statistics on VIX squared by day of the week and time of day. Day-of-the-week and time-of-day return seasonal patterns can result from patterns in information flow during trading and non-trading hours, inventory management by traders, and heightened uncertainty when trading commences. Panel A shows that VIX squared is typically slightly higher on Mondays, averaging 656 basis points versus 613 to 637 basis points on other days of the week. A test of the hypothesis that the averages on each day are jointly equal is strongly rejected. Serial correlation of VIX squared is very high, approaching one. Panel B shows that, during the first half hour of the trading day, there is evidence of a very small “smirk”, with average VIX squared of 636 basis points versus 628 to 631 during other intraday intervals. This parallels the finding in Panel A of heightened volatility on Mondays, perhaps due to information arrival and pent-up demand for immediacy after the weekend. However, the hypothesis that the averages in each period are equal cannot be rejected. Standard deviation is also higher during the opening half hour, while serial correlation of VIX squared is lower in the first and, particularly, last half hours of the day. During the 15 minute period after the NYSE has ceased trading, the standard deviation of VIX squared is only a fraction of its value when the NYSE is open. This suggests that much of the variability in VIX squared relates to trading activity in the underlying S&P 500. Panel B also summarizes close-to-open VIX squared. The volatility of close-to-open VIX is about double for weekends compared to weeknights. In contrast, the average overnight VIX squared spanning the “roll” period (third Friday of each month when the S&P500 options used to compute VIX change) is larger and many time more volatile than the 25 The prominent negative autocorrelation in VIX squared changes also emerges from five minute intervals. All of our regression-related findings reported below are also observed in 5 minute intervals. 23",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 61,
    "chunk_index": 44,
    "word_count": 372,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "each month when the S&P500 options used to compute VIX change) is larger and many time more volatile than the 25 The prominent negative autocorrelation in VIX squared changes also emerges from five minute intervals. All of our regression-related findings reported below are also observed in 5 minute intervals. 23",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 61,
    "chunk_index": 45,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "typical average weekday close-to-open change. Table 4 presents the Pearson correlation matrix for regression variables. Some highlights of the cross correlations of changes in VIX squared and VRP_Jump with other variables are as follows. VIX squared rises with Eurodollar futures returns, that is, as Eurodollar yields decline (H2a). However, rises in VRP_Jump occur as Eurodollar yields rise. This suggests substantial differences between the fundamental uncertainty and risk aversion components of VIX squared, which diverge in their responses to short term interest rates. A divergence is also observed with the flow of policy news: VIX squared is not significantly correlated with it while VRP_Jump is negatively correlated. The substantial negative correlation of SPY return (and buy-sell imbalance) with VIX squared and VRP_Jump is consistent with the SPY return’s role as a control for leverage or volatility feedback. The substantial negative correlation of VIX squared and its risk premium with gold futures returns is not consistent with gold serving as a control for the hedging demand that drives VIX. Table 4 also presents interesting correlations among the explanatory variables. SPY returns are negatively correlated with the flow of policy uncertainty news. SPY and gold returns are positively correlated, which is not consistent with gold as a safe haven from declining equity markets. SPY returns decline when Eurodollar futures prices rise (that is, when Eurodollar yields decline), suggesting flight-to-quality or expectations of monetary easing when stock performance is poor. 3.2 Event study responses to macroeconomic news releases Table 5 summarizes responses of VIX squared and its estimated risk premium to the arrival of macroeconomic news in the form of government announcements. The event response is reported for one to five minutes prior to an announcement and zero to five minutes after the announcement, with asterisks indicating significance at the 10%, 5%, or 1% levels. 24",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 61,
    "chunk_index": 46,
    "word_count": 302,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "its estimated risk premium to the arrival of macroeconomic news in the form of government announcements. The event response is reported for one to five minutes prior to an announcement and zero to five minutes after the announcement, with asterisks indicating significance at the 10%, 5%, or 1% levels. 24",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 61,
    "chunk_index": 47,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "Panel A summarizes event study responses for the entire January 2005 to June 2010 sample period. There is only slight evidence of heightened risk neutral uncertainty around the times that macroeconomic news is announced, H1a. VIX squared shows a marginally significantly rise prior to monetary news. In contrast, the finding that VRP_Jump decreases with cyclical and counter-cyclical news suggests the option market demands a smaller risk premium once macro news has been revealed. Panel B summarizes event study responses during the January 2005 to January 2007 Pre Crisis period. There are no significant reactions for VIX but some negative reactions by its risk premium. Panel C summarizes responses for the February 2007 to February 2009 Crisis period. Unlike Pre Crisis, there are pronounced reactions for VIX. In particular, VIX squared rises around times that cyclical, counter-cyclical, and monetary news are released. This is consistent with the notion, H1a, that these releases increase uncertainty about aggregate equity value. Interestingly, VRP_Jump does not track the behavior of VIX squared but appears largely unchanged around the release of macro news during the Crisis period. This again suggests that the fundamental uncertainty component of VIX squared is distinct from its risk aversion component. Panel D summarizes responses for the March 2009 to June 2010 Post Crisis period. During this period VIX squared declines around cyclical news but is unresponsive to other news series. VRP_Jump also recedes around cyclical news. Panel E presents event study results for the two six-month periods for which we also measure SPX index option trading conditions. SPX index option trading volume rises around cyclical news and declines around counter-cyclical and monetary news arrival. SPX index quote arrival rises around all but the nonfarm payroll news series. The other SPX measures (imbalance, put-call ratio, bid-ask spread) show few if any significant responses to the macro news series. On balance, the evidence on event study responses is sometimes consistent with increased risk neutral volatility around macroeconomic news releases, H1a. The behavior of 25",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 61,
    "chunk_index": 48,
    "word_count": 331,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "the nonfarm payroll news series. The other SPX measures (imbalance, put-call ratio, bid-ask spread) show few if any significant responses to the macro news series. On balance, the evidence on event study responses is sometimes consistent with increased risk neutral volatility around macroeconomic news releases, H1a. The behavior of 25",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 61,
    "chunk_index": 49,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "the VRP_Jump risk premium is distinct from that of VIX squared, suggesting that fundamental uncertainty and risk aversion can move in opposite directions. Although the number of observations for fiscal, monetary, and nonfarm payroll news is small for the sub periods and we do not study the effect of the content of the announcements, it appears that event study responses to the arrival of macro news are particularly pronounced during the Crisis period. It is particularly interesting that monetary news, but not fiscal news, is associated with changes in VIX only during the Crisis period. This suggests that the impact of monetary policy, or investor attention to it, was particularly significant in the depths of the crisis, while fiscal policy was less critical. More generally, the response to cyclical news varies substantially across pre crisis, crisis, and post crisis periods. 3.3 VAR estimates Having used event studies to explore the associations between VIX and the infrequent but important macroeconomic news announcements, we next use the generalized VAR as described earlier to examine associations between VIX and other continuously-observed variables. Because innovation accounting as in equation (5) permits economic interpretation, we focus our discussion of generalized VAR findings on impulse response plots and forecast error variance decompositions rather than present tables with many estimated coefficients from the VAR system. Figure 2 presents generalized impulse response plots for the changes of VIX squared (Panel A) and VRP_Jump (Panel B) for the Pre Crisis (January 2005 to January 2007), Crisis (February 2007 to February 2009), and Post Crisis (March 2009 to June 2010) periods. Each estimated impulse response is plotted in a (5%, 95%) confidence band to assess whether the response is statistically significant across the 15 minute span of each plot. Note that the first point on each plot represents zero lag. 26",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 61,
    "chunk_index": 50,
    "word_count": 301,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "2009), and Post Crisis (March 2009 to June 2010) periods. Each estimated impulse response is plotted in a (5%, 95%) confidence band to assess whether the response is statistically significant across the 15 minute span of each plot. Note that the first point on each plot represents zero lag. 26",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 61,
    "chunk_index": 51,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "Panel A of Figure 2 indicates a prominent negative impact on the change of VIX squared from its own lagged shock for a minute during the Pre Crisis and Crisis periods. This effect is much smaller in the Post Crisis period. These findings are consistent with the unconditional summary statistics in Table 2 that indicate negative serial correlation in the raw VIX squared changes, most notably in the Pre Crisis and Crisis periods. The patterns are similar though larger in scale for VRP_Jump in Panel B. We will have more to say about the apparent mean reversion of VIX squared later in the paper. Figure 2 also shows that an impulse in SPY return is associated with decreases in VIX squared and VRP_Jump for a minute or two afterwards, which is consistent with the classic leverage effect. The difference in impulse responses to the Eurodollar futures across the Pre Crisis, Crisis, and Post Crisis periods is particularly interesting. In the Pre Crisis period, the confidence band indicates that the VIX squared response to the Eurodollar futures return is indistinguishable from zero. During the crisis, the response of VIX squared to the Eurodollar futures return is significantly positive for a minute or two. Given that the Eurodollar futures price rises when the Eurodollar yield declines, this is consistent with ineffective monetary stimulus, H2a. In the Post Crisis period, an impulse in the Eurodollar futures return yields a negative change in VIX squared for one minute later. This is consistent with effective monetary stimulus, H2b, and suggests more credibility for Fed policy once the economy exited the worst of the crisis.26 The scale of the responses is much larger in the Crisis and Post Crisis periods. The responses for VRP_Jump in Panel B are broadly similar except for the Pre Crisis period for which the initial impulse is significantly positive, thus confirming the contrast between the Pre Crisis and Post Crisis periods. An impulse to the gold futures return yields no significant VIX squared or VRP_Jump responses in the Pre Crisis period but significantly negative changes in VIX squared one and 26 Using monthly data from 1990 to 2007, Bekaert, Hoerova, and Lo Duca (2013) find monthly VIX and real interest rate show persistently positively correlation, becoming negative after 13 months. 27",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 61,
    "chunk_index": 52,
    "word_count": 380,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "VIX squared or VRP_Jump responses in the Pre Crisis period but significantly negative changes in VIX squared one and 26 Using monthly data from 1990 to 2007, Bekaert, Hoerova, and Lo Duca (2013) find monthly VIX and real interest rate show persistently positively correlation, becoming negative after 13 months. 27",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 61,
    "chunk_index": 53,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "two minutes out during the Crisis and Post Crisis period. If VIX and gold do not move in the same direction, it suggests that gold is not an indicator of hedging demand or fear in the same way that VIX is. During the Crisis and Post Crisis periods, VIX squared increases within a few minutes of an impulse to SPY volume. In contrast, VRP_Jump tends to decline. During all periods, the negative response of VIX squared to innovations in SPY imbalance mirrors the leverage or risk premium effect evident in the response to the SPY return. There are significant, reversing responses of VIX squared to SPY spread impulses in the Post Crisis period. There are significant responses of VIX squared to impulses in the flow of policy uncertainty news, with a reversing pattern in the Pre Crisis period and positive responses spread over several minutes in the Crisis and Post Crisis periods. Reversal patterns suggest temporary price effects (see, for example, Holthausen, Leftwich, and Mayers; 1990). Interestingly, Panel B shows a substantially different pattern for VRP_Jump. An impulse to the policy news flow yields a significantly negative impulse to VRP_Jump in the Crisis and Post Crisis sub periods, suggesting that news flow can increase ex ante volatility while dampening the risk premium demanded in the options market.27 Table 6 presents the generalized forecast error variance decompositions for changes in VIX squared. Entries in Table 6 give percentages of forecast error variance of VIX squared at several horizons, which are attributable to earlier shocks from each other series (including VIX squared).28 We list horizons of 0 (contemporaneous time), 1 and 2 minutes (short horizon), and 10 and 20 minutes ahead (longer horizon). The table is divided into sections for Pre Crisis (January 2005 to January 2007), Crisis (February 2007 to February 2009), and Post Crisis (March 2009 to June 2010) periods. 27 Theoretical models such as that in Bekaert, Engstrom, and Xing (2009) allow for complex effects of uncertainty versus risk aversion across time and across assets. 28 Generalized variance decompositions do not necessarily sum to 100 percent due to non-zero covariance between the original shocks. The numbers presented in the table are normalized so that the total adds up to 100. 28",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 61,
    "chunk_index": 54,
    "word_count": 372,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "allow for complex effects of uncertainty versus risk aversion across time and across assets. 28 Generalized variance decompositions do not necessarily sum to 100 percent due to non-zero covariance between the original shocks. The numbers presented in the table are normalized so that the total adds up to 100. 28",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 61,
    "chunk_index": 55,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "It is interesting to note that VIX squared is explained primarily by its own lags at all horizons. For the Pre Crisis period, the decomposition assigns over 99% of forecast errors to lagged innovations in VIX squared changes. This declines subsequently, but remains above 90% in the Crisis period and close to 75% in the Post Crisis period. The only other variables that explain more than one percent of forecast errors are the SPY return in the Crisis and Post Crisis periods, and, to a lesser degree, the Eurodollar return and SPY buy-sell imbalance in the Post Crisis period. Note that the fraction of forecast error explained by SPY return is highest in the Post Crisis period. If resolution of the financial crisis included net de-leveraging by S&P 500 firms, we would expect the leverage effect to decrease, not rise, after the crisis. This suggests that at least part of the impact of SPY return is due to something beyond the classic leverage story. We do not report the variance decompositions for VRP_Jump because they are largely very similar to what is reported for VIX squared in Table 6. The only noticeable difference is that, for VRP_Jump in the Post Crisis period, the SPY imbalance becomes less important and the policy uncertainty news flow becomes more important. Interestingly, the sign of the policy news response differs for VRP_Jump, suggesting that, while expected uncertainty rises around news (H3a), the risk premium declines. Furthermore, the scale of the impulse response of VRP_Jump to SPY return suggests that a large fraction of the impulse response of VIX squared to SPY return is due to the response of its risk premium component. However, the variance decompositions for all series remain dominated by autocorrelation and, to a lesser extent, leverage and risk premium effects reflected in the relationship with SPY return.29 4. Diagnosing the autocorrelation of VIX squared changes 29 Note that all generalized impulse response and variance decomposition results are based on one-minute intervals but are qualitatively similar if computed with five-minute intervals. 29",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 61,
    "chunk_index": 56,
    "word_count": 340,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "to a lesser extent, leverage and risk premium effects reflected in the relationship with SPY return.29 4. Diagnosing the autocorrelation of VIX squared changes 29 Note that all generalized impulse response and variance decomposition results are based on one-minute intervals but are qualitatively similar if computed with five-minute intervals. 29",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 61,
    "chunk_index": 57,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "Our empirical tests to this point demonstrate that the arrival of macroeconomic news, the evolution of the short term interest rate, and the flow of policy uncertainty news affect the behavior of VIX. However, the most prominent component of the evolution of VIX is the pronounced dependence of changes in VIX squared on its own lag. We explore this dimension of VIX further in this section. VIX squared is a weighted midpoint price of a portfolio of options and, thus, reflects trading behavior in the underlying S&P500 options market. Therefore, we extend our study of VIX to include the intraday behavior of the index options market. In their study of high frequency exchange rates, Andersen and Bollerslev (1998) note (page 222) that “the pronounced activity pattern in intraday volatility suggests a significant role for the trading process itself.” As described in Section 2.2 above, we have obtained a sample of two six-month periods (July to December 2006 and September 2008 to February 2009) of SPX SP500 index options quotes30 and trades. Given that VIX is computed with out-of-the-money puts and calls only, we restrict our study to out-of-the-money option quotes and trades. Table 7 presents univariate summary statistics on our raw SPX trading measures. The most notable aspect of the summary statistics is the large amount of activity in these options. During the July to December 2006 period, we record an average of 1505 quotes per minute and 672 trades per minute. During the September 2008 to February 2009 period, quote arrival rises to 8864 per minute while trading volume remains about the same at 664 per minute. Thus the ratio of quotes to trades rises many times in the Crisis period, suggesting many more unfilled orders, or strategic behaviors like pinging and quote-stuffing. The put-call ratio, bid-ask spread, and 30 The designated primary market maker (DPM) acts as the “order book official” that organizes the book of limit orders which originate from market makers, floor brokers, the public, and the DPM itself. See Anand and Weaver (2006) and the exchange’s web page (http://wallstreet.cch.com/CBOETools/PlatformViewer.asp?selectednode=chp_1_1_5_5&manual=%2FCBOE% 2Frules%2Fcboe-rules%2F). 30",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 61,
    "chunk_index": 58,
    "word_count": 346,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "ratio, bid-ask spread, and 30 The designated primary market maker (DPM) acts as the “order book official” that organizes the book of limit orders which originate from market makers, floor brokers, the public, and the DPM itself. See Anand and Weaver (2006) and the exchange’s web page (http://wallstreet.cch.com/CBOETools/PlatformViewer.asp?selectednode=chp_1_1_5_5&manual=%2FCBOE% 2Frules%2Fcboe-rules%2F). 30",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 61,
    "chunk_index": 59,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "buy-sell imbalance are broadly similar across the two periods. The large average size of the bid-ask spread (0.07 of the midpoint, in both six month periods) is consistent with the often surprisingly substantial percentage cost of index options trading (George and Longstaff, 1993). Table 8 presents cross correlations among the options trading measures and with VIX squared and its estimated risk premium. Between the VIX measures and the SPX variables, the most noticeable effect is negative correlation between changes in VIX squared (or its risk premium, VRP_Jump) and the SPX options buy-sell imbalance. The correlations are negative, indicating more aggressive selling of SPX options when VIX squared rises. Among the SPX variables, the largest correlation is between SPX spread and SPX put-call ratio, at about 40% in the June to December 2006 period. Thus, the supply of liquidity appears to contract just as the interest in index hedges (that is, puts) rises. In both periods, the correlation between SPX spread and SPX quote arrival is about minus 20%, which is consistent with these two variables reflecting two dimensions of index option liquidity. Next, we parallel our earlier findings on impulse responses and variance decompositions using the options data over the reduced time span for which we have data. We do not report the results because the impact of the SPX variables is small. Generalized impulse response plots for the two six month periods for which we have SPX index options data return are similar to the full period plots of Figure 2. Among the SPX variables, there are only a few instances where shocks to an SPX variable appear to have a significant effect on VIX or its risk premium. A shock to the number of SPX quotes is associated with decreases in VRP_Jump within a few minutes. A shock to the SPX buy-sell imbalance is associated with declines in VIX and its risk premium for several minutes. Variance decompositions including the SPX data return results similar to those in Table 6. Lagged VIX squared and leverage effects dominate, and none of the SPX measures explains more than a fraction of a percent of the forecast errors. 31",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 61,
    "chunk_index": 60,
    "word_count": 358,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "declines in VIX and its risk premium for several minutes. Variance decompositions including the SPX data return results similar to those in Table 6. Lagged VIX squared and leverage effects dominate, and none of the SPX measures explains more than a fraction of a percent of the forecast errors. 31",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 61,
    "chunk_index": 61,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "Finally, we employ our SPX options data to understand the prominent association between current and future changes in VIX squared documented by our summary statistics, generalized impulse response plots, and forecast variance decompositions. Risk neutral stock index volatility has long been known to display mean-reversion in daily observations (Stein, 1989). Early models of stochastic volatility option pricing such as Wiggins (1987) allow for mean-revision in the parameter estimates of the dynamics of the underlying asset price. If stochastic variance is mean-reverting, changes in risk neutral volatility over the life of an option, or functions of it such as VIX, will display negative serial correlation. There is little empirical research on the economic forces underlying mean-reverting stochastic volatility. We structure our test and interpretation around theories of liquidity provision. For this part of the paper, it is useful to think of VIX squared as the price of a traded asset, a variance swap. The market microstructure literature suggests how market maker behavior can affect prices. In theoretical models such as those of Grossman and Miller (1988) and Nagel (2012), market makers respond to demand for immediacy, buying securities when other traders want to sell and selling when other traders want to buy. This induces negative serial correlation in price changes. Negative serial correlation is more severe if the costs, risks, and constraints of market making rise because of weaker liquidity provision in response to demand for immediacy. Put another way, weak liquidity provision results in more severe market impact which is only eventually corrected. VIX squared is a weighted average of S&P500 index option quotes. Thus, our finding of substantial, rapidly decaying negative autocorrelation in VIX squared changes can reflect liquidity provision in the underlying index options market: H4a: Greater liquidity provision as proxied for by more quotes, smaller bid-ask spread, and more trading volume is associated with less severe negative serial correlation. We also predict that liquidity provision rises around times of information arrival: 32",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 61,
    "chunk_index": 62,
    "word_count": 325,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "squared changes can reflect liquidity provision in the underlying index options market: H4a: Greater liquidity provision as proxied for by more quotes, smaller bid-ask spread, and more trading volume is associated with less severe negative serial correlation. We also predict that liquidity provision rises around times of information arrival: 32",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 61,
    "chunk_index": 63,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "H4b: Liquidity provision rises at times of macroeconomic and policy news arrival as market makers respond to increased demand for hedging. H4b assumes that traders acting as market makers meet demand due to hedging and fear around news arrival. Table 9 presents regressions of changes in VIX squared on its first lag including interactive terms for a simple look at the conditional first-order autocorrelation of VIX squared changes. By selecting a lag length of only one minute, we assume that the effects that drive the negative serial correlation of changes in VIX squared occur very rapidly, as would be expected in a very active options market.31 The form of the regression specification is: ΔVIX2 = α + (β + Γ’Z )·ΔVIX 2 + Θ’Z + ε (7) t t-1,t t-1 t-1,t t-1,t The change in VIX squared is regressed on a constant and a vector, Z , of variables which t-1,t allow for a conditional relationship between the change in VIX squared and its own first lag. Coefficients are an intercept, α, a constant for the base level of serial correlation, β, and vectors Γ and Θ. For comparison, we also include a simple regression in which the only independent variable is the first lag of the change in VIX squared. Across the full specifications, 2 and 4, for both time periods, the constant slope coefficient on lagged VIX squared changes is significantly negative, -0.386 for June to December 2006 and -0.250 for September 2008 to February 2009. This echoes the summary statistics and generalized impulse responses presented earlier in the paper. 31 Although serial correlation and generalized impulse response plot for VIX squared change do not measure exactly the same thing, Figure 2 suggests that the negative response of VIX squared change to its own lagged shock is not significant after one minute. 33",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 61,
    "chunk_index": 64,
    "word_count": 305,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "impulse responses presented earlier in the paper. 31 Although serial correlation and generalized impulse response plot for VIX squared change do not measure exactly the same thing, Figure 2 suggests that the negative response of VIX squared change to its own lagged shock is not significant after one minute. 33",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 61,
    "chunk_index": 65,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "The proposition that more liquidity provision is associated with less negative serial correlation of changes in VIX squared, H4a, can be tested with some of the variables we have constructed. If liquidity provision implies smaller bid-ask spreads and more quote and trade activity,32 we can measure associations between those variables and the degree of negative serial correlation of VIX squared changes. Note that interpretation of the interactive terms that allow conditional autocorrelation is complicated because the sign of the one-minute change in VIX squared can be positive or negative. Furthermore, in contrast to the positive interpretation of a stock index rise, an increase in VIX reflects both higher uncertainty and a greater willingness to pay to hedge uncertainty. During the first of our two periods with options data (July to December 2006), we find a significantly negative slope, -10.559, for lagged VIX squared change times lagged SPX bid-ask spread change. The impact of a one standard deviation change (0.04 from Table 7) in spread on first order autocorrelation is -10.559 times 0.04 times the sign of the change in VIX squared, a number around 0.40 in absolute size. When an effect of this magnitude is added to the base first order correlation of -0.386, the autocorrelation becomes close to zero. If subtracted, the level of negative serial correlation doubles. Therefore, if VIX squared increases while the SPX bid ask spread increases (decreases), the autocorrelation of VIX squared changes becomes more negative (positive). This is consistent with H4a, which predicts more severely negative autocorrelation with a wider bid ask spread. In contrast, if VIX squared decreases and the SPX bid ask spread increases (decreases), the autocorrelation of VIX squared changes becomes more positive (negative). This is not consistent with H4a. Thus, a liquidity provision effect from bid-ask spread to serial correlation is observed only when VIX squared is rising. Put another way, this facet of liquidity provision only appears with increases in hedging demand or fear that drive up VIX squared. However, no such effect 32 Quotes represent the offering of liquidity while volume represents taking up these offers. 34",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 61,
    "chunk_index": 66,
    "word_count": 349,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "correlation is observed only when VIX squared is rising. Put another way, this facet of liquidity provision only appears with increases in hedging demand or fear that drive up VIX squared. However, no such effect 32 Quotes represent the offering of liquidity while volume represents taking up these offers. 34",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 61,
    "chunk_index": 67,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "is observed in the second of our two periods. The slope coefficient on the interactive for lagged VIX squared change times spread is statistically insignificant. This suggests that the ability and willingness to provide liquidity was severely degraded by the credit crisis. Our second proxy for liquidity provision is the number of quotes arriving per minute. The slope for lagged VIX squared change times lagged quote arrival is significantly negative, -0.0005, during the June to December 2006 period. A one standard deviation (1024.32) increase in quote flow times -0.0005 implies a change in scale in first order serial correlation of about 0.50, which is sufficiently large to either neutralize or double the basic first order serial correlation of -0.386. Therefore, when VIX squared rises, an increase (decrease) in quote arrival is associated with more (less) severely negative serial correlation in VIX squared. Unlike what is reported for VIX squared change times spread, this is not consistent with H4a.33 On declines in VIX squared, however, the pattern is consistent with greater quote arrival associated with less severe negative serial correlation, H4a. For the September 2008 to February 2009 period, the slope coefficient, 0.067, is marginally significantly positive, which is opposite in implications from the earlier period. Thus, the willingness of liquidity providers to accommodate orders in a rising VIX environment versus a falling VIX environment changes sign from before the crisis to the end of the crisis. Hendershott and Riordan (2013) study algorithmic trading on the German stock exchange and offer some insights on associations between trading, bid-ask spreads, order flow, and liquidity provision. Algorithmic traders can contribute to liquidity provision, in addition to the impact of traditional market makers. While our SPX option trading records do not distinguish orders of algorithmic traders, we can imagine how some of the patterns we document above are consistent with their presence. Hendershott and Riordan (2013) find that 33 It is plausible that spreads and quotes do not behave as predicted by H4a. For example, during a quiet period with little news to trade on and less frequent quote arrival, liquidity providers are not afraid to offer narrow bid-ask spreads. 35",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 61,
    "chunk_index": 68,
    "word_count": 357,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "presence. Hendershott and Riordan (2013) find that 33 It is plausible that spreads and quotes do not behave as predicted by H4a. For example, during a quiet period with little news to trade on and less frequent quote arrival, liquidity providers are not afraid to offer narrow bid-ask spreads. 35",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 61,
    "chunk_index": 69,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "algorithmic traders tend to supply liquidity only when liquidity is expensive. They respond quickly to events, particularly when spreads are wide. This can explain apparently anomalous findings, such as slope coefficients on spread that validate our liquidity provision prediction while slopes on quote frequency reject it. Furthermore, quote arrival can result in unfilled orders, represent strategic behavior rather than reflecting liquidity provision, or originate from different types of traders whose interest in hedging, speculating, or supplying liquidity varies widely over time. Our third proxy for liquidity provision is SPX trading volume. In their early study of S&P 100 index options, George and Longstaff (1993) report that the relation between trading volume and bid-ask spread is complex, suggesting distinct facets of liquidity. In the June to December 2006 period, lagged VIX squared change times trading volume has a positive slope coefficient, suggesting liquidity provision when both VIX squared and trading volume are rising, but not when VIX squared is declining. The estimated slope of 0.00004 times the standard deviation, 2054.02, of changes in SPX volume suggests that a one standard deviation impulse to volume is associated with a change of about one-fifth in the base negative first order serial correlation of VIX squared changes. In the September 2008 to February 2009 period, its slope coefficient is not statistically significant. Whether a rise in VIX attracts liquidity providers to meet demand or causes them to be more cautious varies before versus after the crisis. Next, we look for evidence that liquidity provision increases at times when macroeconomic or policy uncertainty news arrives, H4b. The slope on the interactive term for VIX squared change times a dummy for macroeconomic news arrival is statistically insignificant in both periods. In contrast, the slope, 20.701, on the interactive term for VIX squared change times the flow of policy uncertainty news is significant and positive during the July to December 2006 period. This is consistent with liquidity provision rising and, thus, dampening negative serial correlation, when both VIX squared and the flow of policy 36",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 61,
    "chunk_index": 70,
    "word_count": 338,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "20.701, on the interactive term for VIX squared change times the flow of policy uncertainty news is significant and positive during the July to December 2006 period. This is consistent with liquidity provision rising and, thus, dampening negative serial correlation, when both VIX squared and the flow of policy 36",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 61,
    "chunk_index": 71,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "uncertainty news increase. In contrast, the slope coefficient on the interactive term for VIX squared change times policy uncertainty news flow is statistically insignificant during the September 2008 to February 2009 period, suggesting the breakdown of this dimension of liquidity provision as a result of the crisis. We can also interpret the results on the lagged VIX squared change times lagged put-call ratio with liquidity provision. The variable has a significantly positive slope coefficient in both periods. Thus, when both VIX squared and orders for index puts are rising, the serial correlation of VIX squared is less negative. Perhaps liquidity provision is attracted when demand for index puts and variance swaps is high. The scale of the effect is substantial. In the first (second) period, a one standard deviation change, 0.69 (0.37), in the put-call ratio yields an impact on first order serial correlation of 0.19 (0.706) times 0.69 (0.37) times the sign of the change in VIX squared. Interestingly, this effect is economically larger in the second period. Finally, the estimate regression slope for lagged VIX squared change times SPX buy-sell imbalance reflects a variety of forces ranging from market impact to positive feedback trading, the idea that the direction of prices and the direction of trading tend to run together (De Long, Shleifer, Summers, and Waldmann, 1990b). For the July to December 2006 period prior to the financial crisis, Table 9 reports a significantly positive slope coefficient for lagged VIX squared change times lagged SPX buy-sell imbalance. This is consistent with positive feedback trading: the autocorrelation of VIX squared changes is less severe when SPX buying pressure tends to follow the direction of the VIX price change. The regressions of Table 9 were confined to one lag because economic intuition predicts very quick intraday associations among these variables, and a small specification can be presented compactly. In order to examine what we may be missing when we limit specification (7) to one lag, we estimate a specification with both one and two lags for all terms. The unreported estimated coefficients and their significance for the first lag terms are 37",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 61,
    "chunk_index": 72,
    "word_count": 352,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "small specification can be presented compactly. In order to examine what we may be missing when we limit specification (7) to one lag, we estimate a specification with both one and two lags for all terms. The unreported estimated coefficients and their significance for the first lag terms are 37",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 61,
    "chunk_index": 73,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "similar to that reported for the one lag specification. The effects observed at the first lag either weaken or become statistically insignificant at the second lag. In summary, the results reported in Table 9 suggest that liquidity provision in the SPX options market differs radically before versus during the financial crisis. The r-squareds for the regressions are weaker for the second period, both for the simple autoregressions and the conditional autoregressions. This is consistent with more risk and less available capital for liquidity provision as a result of the crisis. 5. Summary and conclusions While stock index volatility is an important factor in capital markets and the economy generally, there is still much to be learned and explained. Zhou and Zhu (2012) note that how “volatility and volatility risk premiums…are determined by institutional trading and by the real economy and how to incorporate them into a general equilibrium model are all open questions”. Our paper describes and interprets associations between macroeconomic factors, trading conditions, and risk neutral expected variance and its risk premium component. Our high frequency approach reveals new facets of the relationship between stock volatility and macro and microeconomic conditions. While it is increasingly common to see VIX used as an explanatory variable in empirical studies, our work reminds researchers, practitioners, and anyone who follows the VIX that this popular indicator has roots in more fundamental forces. Like any financial market price, VIX reflects both macroeconomic forces and by-products of the trading process. Macroeconomic conditions affect VIX, as does liquidity provision suggested by patterns in the mean reversion of VIX squared. Taking the question of what drives volatility to minute-by-minute data uncovers interesting associations. A radically different stream of thought ascribes excess stock market 38",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 61,
    "chunk_index": 74,
    "word_count": 287,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "macroeconomic forces and by-products of the trading process. Macroeconomic conditions affect VIX, as does liquidity provision suggested by patterns in the mean reversion of VIX squared. Taking the question of what drives volatility to minute-by-minute data uncovers interesting associations. A radically different stream of thought ascribes excess stock market 38 volatility to popular opinion and psychology.34 This suggests directions for further research on VIX. Because theoretical models in which investor utility does not depend only on future consumption can yield excessively volatile stock returns (Barberis, Huang, and Santos, 2001), VIX can be correlated with investor sentiment, behavioral biases, and other non-rational factors. The noise trader model of De Long et al (1990a) motivates many papers that explore the effect of noise trader risks on returns (for example, Lee, Shleifer and Thaler, 1991) and suggests useful proxy variables.35 We can also explore more thoroughly the impact of trader behavior and market microstructure effects. Future research can more thoroughly document the associations between trading conditions, option pricing, and changes in the VIX index.36 Finally, it will be useful to untangle fundamental forces that can affect VIX simultaneously, such as how sentiment is related to liquidity (Baker and Stein, 2004) or under-reaction or overreaction to news (Barberis, Shleifer, and Vishny, 1998). 34 See Shiller (2000) for an overview and Shiller (1981) for classic evidence. 35 For example, Han (2008) relates daily pricing of S&P 500 index options to daily and weekly measures of institutional investor sentiment. 36 See, for example, Drechsler (2013) on the volatility skew in option pricing. 39",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 61,
    "chunk_index": 75,
    "word_count": 257,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "1998). 34 See Shiller (2000) for an overview and Shiller (1981) for classic evidence. 35 For example, Han (2008) relates daily pricing of S&P 500 index options to daily and weekly measures of institutional investor sentiment. 36 See, for example, Drechsler (2013) on the volatility skew in option pricing. 39",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "1. Introduction",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 61,
    "chunk_index": 76,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "Admati, A. R. and Pfleiderer, P., 1988, A theory of intraday patterns: volume and price variability, Review of Financial Studies 1, 3 – 40. Aït-Sahalia, Y., Mykland, P.A., and Zhang, L., 2005. How often to sample a continuous-time process in the presence of market microstructure noise, Review of Financial Studies 18, 351 – 416. Aït-Sahalia, Y., and Yu, J., 2009, High frequency market microstructure noise estimates and liquidity measures, Annals of Applied Statistics 3, 422 - 457. Anand, A., and Weaver, D. G., 2006, The value of the specialist: Empirical evidence from the CBOE, Journal of Financial Markets 9, 100 - 118. Andersen, T. G., and Bollerslev, T., 1997, Heterogeneous Information Arrivals and Return Volatility Dynamics: Uncovering the Long-Run in High Frequency Returns, Journal of Finance 52, 975 - 1005. Andersen, T. G., and Bollerslev, T., 1998, Deutsche Mark-Dollar Volatility: Intraday Activity Patterns, Macroeconomic Announcements, and Longer Run Dependencies, Journal of Finance 53, 219-65. Andersen, T. G., Bollerslev, T., and Diebold, F. X., 2007, Roughing It Up: Including Jump Component in the Measurement, Modeling, and Forecasting of Return Volatility, Review of Economics and Statistics 89, 701 – 720 . Andersen, T.G., Bollerslev, T., Diebold, F. X. and Ebens, H., 2001, The Distribution of realized stock return volatility, Journal of Financial Economics 61, 43-76. Andersen, T. G., Bollerslev, T., Diebold, F. X. and Vega, C., 2003, Micro Effects of Macro Announcements: Real-Time Price Discovery in Foreign Exchange, American Economic Review 93, 38-62. Andersen T. G., Bollerslev, T., Diebold, F. X. and Vega, C., 2007, Real-time price discovery in global stock, bond and foreign exchange markets, Journal of International Economics 73, 251-277. Andersen, T. G., Bondarenko, O. and Gonzalez-Perez, M. T., 2012, Uncovering Novel Features of Equity-Index Return Dynamics via Corridor Implied Volatility. Available at SSRN: http://ssrn.com/abstract=1787528 or http://dx.doi.org/10.2139/ssrn.1787528. 40",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "References",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 61,
    "chunk_index": 77,
    "word_count": 298,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "X. and Vega, C., 2007, Real-time price discovery in global stock, bond and foreign exchange markets, Journal of International Economics 73, 251-277. Andersen, T. G., Bondarenko, O. and Gonzalez-Perez, M. T., 2012, Uncovering Novel Features of Equity-Index Return Dynamics via Corridor Implied Volatility. Available at SSRN: http://ssrn.com/abstract=1787528 or http://dx.doi.org/10.2139/ssrn.1787528. 40",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "References",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 61,
    "chunk_index": 78,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "Andreou, E., and Ghysels, E., 2013, What drives the VIX and the Volatility Risk Premium?, unpublished University of Cyprus and University of North Carolina working paper (September), Bailey, W., 1988, Money Supply Announcements and the Ex Ante Volatility of Asset Prices, Journal of Money, Credit, and Banking 20, 611 – 620. Baker, M., and Jeremy S., 2004, Market liquidity as a sentiment indicator, Journal of Financial Markets 7, 271–288. Baker, S., Bloom, N. and Davis, S. J., 2011, Measuring Economic Policy Uncertainty, unpublished University of Chicago and Stanford University working paper. Bali, T. G., and Zhou, H., 2013, Risk, Uncertainty, and Expected Returns, Available at SSRN: http://ssrn.com/abstract=1898878. Barberis, N., Huang, M., and Santos, T., 2001, Prospect Theory And Asset Prices, Quarterly Journal of Economics 116, 1 - 53. Barberis, N., Shleifer, A.i, and Vishny, R., 1998, A model of investor sentiment, Journal of Financial Economics 49, 307 – 343. Beber, A., Brandt, M. W., and Kenneth A. K., 2011, What Does Equity Sector Order flow Tell Us About the Economy?, Review of Financial Studies 24, 3688 - 3730. Bekaert, G., Engstrom, E., and Xing, Y., 2009, Risk, uncertainty, and asset prices, Journal of Financial Economics 91, 59 – 82. Bekaert, G., and Hoerova, M., 2013, The VIX, the Variance Premium and Stock Market Volatility, Journal of Econometrics, forthcoming. Bekaert, G., Hoerova, M., and Lo Duca, M., 2013, Risk, Uncertainty and Monetary Policy, Journal of Monetary Economics 60, 771-788. Bekaert, G., and Wu, G., 2000, Asymmetric Volatility and Risk in Equity Markets, Review of Financial Studies 13, 1 - 42. Berry, D. B. and Howe, K. M., 1994, Public information arrival, Journal of Finance 49, 1331–1346. Black, F. 1976, Studies of Stock Price Volatility Changes, Proceedings of the 1976 Meeting of Business and 41",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "References",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 61,
    "chunk_index": 79,
    "word_count": 293,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "2000, Asymmetric Volatility and Risk in Equity Markets, Review of Financial Studies 13, 1 - 42. Berry, D. B. and Howe, K. M., 1994, Public information arrival, Journal of Finance 49, 1331–1346. Black, F. 1976, Studies of Stock Price Volatility Changes, Proceedings of the 1976 Meeting of Business and 41",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "References",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 61,
    "chunk_index": 80,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "Economic Statistics Section, American Statistical Association, 177-181. Black, F. and Scholes, M., 1973, The Pricing of Options and Corporate Liabilities, Journal of Political Economy 81, 637-654. Blair, B.J., Poon, S., Taylor, S.J., 2001, Forecasting S&P 100 Volatility: the Incremental Information Content of Implied Volatilities and High-frequency Index Returns, Journal of Econometrics 105, 5-26. Bollen, N. P. B., and Whaley, R. E., 2004, Does Net Buying Pressure Affect the Shape of Implied Volatility Functions?, Journal of Finance 59, 711 – 753. Bollerslev, T., Tauchen, G. ,and Zhou. H., 2010, Expected Stock Returns and Variance Risk Premia, Review of Financial Studies 22, 4463-4492. Bollerslev, T., and Todorov,V. , 2011, Tails, Fears and Risk Premia, Journal of Finance, 66, 2165 - 2212. Boyd, J. H., and Hu, J., and Jagannathan, R. 2005, The stock market’s reaction to unemployment news: Why bad news is usually good for stocks, Journal of Finance 60, 649-672. Brandt, M., and Kavajecz, K., 2004, Price Discovery in the US Treasury Market: the Impact of Order Flow and Liquidity on the Yield Curve, Journal of Finance 59, 2623-2654. Britten-Jones, M., and Neuberger, A., 2000, Option Prices, Implied Processes, and Stochastic Volatility, Journal of Finance 59, 711-753. Brunnermeier, M., and Pedersen, L.H.,2005, Predatory trading, Journal of Finance 60, 1825-1863. Brunnermeier, M. K. and Pedersen, L. H., 2009, Market Liquidity and Funding Liquidity, Review of Financial Studies 22, 2201 – 2238. Canina, L. and Figlewski, S. 1993, The Information Content of Implied Volatility, Review of Financial Studies 3, 659-681. Carlin, B., Lobo, M.,and Viswanathan, S. 2007, Episodic liquidity crises: Cooperative and predatory trading, Journal of Finance 62, 2235-2274. Carr, P., and Lee, R., 2009, Volatility Derivatives, Annual Review of Financial Economics 1, 1 – 21. Carr, P., and Madan, D.,1998, Towards a Theory of Volatility Trading, in R. Jarrow (ed.), Risk Book on Volatility. New York: Risk, pp. 417–27. 42",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "References",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 61,
    "chunk_index": 81,
    "word_count": 308,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "and predatory trading, Journal of Finance 62, 2235-2274. Carr, P., and Lee, R., 2009, Volatility Derivatives, Annual Review of Financial Economics 1, 1 – 21. Carr, P., and Madan, D.,1998, Towards a Theory of Volatility Trading, in R. Jarrow (ed.), Risk Book on Volatility. New York: Risk, pp. 417–27. 42",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "References",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 61,
    "chunk_index": 82,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "Carr, P., and Wu, L., 2006, A Tale of Two Indices, Journal of Derivatives (Spring), 13 – 29. Carr, P., and Wu, L., 2009, Variance Risk Premiums, Review of Financial Studies 22, 1311–1341. Cheung,Y., Lai, K. S., and Bergman, Mi., 2004, Dissecting the PPP Puzzle: The Unconventional Roles of Nominal Exchange Rate and Price Adjustments, Journal of International Economics 64, 135 - 150. Chicago Board Options Exchange, 2009, The CBOE Volatility Index – VIX, available at: http://www.cboe.com/micro/vix/vixwhite.pdf. Christie, A. A., 1982, The Stochastic Behavior of Common Stock Variances – Value, Leverage, and Interest Rate Effects, Journal of Financial Economics 10, 407 – 432. CME Group, 2011, S&P 500 Futures and Options: Standard and E-mini Contracts, available at: http://www.cmegroup.com/trading/equity-index/files/SxP500_FC.pdf. Copeland, T. E., and Galai, D., 1983, Information Effects on the Bid-Ask Spread, Journal of Finance 38, 1457 – 1469. Cornell, B., 1978, Using the Option Pricing Model to Measure the Uncertainty Producing Effect of Major Announcements, Financial Management 7, 54 – 59. Cornell, B., 1983, The money supply announcements puzzle: Review and interpretation, American Economic Review 73, 644 - 657. Corradi, V., Distaso, W., and Mele, A., 2013, Macroeconomic determinants of stock volatility and volatility premiums, Journal of Monetary Economics 60, 203 – 220. De Long, J. Bradford, A. S., Lawrence H. S., and Waldmann, R. J., 1990a, Noise Trader Risk in Financial Markets, Journal of Political Economy 98, 703-738. De Long, J. B., Shleifer, A., Summers, L. H., and Waldmann, R. J., 1990b, Positive Feedback Trading Strategies and Destabilizing Rational Speculators, Journal of Finance 45, 379-395. Demeterfi, K., Derman, E. , Kamal, M. and Zou, J., 1999, A Guide to Volatility and Variance Swaps, Journal of Derivatives 6, 9 – 32. Downing, C., Underwood, S., and Xing, Y., 2009, The Relative Informational Efficiency of Stocks and Bonds: An Intraday Analysis, Journal of Financial and Quantitative Analysis 44, 1081 – 1102. 43",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "References",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 61,
    "chunk_index": 83,
    "word_count": 311,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "Kamal, M. and Zou, J., 1999, A Guide to Volatility and Variance Swaps, Journal of Derivatives 6, 9 – 32. Downing, C., Underwood, S., and Xing, Y., 2009, The Relative Informational Efficiency of Stocks and Bonds: An Intraday Analysis, Journal of Financial and Quantitative Analysis 44, 1081 – 1102. 43",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "References",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 61,
    "chunk_index": 84,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "Drechsler, I., 2013, Uncertainty, Time-Varying Fear, and Asset Prices, Journal of Finance 68, 1843 – 1899. Drechsler, I., and Yaron, A., 2011, What’s Vol got to do with it, Review of Financial Studies 24, 1 - 45. Easley, D., O'Hara, M., and Srinivas, P. S., 1998, Option Volume and Stock Prices: Evidence on Where Informed Traders Trade, Journal of Finance 53, 431 – 465. Ederington, L. H., and Lee, J. H., 1993, How Markets Process Information: News Releases and Volatility, Journal of Finance 48, 1161–1191. Ederington, L. H., and Lee, J. H., 1996, The Creation and Resolution of Market Uncertainty: The Impact of Information Releases on Implied Volatility, Journal of Financial and Quantitative Analysis 31, 513 - 539. Evans, M., and Lyons, Ri., 2008, How is Marco News Transmitted to Exchange Rates? Journal of Financial Economics 88, 26-50. Fama, E., 1965, The Behavior of Stock Market Prices, Journal of Business 38, 34 – 105. French, K. R., Schwert, G. W., and Stambaugh, R. F., 1987, Expected stock returns and volatility, Journal of Financial Economics 19, 3 - 29. George, T. J., and Longstaff, F. A., 1993, Bid-Ask Spreads and Trading Activity in the S&P 100 Index Options Market, Journal of Financial and Quantitative Analysis, 28, 381 - 397. Giesecke, K., Longstaff, F. A., Schaefer, Stephen, and Strebulaev, Ilya, 2011, Corporate bond default risk: A 150-year perspective, Journal of Financial Economics102, 233 – 250. Grossman, S.J,. and Miller, M. H, 1988, Liquidity and Market Structure, Journal of Finance 43, 617 – 637. Han, B., 2008, Investor sentiment and option prices, Review of Financial Studies 21, 387 - 414. Harvey, C. and Whaley, R., 1992, Market Volatility Prediction and the Efficiency of the S&P 100 Index Option Market. Journal of Financial Economics 31, 43–74. Hasbrouck, J., 1991, Measuring the Information Content of Stock Trades, Journal of Finance 46,179-207. Hendersott, T., and Riordan, R., 2013, Algorithmic Trading and the Market for Liquidity, Journal of Financial and Quantitative Analysis 48, 1001 – 1024. 44",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "References",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 61,
    "chunk_index": 85,
    "word_count": 330,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "the S&P 100 Index Option Market. Journal of Financial Economics 31, 43–74. Hasbrouck, J., 1991, Measuring the Information Content of Stock Trades, Journal of Finance 46,179-207. Hendersott, T., and Riordan, R., 2013, Algorithmic Trading and the Market for Liquidity, Journal of Financial and Quantitative Analysis 48, 1001 – 1024. 44",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "References",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 61,
    "chunk_index": 86,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "Holthausen, R. W., Leftwich, R. W., and Mayers, D., 1990, Large-Block Transactions, the Speed of Response, and Temporary and Permanent Stock-Price Effects, Journal of Financial Economics 26, 71 - 95. Hotchkiss, E, and Tavy Ronen, T., 2002, The Informational Efficiency of the Corporate Bond Market: An Intraday Analysis, Review of Financial Studies 15, 1325 – 1354. Jacquier, E., and Okou, C., 2012, Segregating Continuous Volatility from Jumps in Long-Run Risk-Return Trade-Offs, unpublished MIT Sloan and HEC Montreal working paper (February). Jiang, G. J. and Tian, Y. S., 2005, The model-free Implied Volatility and Its Information Content, Review of Financial Studies 18, 1305-1342. Lee, C., Andrei S. and Richard H. T., 1991, Investor Sentiment and the Closed-end Fund Puzzle, Journal of Finance 46, 75-109. Martin, I., 2013, Simple Variance Swaps, unpublished Stanford University working paper. Merton, R. C., 1974, On the Pricing of Corporate Debt: The Risk Structure of Interest Rates, Journal of Finance 29, 449-470. Nagel, S., 2012, Evaporating Liquidity, Review of Financial Studies 25, 2005 - 2039. Pagan, A. R., and Schwert, G.W., 1990, Alternative models for conditional stock volatility, Journal of Econometrics 45, 267 - 290. Pasquariello, P. and Vega, C., 2007, Informed and Strategic Order Flow in the Bond Market, Review of Financial Studies 20, 1975-2019. Pastor, L., and Veronesi, P., 2012, Uncertainty about Government Policy and Stock Prices, Journal of Finance 67, 1219 – 1264. Patell, J., and Wolfson, M., 1979, Anticipated information releases reflected in call option prices, Journal of Accounting and Economics 1, 117-140. Pesaran, H.H., and Shin, Y., 1998, Generalized impulse response analysis in linear multivariate models, Economics Letters 58, 17 – 29. 45",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "References",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 61,
    "chunk_index": 87,
    "word_count": 271,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "Prices, Journal of Finance 67, 1219 – 1264. Patell, J., and Wolfson, M., 1979, Anticipated information releases reflected in call option prices, Journal of Accounting and Economics 1, 117-140. Pesaran, H.H., and Shin, Y., 1998, Generalized impulse response analysis in linear multivariate models, Economics Letters 58, 17 – 29. 45",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "References",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 61,
    "chunk_index": 88,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "Roll, R., 1984, A Simple Implicit Measure of the Effective Bid-Ask Spread in an Efficient Market, The Journal of Finance 39, 1127 – 1139. Ross, S. A., 1989, Information and Volatility: the No-Arbitrage Martingale Approach to Timing and Resolution Irrelevancy, Journal of Finance, 46, 1-17. Schwert, G. W., 1981, The Adjustment of Stock Prices to Information About Inflation, Journal of Finance 36, 15 - 29. Schwert, G. W., 1989, Why Does Stock Market Volatility Change Over Time, Journal of Finance 44, 1115-54. Shiller, R. J., 1981, Do stock prices move too much to be justified by subsequent changes in dividends?, American Economic Review 75, 421 – 436. Shiller, R. J., 2000, Irrational Exuberance, Princeton NJ: Princeton University Press. Sims, C., 1980, Macroeconomics and reality, Econometrica 48, 1 - 48. Stanton, R., and Wallace, N., 2011, The Bear’s Lair: Index Credit Default Swaps and the Subprime Mortgage Crisis, Review of Financial Studies 24, 3250 – 3280. Stein, J., 1989, Overreactions in the Options Market, Journal of Finance 44, 1011 – 1023. Subrahmanyam, A., 1991, A Theory of Trading in Stock Index Futures, Review of Financial Studies 4, 17 – 51. Todorov, V., and Tauchen, G., 2011, Volatility Jumps, Journal of Business and Economic Statistics 29, 356 - 371. Whaley, R.E., 2000, The Investor Fear Gauge, Journal of Portfolio Management 26, 12-17. Whaley, R.E., 2009, Understanding the VIX, Journal of Portfolio Management 35, 98-105. Wiggins, J., 1987, Option values under stochastic volatility: Theory and empirical estimates, Journal of Financial Economics 19, 351 – 372. Zhou, G., and Zhu, Y., 2012, Volatility Trading: What Is the Role of the Long-Run Volatility Component?, Journal of Financial and Quantitative Analysis 47, 273 - 307. 46",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "References",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 61,
    "chunk_index": 89,
    "word_count": 280,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "35, 98-105. Wiggins, J., 1987, Option values under stochastic volatility: Theory and empirical estimates, Journal of Financial Economics 19, 351 – 372. Zhou, G., and Zhu, Y., 2012, Volatility Trading: What Is the Role of the Long-Run Volatility Component?, Journal of Financial and Quantitative Analysis 47, 273 - 307. 46",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "References",
    "page_number": 48,
    "page_range": "p.48",
    "total_pages": 61,
    "chunk_index": 90,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "Table 1. Scheduled macroeconomic news releases Abbreviations are: Bureau of Labor Statistics (BLS), Bureau of the Census (BC), Bureau of Economic Analysis (BEA), Federal Reserve Board (FRB), National Association of Purchasing Managers (NAPM), Conference Board (CB), Financial Management Office (FMO), Employment and Training Administration (ETA). In February 2005, business inventory announcement was moved from 8:30 A.M. to 10:00 A.M. Returns are three-minute windows spanning most announcements, except previous close-to-open for announcements that occur prior to 9:30am. Announcement surprise is defined as surprise minus median forecast from Bloomberg scaled by standard deviation. Returns on the S&P 500 ETF, SPY, are available at one minute intervals that cover 8:30 AM announcements because we have access to trades from the Pacific Exchange and NASD through 19th June 2006. Cells marked “†” could not be computed due to small number of observations. Correlation and p-value of surprise with SPY return Pre Crisis period Crisis period Observations Source Time Standard Deviation Whole period 1/2005 to 1/2007 2/2007 to 3/2009 Quarterly GDP Final 22 BEA 8:30 AM 0.259 0.36425 0.0956 0.72401 0.0423 0.34857 0.2219 Advanced GDP 22 BEA 8:30AM 0.735 0.20689 0.3556 -0.02457 0.9539 0.59021 0.0263 Preliminary GDP 22 BEA 8:30AM 0.316 0.23525 0.2919 0.05306 0.9007 0.26089 0.3676 Monthly Nonfarm Payroll Employment 66 BLS 8:30 AM 65.807 -0.45247 0.0001 -0.29181 0.1665 -0.52841 0.0003 Retail Sales 66 BC 8:30 AM 0.006 0.49413 <.0001 -0.06382 0.7724 0.58436 <.0001 Industrial Production change 66 FRB 9:15 AM 0.449 -0.20649 0.0989 0.35516 0.0886 -0.26781 0.0905 Capacity Utilization 66 FRB 9:15 AM 0.385 0.02942 0.8146 -0.05992 0.7809 0.12084 0.4459 Personal Income 65 BEA 8:30 AM 0.358 0.53301 <.0001 0.23156 0.2763 0.60032 <.0001 Consumer Credit 66 FRB 3:00 PM 6.506 -0.03614 0.7733 -0.32735 0.1184 0.07568 0.6338 New Home Sales 66 BC 10:00 AM 67.964 -0.34622 0.0213 † † -0.3638 0.057 Personal Consumption Expenditures 66 BEA 8:30 AM 0.139 0.73607 <.0001 0.30966 0.1409 0.8083 <.0001 Durable Goods Orders 66 BC 10:00 AM 0.025 0.14016 0.2617 -0.05915 0.7837 0.07697 0.6281 Factory Orders 66 BC 10:00 AM 0.781 0.19424 0.1181 -0.01946 0.9281 0.35961 0.0193 Construction Spending 66 BC 10:00 AM 0.778 0.2073 0.0949 -0.06359 0.7678 0.3072 0.0478 47",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "References",
    "page_number": 48,
    "page_range": "p.48",
    "total_pages": 61,
    "chunk_index": 91,
    "word_count": 352,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "8:30 AM 0.139 0.73607 <.0001 0.30966 0.1409 0.8083 <.0001 Durable Goods Orders 66 BC 10:00 AM 0.025 0.14016 0.2617 -0.05915 0.7837 0.07697 0.6281 Factory Orders 66 BC 10:00 AM 0.781 0.19424 0.1181 -0.01946 0.9281 0.35961 0.0193 Construction Spending 66 BC 10:00 AM 0.778 0.2073 0.0949 -0.06359 0.7678 0.3072 0.0478 47 Business Inventories 66 BC 8:30/10:00 AM 0.002 0.39204 0.0012 0.04244 0.8475 0.46468 0.0019 Government Budget deficit 66 FMS 2:00 PM 11.435 0.29171 0.0175 0.15833 0.46 0.33022 0.0327 Trade Balance 66 BEA 8:30 AM 3.438 0.07485 0.5503 0.13292 0.5358 0.08353 0.599 Producer Price Index inflation 66 BLS 8:30 AM 0.580 0.45612 0.0001 0.15301 0.4753 0.57455 <.0001 Consumer Price Index inflation 66 BLS 8:30 AM 0.154 -0.03506 0.7799 -0.04165 0.8468 -0.08846 0.5775 Consumer Confidence Index 66 CB 10:00 AM 5.157 0.2401 0.054 0.18979 0.3744 0.25462 0.1082 NAPM Index 66 NAPM 10:00 AM 2.102 -0.18702 0.1327 -0.38939 0.06 -0.0739 0.6418 Housing Starts 66 BC 8:30 AM 0.091 -0.01141 0.9281 0.03743 0.8622 -0.01997 0.9014 Leading Indicators change (6 week) 66 CB 8:30 AM 0.203 0.13624 0.2754 0.37837 0.0683 0.09075 0.5676 FOMC Target Fed Funds Rate (8 per year) 46 FRB 2:15 PM 0.056 0.54623 <.0001 -0.03645 0.8657 0.69818 <.0001 Initial Unemployment Claims 286 ETA 8:30 AM 19.924 -0.45343 <.0001 -0.01465 0.8827 -0.54747 <.0001 48",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "References",
    "page_number": 49,
    "page_range": "p.49-50",
    "total_pages": 61,
    "chunk_index": 92,
    "word_count": 210,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.49-50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "Leading Indicators change (6 week) 66 CB 8:30 AM 0.203 0.13624 0.2754 0.37837 0.0683 0.09075 0.5676 FOMC Target Fed Funds Rate (8 per year) 46 FRB 2:15 PM 0.056 0.54623 <.0001 -0.03645 0.8657 0.69818 <.0001 Initial Unemployment Claims 286 ETA 8:30 AM 19.924 -0.45343 <.0001 -0.01465 0.8827 -0.54747 <.0001 48 Table 2. Summary statistics for 1-minute intervals VIX is intraday ticks of the Chicago Board Option Exchange (CBOE) S&P500 volatility spot index from the CBOE’s Market Data Express service, which is annualized standard deviation in terms of percentage. VRP_Jump is intraday ticks of the variance risk premiums defined as the difference between VIX squared and expected annualized realized variance, which is in terms of basis points and accounts explicitly for the impact of jumps. “Δ” prefix indicates first differenced series “Lag x” denotes autocorrelation at x period lag. LB Q(60) is the Ljung-Box Q (60) statistic with *, **, and *** denoting significance at 10%, 5%, and 1%, respectively. Variable Mean Stdev Min Max Skew Kurt Lag1 Lag60 LB Q (60) Whole sample VIX2 617.387 830.65 88.17 9292.96 3.30 12.98 0.999 0.996 9999.99*** VRP_Jump 38.03 328.83 -6117.78 5335.79 -1.44 27.67 0.999 0.960 9999.99*** ΔVIX2 0.00 16.05 -4580.14 4608.93 35.22 38848.09 -0.194 -0.003 9999.99*** ΔVRP_Jump 0.00 17.06 -4580.39 4605.58 25.68 30752.16 -0.193 0.003 9999.99*** Pre Crisis (1/2005 to 1/2007) VIX2 165.76 52.43 88.17 1730.56 2.39 14.07 0.992 0.961 9999.99*** VRP_Jump -73.47 32.05 -164.67 1482.47 3.65 62.66 0.977 0.893 9999.99*** ΔVIX2 -0.00 6.80 -1550.73 1545.33 15.20 30381.79 -0.327 -0.000 9999.99*** ΔVRP_Jump -0.00 6.82 -1550.73 1545.28 15.07 30052.27 -0.326 -0.000 9999.99*** Crisis (2/2007 to 3/2009) VIX2 1001.59 1153.76 94.28 9292.96 2.11 4.32 0.999 0.995 9999.99*** VRP_Jump 64.75 472.11 -6117.77 5335.79 -1.38 15.11 0.999 0.958 9999.99*** ΔVIX2 0.01 24.20 -4580.14 4608.93 25.80 18809.38 -0.190 0.005 9999.99*** ΔVRP_Jump 0.01 25.71 -4580.38 4605.58 19.01 14957.56 -0.198 0.004 9999.99*** Post Crisis (4/2009 to 6/2010) VIX2 696.41 338.82 256.32 2323.24 1.18 1.26 0.999 0.985 9999.99*** VRP_Jump 176.91 213.21 -1920.72 1145.37 -2.34 18.32 0.999 0.941 9999.99*** ΔVIX2 -0.01 6.14 -868.89 474.29 -15.42 4488.03 -0.037 0.009 2628.12*** ΔVRP_Jump 0.00 7.52 -907.37 481.64 -17.54 3086.76 0.083 -0.002 4729.64*** 49",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "References",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 61,
    "chunk_index": 93,
    "word_count": 348,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "14957.56 -0.198 0.004 9999.99*** Post Crisis (4/2009 to 6/2010) VIX2 696.41 338.82 256.32 2323.24 1.18 1.26 0.999 0.985 9999.99*** VRP_Jump 176.91 213.21 -1920.72 1145.37 -2.34 18.32 0.999 0.941 9999.99*** ΔVIX2 -0.01 6.14 -868.89 474.29 -15.42 4488.03 -0.037 0.009 2628.12*** ΔVRP_Jump 0.00 7.52 -907.37 481.64 -17.54 3086.76 0.083 -0.002 4729.64*** 49 Table 3. Daily and intraday patterns in level of VIX index This table presents summary statistics on day-of-the-week and time-of-day averages of the VIX squared index. “Roll” indicates overnight period (from open of third Friday of the month to previous close) when the VIX calculation moves to a new longer maturity options. . Mean, standard deviation and auto-correlation are equally-weighted averages of statistics computed once a day for each day. The F-statistic tests whether means are the same from Monday to Friday (Panel A) or across times of the day (Panel B). Panel A: Summary statistics on 1 minute VIX squared within each day of the week, 9:30am to 4:15PM, 2005 to June 2010 Monday Tuesday Wednesday Thursday Friday Mean 656.861 628.513 613.325 618.897 637.515 Standard deviation 54.139 48.317 49.969 67.520 57.096 Autocorrelation 0.968 0.971 0.971 0.978 0.974 F statistic (p-value) 44.19***(<.0.001) Panel B: Summary statistics on VIX squared around the clock, 2005 to June 2010 1 minute intervals Overnight close-to-open VIX2 9:30 to 10 10 to 11 11 to 12 12 to 1 1 to 2 2 to 3 3 to 4 4 to 4:15 Weekdays Weekends Roll Mean 636.483 631.233 629.923 628.813 629.931 630.430 628.815 628.837 613.521 642.885 672.082 Standard deviation 13.298 11.753 8.902 7.690 8.065 9.631 12.838 3.571 23.479 53.017 129.206 Autocorrelation 0.753 0.873 0.878 0.865 0.872 0.874 0.881 0.534 0.9698 0.9197 0.9061- F statistic (p-value) 0.63(0.730) 50",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "References",
    "page_number": 51,
    "page_range": "p.51",
    "total_pages": 61,
    "chunk_index": 94,
    "word_count": 281,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.51)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "to 4 4 to 4:15 Weekdays Weekends Roll Mean 636.483 631.233 629.923 628.813 629.931 630.430 628.815 628.837 613.521 642.885 672.082 Standard deviation 13.298 11.753 8.902 7.690 8.065 9.631 12.838 3.571 23.479 53.017 129.206 Autocorrelation 0.753 0.873 0.878 0.865 0.872 0.874 0.881 0.534 0.9698 0.9197 0.9061- F statistic (p-value) 0.63(0.730) 50 Table 4. Correlation matrix for vector auto regression variables This table presents contemporaneous Pearson correlations for one minute intervals from January 2005 to June 2010. “Return” indicates percentage rate of price change, “volume” is log-differences in trading volume , “imbalance” is price setting SPY buy sell imbalance, “bid-ask” is average for each minute of bid-ask spread divided by midpoint . *, **, and *** denote significance at 10%, 5%, and 1%, respectively. ΔVRP_Jump Eurodollar Policy SPY Gold futures ΔSPY Variable futures news flow Return return ΔSPY spread SPY imbalance Volume return ΔVIX2 0.89946*** 0.01446*** 0.00012 -0.14271*** -0.02171*** 0.00113 0.00115 -0.05135*** ΔVRP_Jump -0.02233*** -0.06523*** -0.11489*** -0.02804*** -0.00374*** 0.00236 -0.00374*** Eurodollar 0.04347*** -0.05984*** 0.00635*** 0.00403*** -0.0006 -0.02833*** futures return Policy news -0.00797*** 0.00787*** 0.00077 -0.00007 -0.00011 flow SPY return 0.08654*** 0.00417*** 0.00125 0.35651*** Gold futures -0.00375*** -0.00034 0.04933*** return ΔSPY volume 0.00537 0.00620*** ΔSPY spread -0.00134 51",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "References",
    "page_number": 52,
    "page_range": "p.52-53",
    "total_pages": 61,
    "chunk_index": 95,
    "word_count": 195,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.52-53)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "-0.14271*** -0.02171*** 0.00113 0.00115 -0.05135*** ΔVRP_Jump -0.02233*** -0.06523*** -0.11489*** -0.02804*** -0.00374*** 0.00236 -0.00374*** Eurodollar 0.04347*** -0.05984*** 0.00635*** 0.00403*** -0.0006 -0.02833*** futures return Policy news -0.00797*** 0.00787*** 0.00077 -0.00007 -0.00011 flow SPY return 0.08654*** 0.00417*** 0.00125 0.35651*** Gold futures -0.00375*** -0.00034 0.04933*** return ΔSPY volume 0.00537 0.00620*** ΔSPY spread -0.00134 51 Table 5. Event study responses of VIX squared and its risk premiums to macroeconomic news arrival VRP_Jump is intraday ticks of the variance risk premiums defined as the difference between VIX squared and expected annualized realized variance, which is in terms of basis points and accounts explicitly for the impact of jumps. Quotes sums quantity ordered in SPX put and call quotes submitted during the interval. Put-Call is ratio of SPX putto SPX call quotes. Spread is the average of bid - ask divided by midpoint across puts and calls weighted by quotes. Volume is trading volume per minute. Imbalance is “positive volume” (calls traded at ask and puts traded at bid) minus “negative volume” (puts traded at ask and calls traded at bid) following Easley, O’Hara, and Srinivas (1998). Observation interval is one minute. “N=” indicates the number of observations of the particular announcement series during the time period covered by the panel. Panel A: Full Period (January 2005 to June 2010) Cyclical news Countercyclical news Fiscal news Monetary news Nonfarm payroll news N=299 N=317 N=62 N=63 N=46 (-5,-1) (0,+5) (-5,-1) (0,+5) (-5,-1) (0,+5) (-5,-1) (0,+5) (-5,-1) (0,+5) ΔVIX2 -0.327196 -0.304838 0.140046 0.362975 0.752351 1.035467 1.272312* 1.009898 -0.159272 -0.322802 VRP_Jump -0.204133 -1.221121*** -0.052485 -1.036621** 0.245689 0.130660 0.041499 -2.461311 0.478022 -0.656289 Panel B: Pre Crisis (January 2005 to January 2007 Cyclical news Countercyclical news Fiscal news Monetary news Nonfarm payroll news N=108 N=116 N=23 N=24 N=17 (-5,-1) (0,+5) (-5,-1) (0,+5) (-5,-1) (0,+5) (-5,-1) (0,+5) (-5,-1) (0,+5) ΔVIX2 -0.245500 -0.299398 -0.245500 -0.299398 0.167106 0.070580 1.004246 0.125606 0.197946 0.303521 VRP_Jump -0.500595 -1.709620** -0.500595 -1.709620** -0.662164 -1.379900 0.207592 -2.882151** 0.814027 -0.492448 Panel C: Crisis (February 2007 to February 2009) Cyclical news Countercyclical news Fiscal news Monetary news Nonfarm payroll news N=124 N=128 N=25 N=25 N=21 (-5,-1) (0,+5) (-5,-1) (0,+5) (-5,-1) (0,+5) (-5,-1) (0,+5) (-5,-1) (0,+5) ΔVIX2 1.318396** 2.270922** 1.318396** 2.270922*** 0.7745310 1.037416 1.714808 1.769123** 0.718019 0.895190 VRP_Jump 0.525149 -0.074817 0.525149 -0.074817 0.099157 -0.055036 2.155006 1.2269463 0.570338 -0.552503 Panel D: Post Crisis (March 2009 to June 2010) Cyclical news Countercyclical news Fiscal news Monetary news Nonfarm payroll news N=67 N=73 N=14 N=14 N=8 ΔVIX2 -1.247956** -1.828020** -1.247956 -1.828020 1.573744 2.447388 0.922532 1.106907 -2.783558 -4.212508 VRP_Jump -0.349273 -1.639077** -0.349273 -1.639077** 1.821426 2.655645 -4.005487 -8.356105 -0.361801 -1.196403 52",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "References",
    "page_number": 53,
    "page_range": "p.53",
    "total_pages": 61,
    "chunk_index": 96,
    "word_count": 422,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.53)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "0.570338 -0.552503 Panel D: Post Crisis (March 2009 to June 2010) Cyclical news Countercyclical news Fiscal news Monetary news Nonfarm payroll news N=67 N=73 N=14 N=14 N=8 ΔVIX2 -1.247956** -1.828020** -1.247956 -1.828020 1.573744 2.447388 0.922532 1.106907 -2.783558 -4.212508 VRP_Jump -0.349273 -1.639077** -0.349273 -1.639077** 1.821426 2.655645 -4.005487 -8.356105 -0.361801 -1.196403 52 Table 5 continued. Panel E: Months with SPX index option data (July 2006 to December 2006 and September 2008 to February 2009) Cyclical news Countercyclical news Fiscal news Monetary news Nonfarm payroll news N=57 N=60 N=12 N=12 N=7 (-5,-1) (0,+5) (-5,-1) (0,+5) (-5,-1) (0,+5) (-5,-1) (0,+5) (-5,-1) (0,+5) ΔVIX2 -0.196072 0.544074 -0.636394 -0.644664 -0.284096 -0.693332 1.0207015 1.0971368 -0.788232 -2.271858 VRP_Jump -1.568940** -2.808713** -0.882408* -1.851015** 0.7370475 0.6614259 2.7520804** 2.4411805 0.5337095 -1.579959 SPX volume 0.729029** 4.231512* -0.247077 -1.208212*** 0.4660165 0.6347853 -0.127209 -1.336320** -0.031324 13.933248 SPX imbalance -0.283379 -0.681625** 0.0744730 0.0550980 -1.4476278*** 0.0707836 0.1389134 1.0237176 0.0157391 0.1346094 SPX quotes 1.8393899** 5.156403*** 1.0070459 5.15889551*** 1.5954617 6.824153** 2.6186153 5.0106312** 0.0476322 0.6572189 SPX Put-Call Ratio 0.575386 0.505587 -0.102151 -0.122702 -0.487770 -1.022120 -0.262186 -0.532671 0.2466506 -1.027235 SPX spread 0.496620 1.679622** -0.044284 1.5938123** -0.504394 0.9354056 -0.292812 3.4881787 0.430278 1.0332436 53",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "References",
    "page_number": 54,
    "page_range": "p.54-55",
    "total_pages": 61,
    "chunk_index": 97,
    "word_count": 182,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.54-55)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "SPX imbalance -0.283379 -0.681625** 0.0744730 0.0550980 -1.4476278*** 0.0707836 0.1389134 1.0237176 0.0157391 0.1346094 SPX quotes 1.8393899** 5.156403*** 1.0070459 5.15889551*** 1.5954617 6.824153** 2.6186153 5.0106312** 0.0476322 0.6572189 SPX Put-Call Ratio 0.575386 0.505587 -0.102151 -0.122702 -0.487770 -1.022120 -0.262186 -0.532671 0.2466506 -1.027235 SPX spread 0.496620 1.679622** -0.044284 1.5938123** -0.504394 0.9354056 -0.292812 3.4881787 0.430278 1.0332436 53 Table 6. Generalized Variance decomposition for VARs to explain VIX squared This table reports generalized variance decompositions of forecast errors (Pesaran and Shin, 1998). Each row measures how much (in percent) of the current innovation in a variable explains future variation in VIX squared or its risk premium at selected horizons out 20 minutes. The generalized forecast error variance decomposition is standardized so that the sum of total decomposition is 100%. Forecast ΔVIX2 SPY Eurodollar futures Gold futures Δ SPY SPY Δ SPY Policy news horizon return return return volume imbalance spread flow Pre Crisis 0 99.46 0.45 0.00 0.00 0.00 0.09 0.00 0.00 1 99.23 0.52 0.00 0.00 0.00 0.09 0.00 0.16 2 99.21 0.53 0.00 0.00 0.00 0.09 0.00 0.17 10 99.03 0.54 0.00 0.00 0.00 0.09 0.00 0.33 20 99.03 0.54 0.00 0.00 0.00 0.09 0.00 0.33 Crisis 0 96.79 2.67 0.02 0.07 0.01 0.45 0.00 0.00 1 92.31 6.89 0.08 0.11 0.03 0.53 0.00 0.05 2 92.28 6.91 0.08 0.11 0.03 0.52 0.00 0.07 10 92.04 7.02 0.08 0.12 0.10 0.53 0.00 0.10 20 92.04 7.02 0.08 0.12 0.10 0.53 0.00 0.10 Post Crisis 0 94.59 3.88 0.11 0.17 0.00 1.25 0.00 0.00 1 72.63 21.71 3.56 0.26 0.01 1.68 0.00 0.13 2 72.52 21.79 3.56 0.27 0.02 1.70 0.01 0.14 10 72.47 21.80 3.55 0.28 0.02 1.72 0.02 0.15 20 72.47 21.80 3.55 0.28 0.02 1.72 0.02 0.15 54",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "References",
    "page_number": 55,
    "page_range": "p.55",
    "total_pages": 61,
    "chunk_index": 98,
    "word_count": 284,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.55)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "0.00 0.10 Post Crisis 0 94.59 3.88 0.11 0.17 0.00 1.25 0.00 0.00 1 72.63 21.71 3.56 0.26 0.01 1.68 0.00 0.13 2 72.52 21.79 3.56 0.27 0.02 1.70 0.01 0.14 10 72.47 21.80 3.55 0.28 0.02 1.72 0.02 0.15 20 72.47 21.80 3.55 0.28 0.02 1.72 0.02 0.15 54",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "References",
    "page_number": 56,
    "page_range": "p.56",
    "total_pages": 61,
    "chunk_index": 99,
    "word_count": 50,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.56)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "Table 7. Summary statistics for 1-minute measures of S&P 500 index options trading This table includes all trades and quotes for out-of-the-money options with the two expirations closest to 30 days as described in CBOE (2009). Given the size and cost of options data, we study two six month periods from before and during the financial crisis. “Lag x” denotes autocorrelation at x period lag. LB Q(60) is the Ljung-Box Q (60) statistic with *, **, and *** denoting significance at 10%, 5%, and 1%, respectively. Following Easley, O’Hara, and Srinivas (1998), SPX imbalance equals “positive volume” (calls traded at ask and puts traded at bid) minus “negative volume” (puts traded at ask and calls traded at bid). Spread is average within the minute of bid-ask spread divided by midpoint. Statistics for changes in variables are also reported for those series that are used in regressions in first-differenced form. Variable Mean Stdev Min Max Skew Kurt Lag1 Lag60 LB Q (60) July – December 2006 SPX quotes 0.736 0.472 831800*** 1505.04 1420.28 2 9171 1.53 5.04 SPX put-call 0.175 0.121 47114*** 0.66 0.55 0.04 21 11.73 236.58 SPX spread 0.238 0.097 41907*** 0.07 0.04 0.01 0.94 6.3 67.56 SPX volume 0.226 0.031 11446*** 672.61 2054.02 1 225187 37.69 3393.78 SPX imbalance 0.106 0.007 1912.7*** -0.01 0.60 -1 1 0.02 2.18 Δ quotes -0.376 -0.003 6997.5*** 1.33 1024.32 -7202 7278 0.07 6.45 Δ put-call -0.468 0.001 10396*** 0.0013 0.69 -18.8 20.45 0.65 166.54 Δ spread -0.432 -0.004 8875.9*** -0.00004 0.04 -0.89 0.84 -0.12 48.16 Δ volume -0.417 -0.020 7770.5*** 3.78 2641.44 -225125 224685 1.1 2579.61 September 2008 – February 2009 SPX quotes 0.838 0.610 1000000*** 8864.92 7683.65 5 81292 2.26 9.92 SPX put-call 0.806 0.689 1000000*** 1.49 0.6 0.2 38.4 8.39 386.89 SPX spread 0.808 0.602 1000000*** 0.07 0.05 0.01 0.9 3.35 21.84 SPX volume 0.181 0.036 6056.9*** 664.66 1696.33 1 169040 29.6 2449.56 SPX imbalance 0.111 -0.000 1197.2*** 0.01 0.63 -1 1 -0.02 2.05 Δ quotes -0.403 0.011 7690.6*** -1.02 4376.04 -71223 40406 0.06 9.97 Δ put-call -0.466 0.002 10345*** 0.000004 0.37 -37.19 37.21 -3.72 4892.77 Δ spread -0.414 0.016 9069.2*** -0.000003 0.03 -0.7 0.51 -0.68 53.72 Δ volume -0.143 -0.005 6805.3*** -2.78 2211.76 -168481 167676 1.17 1760.3 55",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "References",
    "page_number": 56,
    "page_range": "p.56",
    "total_pages": 61,
    "chunk_index": 100,
    "word_count": 369,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.56)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "0.63 -1 1 -0.02 2.05 Δ quotes -0.403 0.011 7690.6*** -1.02 4376.04 -71223 40406 0.06 9.97 Δ put-call -0.466 0.002 10345*** 0.000004 0.37 -37.19 37.21 -3.72 4892.77 Δ spread -0.414 0.016 9069.2*** -0.000003 0.03 -0.7 0.51 -0.68 53.72 Δ volume -0.143 -0.005 6805.3*** -2.78 2211.76 -168481 167676 1.17 1760.3 55 Table 8. Cross-correlations among 1-minute measures of S&P 500 index options trading This table reports correlations among the index option measures. See previous table for more detailed descriptions. *, **, and *** denote significance at 10%, 5%, and 1%, levels respectively. Δ VIX2 Δ VRP_Jump Δ SPX quotes Δ SPX put-call Δ SPX spread Δ SPX volume July to December 2006 Δ VIX2 1.0000 Δ VRP_Jump 0.9758*** 1.0000 Δ SPX quotes 0.0034 -0.0002 1.0000 Δ SPX put-call 0.0003 -0.0004 -0.1259*** 1.0000 Δ SPX spread -0.0081* -0.0149*** -0.2164*** 0.4076*** 1.0000 Δ SPX volume 0.0110** 0.0023 0.0141*** -0.0034 0.0060 1.0000 SPX imbalance -0.0153*** -0.0143*** -0.0067 0.0040 0.0013 -0.0006 September 2008 to February 2009 Δ VIX2 1.0000 Δ VRP_Jump 0.9614*** 1.0000 Δ SPX quotes -0.0009 -0.0080 1.0000 Δ SPX put-call 0.0013 0.0045 -0.0257*** 1.0000 Δ SPX spread -0.0072 -0.0059 -0.2111*** 0.1081*** 1.0000 Δ SPX volume -0.0006 -0.0065 0.0038 0.0085 -0.0029 1.0000 SPX imbalance -0.0417*** -0.0393*** 0.0037 -0.0131*** 0.0047 0.0024 56",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "References",
    "page_number": 57,
    "page_range": "p.57-58",
    "total_pages": 61,
    "chunk_index": 101,
    "word_count": 207,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.57-58)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "2008 to February 2009 Δ VIX2 1.0000 Δ VRP_Jump 0.9614*** 1.0000 Δ SPX quotes -0.0009 -0.0080 1.0000 Δ SPX put-call 0.0013 0.0045 -0.0257*** 1.0000 Δ SPX spread -0.0072 -0.0059 -0.2111*** 0.1081*** 1.0000 Δ SPX volume -0.0006 -0.0065 0.0038 0.0085 -0.0029 1.0000 SPX imbalance -0.0417*** -0.0393*** 0.0037 -0.0131*** 0.0047 0.0024 56 Table 9. Regressions to explain first-order serial correlation of VIX squared changes This table reports regressions of ΔVIX2 on its first lag and interactive variables equal to its first lag times trading conditions. t Spread is average within the minute of bid – ask spread divided by midpoint across puts and calls weighted by quotes. Quotes sums quantity ordered in SPX put and call quotes submitted during the interval. Volume is trading volume per minute. Macro news dummy equals one if any cyclical, countercyclical, fiscal, monetary, or nonfarm payroll news arrives within the one minute interval. Put-Call is ratio of SPX put to SPX call quotes. Imbalance is “positive volume” (calls traded at ask and puts traded at bid) minus “negative volume” (puts traded at ask and calls traded at bid) following Easley, O’Hara, and Srinivas (1998). Observation interval is one minute. p-statistics are based on Newey-West robust standard errors. July to December 2006 September 2008 to February 2009 1 2 3 4 Slope p-value Slope p-value Slope p-value Slope p-value Constant -0.001 0.853 0.012 0.231 0.042 0.800 0.010 0.962 Δ VIX 2 -0.416 0.000 -0.386 0.000 -0.193 0.079 -0.250 0.010 t-1 Δ VIX 2 · Δ SPX spread -10.559 0.000 -4.019 0.234 t-1 t Δ VIX 2 · Δ SPX quotes -0.0005 0.000 0.00002 0.067 t-1 t Δ VIX 2 · Δ SPX volume 0.00004 0.001 0.00001 0.423 t-1 t Δ VIX 2 · macro news dummy 0.301 0.326 0.390 0.379 t-1 t Δ VIX 2 · policy news flow 20.701 0.000 3.050 0.538 t-1 t Δ VIX 2 · Δ SPX put-call 0.190 0.002 0.706 0.021 t-1 t Δ VIX 2 · SPX imbalance 0.464 0.000 0.143 0.233 t-1 t Δ SPX spread -0.454 0.221 -3.361 0.661 t Δ SPX quotes -0.0000001 0.987 0.00003 0.714 t Δ SPX volume 0.00001 0.174 0.00003 0.723 t Macro news dummy -0.118 0.594 5.752 0.160 t Policy news flow 0.651 0.910 6.111 0.919 t Δ SPX put-call 0.018 0.153 0.294 0.721 t SPX imbalance -0.093 0.000 -3.697 0.000 t Adjusted r-squared 0.173 0.347 0.037 0.123 Observations 49168 41884 49108 38936 57",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "References",
    "page_number": 58,
    "page_range": "p.58",
    "total_pages": 61,
    "chunk_index": 102,
    "word_count": 399,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.58)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  },
  {
    "text": "SPX volume 0.00001 0.174 0.00003 0.723 t Macro news dummy -0.118 0.594 5.752 0.160 t Policy news flow 0.651 0.910 6.111 0.919 t Δ SPX put-call 0.018 0.153 0.294 0.721 t SPX imbalance -0.093 0.000 -3.697 0.000 t Adjusted r-squared 0.173 0.347 0.037 0.123 Observations 49168 41884 49108 38936 57 Figure 1. Intraday VIX and VRP at 1-minute intervals VRP_Jump is intraday ticks of the variance risk premiums defined as the difference between VIX squared and expected annualized realized variance, which is in terms of basis points and accounts explicitly for the impact of jumps. VIX squared and VRP_Jump are expressed in basis points. Plots include periods from 9:30am to 4pm. Panel A: VIX squared Panel B: VRP_Jump 58 Figure 2. Generalized Impulse Response plots for changes in VIX squared and its risk premium This figure shows the plots of generalized impulse responses of VIX squared(Panel A) and its estimated risk premium VRP_Jump (Panel B) to one standard deviation of innovations in the VAR for Pre Crisis, Crisis, and Post Crisis samples and the whole period. Solid lines are point estimates and dashed lines are 95% confidence intervals. Panel A: Generalized impulse response plots for changes in VIX squared 59 Figure 2 continued. Panel B: Generalized impulse response plots for VRP_Jump 60",
    "title": "BZZ VIX 27Feb2014",
    "source_type": "pdf",
    "document_id": "60bee92cfbcb",
    "source_file": "What Makes the VIX Tick_27Feb2014.pdf",
    "section": "References",
    "page_number": 59,
    "page_range": "p.59-61",
    "total_pages": 61,
    "chunk_index": 103,
    "word_count": 212,
    "author": "wbb1",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.59-61)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140227102601-05'00'",
    "duration": null
  }
]