[
  {
    "text": "Who Is Minding the Store? Order Routing and Competition in Retail Trade Execution Xing Huang, Philippe Jorion, Jeongmin Lee, and Christopher Schwarz ∗,† November 9, 2023 Abstract Using 150,000 actual trades, we examine competition among wholesalers, to which brokers route orders from their retail investors. We find that each broker’s wholesaler execution prices have substantial dispersion and are persistent. However, most brokers donotadjusttheirroutingevenwhentheysendmoreorderstohigher-costwholesalers. We also observe that the entry of a new wholesaler improves other wholesalers’ execu- tion quality. Finally, we present a stylized model that illustrates how brokers’ limited response to execution allows wholesalers to exercise their market power. Overall, our findings are inconsistent with perfect competition. JEL Classifications: G12, G14, G50 Keywords: retail trading, execution quality, order routing, competition, bid/ask spread, market microstructure, broker-dealers, wholesalers ∗Christopher Schwarz (corresponding author, phone: 949-824-0936, email: cschwarz@uci.edu) and Philippe Jorion are at the Paul Merage School of Business at the University of California at Irvine. Xing Huang is at the Olin Business School, Washington University in St. Louis. Jeongmin “Mina” Lee is at the Federal Reserve Board, Washington, DC. The views expressed here are the authors’ own and do not reflect the views of the Federal Reserve System or its staff. We wish to thank Alyssa Moncrief and Sanath Nair for research assistance. This paper benefited from helpful comments by conference participants at the 2023 ESSFMAssetPricingConference,aswellasseminarsatColumbiaUniversity,CornellUniversity,andNotre Dame University. †All the brokerage accounts referenced were funded directly by the authors with personal money. No outside compensation was received from any broker or wholesaler for this study. This paper required no outside approval. All errors are our own. Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 79,
    "chunk_index": 0,
    "word_count": 269,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "participants at the 2023 ESSFMAssetPricingConference,aswellasseminarsatColumbiaUniversity,CornellUniversity,andNotre Dame University. †All the brokerage accounts referenced were funded directly by the authors with personal money. No outside compensation was received from any broker or wholesaler for this study. This paper required no outside approval. All errors are our own. Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 79,
    "chunk_index": 1,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "Retail investors’ access to U.S. equity markets has vastly improved over the last few decades. As markets started to automate in the mid-1990s, investors benefited from a major reductions in trading costs. This period also witnessed major structural changes in market design, inparticularRegulationNMS(SEC(2005)), whichultimatelymostlydelegatedretail trading to specialized OTC market-makers, known as “wholesalers.” After retail trading volumes exploded in late 2019 due to brokers going commission-free, the current market structurehascomeunderscrutiny. ThisattentionculminatedinfourSecuritiesandExchange Commission (SEC) proposals in late 2022 whose goal is to further decrease trading costs for retail investors by increasing competition among market makers. In this paper, we examine the competitiveness of retail trade execution. On the one hand, there are concerns that the wholesaler market is too concentrated, with only four large players.1 On the other hand, the current market structure is already designed to be competitive. Retail brokers are expected to enforce competition across wholesalers. Indeed, under their legal duty of “best execution,” brokers should monitor the quality of execution by wholesalers and act accordingly. Furthermore, their routing decisions should ensure that “order flow is directed to markets providing the most beneficial terms for their customers’ orders.”2 Given this market design, one might argue that wholesalers compete in Bertrand fashion such that perfect competition may be obtained even with two competitors. The goal of this paper is to contribute to this debate on competition among wholesalers by providing empirical evidence and economic insights. 1See for instance Hu and Murphy (2022) . 2FINRA (2014). 1 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 79,
    "chunk_index": 2,
    "word_count": 250,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "fashion such that perfect competition may be obtained even with two competitors. The goal of this paper is to contribute to this debate on competition among wholesalers by providing empirical evidence and economic insights. 1See for instance Hu and Murphy (2022) . 2FINRA (2014). 1 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 79,
    "chunk_index": 3,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "We provide a unique window into the analysis of competition in the wholesaler market by observing granular data on interactions between broker routing and wholesaler execution. Rather than relying on public disclosures that are aggregated at a high level, we are able to perform analyses on these interactions using data from an almost two-year long experiment where we placed our own retail trades across 10 brokerage accounts.3 Our parallel trades allow us to directly compare execution prices across brokers and venues over this large sample. In addition, this provides direct data on the percentage of order flow routed to each wholesaler, as well as the brokers’ responses to differences in execution quality. Importantly, our data allow us to perform within-broker analysis. As shown by Schwarz et al. (2023), brokers experience substantial variations in average execution, which likely re- flectdifferentcharacteristics(e.g.,theso-called“toxicity”)oforderflowsacrossbrokers. Such across-broker variations in execution could obfuscate comparisons across wholesalers when examined through the lens of aggregate-level data provided in public disclosures. Specifi- cally, we measure price execution relative to the average across venues for each broker, based on the effective over quoted (E/Q) spread, which provides a normalized measure of trading cost. A higher E/Q indicates a larger transaction cost for investors since trades are executed closer to the prevailing quoted spread, and is equivalent to lower price improvement (PI). Another advantage of our approach lies in the randomization of trading time across a diverse range of stocks. We selected a representative sample of the universe of U.S. stocks 3We generated a total of approximately 172,000 trades, equivalent to $22.4 million in notional, over the period from December 21, 2021, to May 31, 2023. Our trades are executed through E*Trade, Fidelity, Interactive Brokers (IBKR, with both their Pro and Lite account types), Robinhood, Schwab, and TD Ameritrade. Weplacedordersatdifferentbrokersthatwereidenticalintype(marketorders),ticker(stock), size (dollars and shares traded), direction (buy or sell), and submission time. All trades were intraday, i.e., we bought equities after the market opened and then sold them within 30 minutes, with trading spread out throughout the day. 2 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 79,
    "chunk_index": 4,
    "word_count": 342,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "Robinhood, Schwab, and TD Ameritrade. Weplacedordersatdifferentbrokersthatwereidenticalintype(marketorders),ticker(stock), size (dollars and shares traded), direction (buy or sell), and submission time. All trades were intraday, i.e., we bought equities after the market opened and then sold them within 30 minutes, with trading spread out throughout the day. 2 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 79,
    "chunk_index": 5,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "stratified by key dimensions: market capitalization, price, liquidity, and volatility. By sys- tematically placing trades at varied times throughout the day and rotating these times across stocks, we can mitigate the selection bias that that could arise from potential strategic be- haviors of wholesalers.4 We observe widely varying practices for stock routing. Approximately two-thirds of our brokers route stocks to wholesalers using what we call a “proportional” method. These brokers simply take a “slice” of their overall order flow and send it to each wholesaler; the only variation across wholesalers is the dollar size of their slice. The remaining one-third of brokersusewhatwecalla“selective”routingmethod(“smart-routing”inindustryparlance), where the routing for each stock is selected from wholesaler and stock characteristics. Armed with this information, we test implications of the perfect Bertrand competition hypothesis. If the market was perfectly competitive and a broker can frictionlessly switch among wholesalers based on their execution, only a wholesaler that provides the best exe- cution quality would receive any order flow. Thus, we would expect that for a given broker there is no dispersion of execution costs across wholesalers. However, we find that there is a substantial dispersion. Moreover, the dispersion is persistent over time, both at the over- all portfolio and individual stock levels. At the overall portfolio level, slopes on past price improvement are often close to one, with R-squares over 50%. At the individual stock level, the persistence is more modest with slopes around 0.3 and lower R-squares (around 8%). Despite this predictability, a majority of our brokers do not seem to change their routing based on past execution. In fact, only one does so at a statistically significant level. To 4Wholesalers might tailor their execution quality based on their understanding of brokers’ evaluation metrics. Consequently, using archival or public disclosure data may inadvertently bias the sample towards instances where strategic wholesalers offer superior executions. Our approach with randomized timing on a representative sample could provide a more comprehensive and unbiased view of the market. 3 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 79,
    "chunk_index": 6,
    "word_count": 334,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "of brokers’ evaluation metrics. Consequently, using archival or public disclosure data may inadvertently bias the sample towards instances where strategic wholesalers offer superior executions. Our approach with randomized timing on a representative sample could provide a more comprehensive and unbiased view of the market. 3 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 79,
    "chunk_index": 7,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "illustrate the impact of not changing market share to predictably lower cost wholesalers, we simulate dynamic routing decisions that are based on our prior price execution. Doing so lowers E/Q by 34% when using overall routing and 19% when using stock-by-stock routing. These changes are more dramatic for proportional brokers, with a drop of 45% using overall routing, whereas it is only 10% for selective-routing brokers. Regardless of how responsive broker routing is, the wholesaler market might still benefit from greater competition. To explore this further, we examine the entry of Jane Street as wholesaler for a particular broker in early 2022. This broker is the most responsive broker from our empirical findings, and also has data starting in 2021. Immediately after this entry, we find a significant improvement in the overall price execution by the other wholesalers at that broker; in addition, they still lost significant market share. This suggests that retail investors at that broker benefited from this increased wholesaler competition. One possible explanation for the limited response of brokers to past execution quality could be that routing has stabilized at a steady state. If this were the case, we would expect brokers to direct orders in a manner that minimizes costs by sending more orders to wholesalers that provide lower execution costs. Contrary to this prediction, our findings show that the majority of brokers actually route more orders to wholesalers associated with higher execution costs. To understand this puzzling pattern and collectively explain our findings, we develop a stylized model of order routing that sheds light on the underlying economic intuition. In the model, a broker has two wholesalers to route orders. The broker experiences switching costs, which serve as a modeling device to capture potential frictions that limit the ability or willingness of brokers to respond to dispersion in execution quality. For example, these 4 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 79,
    "chunk_index": 8,
    "word_count": 314,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "In the model, a broker has two wholesalers to route orders. The broker experiences switching costs, which serve as a modeling device to capture potential frictions that limit the ability or willingness of brokers to respond to dispersion in execution quality. For example, these 4 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 79,
    "chunk_index": 9,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "costs could be for the time and cost of monitoring, limits imposed on maximum or minimum market share, technology limitations, and so forth. Equilibrium outcomes depend on the size of switching costs. Whenswitchingcostsareabsentorverysmall, theequilibriumresemblesthatofBertrand competition. There is no dispersion among execution costs, since the low-cost wholesaler receives the entire order flow otherwise. All wholesalers offer the same execution, and there is no relation between execution prices and market share. Thus, switching costs, or the broker’s limited response to execution that result from them, are essential in understanding the relation between execution prices and market share. When switching costs are high, wholesalers exercise their market power and raise their execution costs. The rents they extract from the broker (or more precisely, their retail investors) are split according to their market share. The wholesaler with larger market share charges higher costs than the other wholesaler. Thus, the puzzling pattern of brokers routing more orders to higher-cost wholesalers is not because brokers route more orders to wholesalers because they are more expensive but rather that wholesalers charge higher prices because brokers route more orders to them. When switching costs are moderate and the larger wholesaler incurs lower marginal costs when making markets for the broker’s order flow, the relation between execution costs and market share can flip. The larger wholesaler’s incentive to charge less and acquire an even larger market share outweighs the incentive to charge more, such that the wholesaler with larger market share charges less than the other wholesaler. These results are consistent with our empirical finding that the relation between market share and execution cost is positive for proportional brokers, while it is negative for selective 5 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 79,
    "chunk_index": 10,
    "word_count": 282,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "charge more, such that the wholesaler with larger market share charges less than the other wholesaler. These results are consistent with our empirical finding that the relation between market share and execution cost is positive for proportional brokers, while it is negative for selective 5 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 79,
    "chunk_index": 11,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "brokers, who tend to respond to prior execution albeit modestly and thus exhibit smaller switching costs than proportional brokers. Overall, our paper adds significantly to the literature on the broker-wholesaler market- place. We describe the range of current practices in how brokers route trades to wholesalers. We also document that price improvement is highly persistent over time. We are able to show that a majority of brokers do not react significantly to past price improvement when making routing decisions. This is even if higher execution cost wholesalers have larger mar- ket share. We also directly examine competitive changes when a new wholesaler enters the market at one broker. Finally, we present a stylized model to provide economic intuition for our findings. Our results suggest that the marketplace is not perfectly competitive. Our paper is most closely related to Dyhrberg et al. (2023). The authors use public 605 forms (disclosures of order execution information by market centers) to investigate the com- petitiveness of the wholesaler marketplace. Their general conclusion is that the wholesaler market is competitive. While we are able to replicate their main empirical finding with our data, we find more mixed results due to the greater detail in our data set, including routing information and execution at the wholesaler-broker levels. As noted, the SEC has proposed several rules to increase competition in the broker- wholesaler marketplace. These proposals attempt to accomplish this goal through changes in best execution requirements, tick sizes, disclosure, and how orders are executed in the marketplace. The direct implication of our results is that more disclosure would be beneficial forretailinvestors. Undertheproposeddisclosurerequirements(SEC(2022a)),the605forms would be required not only of market centers, but also of retail brokers. This would help investors pick brokers that provide lower execution costs. However, the proposal still does 6 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 79,
    "chunk_index": 12,
    "word_count": 301,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "The direct implication of our results is that more disclosure would be beneficial forretailinvestors. Undertheproposeddisclosurerequirements(SEC(2022a)),the605forms would be required not only of market centers, but also of retail brokers. This would help investors pick brokers that provide lower execution costs. However, the proposal still does 6 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 79,
    "chunk_index": 13,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "not require disclosing execution costs by broker-wholesaler pair. As we show, this approach would provide more informative measures of wholesaler performance because it controls for broker order-flow characteristics. Such public disclosures would create additional pressure on brokers for better monitoring and execution, creating more competition in this market. Finally, it is important to note the limitations of our study. Our experiment was based solely on placing small “market” orders for equities during the day; we do not evaluate other types of orders or options trading. Most of our orders are odd-lots, i.e., less than 100 shares, although we also experimented with round lots, with similar results.5 Even so, it should be noted that odd lots are becoming increasingly important, now accounting for 60% of orders and close to 20% of trading volume.6 Further, we only examine execution quality in terms of price improvement, while other aspects may be important as well. Lastly, we do not observe the entire order flow of our brokers. The rest of the paper is organized as follows. Section 2 reviews the current literature on this topic, while Section 3 describes interactions between brokers and wholesalers. Sec- tion 4 describes our self-generated data. Section 5 then describes patterns in the routing of individual stocks across wholesalers by brokers. Next, Section 6 shows that execution qual- ity is persistent across time, which is a prerequisite condition for actively managing order allocations across wholesalers. So, Section 7 describes the broker’s response to prior price improvement. To assess the degree of competitiveness in the wholesaler industry, Section 8 5Forexample,ifsomebrokersonlysetallocationsattheoverallorderflowleveleitherduetotechnological limitationsorduetoprioritizingonesegment(suchastradesize)orsetofsymbols(tickers),thenanysegment oftheirflowthatisnotprioritizedwillappeartobenotmonitoredsinceexecutionwithinthatsegmentdoes not impact their routing choices. 6See https://www.sec.gov/marketstructure/datavis/ma_overview.html. Currently, the 605 forms do not cover odd lots. So,itishardtoknowwhetherexecutionqualitysystematicallydiffersfromroundlots. Bartlett(2021)usesaregression discontinuity approach, using 2020 data, to show a drop in PI from 45% to 41% for odd lots, implying a slightly worse execution. On the other hand, Fidelity, one of the largest retail brokers, reports that, during 2022Q4, its odd-lot bucket has actually better price improvement, by about 1 ppt. See https://www.fidelity.com/bin-public/060_www_fidelity_com/ documents/FIF-FBS-retail-execution-quality-stats.pdf 7 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 79,
    "chunk_index": 14,
    "word_count": 339,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "in PI from 45% to 41% for odd lots, implying a slightly worse execution. On the other hand, Fidelity, one of the largest retail brokers, reports that, during 2022Q4, its odd-lot bucket has actually better price improvement, by about 1 ppt. See https://www.fidelity.com/bin-public/060_www_fidelity_com/ documents/FIF-FBS-retail-execution-quality-stats.pdf 7 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 79,
    "chunk_index": 15,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "assesses the impact of a new wholesaler, and Section 9 presents a stylized model explaining our empirical findings. Section 10 concludes. 2. Literature Review Previous work on execution quality has mostly focused on different market environments, market centers, and types of trades. Also, the market environment has drastically changed since the advent of zero commissions in 2019.7 A detailed analysis such as ours has not been performed before, owing to a lack of suitable public databases. Traditional trade-level datasets used in academic research, such as the Trade and Quote (TAQ) database, do not identify the broker, nor the wholesaler, nor the trade direction, nor the type of trader (retail or institutional). Our self-generated trades do not suffer from any of these drawbacks. They offer a representative sample of “market” orders, which are most widely used by retail investors.8 Other datasets are available, but only at aggregate levels. Under Rule 605, the SEC requires all market centers to publish monthly reports that include information about their average quality of execution on a stock-by-stock basis.9 The 605 forms, however, have no information about counterparties. Aside from that, Rule 606 requires broker-dealers to publish reports that provide a monthly summary of their routing practices to various venues, 7For example, Battalio et al. (2016) and Battalio (2018) use data from 2012 and 2016, respectively, to examine fees and rebates on exchanges, where rebates apply to limit orders. 8Schwab(2022),forexample(p.10),indicatesthatabout75%ofitsequitytradesareplainmarketorders. 9Fordetails,seeSEC(2005)(”DisclosureofOrderExecutionInformation”.) Onebenefitofthesereports is that the filers observed the direction of trades, so that there is no need to use an algorithm to do so. In contrast to a trading experiment, the typical approach in empirical research based on TAQ is to use the Lee and Ready (1991) algorithm or more recently Boehmer et al. (2021). These assign buy (sell) signals from trades executed above (below) the midpoint or based on the amount of subpenny price improvement, respectively. The problem, however, is that these algorithms misclassify many entries at or beyond the midpoint, which systematically understates the extent of price improvement. 8 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 79,
    "chunk_index": 16,
    "word_count": 340,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "assign buy (sell) signals from trades executed above (below) the midpoint or based on the amount of subpenny price improvement, respectively. The problem, however, is that these algorithms misclassify many entries at or beyond the midpoint, which systematically understates the extent of price improvement. 8 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 79,
    "chunk_index": 17,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "detailing fractions of orders as well as PFOFs, both in total dollars and per share.10 The 606 forms, however, have no information on quality of execution. Overall, these two forms are complementary, but only provide “marginal distributions” about execution and routing, instead of the full joint distribution for which our experiment has a representative sample. Dyhrbergetal.(2023)providethefirstsystematicdescriptionofthecurrentlandscapefor retail execution quality. They examine Rule 605 reports from 14 exchanges and the largest 8 wholesalers over the 2019-2022 period. Their first finding is that wholesalers deliver retail trading costs that are lower than those offered by exchanges, leading to savings estimated up to a billion dollars per month.11 They also examine competition in the wholesaler market, first by relating market share (not routing data) to prior execution quality. They find that market share for a particular stock 𝑖 is high when that wholesaler provides better overall execution quality. However, execution quality for stock 𝑖 has no effect, suggesting that brokers are only focusing on overall execution. They infer that brokers enforce competition by allocating more trades to wholesalers with better execution. Second, they examine the entry of a new wholesaler, Jane Street, which markedly increased its market share around July 2021. They find no change in realized spreads during the quarters after and before that date, concluding that the wholesaler market was already competitive before the entry. Ourregressionsofwholesalermarketshareonpriorpriceimprovementfindsimilarresults when measured in levels across all our brokers. However, we document that these results are driven by selective-routing brokers as well as the fact that two poorly performing wholesalers 10Enhanced disclosure requirements for Rule 606 (”Disclosure of Order Handling Information”) were adopted in November 2018. See SEC (2018). 11These results echo those in Adams et al. (2021) and Battalio and Jennings (2023). 9 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 79,
    "chunk_index": 18,
    "word_count": 293,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "brokers as well as the fact that two poorly performing wholesalers 10Enhanced disclosure requirements for Rule 606 (”Disclosure of Order Handling Information”) were adopted in November 2018. See SEC (2018). 11These results echo those in Adams et al. (2021) and Battalio and Jennings (2023). 9 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 79,
    "chunk_index": 19,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "have low market shares. We also focus on changes, not levels of market shares, and find markedly weaker effects. For proportional-routing brokers, we find the opposite result, i.e., the best wholesalers get lower shares than the worst for our trades. As to the new entrant, Jane Street entered the market at different times for different brokers. Because the effects are spread over time, this makes it difficult to find changes from aggregated 605 data. In contrast, we have data on individual brokers, which allows us to pick up changes in price execution at the precise time for each broker. Additionally, Form 605 is missing odd-lot trades, which now make up the majority of trades, as indicated previously. Finally, while we conclude that the market could benefit from more competition, we are also certainly not suggesting there is currently no competition. Indeed, retail traders now receive substantially better price improvement from wholesalers than exchanges. AdifferentperspectiveisofferedbyHuandMurphy(2022),whoarguethatthewholesaler marketishighlyconcentrated,withtwofirms,CitadelandVirtu,accountingforabout70%of retail order flow over 2017-2021. Their theoretical model predicts that, in a non-competitive market, spreads should be wider than needed. Our experiment provides direct evidence on routing and execution patterns between our sevenbrokersandtheirwholesalers, whichcanbeusedtoassessthedegreeofcompetitiveness of the wholesaler market. Indeed, the SEC (2022b) proposed an “Order Competition Rule” (OCR), which attempts to create more competition for retail trades. One concern is the use of Payment for Order Flow (PFOF), where wholesalers pay brokers for their order flow. PFOF could potentially lead to worse execution for retail traders due to its inherent conflict of interest. However, recent research (e.g., Battalio and Jennings (2023), Ernst and Spatt (2023), and Schwarz 10 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 79,
    "chunk_index": 20,
    "word_count": 268,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "Payment for Order Flow (PFOF), where wholesalers pay brokers for their order flow. PFOF could potentially lead to worse execution for retail traders due to its inherent conflict of interest. However, recent research (e.g., Battalio and Jennings (2023), Ernst and Spatt (2023), and Schwarz 10 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 79,
    "chunk_index": 21,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "et al. (2023)) has largely shown that PFOF does not significantly impact price execution for equity trades. The other concern is the current wholesaler routing model is not optimal and should be replaced by open auctions, where market makers bid on each individual order. This proposed market structure is totally different from the current one; the question is whether it is needed and whether it will indeed lead to better execution. Ernst and Spatt (2023) provide a systematic comparison of the two models. On the one hand, order-by-order auctions ensure that an incoming retail market order is always routed to the market maker with the best price. However, this may be worse than the typical price in the current routing model, for several reasons. First, the market maker with the most aggressive price is subject to a winner’s curse, e.g., because it reveals information about inventory positions. In response, market makers will bid more conservatively, leading to less competition. Worse, market makers may decide not to provide quotes at all, especially for small stocks that are subject to greater adverse selection. This may lead to failed auctions. Ontheotherhand, underthecurrentroutingmodel, wholesalersevaluatetheprofitability of the entire order flow that they are committed to trade, enabling the subsidization of say, small or less liquid stocks at the expense of large liquid stocks. In this case, the authors assume that competition is ensured because brokers monitor execution closely and route orders based on each market maker’s aggregate performance. Ernst and Spatt (2023) also provide empirical evidence that is consistent with their conclusions, which is that “retail investor welfare can decrease in a switch to order-by-order trading, especially for volatile or less liquid stocks”. We note, however, that their analysis assumes disciplined routing practices. Our paper checks whether this is the case. 11 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 79,
    "chunk_index": 22,
    "word_count": 302,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "is consistent with their conclusions, which is that “retail investor welfare can decrease in a switch to order-by-order trading, especially for volatile or less liquid stocks”. We note, however, that their analysis assumes disciplined routing practices. Our paper checks whether this is the case. 11 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 79,
    "chunk_index": 23,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "Indeed, perfect competition may be difficult to achieve. Competition across wholesalers should be enforced by brokers, who are themselves subject to the scrutiny of retail investors. Best execution rules should be enforced by regulators. Imperfect information, however, makes this difficult. In the current environment, for example, brokers and investors cannot compare execution quality across brokers. In other words, if there is no pressure on bro- kers from investors to improve execution quality, then brokers might not prioritize applying pressure to wholesalers either. Addressing this blind spot is the purpose of the recently proposed ”Order Execution Disclosure” rule (SEC (2022a)), which would expand the scope of 605 reports to brokers in addition to market centers, and will be discussed in the following section. 3. Interactions between Brokers and Wholesalers Starting in late 2019, almost all retail brokers went commission free, following Robin- hood’s example in 2015. This was made possible because brokers could route their trades off exchanges, directly to wholesalers. From the brokers’ perspective, this setup can not only provide PFOF revenues, but it also helps them fulfill their best execution requirements. Interestingly, the relation between brokers and wholesalers is rather loose, reflecting the nature of their private arrangements.12 First, the broker selects a pool of wholesalers that satisfy its due diligence requirements. The broker then sets a level of payment for order flow, which can be zero. It is important to note that the broker typically sets “level”, or identical, PFOF rates across wholesalers in order to avoid conflicts of interest in routing decisions. Next, the wholesaler can decide whether to accept or not the broker’s orders. 12Schwab (2022), for example, provides an overview of order routing practices for U.S. equities. 12 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 79,
    "chunk_index": 24,
    "word_count": 288,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "“level”, or identical, PFOF rates across wholesalers in order to avoid conflicts of interest in routing decisions. Next, the wholesaler can decide whether to accept or not the broker’s orders. 12Schwab (2022), for example, provides an overview of order routing practices for U.S. equities. 12 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 79,
    "chunk_index": 25,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "There are no other contractual obligations: brokers can route orders to any market centers, and wholesalers do not commit to any set price improvement. Notably, brokers receive no indicative quotes, pre-trade, from wholesalers. Also, from the viewpoint of wholesalers, they only see the order flow from each broker in aggregate, i.e., without knowing the identity of the clients placing orders. The next step is for the broker to send its order flow across venues. Wholesalers then execute the order flow they receive, either internally, i.e., into or from their own inventory, or externally, i.e., pass them along to another venue for execution, with the majority — close to 90% — internalized (SEC (2022b)). At this point, it is useful to detail the best execution requirements, which apply to both the originating broker and the wholesaler, who acts as “executing” broker. In the U.S., the broker-dealer industry is overseen by the Financial Industry Regulatory Authority (FINRA), which has issued guidance on best execution practices. According to FINRA (2014)’s Rule 5310, a member firm “shall use reasonable diligence to ascertain the best market for the subject secu- rity and buy or sell in such market so that the resultant price to the customer is as favorable as possible under prevailing market conditions.” In practice, Section .09 requires the originating retail broker to periodically conduct regular and rigorous reviews of the quality of the executions, at least on a quarterly basis. FINRA (2015) also says that this must include both venues currently used by the broker, as well as competing markets. Reviews are not sufficient, however. In addition: “Inconductingitsregularandrigorousreview,amembermustdeterminewhether any material differences in execution quality exist among the markets trading the 13 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 79,
    "chunk_index": 26,
    "word_count": 284,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "on a quarterly basis. FINRA (2015) also says that this must include both venues currently used by the broker, as well as competing markets. Reviews are not sufficient, however. In addition: “Inconductingitsregularandrigorousreview,amembermustdeterminewhether any material differences in execution quality exist among the markets trading the 13 Electronic copy available at: https://ssrn.com/abstract=4609895 security and, if so, modify the member’s routing arrangements or justify why it is not modifying its routing arrangements.” Thus, the best execution requirement is for both monitoring the quality of execution and taking action, i.e., changing routing if needed. It should be noted that brokers only observe directly the quality of execution of their own orders across wholesalers. They cannot see execution quality for the same trades executed at the same venues for other brokers, which motivates the proposal to expand the disclosure of execution information to brokers (SEC (2022a)). Brokers can observe stock-level execution reported by market centers in their 605 forms, but these are averaged across all trades and do not include odd lots. Finally, it is important to note that using prior performance to change routing assumes that execution quality is persistent and that changes in order routing will not impact price improvement. We will test the first hypothesis. Admittedly, different brokers may have different objective functions underlying their routing decisions. Brokers may emphasize different aspects of execution, or may focus on specialtypesoftrades, e.g., smallmarketorders. Indeed, differentbrokersmayhavedifferent clienteles (e.g., high net worth individuals versus small individual retail traders) that cause the broker to emphasize different types of orders in their routing decisions. In addition, the concept of “best execution” is more holistic than just price improvement (even though this is systematically listed first) and can include additional factors like execution time and fill rates. Fromourdiscussionswiththeindustry, brokersgenerallyprovidefeedback(“scorecards”) 14 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 79,
    "chunk_index": 27,
    "word_count": 296,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "to emphasize different types of orders in their routing decisions. In addition, the concept of “best execution” is more holistic than just price improvement (even though this is systematically listed first) and can include additional factors like execution time and fill rates. Fromourdiscussionswiththeindustry, brokersgenerallyprovidefeedback(“scorecards”) 14 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 79,
    "chunk_index": 28,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "on how a wholesaler’s price improvement compares to its competitors.13 If execution is subpar, the broker can advise the wholesaler to provide better price improvement. Of course, brokers also have the option to route more of their orders to different wholesalers. Practical considerations are also important. For instance, it may be beneficial to keep small allocations to some venues to enable broader and continuous comparisons of execution information. Also, it would be unwise to route all trades to one single venue, even if it had the best execution, because this could lead to less competition in the long run. Reportedly, allocations above 50% would also attract the attention of regulators. Brokers may even be hesitant to route a majority of their orders to one wholesaler in order to diversify against operational issues such as outages. Finally, some wholesalers may not have the technical capabilities to handle multiples of their current trading volumes. Going into the detail of stock-level routing practices, brokers can follow different ap- proaches. The first is to simply route a certain percentage of their entire order flow over a certain period to a wholesaler, which we refer to as “proportional” routing. Each wholesaler then receives a slice of the broker’s order flow, with the same relative weights (or composi- tion) across stocks, perhaps only differing in the share of total volume sent. One benefit of this approach is that, since each wholesaler receives the same composition for the order flow, the broker can compare execution directly at the overall portfolio level across wholesalers. In addition, discussions with the industry suggest that wholesalers prefer this proportional approach because the order flow is more diversified as well as more predictable over time, making it easier to manage inventory, thus possibly leading to better execution. 13Brokersprovideanonymizedrankingsacrosstheirwholesalers. Reportedly,thisisgenerallydoneacross tradesizesegment,e.g.,odd-lots,thenin“buckets”of100-499,500-1999,2000-4999,andabove5,000shares. 15 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 79,
    "chunk_index": 29,
    "word_count": 304,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "across wholesalers. In addition, discussions with the industry suggest that wholesalers prefer this proportional approach because the order flow is more diversified as well as more predictable over time, making it easier to manage inventory, thus possibly leading to better execution. 13Brokersprovideanonymizedrankingsacrosstheirwholesalers. Reportedly,thisisgenerallydoneacross tradesizesegment,e.g.,odd-lots,thenin“buckets”of100-499,500-1999,2000-4999,andabove5,000shares. 15 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 79,
    "chunk_index": 30,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "The second approach is for brokers to route orders on a stock-by-stock basis, which we call “selective” routing, usually described as “smart” routing by the industry. Under this scenario, brokers evaluate execution for each stock individually and increase the fraction of each stock routed to wholesalers that have provided the best execution for that stock. With selective routing, however, different wholesalers would receive different order flow composi- tion, so that evaluating wholesalers on an overall execution level may not be appropriate. So, performance evaluation is more complex under this scenario. Our data should enable us to address many of these questions, in particular what are the stock routing practices used by brokers, whether execution quality is persistent, and whether routing patterns are influenced by execution quality, all of which are important to evaluate the retail broker-wholesaler marketplace. 4. Data Our main source of data is self-generated, by placing our own parallel trades at several brokerage houses. In summary, we place simultaneous identical trades (i.e., trades in the same stock of the same order size at the same time) across multiple brokerage accounts. An early version of this dataset is used in both Schwarz et al. (2023) and Barber et al. (2023). Further details about the experiment can be found in those manuscripts. The stocks we traded were selected as a representative sample of the population of U.S. stocks by stratification into 128 bins based on market capitalization, price, liquidity, and volatility using the June 2021 version of the CRSP stock database. To be included, each stock was required to have a price greater than a dollar and a share code of either 10 or 11.14 14StockslessthanonedollararesubjecttodifferentrulesperRegulationNMS.Additionally, someofour 16 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 79,
    "chunk_index": 31,
    "word_count": 283,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "based on market capitalization, price, liquidity, and volatility using the June 2021 version of the CRSP stock database. To be included, each stock was required to have a price greater than a dollar and a share code of either 10 or 11.14 14StockslessthanonedollararesubjecttodifferentrulesperRegulationNMS.Additionally, someofour 16 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 79,
    "chunk_index": 32,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "One stock was then selected randomly within each bin. Stocks with a share price that drops below one dollar at the end of the week are replaced with others from the same buckets using the latest quarterly version of the CRSP database. In addition, we included four stocks with high retail activity (AMC, Tesla, Nio, and Aurora Cannabis) and some mega-cap stocks (Apple, Bank of America, NVIDIA, ExxonMobil, Google, and Visa.) Duringthecourseofourexperiment,wetradedstocksatsixdifferentbrokeragesinseveral accounts. Our trades are executed through E*Trade, Fidelity, Interactive Brokers (IBKR), Robinhood, Schwab, and TD Ameritrade, which is now owned by Schwab. For IBKR, we traded both their Pro and Lite (Free) accounts, which are with and without commissions, respectively. Whenever possible, we use the Application Programming Interface (API) to automatically trade stocks each day. This allows us to process a large number of trades, as wellastoensurethatexecutiontimesareclosetoeachother. Unfortunately, someprominent brokers, including IBKR Free, Schwab, and Fidelity, do not offer general access to their API. Hence, we had to place trades at these brokers by hand. Trade times are synced to match the trade times at other brokers. We begin trading each day at 9:40 AM EST, shortly after the opening auction. Our program trades throughout the day, spacing trades out over the course of the day, with the last trades ending at 3:50 PM EST shortly before the market close. Trading times are rotated across stocks to avoid any time-of-day effect. After purchase, the program sells the same number of shares within 30 minutes. Thus, there is little directional exposure during the day and no open positions at the close. Our order target size is $100. We trade full brokers will not trade stocks less than one dollar without special approval. Share codes 10 and 11 identify U.S.-based common stocks. 17 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 79,
    "chunk_index": 33,
    "word_count": 298,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "is little directional exposure during the day and no open positions at the close. Our order target size is $100. We trade full brokers will not trade stocks less than one dollar without special approval. Share codes 10 and 11 identify U.S.-based common stocks. 17 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 79,
    "chunk_index": 34,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "shares only, rounding the number of shares to make the trade size closest to $100, with a minimum size of one share for higher priced stocks. Identical orders are randomized across brokers to avoid giving a systematic time advantage to any broker.15 In total, we placed 171,634 trades equivalent to $22.4 million in notional. We supplement our trading data with TAQ, which has a complete record of all trades in U.S. equities. We identifiedeachofourtradesandretrievedthematchingNationalBestBidandOffer(NBBO) generated through WRDS. TAQ also provides a broad classification of trade locations, but most of our trades are off-exchanges and coded as “D.” Next, we use return and volume data from CRSP. Finally, wewereabletoidentifytheexactvenuesforallourtrades. WereliedonSECrule 606(b)(1), which requires brokers to provide clients with the exact routing of each of their trades over the last six months. We requested and received this information from all of our brokers. This information is crucial to evaluate routing decisions and wholesaler execution. In Table 1, we provide summary statistics on order routing for each of our brokerage accounts. The row totals give the total number of trades for that brokerage account, whereas the column totals give the total number of trades sent to that wholesaler across all of our accounts. Panel A shows the total number of trades across brokers and wholesalers, whereas Panel B shows percentages by brokers. [Insert Table 1 about here] Most of our commission-free trades are sent to four wholesalers – Citadel, Virtu, Jane Street, and G1X. The rest is sent mostly to Two Sigma (mainly by Robinhood), to UBS 15See Schwarz et al. (2023) for a detailed analysis of the experiment’s controls and robustness to latency. 18 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 79,
    "chunk_index": 35,
    "word_count": 277,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "commission-free trades are sent to four wholesalers – Citadel, Virtu, Jane Street, and G1X. The rest is sent mostly to Two Sigma (mainly by Robinhood), to UBS 15See Schwarz et al. (2023) for a detailed analysis of the experiment’s controls and robustness to latency. 18 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 79,
    "chunk_index": 36,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "which shrunk its market share over this period, and other venues. Routing patterns in the IBKR Pro account are very different, however, with most of the trades sent to IBKR’s own Alternative Trading System (ATS) and to exchanges.16 The routing patterns are also shown in Figure 1. [Insert Figure 1 about here] Our data have several advantages over publicly available order routing information. Bro- kers are required to file SEC Form 606 reports that disclose PFOF information by venue and trade type. They also show the fraction of orders routed to their venues. However, there is no information on the dollar size of the order flows, nor detail about individual stocks, because they are aggregated at the S&P500 and non-S&P500 levels. They are also missing the price improvement for each wholesaler.17 The wholesalers used by brokers are required to file SEC Form 605 reports that display detailed execution statistics broken down by stock. Because all trades are aggregated, the data only represent averages across all clients. This hides any differences in execution. Indeed,wholesalerscanprovidewidelydifferentexecutionacrossclients,asshownbySchwarz etal.(2023). Also,asnoted,oddlotsarenotreported. Theformscanalsobeusedtomeasure the fraction of trading done for individual stocks by market centers, but these are aggregate numbers as well, which cannot be tied to brokers. Thus, such aggregate data, both at the 16ATSsarecomputerizedsystemssuchasElectronicCommunicationNetworks(ECNs)thatautomatically matchbuyersandsellersofsecurities. A“darkpool”referstoanATSthatisnot“lit”,meaningthatitdoes notpubliclydisplaypre-tradequotations. Theyarelessregulatedthanexchangesbutarestillsubjecttothe 1998RegulationATS.BothATSsandwholesalersmustalsooperateasbroker-dealers, soarestillsubjectto SEC and FINRA oversight. They generally charge no execution fees or fees that are lower than exchanges. 17We compare our trades routing to the 606 data for all of our brokers, except IBKR who does not separate their LITE and PRO accounts. The fit was excellent, with an R-square around 90%. As expected, it was slightly worse for Robinhood, which actively changes routing across stocks and over time. So, our routing sample is representative of the brokers’ routing. 19 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 79,
    "chunk_index": 37,
    "word_count": 298,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "does not separate their LITE and PRO accounts. The fit was excellent, with an R-square around 90%. As expected, it was slightly worse for Robinhood, which actively changes routing across stocks and over time. So, our routing sample is representative of the brokers’ routing. 19 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 79,
    "chunk_index": 38,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "stock execution level and for venue market share, make it difficult to infer broker routing patterns and execution levels. Our data directly address these issues. We place the same trades at each broker, so there are no order flow differences. Our trades are largely odd lot trades, which represent the majority of retail stock trading. For each one of our trades, we can precisely trace the routing and execution, and compare them across brokers and wholesalers. Thus, we can directly observe patterns in order flows and check how they react to the quality of execution. This allows us to directly observe the interaction between brokers and wholesalers. To provide a visual representation of the details in our dataset, Figure 2 plots data for Robinhood as an illustration. In Panel A, we report the percentage of our trades sent to each wholesaler over our 18-month trading period. In Panel B, we report the effective over quoted (E/Q) spread for each wholesaler, averaged across stocks. [Insert Figure 2 about here] Note that E/Q is a traditional measure of transaction cost. For buy trades, for example, the “effective” spread is defined as twice the difference between the execution price and the midpoint; this is then scaled by the (NBBO) quoted spread to give a unitless ratio. This is directly related to price improvement (PI), which in this case is the ask quote minus the execution price, also scaled by NBBO. Indeed, (𝐸/𝑄) = 1−2 PI. So, lower E/Q is equivalent to greater price improvement. The graph shows that the average E/Q is around 0.4, which implies PI = 30%. Our data reveal substantial variation, both over time and in the cross-section, in order routing as well as effective spreads. Such detail far exceeds what is available in public 20 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 79,
    "chunk_index": 39,
    "word_count": 301,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "The graph shows that the average E/Q is around 0.4, which implies PI = 30%. Our data reveal substantial variation, both over time and in the cross-section, in order routing as well as effective spreads. Such detail far exceeds what is available in public 20 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 79,
    "chunk_index": 40,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "disclosures, which only report aggregate execution statistics and aggregate market shares across wholesalers on a monthly basis. This said, our data has two limitations. First, most of our orders are odd lot orders that may receive different execution from larger orders.18 Second, we are only examining market orders for equities. Thus, our results may not generalize to other order types. 5. Stock Routing Patterns We begin our analysis by showing how our brokers route stock trades. As an example, we first compute the percentage of our orders for each stock with more than 100 trades overall that are routed to Citadel. For each broker, we then sort each stock from the lowest to the highest percentage. We display results in Figure 3 for E*Trade, Fidelity, IBKR Lite, Robinhood, Schwab, and TD Ameritrade, in Panels A to F, respectively. The horizontal axis corresponds to each of the stocks in our trades. Each entry describes the distribution of trades sent to Citadel for that stock, i.e., with a sequence of 1 (if so) or 0 (or not), showing their average by a circle in the middle of whiskers that represent 95% confidence bands. Red lines indicate that the percentage of orders routed to Citadel is significantly different from the overall average for that broker. [Insert Figure 3 about here] If brokers were using a “proportional” method to route orders, we should observe that all of our stocks have essentially the same percentage of their orders routed to Citadel, or that 18Schwarz et al. (2023), however, did place larger trades and trades over 100 shares. They find similar executioncomparedtotheir$100trades. Thus,wewouldexpectordersinlargersizestobehandledsimilarly. 21 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 79,
    "chunk_index": 41,
    "word_count": 273,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "method to route orders, we should observe that all of our stocks have essentially the same percentage of their orders routed to Citadel, or that 18Schwarz et al. (2023), however, did place larger trades and trades over 100 shares. They find similar executioncomparedtotheir$100trades. Thus,wewouldexpectordersinlargersizestobehandledsimilarly. 21 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 79,
    "chunk_index": 42,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "the average line should be flat. On the other hand, if many stocks deviate strongly from the average, the broker must be employing a “selective” routing method. The six accounts route between 24% and 37% of their orders to Citadel, on average. Otherwise, the figure suggests that brokers use different methods for routing orders. Four of our brokers use a method close to proportional routing, that is, E*Trade, Fidelity, Schwab, and TD Ameritrade. ThegraphsforIBKRLiteandRobinhood, ontheotherhand, differfromthoseinthefirst group,indicatingthatthesetwobrokersuseselectiveorderrouting. Indeed,thesetwobrokers advertise this feature. Robinhood indicates that “[T]his algorithm, known as the smart order router, prioritizes sending your order to a market maker that’s likely to give you the best execution, based on historical performance.”19 IBKR also emphasizes its ‘SmartRouting’ algorithm, which “searches for the best destination price in view of the displayed prices, sizes and accumulated statistical information about the behavior of market centers at the time an order is placed, then immediately seeks to execute that order electronically.”20 To investigate factors that lead to differences in order routing, we perform a series of logistic regressions. For each broker and wholesaler, we run a model where the dependent variable is set to one if the broker’s order was routed to that wholesaler, and zero otherwise. We include variables that may explain routing decisions and can be directly observed by the broker. Following the idea that more trades should be routed to venues that provide lower execution cost, the first variable is the prior calendar month’s E/Q ratio for that stock at that venue minus the average E/Q for that same stock across venues, all at the same 19See https://robinhood.com/us/en/support/articles/how-robinhood-makes-money/. 20See https://www.interactivebrokers.com/lib/cstools/faq/#/content/38448530/. 22 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 79,
    "chunk_index": 43,
    "word_count": 275,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "should be routed to venues that provide lower execution cost, the first variable is the prior calendar month’s E/Q ratio for that stock at that venue minus the average E/Q for that same stock across venues, all at the same 19See https://robinhood.com/us/en/support/articles/how-robinhood-makes-money/. 20See https://www.interactivebrokers.com/lib/cstools/faq/#/content/38448530/. 22 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 79,
    "chunk_index": 44,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "broker (Venue Excess E/Q (t-1)). This variable measures the cost of price execution for this stock traded at this wholesaler relative to other venues. We would expect a negative coefficient with selective routing. The second variable is the percentage of trades that were routed to that venue during the prior calendar month (Venue % (t-1)); this controls for persistence in routing decisions. We also include a number of other control variables. Stock characteristics include the log of the stock price at the time of the trade, the log-volume and both the return and the absolute value of the return on the trade day. We also include the spread at the time of the trade, whether the trade is a buy or sell (1 or 0), and whether the stock is part of the S&P 500 index (1 if so, or 0). The last variable indicates whether our last trade went to the same venue. In all models, we include day fixed effects.21 We provide the visualization of coefficient estimates in Figure 5 and report results in Table 2 for E*Trade, Fidelity, IBKR Lite, Robinhood, Schwab, and TD Ameritrade in Panels A to F, respectively. 22 [Insert Figure 5 about here] [Insert Table 2 about here] The logistic models lead to the same conclusions as Figure 3 for our brokers. Four of our brokers have nearly proportional routing. The coefficients on prior execution costs are not significant. These brokers clearly do not allocate stock-level order flow on the basis of past stock-level execution. 21Because the number of days that we have traded exceeds the number of stocks, we cannot cluster by stockandincludedayfixedeffectsinthesamemodel. Wefindsimilarconclusionsifweremovethedayfixed effects and cluster by stock, or if we include month fixed effects and cluster by stock. 22Note that not all wholesalers are present in the panels. This is either because the broker did not send any trades to that venue, or because the number of observations is too small, e.g., for UBS. We chose a cutoff point of at least 100 trades to include venues. 23 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 79,
    "chunk_index": 45,
    "word_count": 343,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "are present in the panels. This is either because the broker did not send any trades to that venue, or because the number of observations is too small, e.g., for UBS. We chose a cutoff point of at least 100 trades to include venues. 23 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 79,
    "chunk_index": 46,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "On the other hand, many variables are significant for Robinhood and IBKR Lite. In both cases, a wholesaler is more likely to get an order if the prior month execution on that stock was better than other wholesalers. Order flow is also persistent across time. In many cases, the two brokers’ selective-routing systems agree. For example, both are more likely to route trades for stocks with high volumes to Citadel. Next, we turn to IBKR Pro. As discussed before, this explicitly uses a ‘SmartRouting’ system. Table 1 shows that this account uses different execution venues. Indeed, it routes the majority (58%) of its trades to its own ATS, then 34% to one of the exchanges, with a few percent only to wholesalers. Figure 3 showed routing patterns from other brokers to Citadel. Similarly, Figure 4 plots the percentage of trades for each stock that is routed to IBKR’s ATS. [Insert Figure 4 about here] As with IBKR Lite and Robinhood, IBKR Pro appears to be non-randomly routing our trades to its ATS. In fact, we see a wide dispersion in routing percentage, with one stock having only 10% of its orders only routed to the ATS and another stock having every single order routed to the ATS. This spread is more extreme than that for Robinhood and IBKR Lite. We then perform the same logistic regression as in Table 2, using the ATS and exchanges as execution venues. Results are shown in Table 3. [Insert Table 3 about here] Consistent with the figure, IBKR uses selective routing to its own ATS. We find very strong evidence, from the coefficients on Venue Excess E/Q, that more trades are sent to 24 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 79,
    "chunk_index": 47,
    "word_count": 285,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "as execution venues. Results are shown in Table 3. [Insert Table 3 about here] Consistent with the figure, IBKR uses selective routing to its own ATS. We find very strong evidence, from the coefficients on Venue Excess E/Q, that more trades are sent to 24 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 79,
    "chunk_index": 48,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "venues that have provided lower execution cost than the competition, although we do not find this is true for exchange traders. Perhaps exchange trades are exhausted trades from their smart-router that would get relatively worse execution at that time on a dark pool. There are also systematic differences between the types of stocks sent to these two venue groups. Stocks with wide spreads and high prices are more likely to be sent to the ATS; stocks with opposing characteristics are systematically sent to exchanges, reflecting venue complementary. Interestingly, based on the findings of Schwarz et al. (2023), the three accounts with the lowest overall price improvement are those using selective routing. Other factors, however, may be the primary drivers of the observed differences in execution, such as the toxicity of order flow.23 Perhaps brokers with more toxic order flows have to work especially hard at improving their execution quality. In any event, the key issue is the quality of actual, not past, trade execution. 6. Persistence of Price Improvement Before evaluating how brokers perform managing their order flow, we examine how per- sistent price execution is over time. If price execution is random for a particular broker- wholesaler pair, then there is little value in rerouting order flow to the wholesaler that had the best performance (or lowest cost) the prior period. We consider persistence first at the 23Also, brokers may face conflicts of interests when operating their own ATS that may affect execution quality. Anandetal.(2021)examineinstitutionalbrokersthatoperatetheirownATS.Theyarguethatthis setup can create potential conflicts of interest. For example, such brokers would avoid paying exchange fees that they typically absorb by using affiliated venues. Also, they benefit from higher volumes on affiliated venues because other participants typically pay fees to their ATS. As a result, such brokers may prefer affiliated ATSs over other venues, even if not optimal for the client. Indeed, these authors report that such trading in affiliated ATSs is associated with lower execution quality. 25 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 79,
    "chunk_index": 49,
    "word_count": 329,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "because other participants typically pay fees to their ATS. As a result, such brokers may prefer affiliated ATSs over other venues, even if not optimal for the client. Indeed, these authors report that such trading in affiliated ATSs is associated with lower execution quality. 25 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 79,
    "chunk_index": 50,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "overall portfolio level, and second at the stock level. To evaluate the overall performance of wholesalers, we first compute the monthly average of the price improvement, using E/Q, for each wholesaler at each broker for our trades. We then subtract the average E/Q across wholesalers for that broker to obtain the “excess” E/Q for each wholesaler-pair. To evaluate persistence, we regress this excess E/Q over its average over the last one- and three-month periods. The regression is estimated across all brokers, then separately for proportional and selective-routing brokers, and finally for each broker individually. Regressions are run with broker dummy variables where appropriate, and standard errors are clustered by month. We report results in Panels A and B of Table 4. [Insert Table 4 about here] We find that wholesaler comparative performance is extremely persistent at the overall level. Across all brokers, the prior one-month coefficient is 0.74, which is very high and statistically significant. Figure 6 illustrates this very strong relationship and shows that the R-square is very high, above 50%. Using the average execution over the last three months, the slope increases to 0.86. At least, the slope is lower than one, which suggest slow reversion to the broker mean, or mild amelioration of performance over time. [Insert Figure 6 about here] These results hold up in our two subgroups of proportional and selective-routing brokers, with similar slope coefficients. Of course, brokers can keep track of the entire universe of their trades executed by the various wholesalers and can perform the same analysis in-house. 26 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 79,
    "chunk_index": 51,
    "word_count": 262,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "about here] These results hold up in our two subgroups of proportional and selective-routing brokers, with similar slope coefficients. Of course, brokers can keep track of the entire universe of their trades executed by the various wholesalers and can perform the same analysis in-house. 26 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 79,
    "chunk_index": 52,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "Admittedly, they may have other objectives than the average price improvement across all their trades. Using our representative sample, however, we can also perform the analysis at the broker level. Across our six brokers, we still find high slope coefficients, varying from 0.51 to 0.92 in Panel A. This suggests that excess E/Q across wholesalers is highly predictable at the portfolio level. Next, we perform the same analysis at the individual stock level. This is useful for a numberofreasons. First, thisallowsustocontrolforpossibletiltsinthestocksroutedacross wholesalers. A broker could send, for example, more stocks with easier price improvement systematically to one wholesaler, which would create artificial persistence in excess E/Q. Even though we found minor effects of stock characteristics on routing in Table 2, this is a useful robustness check. Second, this stock-level analysis is representative of selective routing, where brokers are relying on persistence in price execution at the individual stock level to make routing adjustments. Ontheotherhand, usingdataatthestockleveldataissurelynoisierthanattheportfolio level, leading to estimated coefficients that can be biased downward if the right-hand-side variables are affected by greater errors in the variables.24 Indeed, actual execution prices surely also reflect transitory movements in stock-level inventory, which create idiosyncratic noise. Due to diversification effects, such transitory deviations are dampened at the total inventory level. We now calculate excess E/Q as the wholesaler E/Q for a stock at a broker minus the E/Q for that stock across all wholesalers for that broker, both averaged over the month. 24Thisissueisakintotestsofassetpricingmodelswheretheright-hand-sidevariableconsistsofstock-level historical betas, which are affected by estimation error, reflecting the usual sampling variability. Traditional methodology then groups stocks into portfolios to decrease this error, and thus lower the bias in slope coefficients. See Kim (1995), for example. 27 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 79,
    "chunk_index": 53,
    "word_count": 283,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "broker, both averaged over the month. 24Thisissueisakintotestsofassetpricingmodelswheretheright-hand-sidevariableconsistsofstock-level historical betas, which are affected by estimation error, reflecting the usual sampling variability. Traditional methodology then groups stocks into portfolios to decrease this error, and thus lower the bias in slope coefficients. See Kim (1995), for example. 27 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 79,
    "chunk_index": 54,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "This is done at each broker individually. We then run the same model as before but at the stock level. Results are shown in Panels C and D of Table 4. The results are consistent with those at the overall, portfolio levels. Across all brokers, subgroups, and individual brokers, we find that price execution is persistent based on the prior one- and three-month prior price execution. Across all brokers, the slope coefficient is 0.18, and also highly statistically significant. The values of the coefficients, however, are systematically lower than those at the portfolio level in Panels A and B. Also, the R-squares are on the order of eight percent instead of 50 percent. As indicated, the lower coefficients surely reflect the greater degree of noise when evaluating PI at the stock level. All panels indicate that excess E/Q by wholesaler is highly persistent, and thus predictable over time. Overall, these findings suggest that brokers can use prior data to make changes to their routing practices to obtain greater price improvement for their customers. 7. Broker Response to Prior Price Improvement In the prior section, we found that price improvement is persistent over time. As a result, we examine whether brokers use this information to alter their routing decisions over time. We would expect that brokers do change their allocation to wholesalers based on past execution. Indeed, brokers are required, under their best execution obligations, to evaluate the execution quality of execution venues over time, and to act upon this evaluation. As previouslymentioned, theyreportedlycomplywiththeseobligations“byestablishingrouting allocationsbasedonthishistoricalperformance.”Onewouldexpectthatthisassertionshows up in the data. In addition, active routing choices should be an essential practice to maintain competition in the wholesaler market. 28 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 79,
    "chunk_index": 55,
    "word_count": 281,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "best execution obligations, to evaluate the execution quality of execution venues over time, and to act upon this evaluation. As previouslymentioned, theyreportedlycomplywiththeseobligations“byestablishingrouting allocationsbasedonthishistoricalperformance.”Onewouldexpectthatthisassertionshows up in the data. In addition, active routing choices should be an essential practice to maintain competition in the wholesaler market. 28 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "1. Introduction",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 79,
    "chunk_index": 56,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "To determine how brokers react to prior execution, we first compute the monthly change inthepercentageofordersroutedfromeachbrokertoeachwholesaler, usingalltradesacross all stocks. Next, we regress these changes against the past excess E/Q for that wholesaler at that broker, measured over the prior one- and three-month periods. The regression is estimated across all brokers, then separately for proportional and selective-routing brokers, and finally for each broker individually. For our brokers that use proportional routing, we should observe changes at the overall routing level. For selective-routing brokers, changes should occur at the stock level, perhaps obscuring changes at the overall level. Our models include appropriate brokers dummies and cluster standard errors by month. We report results in Panels A and B of Table 5. [Insert Table 5 about here] When looking at all brokers together, we find some evidence that brokers change their routing toward wholesalers that provided better execution the prior month. The slopes are barely statistically significant, but the economic magnitude is quite small. For every 0.01 decline in excess E/Q, there is only approximately a 0.03% increase in the share of orders routed to that wholesaler. For better economic perspective, recall that E/Q= +1 is the worst possible pricing, that E/Q= 0 is midpoint pricing, and that E/Q= −1 means buying at the bid and selling at the ask. So, if E/Q were to go from +1 to −1, which is an extreme move, the wholesaler would only gain 6.2% share. Looking at individual brokers, this result is driven completely 29 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "7.1. Routing Changes",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 79,
    "chunk_index": 57,
    "word_count": 253,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.1. Routing Changes (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "that E/Q= −1 means buying at the bid and selling at the ask. So, if E/Q were to go from +1 to −1, which is an extreme move, the wholesaler would only gain 6.2% share. Looking at individual brokers, this result is driven completely 29 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "7.1. Routing Changes",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 79,
    "chunk_index": 58,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.1. Routing Changes (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "by the selective-routing brokers and almost exclusively by Robinhood. Also, note that only the prior month execution has any statistically significant impact on routing changes.25 Next, we consider stock-by-stock routing as a function of prior stock execution. Brokers with selective routing should be expected to send relatively more trades for individual stocks to wholesalers with better execution for that stock. This is unlike brokers with proportional routing, which only adjust total flows to each wholesaler. The analysis is similar to the previous one, with results reported in Panels C and D of Table 5. We find similar results. Selective-routing brokers do make changes to their stock routing patterns based on prior execution, while proportional brokers show no response based on the variation in the quality of execution for individual stocks. Overall, our results suggest that most brokers either do not or cannot make changes to their routing patterns based on prior execution that are likely to improve price execution for our types of trades. Either brokers are poor monitors of price execution by wholesalers, with ineffective follow-up, or the wholesaler market is not competitive and therefore brokers do not feel capable of changing their routing practices. 7.2. Routing Levels In contrast, Dyhrberg et al. (2023) conclude that the wholesaler market is competitive, using Form 605. They find that wholesalers with better price execution tend to have a higher percentage of trades routed to them. In other words, they focus on levels whereas our analyses focus on changes. For comparison purposes, we also run our analysis using levels instead of changes. Each 25Inuntabulatedresults,wealsoexamineweeklychangesonpriorweekexcessE/Qandmonthlychanges on prior two-month execution. The results are similar to those in Table 5. 30 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "7.1. Routing Changes",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 79,
    "chunk_index": 59,
    "word_count": 281,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.1. Routing Changes (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "routed to them. In other words, they focus on levels whereas our analyses focus on changes. For comparison purposes, we also run our analysis using levels instead of changes. Each 25Inuntabulatedresults,wealsoexamineweeklychangesonpriorweekexcessE/Qandmonthlychanges on prior two-month execution. The results are similar to those in Table 5. 30 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "7.1. Routing Changes",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 79,
    "chunk_index": 60,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.1. Routing Changes (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "month, we regress the percentage of our trade (in levels) routed to each wholesaler for each broker against the prior month’s excess E/Q for that wholesaler for that broker. Because 96% of our orders are routed to the top four wholesalers, we also present results for the top four wholesalers only, in addition to the full sample. Results are shown in Table 6. [Insert Table 6 about here] For the full set of wholesalers, which is the most comparable to these authors’ analysis, we indeed match their results. The negative slope indicates that better price execution, or lower cost, is associated with greater market share for wholesalers. For every 0.01 lower excess E/Q, a wholesaler receives 0.3% more share. However, this result is much stronger for our selective-routing brokers than our proportional-routing brokers. Interestingly, only three of our six brokers show significant coefficients with correct negative signs. Consider next the subsample of “Top 4” wholesalers (Panel B). For all brokers, the slope coefficient is similar to that in the first column. However, results now differ sharply across the two broker groups. While selective-routing brokers still have a very significant negative relation, our proportional brokers now have a positive, significant relation. 7.3. Execution and Routing To illustrate this point, consider the broker Fidelity. Figure 7 plots the time series of its wholesaler share in Panel A and execution cost in Panel B. [Insert Figure 7 about here] Panel B shows that Citadel is, on average, the laggard among the “Top 4” wholesalers for our trades at that broker. Virtu has the best execution, with Jane Street and G1X in 31 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "7.1. Routing Changes",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 79,
    "chunk_index": 61,
    "word_count": 274,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.1. Routing Changes (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "A and execution cost in Panel B. [Insert Figure 7 about here] Panel B shows that Citadel is, on average, the laggard among the “Top 4” wholesalers for our trades at that broker. Virtu has the best execution, with Jane Street and G1X in 31 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "7.1. Routing Changes",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 79,
    "chunk_index": 62,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.1. Routing Changes (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "between. One would expect a similar ranking of market shares. However, Panel A shows that Citadel receives the most orders, around 40% on average. In fact, the wholesaler shares have been relatively stable over our 13 months of trading. As an aside, it is interesting to note that execution costs for Fidelity have sharply decreased over this period, from an average E/Q of 0.30 to around 0.10, which is a remarkable improvement. To summarize the evidence across brokers, Figure 8 plots the overall relation between market share and execution costs. Panels A and B break down the sample into proportional and selective brokers, respectively. Selective brokers display the expected negative relation between higher cost and lower shares. In contrast, this relation is positive for proportional brokers. [Insert Figure 8 about here] In Section 9, we present a model of order routing with switching costs to explain the relation between market share and execution costs. As discussed previously, best execution certainly has many dimensions, across types of orders, trade sizes, and execution metrics. Our sample focuses on E/Q for our odd-lot marketorders. ItispossiblethatFidelityreceivesbetterexecutionthanaveragefromCitadel for non-odd lot orders. Even so, it would be straightforward to establish different routing patterns across trade sizes so that small investors enjoy better execution. Ultimately, reflecting these routing patterns, the average execution for each of our whole- salerscandeviatesignificantlyfromthebrokeraverage. InTable7, wepresentthesenumbers for each broker-wholesaler pair. We show the average E/Q for each broker, and then excess E/Q as described before, averaged over all trades within a month for each pair. We then 32 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "7.1. Routing Changes",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 79,
    "chunk_index": 63,
    "word_count": 260,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.1. Routing Changes (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "routing patterns, the average execution for each of our whole- salerscandeviatesignificantlyfromthebrokeraverage. InTable7, wepresentthesenumbers for each broker-wholesaler pair. We show the average E/Q for each broker, and then excess E/Q as described before, averaged over all trades within a month for each pair. We then 32 Electronic copy available at: https://ssrn.com/abstract=4609895 report time-series statistics based on the Fama and MacBeth (1973) approach using Newey and West (1987) with one lag to control for autocorrelation. [Insert Table 7 about here] Weobservestatisticallyandeconomicallylargedifferencesacrosswholesalers, evenwithin the Top 4. For both E*Trade, Fidelity, and Schwab, the spread between the best and worst execution cost E/Q is greater than 0.20. TD has the smallest spread, at 0.10, but also the lowest average execution cost. 7.4. Counterfactual To see how much using past execution to route orders would potentially improve our execution, we run a counterfactual analysis. We must assume that such rerouting would not alter our trade execution nor the competitive dynamics of the wholesaler market (which is reasonable given the small size of trades.) We use two methods. The first is based on overall execution. Each month for each broker, we route all of our orders to the wholesaler who had the best execution the prior month. All of our trades are then assigned the average execution for each stock at that broker received from that wholesaler in the current month. The second is based on stock-by-stock routing. We use the prior month’s execution on a stock-by-stock level to reroute our trades to the best wholesaler for that stock during the prior month. Our trades are then assigned the actual execution for each stock at that broker in the current month. We report our results in Table 8 with overall and stock-by-stock execution in Panels A and B, respectively. 33 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "7.1. Routing Changes",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 79,
    "chunk_index": 64,
    "word_count": 299,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.1. Routing Changes (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "wholesaler for that stock during the prior month. Our trades are then assigned the actual execution for each stock at that broker in the current month. We report our results in Table 8 with overall and stock-by-stock execution in Panels A and B, respectively. 33 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "7.1. Routing Changes",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 79,
    "chunk_index": 65,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.1. Routing Changes (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "[Insert Table 8 about here] ThecolumnsshowtheoriginalE/Q,theupdatedE/Q,aswellastheabsoluteandrelative difference, for each broker. When using overall execution, the effective spread decreases from an average across brokers of 0.315 to 0.235, which is a major improvement. The percentage improvement averages a drop of 34% across brokers. The changes are statistically significant across all brokers. However, the changes for the proportional-routing brokers are much larger than the selective-routing brokers. Using stock-by-stock routing creates some improvement as well, but the changes are more muted. This is likely due to the increase in noise that we found previously in our previous stock-by-stock persistence results. These results suggest that routing based on overall execution could in theory achieve better results. In practice, however, this method would create extreme swings in routing fractions that are not realistic. Still, one could modulate the change, by assigning, for example, half the weight on the original and the other half on our updated routing, which would result in half the E/Q improvement reported in the table. Overall, our results suggest that many brokers are not able to extract the best execution from the wholesaler market. This could be due to monitoring patterns and insufficient pressuring of wholesalers by brokers. Alternatively, retail investors may not know or care about differences in execution across brokers, which does not create pressures for further execution improvement on brokers.26 Regardless of the reason, our results suggest room for improvement in retail trading execution. 26For our largely odd-lot orders, even Form 605 has no data on execution. Thus, there is no effective way to evaluate wholesaler performance on odd-lots, even at an aggregate level. 34 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "7.1. Routing Changes",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 79,
    "chunk_index": 66,
    "word_count": 272,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.1. Routing Changes (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "Regardless of the reason, our results suggest room for improvement in retail trading execution. 26For our largely odd-lot orders, even Form 605 has no data on execution. Thus, there is no effective way to evaluate wholesaler performance on odd-lots, even at an aggregate level. 34 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "7.1. Routing Changes",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 79,
    "chunk_index": 67,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.1. Routing Changes (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "In the prior section, we find that most brokers do not seem to actively reroute orders across wholesalers to get better execution for their clients. In this section, we examine how the entry of a new competitor impacts the wholesaler market for one of our brokers. Jane Street progressively entered the retail wholesaler market in 2020. Based on Form 606 filings, Jane Street became a market center for Fidelity in the second quarter of 2020, for E*Trade in the second quarter of 2021, and for TD Ameritrade in the fourth quarter of 2021. In all cases, market shares increased sharply for Jane Street. Unfortunately, these entrances predate our trading experiment, which starts in early 2022. Otherwise, Dyhrberg et al. (2023) use 605 data to suggest that the entrance of Jane Street did not impact wholesaler execution between the second and fourth quarters of 2021. However, Jane Street did not become a wholesaler for Robinhood until the first quarter of 2022, which is in our sample. When we started trading, none of our orders were routed to Jane Street. By February 22, 2022, almost a quarter of our trades were routed to Jane Street, as shown in Panel A in Figure 2. During the initial period, Jane Street provided very low trading costs, even negative (Panel B). This amount was not economically sustainable and, once Robinhood started allocating more trades to Jane Street, the trading cost went back to a level comparable to the best wholesalers. To evaluate more formally the impact of this new entrant, we examine changes in two wholesaler characteristics, i.e., the fraction of orders routed to Robinhood’s venues, and the 35 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "8.1. Empirical Evidence",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 79,
    "chunk_index": 68,
    "word_count": 279,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "8.1. Empirical Evidence (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "to Jane Street, the trading cost went back to a level comparable to the best wholesalers. To evaluate more formally the impact of this new entrant, we examine changes in two wholesaler characteristics, i.e., the fraction of orders routed to Robinhood’s venues, and the 35 Electronic copy available at: https://ssrn.com/abstract=4609895 average price improvement across wholesalers, before and after February 23, 2022. If Jane Street increased competition in the marketplace, we should see a lower allocation to other venues, and a decrease in execution costs. Table 9 shows changes in venue routing and price improvement in Panels A and B, respectively. [Insert Table 9 about here] We see that the entry of Jane Street significantly impacted the wholesaler market for Robinhood. The allocation to Jane Street went from 3% to 23%, leading to large drops in sharesforVirtu,Citadel,andG1X.Wealsoseethat,whilenotalwaysstatisticallysignificant, execution costs decreased for all wholesalers after the new entry. Citadel decreased its E/Q cost sharply, from 0.54 to 0.40. For Robinhood overall, the average execution cost decreased from 0.55 to 0.47, which is economically significant. Overall, these results suggest that the wholesaler market benefited from this additional competition. There are two potential explanations for the observed increase in execution quality at Robinhood. Thefirstisthatexistingwholesalersraisetheirexecutionqualityacrossalltrades in response to increased competition. The second is that, as part of its selective-routing system, Robinhood systematically reroutes trades with the worst execution from its existing wholesalers to Jane Street. To investigate this latter explanation, we regress the change in the wholesaler’s share in that stock across periods against its initial excess execution cost. If the change was driven by selective-routing decisions, we should see negative, significant coefficients, meaning that higher E/Q should lead to lower share allocations. Table 10 shows the results, which include some stock-level controls. [Insert Table 10 about here] 36 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "8.1. Empirical Evidence",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 79,
    "chunk_index": 69,
    "word_count": 299,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "8.1. Empirical Evidence (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "its initial excess execution cost. If the change was driven by selective-routing decisions, we should see negative, significant coefficients, meaning that higher E/Q should lead to lower share allocations. Table 10 shows the results, which include some stock-level controls. [Insert Table 10 about here] 36 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "8.1. Empirical Evidence",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 79,
    "chunk_index": 70,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "8.1. Empirical Evidence (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "The table shows insignificant coefficients in the first row. Thus, routing changes were not driven by the wholesaler’s execution quality relative to its peers in the weeks leading up to Jane Street’s addition. This suggests that Robinhood used Jane Street’s entrance to benefit from better execution across wholesalers. 8.2. Discussions and Implications for 605 Forms Our results are in contrast to Dyhrberg et al. (2023) who conclude that the entry of Jane Street did not impact execution between the second and fourth quarters of 2021. Several factors could drive the different conclusions. First, our data is more detailed, providing exact execution data for specific stocks routed by a specific broker on a daily basis; in contrast, 605 reports provide stock-level execution statistics for each market center aggregated across all their clients on a monthly basis. Second, we focus on one broker, whereas 605 reports only provide averages across all brokers. This allows us to focus on the effective date of entry for Jane Street, which should be more precise, given that Jane Street’s addition to each broker’s list of venues happened at different times. Third, almost all of our trades are odd lots, which are not reported on 605 reports. Regardless, at least for odd-lot trades at Robinhood, Jane Street’s entry significantly altered order routing and improved price execution. It should be emphasized that our within-broker results could not have been picked up by the aggregate 605 forms. Worse, the 605 forms obfuscate within-broker execution quality. As this example demonstrates, Jane Street was added as an executing wholesaler for Robinhood inthefirstquarterof2022. Followingitsentry,JaneStreetgainedmarketshareatRobinhood because its within-broker execution was better than other wholesalers, which lost market share. Importantly, we note that Robinhood’s average execution is worse than that for other 37 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "8.1. Empirical Evidence",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 79,
    "chunk_index": 71,
    "word_count": 294,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "8.1. Empirical Evidence (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "execution quality. As this example demonstrates, Jane Street was added as an executing wholesaler for Robinhood inthefirstquarterof2022. Followingitsentry,JaneStreetgainedmarketshareatRobinhood because its within-broker execution was better than other wholesalers, which lost market share. Importantly, we note that Robinhood’s average execution is worse than that for other 37 Electronic copy available at: https://ssrn.com/abstract=4609895 brokers, reflecting its client order flow characteristics, i.e., “toxicity.” Next,considerthe605formforthesmallestreportedtrades,from100to499shares,which best match Robinhood’s retail clients. For Jane Street, this actually shows a worsening of execution quality from January to April 2022. Contrariwise, the 605 form for Virtu shows an improvement in E/Q. In fact, however, we do not observe changes in the within-broker E/Q for Jane Street and Virtu. So, the changes in 605 data almost certainly reflect the addition and subtraction of Robinhood trades, respectively, as opposed to true changes in execution quality. The conclusion is that changes in the clientele served by wholesalers could create mis- leading changes in aggregate execution numbers shown in the 605 forms. This demonstrates the superiority of within-broker analysis relative to the aggregate reporting in the 605 forms, and the need for expanding 605 reports to the broker-wholesaler pairs. 9. Model of Order Routing with Switching Costs Our prior results show a puzzling result: why would proportional brokers route larger sharesoftheirorderstowholesalerswithlowerpriceexecutionquality? Iftheywererandomly allocating trades, we would expect the relation to be random, not positive. More generally, if price execution is predictable, why do brokers not respond to persistent dispersion across different wholesalers? To provide economic insights into these questions, in this section we develop a stylized model of order routing including brokers’ switching costs. 38 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "8.1. Empirical Evidence",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 79,
    "chunk_index": 72,
    "word_count": 267,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "8.1. Empirical Evidence (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "be random, not positive. More generally, if price execution is predictable, why do brokers not respond to persistent dispersion across different wholesalers? To provide economic insights into these questions, in this section we develop a stylized model of order routing including brokers’ switching costs. 38 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "8.1. Empirical Evidence",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 79,
    "chunk_index": 73,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "8.1. Empirical Evidence (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "Consider a generic broker, which can route its order flow to two wholesalers 𝑋 and 𝑌. The size of the order flow is normalized to one. The initial order flow market share of wholesaler 𝑋 is given by 𝜎 ∈ [0,1] with the remaining 1−𝜎 routed to wholesaler 𝑌. The broker and the two wholesalers are risk neutral. The broker may incur quadratic switching costs when adjusting the market share. These switching costs are given by 𝑠Δ2, where 𝑠 ≥ 0 and Δ ∈ [−𝜎,1−𝜎] is the additional market 2 share allocated to wholesaler 𝑋. The broker optimally chooses an adjustment of the market share Δ to minimize the total costs, including the price it pays to the wholesalers, reflecting execution costs (or, E/Q) paid by the broker’s customers, and the switching costs, if any: 𝑠 min (𝜎 +Δ)𝑝 +(1−𝜎 −Δ)𝑝 + Δ2. (1) 𝑋 𝑌 Δ∈[−𝜎,1−𝜎] 2 Here, switching costs serve as a simple modeling device to capture potential frictions that limit the ability or willingness of brokers to respond to dispersion in execution quality.27 For example, switching costs could include the time and cost it takes for brokers to monitor wholesalers’ performance, brokers limiting either the maximum or minimum share they are willing to route to any one wholesaler, managerial/organizational inertia (“nobody gets fired for buying IBM”), the desire or requirements to supply stable order flows to wholesalers, lack of technology to implement complex routing, and more.28 27Switchingcostshavelongbeenusedandstudiedintheeconomicsliterature(see,e.g.,Klemperer(1987)). 28Many of these costs are likely to be non-linear. For example, every additional parameter used to set determine routing exponential increases complexity. If brokers impose minimum or maximum market shares, those become exponentially more binding as the boundary is approached. If the broker has limited technology, costs will increase extremely quickly. 39 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "9.1. Setup and Equilibrum",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 79,
    "chunk_index": 74,
    "word_count": 297,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "9.1. Setup and Equilibrum (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "be non-linear. For example, every additional parameter used to set determine routing exponential increases complexity. If brokers impose minimum or maximum market shares, those become exponentially more binding as the boundary is approached. If the broker has limited technology, costs will increase extremely quickly. 39 Electronic copy available at: https://ssrn.com/abstract=4609895 Wholesalers incur constant marginal costs to process and make markets for the broker’s order flow. These costs may be heterogeneous, denoted by 𝑓 and 𝑓 for wholesalers 𝑋 and 𝑋 𝑌 𝑌, respectively, where 𝑓 ≤ 𝑓 without loss of generality. Wholesaler 𝑋 optimally chooses 𝑋 𝑌 the price 𝑝 , which captures execution costs paid by the broker’s customers, to maximize 𝑋 its profits: max (𝑝 −𝑓 )(𝜎 +Δ). (2) 𝑋 𝑋 𝑝𝑋 Similarly, wholesaler 𝑌 chooses the price 𝑝 to maximize its profits: 𝑌 max (𝑝 −𝑓 )(1−𝜎 −Δ). (3) 𝑌 𝑌 𝑝𝑌 A pure-strategy Nash equilibrium is found when (1) the broker optimally chooses its adjustment in the market share, Δ, as a function of the prices charged by the wholesalers; (2) the wholesalers optimally chooses prices, 𝑝 and 𝑝 , given the broker’s strategy and each 𝑋 𝑌 other’s pricing; and (3) the broker’s and the two wholesalers’ strategies, Δ, 𝑝 , and 𝑝 , are 𝑋 𝑌 all consistent. The proposition below fully characterizes equilibrium. The proof is in the Appendix A. Proposition 1 If switching costs are sufficiently high (i.e., 𝑠 > (𝑓 − 𝑓 )/(2 − 𝜎), where 𝑌 𝑋 𝑓 ≥ 𝑓 ), then in equilibrium, the wholesalers charge 𝑌 𝑋 2𝑓 +𝑓 𝑠(1+𝜎) 𝑓 +2𝑓 𝑠(2−𝜎) 𝑋 𝑌 𝑋 𝑌 𝑝 = + and 𝑝 = + , (4) 𝑋 𝑌 3 3 3 3 40 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "9.1. Setup and Equilibrum",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 79,
    "chunk_index": 75,
    "word_count": 290,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "9.1. Setup and Equilibrum (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "𝑓 )/(2 − 𝜎), where 𝑌 𝑋 𝑓 ≥ 𝑓 ), then in equilibrium, the wholesalers charge 𝑌 𝑋 2𝑓 +𝑓 𝑠(1+𝜎) 𝑓 +2𝑓 𝑠(2−𝜎) 𝑋 𝑌 𝑋 𝑌 𝑝 = + and 𝑝 = + , (4) 𝑋 𝑌 3 3 3 3 40 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "9.1. Setup and Equilibrum",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 79,
    "chunk_index": 76,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "9.1. Setup and Equilibrum (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "and the broker adjusts its market share by 𝑓 −𝑓 1−2𝜎 𝑌 𝑋 Δ = + . (5) 3𝑠 3 Otherwise (𝑠 ≤ (𝑓 −𝑓 )/(2−𝜎)), in equilibrium 𝑌 𝑋 𝑝 = 𝑓 −𝑠(1−𝜎), 𝑝 = 𝑓 , and Δ = 1−𝜎, (6) 𝑋 𝑌 𝑌 𝑌 under the assumption that if the prices are the same, wholesaler 𝑋 takes the whole market. In the following subsections, We study the properties of the equilibrium characterized in Proposition 1 to connect the theoretical implications with our empirical findings. To clarify economic intuition, we analyze three cases separately: (1) the benchmark case absent switch- ing costs, (2) the case with switching costs and the same marginal costs for the wholesalers, and (3) the case with switching costs and different marginal costs. 9.2. Equilibrium Absent Switching Costs Suppose the broker incurs no switching cost (i.e., 𝑠 = 0). Then the two wholesalers are in Bertrand competition. When the wholesalers have the same marginal cost, their prices equal the marginal cost (𝑝 = 𝑝 = 𝑓 = 𝑓 ), resulting in perfect competition even with just two 𝑋 𝑌 𝑋 𝑌 wholesalers, also well known as the “Bertrand paradox.” Any dispersion in prices makes the broker shift its entire order flow to the lower-priced wholesaler. Such extremely responsive routing in turn makes the wholesalers compete vigorously with one another, eliminating price dispersion and driving down prices to the marginal cost. In equilibrium, the market is perfectly competitive, and the average price is the marginal cost no matter how the broker 41 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "9.1. Setup and Equilibrum",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 79,
    "chunk_index": 77,
    "word_count": 262,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "9.1. Setup and Equilibrum (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "extremely responsive routing in turn makes the wholesalers compete vigorously with one another, eliminating price dispersion and driving down prices to the marginal cost. In equilibrium, the market is perfectly competitive, and the average price is the marginal cost no matter how the broker 41 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "9.1. Setup and Equilibrum",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 79,
    "chunk_index": 78,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "9.1. Setup and Equilibrum (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "routes its order. (For simplicity, we assume that the broker routes the all order flow to wholesaler 𝑋.) However, when the wholesalers have different marginal costs (𝑓 < 𝑓 ), the market is 𝑋 𝑌 imperfectly competitive. Competition between the two wholesalers drives down prices only to the higher marginal cost (𝑝 = 𝑝 = 𝑓 ), allowing the low-cost wholesaler (𝑋) to remain 𝑋 𝑌 𝑌 profitable.29 Notice, responsive routing and Bertrand competition alone do not guarantee perfect competition. Regardless of whether wholesalers have the same marginal cost or not, Bertrand competi- tion implies that the wholesalers charge the same price to the broker in equilibrium. Without price dispersion, of course, there is no relation between prices (or execution costs) and mar- ket share. Even if there were wholesalers charging higher prices, we would not observe this in the data because the lowest-price wholesaler should capture a 100% market share anyway. Further, the broker’s extremely responsive routing, a requirement for Bertrand competition, is inconsistent with our finding that most brokers do not respond to prior execution costs and even responsive brokers do so only modestly. 9.3. Equilibrium When the Wholesalers Have the Same Marginal Cost Now, suppose that the broker incurs switching costs (i.e., 𝑠 > 0). Assume, for now, the two wholesalers have the same marginal cost (i.e., 𝑓 = 𝑓 ). 𝑋 𝑌 The broker finds the optimal adjustment of market share, Δ, by solving Equation (1). 29Without the assumption that the low-cost wholesaler receives the entire order flow when the prices are equal, there is no pure-strategy Nash equilibrium. Instead, there exist mixed-strategy Nash equilibria, as discussed in Blume (2003). 42 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "9.1. Setup and Equilibrum",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 79,
    "chunk_index": 79,
    "word_count": 280,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "9.1. Setup and Equilibrum (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "optimal adjustment of market share, Δ, by solving Equation (1). 29Without the assumption that the low-cost wholesaler receives the entire order flow when the prices are equal, there is no pure-strategy Nash equilibrium. Instead, there exist mixed-strategy Nash equilibria, as discussed in Blume (2003). 42 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "9.1. Setup and Equilibrum",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 79,
    "chunk_index": 80,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "9.1. Setup and Equilibrum (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "The first order condition (F.O.C.) implies: 𝑝 −𝑝 𝑌 𝑋 Δ = , (7) 𝑠 under some conditions (which are met in equilibrium, see the proof in Appendix A for details). Thus, the broker always moves towards the lower-priced wholesaler (i.e., Δ > 0 if and only if 𝑝 < 𝑝 ). But the extent to which it does so depends on and decreases in 𝑋 𝑌 the switching costs. Higher switching costs make it difficult for the broker to adjust market share drastically even when there is wide price dispersion. In equilibrium (Proposition 1), the wholesalers charge: 𝑠(1+𝜎) 𝑠(2−𝜎) 𝑝 = 𝑓 + and 𝑝 = 𝑓 + . (8) 𝑋 𝑋 𝑌 𝑋 3 3 Notice, as switching costs increase, both wholesalers charge higher prices relative to the marginal cost. The limited ability to adjust market share provides the wholesalers with a scope for exercising their market power. Further, the extent to which wholesalers extract rents from the broker (or more precisely, from its customers to whom the broker passes down the execution costs) depends on their market share. The wholesaler with larger pre-existing market share (i.e., 𝑋 if 𝜎 > 1/2 and 𝑌 if 𝜎 < 1/2) charges higher prices than the other wholesaler. While the broker does move away from the higher-priced, large wholesaler, the large wholesaler remains large after the adjustment in equilibrium.30 For example, if wholesaler 𝑋 was initially large with 𝜎 = 2/3, 30In equilibrium, 𝜎+Δ=(1−2𝜎)/3 such that 𝜎+Δ>1/2 if and only if 𝜎 >1/2. 43 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "9.1. Setup and Equilibrum",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 79,
    "chunk_index": 81,
    "word_count": 258,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "9.1. Setup and Equilibrum (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "the broker does move away from the higher-priced, large wholesaler, the large wholesaler remains large after the adjustment in equilibrium.30 For example, if wholesaler 𝑋 was initially large with 𝜎 = 2/3, 30In equilibrium, 𝜎+Δ=(1−2𝜎)/3 such that 𝜎+Δ>1/2 if and only if 𝜎 >1/2. 43 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "9.1. Setup and Equilibrum",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 79,
    "chunk_index": 82,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "9.1. Setup and Equilibrum (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "then it remains large after the adjustment with Δ = −1/9 and 𝜎+Δ = 5/9 (Proposition 1). Thus, there is a positive relation between market share and prices, consistent with what we find for proportional brokers in Figure 8 (with prices reflecting execution costs). While the positive relation might initially appear counterintuitive, in that the broker routes more order flow to more expensive wholesalers, the intuition becomes clear. It is not that brokers route more order to some wholesalers because they charge higher prices, but rather some wholesalers can charge higher prices because brokers route more orders to them. While brokers can respond by shifting some orders to the smaller wholesaler, in equilibrium, prices are determined such that the expensive, larger wholesaler remains large. In other words, the larger wholesaler can raise prices more than the smaller wholesaler because the change in market share is a relatively smaller portion of their overall profit. Notice, this result does not require that brokers have substantial switching costs. Any switching costs imply that the broker routes more order flows to the more expensive wholesaler. 9.4. Equilibrium When the Wholesalers Have the Different Marginal Costs In the prior cases, we would find either no relation or a positive relation between costs and market share. In this context, negative relation between market share and execution costs that we document for selective brokers is puzzling. While selective brokers somewhat respond to execution, their routing behaviors still reflect the presence of strictly positive switching costs. To understand the negative relation between market share and execution costs, we next allow wholesalers to have different marginal costs. Now, suppose that the two wholesalers have different marginal costs (i.e., 𝑓 < 𝑓 ), while the broker still incurs switching costs 𝑋 𝑌 44 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "9.1. Setup and Equilibrum",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 79,
    "chunk_index": 83,
    "word_count": 298,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "9.1. Setup and Equilibrum (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "To understand the negative relation between market share and execution costs, we next allow wholesalers to have different marginal costs. Now, suppose that the two wholesalers have different marginal costs (i.e., 𝑓 < 𝑓 ), while the broker still incurs switching costs 𝑋 𝑌 44 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "9.1. Setup and Equilibrum",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 79,
    "chunk_index": 84,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "9.1. Setup and Equilibrum (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "(i.e., 𝑠 > 0). There are two cases (Proposition 1). If switching costs are sufficiently high (i.e., 𝑠 > (𝑓 −𝑓 )/(2−𝜎)), the equilibrium is similar to that obtained when the wholesalers 𝑌 𝑋 have the same marginal cost. In Equation (4), the only difference is that prices depend on the weighted average of the marginal costs, where their own marginal cost gets 2/3 of the weight (e.g., (2𝑓 +𝑓 )/3). 𝑋 𝑌 Comparing equilibrium prices, we have 𝑓 −𝑓 1 𝑌 𝑋 𝑝 < 𝑝 if and only if 𝑠 < and 𝜎 > . (9) 𝑋 𝑌 2𝜎 −1 2 Thus, provided that the lower-cost wholesaler is also the larger wholesaler before the ad- justment (i.e., 𝜎 > 1/2), there is a negative relation between market share and prices when switching costs are relatively small (but not too small, as discussed below). The larger wholesaler here has two competing incentives. On the one hand it can raise prices to take advantage of its market share and extract larger rents from the broker. On the other hand, it can reduce prices to take advantage of its lower costs and obtain an even larger market share. When the broker’s switching costs are relatively small, the incentive to reduce prices outweighs the incentive to raise prices, resulting in the larger wholesaler charging lower prices than the smaller wholesaler in equilibrium. Notice, this case is the most consistent with our empirical findings that selective brokers, who tend to respond to execution albeit modestly and thus exhibit smaller switching costs than proportional brokers, also exhibit negative relation between market share and execu- tion costs, while proportional brokers generate positive relation between market share and execution costs. 45 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "9.1. Setup and Equilibrum",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 79,
    "chunk_index": 85,
    "word_count": 289,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "9.1. Setup and Equilibrum (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "findings that selective brokers, who tend to respond to execution albeit modestly and thus exhibit smaller switching costs than proportional brokers, also exhibit negative relation between market share and execu- tion costs, while proportional brokers generate positive relation between market share and execution costs. 45 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "9.1. Setup and Equilibrum",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 79,
    "chunk_index": 86,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "9.1. Setup and Equilibrum (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "Finally, if switching costs are too small (i.e., 𝑠 ≤ (𝑓 − 𝑓 )/(2 − 𝜎)), the equilibrium 𝑌 𝑋 becomes similar to that with Bertrand competition in Section 9.2, which arises when the broker does not incur any switching costs. The lower-cost wholesaler drives the other whole- saler to zero profits and obtains a 100% market share. Interestingly, switching costs reduce the prices the broker pays because the broker would not shift the entire order flow to the low-cost wholesaler unless it is compensated for the switching costs. 10. Conclusions Retail trading has reached record volumes in the last several years, spurred by technolog- ical advances as well as the advent of commission-free trading. Even so, the current market structure has attracted the attention of regulators. Many worry about potential conflicts of interest, such as payment for order flow. Others worry about the competitiveness of the wholesaler marketplace given that it has only four large players. These concerns ultimately led the SEC to introduce four proposals aimed at increasing competition in order to improve trading execution. The counterargument is that the market is functioning well currently, that trading costs haveneverbeenlower, andthattheproposedmarketstructurechangescouldactuallyleadto worse execution for retail traders. In particular, some participants argue that competition across wholesalers is already enforced by retail brokers, who should closely monitor the quality of trade execution and route greater allocations to the most competitive wholesalers, as required by best execution standards. Using a self-created dataset of over 150,000 trades, our paper provides a unique window into the analysis of competition in the wholesaler market by focusing on actual interactions 46 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "9.1. Setup and Equilibrum",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 79,
    "chunk_index": 87,
    "word_count": 270,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "9.1. Setup and Equilibrum (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "execution and route greater allocations to the most competitive wholesalers, as required by best execution standards. Using a self-created dataset of over 150,000 trades, our paper provides a unique window into the analysis of competition in the wholesaler market by focusing on actual interactions 46 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "9.1. Setup and Equilibrum",
    "page_number": 48,
    "page_range": "p.48",
    "total_pages": 79,
    "chunk_index": 88,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "9.1. Setup and Equilibrum (p.48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "between broker routing and wholesaler execution. We first examine routing practices in detail. Routing involves allocations to wholesalers at the overall portfolio level and/or at the stock level. For stock trades, brokers use one of tworoutingmethods. Thefirstisproportional, wherestocksaresentinthesameproportions but in potentially different total amounts. The second is selective, where stocks are routed individually to different wholesalers. Competition can be enforced by routing more of either the total dollar amount or individual stock trades to wholesalers with better within-broker execution. We find that most brokers in our sample use proportional stock routing. In addition, a majority of our brokers do not seem to change their routing for our trades based on past performance. For active routing to be useful, however, execution quality needs to be persistent over time. We verify that prior execution quality by a wholesaler for a given broker can predict futureexecutionquality, attheoveralllevelandonastock-by-stockbasis. Indeed, weprovide a hypothetical exercise of increasing routing allocations to venues with better execution quality and show that such practice would lead to significantly higher price improvement for retail investors. If so, it would be easy to increase execution quality within the current marketstructure. Wealsofindthattheintroductionofanewwholesaler, JaneStreet, caused significant increases in price improvement to Robinhood trades. This can be attributed directly to Jane Street, but also to other wholesalers that responded by improving their executionquality. Finally, wepresentastylizedmodeltodemonstratetheeconomicintuition of our model. Our overall conclusion is that the retail trade wholesaler marketplace is not perfectly competitive. One potential method to improve competition could be through greater dis- 47 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "9.1. Setup and Equilibrum",
    "page_number": 48,
    "page_range": "p.48",
    "total_pages": 79,
    "chunk_index": 89,
    "word_count": 254,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "9.1. Setup and Equilibrum (p.48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "to Jane Street, but also to other wholesalers that responded by improving their executionquality. Finally, wepresentastylizedmodeltodemonstratetheeconomicintuition of our model. Our overall conclusion is that the retail trade wholesaler marketplace is not perfectly competitive. One potential method to improve competition could be through greater dis- 47 Electronic copy available at: https://ssrn.com/abstract=4609895 closure to help facilitate more active routing decisions. Greater disclosure would put more pressure on brokers to manage trading costs. While the proposed extension of 605 forms to brokers does represent an improvement, it is still insufficient because it fails to control for broker-specific factors. Further extension of disclosures to each broker-wholesaler pair would allow proper evaluation of execution quality. At the same time, brokers could allocate their trades more actively, yielding better execution for their retail investors and enforcing pricing discipline on existing wholesalers. New entrants may also create more competition, forcing existing wholesalers to improve their execution for the ultimate benefit of retail investors. 48 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "9.1. Setup and Equilibrum",
    "page_number": 49,
    "page_range": "p.49",
    "total_pages": 79,
    "chunk_index": 90,
    "word_count": 162,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "9.1. Setup and Equilibrum (p.49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "same time, brokers could allocate their trades more actively, yielding better execution for their retail investors and enforcing pricing discipline on existing wholesalers. New entrants may also create more competition, forcing existing wholesalers to improve their execution for the ultimate benefit of retail investors. 48 Electronic copy available at: https://ssrn.com/abstract=4609895 Adams, S., C.Kasten, andE.Kelley(2021). Doinvestorssavewhenmarketmakerspay? Re- tail execution costs under payment for order flow models. https://ssrn.com/abstract= 3975667. Working Paper. Anand, A., M. Samadi, J. Sokobin, and K. Venkataraman (2021). Institutional order han- dling and broker-affiliated trading venues. Review of Financial Studies 34, 3364–3402. Barber, B., X. Huang, P. Jorion, T. Odean, and C. Schwarz (2023). A (sub)penny for your thoughts: Tracking retail investor activity in TAQ. Journal of Finance, forthcoming. Bartlett, R. (2021). Modernizing odd lot trading. Columbia Business Law Review, 520–568. Battalio, R. (2018). What has changed in four years? Are retail broker routing decisions in 4Q2016 consistent with the pursuit of best execution? In Walter Mattli, ed. Global Algorithmic Capital Markets, 147–164. Oxford University Press. Battalio, R., S. Corwin, and R. Jennings (2016). Can brokers have it all? On the relation between make-take fees and limit order execution quality. Journal of Finance 71, 2193– 2238. Battalio, R. and R. Jennings (2023). Absolute and relative wholesaler execution quality in May 2022. https://papers.ssrn.com/abstract=4304124. Working Paper. Blume, A. (2003). Bertrand without fudge. Economics Letters 78(2), 167–168. 49 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "References",
    "page_number": 50,
    "page_range": "p.50-51",
    "total_pages": 79,
    "chunk_index": 91,
    "word_count": 231,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.50-51)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "the relation between make-take fees and limit order execution quality. Journal of Finance 71, 2193– 2238. Battalio, R. and R. Jennings (2023). Absolute and relative wholesaler execution quality in May 2022. https://papers.ssrn.com/abstract=4304124. Working Paper. Blume, A. (2003). Bertrand without fudge. Economics Letters 78(2), 167–168. 49 Electronic copy available at: https://ssrn.com/abstract=4609895 Boehmer, E., C. Jones, X. Zhang, and X. Zhang (2021). Tracking retail investor activity. Journal of Finance 76, 2249–2305. Dyhrberg, A., A. Shkilko, and I. Werner (2023). The retail execution quality landscape. https://papers.ssrn.com/abstract_id=4313095. Working Paper. Ernst, T. and C. Spatt (2023). Payment for order flow and asset choice. https://ssrn. com/abstract=4056512. Working Paper. Fama, E. and J. D. MacBeth (1973). Risk, return, and equilibrium: Empirical tests. Journal of Political Economy 81, 607–636. FINRA (2014). Rule 5310: Best execution and interpositioning. https://www.finra.org/ rulesguidance/rulebooks/finra-rules/5310. Financial Industry Regulatory Author- ity. FINRA (2015). Notice 15-46: Best execution. https://www.finra.org/sites/default/ files/notice_doc_file_ref/Notice_Regulatory_15-46.pdf. Financial Industry Reg- ulatory Authority. Hu, E. and D. Murphy (2022). Competition for retail order flow and market quality. https: //ssrn.com/abstract=4070056. Working Paper. Kim, D. (1995). The errors in the variables problem in the cross-section of expected stock returns. Journal of Finance 50, 1605–1634. Klemperer, P. (1987). Markets with consumer switching costs. The Quarterly Journal of Economics 102(2), 375–394. 50 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "References",
    "page_number": 51,
    "page_range": "p.51-52",
    "total_pages": 79,
    "chunk_index": 92,
    "word_count": 209,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.51-52)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "flow and market quality. https: //ssrn.com/abstract=4070056. Working Paper. Kim, D. (1995). The errors in the variables problem in the cross-section of expected stock returns. Journal of Finance 50, 1605–1634. Klemperer, P. (1987). Markets with consumer switching costs. The Quarterly Journal of Economics 102(2), 375–394. 50 Electronic copy available at: https://ssrn.com/abstract=4609895 Lee, C. and M. Ready (1991). Inferring investor behavior from intraday data. Journal of Finance 46, 733–746. Newey, W. K. and K. D. West (1987). A simple, positive semi-definite, heteroskedasticity and autocorrelation consistent covariance matrix. Econometrica 55, 703–708. Schwab (2022). U.S. equity market structure: Order routing practices, considerations, and opportunities. https://content.schwab.com/web/retail/public/about-schwab/ Schwab-2022-order-routing-whitepaper.pdf. White Paper. Schwarz, C., B. Barber, X. Huang, P. Jorion, and T. Odean (2023). The ‘actual retail price’ of equity trades. https://ssrn.com/abstract=4189239. Working Paper. SEC (2005). Regulation NMS. https://www.sec.gov/rules/final/34-51808.pdf. Secu- rities and Exchange Commission Release No. 34-51808. SEC (2018). Disclosure of order handling information. https://www.sec.gov/rules/ final/2018/34-84528.pdf. Securities and Exchange Commission Release No. 34-84528. SEC (2022a). Disclosure of order execution information. https://www.sec.gov/rules/ proposed/2022/34-96493.pdf. Securities and Exchange Commission Release No. 34- 96493. SEC (2022b). Order competition rule. https://www.sec.gov/rules/proposed/2022/ 34-96495.pdf. Securities and Exchange Commission Release No. 34-96495. 51 Electronic copy available at: https://ssrn.com/abstract=4609895 Figure 1: Wholesaler Share by Broker This figure shows the percent of our orders that went to each wholesaler for each brokerage account. The raw data are in Table 1, Panel B. 52 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "References",
    "page_number": 52,
    "page_range": "p.52-54",
    "total_pages": 79,
    "chunk_index": 93,
    "word_count": 230,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.52-54)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "and Exchange Commission Release No. 34-96495. 51 Electronic copy available at: https://ssrn.com/abstract=4609895 Figure 1: Wholesaler Share by Broker This figure shows the percent of our orders that went to each wholesaler for each brokerage account. The raw data are in Table 1, Panel B. 52 Electronic copy available at: https://ssrn.com/abstract=4609895 Panel A: Wholesaler Share Panel B: Wholesaler Effective/Quoted (E/Q) Spread Figure 2: Robinhood Wholesaler Data This figure graphs the time series of the fraction of our Robinhood orders that go to each wholesaler (Panel A) as well as the effective over quoted spread from each wholesaler for these trades (Panel B). In both cases, we use a rolling average over the last five trading days. 53 Electronic copy available at: https://ssrn.com/abstract=4609895 Panel A: E*Trade Panel B: Fidelity Panel C: IBKR Lite Figure 3: (Continued on the following page.) 54 Electronic copy available at: https://ssrn.com/abstract=4609895 Panel D: Robinhood Panel E: Schwab Panel F: TD Ameritrade Figure 3: Order Routing to Citadel for Individual Stocks This figure shows the percentage of our orders for each stock that are routed to Citadel for each broker. Each vertical bar represents one stock, with whiskers showing 95% confidence intervals. A stock requires at least 100 trades to be included. If a stock percentage is significantly different from the average at the 5% level, lines are shown in red; otherwise, lines are in black. Panels A to F report results for E*Trade, Fidelity, IBKR Lite, Robinhood, Schwab, and TD Ameritrade, respectively. 55 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "References",
    "page_number": 54,
    "page_range": "p.54-56",
    "total_pages": 79,
    "chunk_index": 94,
    "word_count": 251,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.54-56)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "to be included. If a stock percentage is significantly different from the average at the 5% level, lines are shown in red; otherwise, lines are in black. Panels A to F report results for E*Trade, Fidelity, IBKR Lite, Robinhood, Schwab, and TD Ameritrade, respectively. 55 Electronic copy available at: https://ssrn.com/abstract=4609895 Figure 4: IBKR’s Order Routing to its Own ATS for Individual Stocks This figure shows the percentage of our orders for each stock that are routed to IBKR’s own ATS when using the IBKR Pro account. Each vertical bar represents one stock, with whiskers showing 95% confidence intervals. If a stock percentage is significantly different from the average at the 5% level, lines are shown in red; otherwise, lines are in black. 56 Electronic copy available at: https://ssrn.com/abstract=4609895 E*Trade Fidelity Schwab TD Ameritrade 57 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "References",
    "page_number": 57,
    "page_range": "p.57-59",
    "total_pages": 79,
    "chunk_index": 95,
    "word_count": 139,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.57-59)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "represents one stock, with whiskers showing 95% confidence intervals. If a stock percentage is significantly different from the average at the 5% level, lines are shown in red; otherwise, lines are in black. 56 Electronic copy available at: https://ssrn.com/abstract=4609895 E*Trade Fidelity Schwab TD Ameritrade 57 Electronic copy available at: https://ssrn.com/abstract=4609895 Robinhood IBKR Lite IBKR Pro Figure 5: Drivers of Routing Decisions This figure examines how brokers route orders to wholesalers (or venues). For each broker-wholesaler pair, we run a logistic regression where the dependent variable is one if the trade is routed to that wholesaler and zerootherwise. Forregressors, weinclude𝐸/𝑄(effectiveoverquotedspread)forthatstockatthatvenuein excess of the average for that stock across venues (Venue Excess E/Q (t-1)), the percent of orders routed to thatwholesalerthepreviousmonth(Venue % (t-1)), aswellasadummyvariablesetatoneifourlastorder was routed to that venue (Prior Same Venue). We also include a number of stock characteristics including the log of the stock price, the trade date’s log volume, return, absolute return, the spread at the time of the trade, and a dummy variable for stocks in the S&P 500 index. Finally, we include a dummy variable reflecting whether the trade was a buy or a sell (Buy(1/0)). Models include day fixed effects. The error bar represents the 95% confidence interval for the estimated coefficient. If a coefficient estimation is statistically significant at the 5% level, lines are shown in color; otherwise, lines are in black. 58 Electronic copy available at: https://ssrn.com/abstract=4609895 Figure 6: Relation between Current and Prior Month Effective Spreads This plots, for each broker-wholesaler pair, the excess effective over quoted trade spread (E/Q) for the current month on the vertical axis against that for the prior month. Excess E/Q is computed as the average E/Q for each wholesaler at that broker minus the average for all wholesalers for that broker. 59 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "References",
    "page_number": 59,
    "page_range": "p.59-60",
    "total_pages": 79,
    "chunk_index": 96,
    "word_count": 300,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.59-60)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "excess effective over quoted trade spread (E/Q) for the current month on the vertical axis against that for the prior month. Excess E/Q is computed as the average E/Q for each wholesaler at that broker minus the average for all wholesalers for that broker. 59 Electronic copy available at: https://ssrn.com/abstract=4609895 Panel A: Wholesaler Share Panel B: Wholesaler Effective/Quoted (E/Q) Spread Figure 7: Fidelity Wholesaler Data This figure describes wholesaler patterns for our trades at Fidelity. It shows the time series of the fraction of our orders that go to each wholesaler (Panel A) as well as the effective over quoted spread from each wholesaler for these trades (Panel B). In both cases, we use a rolling average over the last five trading days. 60 Electronic copy available at: https://ssrn.com/abstract=4609895 Panel A: Proportional Brokers Panel B: Selective Brokers Figure 8: Wholesaler Price Improvement and Share This figure describes the relation between wholesaler market share and its price improve- ment as measured by its excess effective over quoted spread. Panel A plots the relation for proportional brokers while Panel B plots the relation for selective brokers. 61 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "References",
    "page_number": 61,
    "page_range": "p.61-63",
    "total_pages": 79,
    "chunk_index": 97,
    "word_count": 190,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.61-63)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "Price Improvement and Share This figure describes the relation between wholesaler market share and its price improve- ment as measured by its excess effective over quoted spread. Panel A plots the relation for proportional brokers while Panel B plots the relation for selective brokers. 61 Electronic copy available at: https://ssrn.com/abstract=4609895 Table 1: Summary Statistics on Order Routing This table presents summary statistics on order routing for our trades. We placed parallel trades at six brokers from December 2021 through May 2023. We requested and obtained routing information through SEC rule 606(b)(1). The table reports the number of trades at each broker that go to each wholesaler in Panel A, as well as the percent of orders for each broker in Panel B. Averages in Panel B exclude IBKR Pro. Panel A: Broker-Wholesaler Routing Count Citadel Virtu Jane Street G1X Two Sigma UBS Exchange Other Own ATS Total E*Trade 10,651 8,085 5,286 5,202 919 811 - - - 30,954 Fidelity 4,561 3,102 1,262 2,847 148 83 - 226 - 12,229 IBKR Lite 2,834 1,293 6,543 - - - - 42 - 10,712 Robinhood 9,669 12,761 8,568 3,507 5,212 - 150 92 - 39,959 Schwab 3,047 2,410 2,400 2,279 436 512 - - - 11,084 TD Ameritrade 11,088 13,660 5,161 11,160 224 497 - 520 - 42,310 IBKR Pro 126 96 31 - - 71 1,464 - 2,477 4,265 Total 41,976 41,407 29,251 24,995 6,939 1,974 150 880 2,477 150,049 Panel B: Routing Percentages by Broker Citadel Virtu Jane Street G1X Two Sigma UBS Exchange Other Own ATS E*Trade 34% 26% 17% 17% 3% 3% 0% Fidelity 37% 25% 10% 23% 1% 1% 2% IBKR Lite 26% 12% 61% 0% Robinhood 24% 32% 21% 9% 13% 0% 0% Schwab 27% 22% 22% 21% 4% 5% TD Ameritrade 26% 32% 12% 26% 1% 1% 1% IBKR Pro 3% 2% 1% 2% 34% 58% Average 29% 25% 24% 16% 4% 2% 0% 1% Electronic copy available at: https://ssrn.com/abstract=4609895 62",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "References",
    "page_number": 63,
    "page_range": "p.63",
    "total_pages": 79,
    "chunk_index": 98,
    "word_count": 325,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.63)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "12% 61% 0% Robinhood 24% 32% 21% 9% 13% 0% 0% Schwab 27% 22% 22% 21% 4% 5% TD Ameritrade 26% 32% 12% 26% 1% 1% 1% IBKR Pro 3% 2% 1% 2% 34% 58% Average 29% 25% 24% 16% 4% 2% 0% 1% Electronic copy available at: https://ssrn.com/abstract=4609895 62",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "References",
    "page_number": 64,
    "page_range": "p.64",
    "total_pages": 79,
    "chunk_index": 99,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.64)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "Table 2: Drivers of Routing Decisions This table examines how brokers route orders to wholesalers, or venues. For each broker, we run a logistic regression where the dependent variable is one if the trade is routed to that wholesaler and zero otherwise. For regressors, we include E/Q (effective over quoted spread) for that stock at that venue in excess of the average for that stock across venues (Venue Excess E/Q (t-1)), the percent of orders routed to that wholesaler the previous month (Venue % (t-1)), as well as a dummy variable set at one if our last order was routed to that venue (Prior Same Venue). We also include a number of stock characteristics including the log of the stock price, the trade date’s log volume, return, absolute return, the spread at the time of the trade, and a dummy variable for stocks in the S&P 500 index. Finally, we include a dummy variable reflecting whether the trade was a buy or a sell (Buy(1/0)). Models include day fixed effects. **,* represents significance at the 1%, 5% levels respectively. Panel A: E*Trade Citadel Virtu G1X Jane Two UBS Street Sigma Venue Excess E/Q (t-1) -0.024 -0.016 0.011 0.100* 0.245 -0.027 Venue % (t-1) 0.121 -0.139 0.204 -0.083 2.521** -9.734** Log(Price) 0.008 0.026 0.010 0.033* -0.013 0.025 Log(Volume) 0.013 -0.005 0.007 0.008 0.017 -0.003 Return 0.058 0.042 -0.045 0.159 -0.209 0.078 Abs(Return) 0.057 0.043 -0.046 0.157 -0.219 0.079 Spread -0.073 0.038 -0.036 0.065 -0.287 -0.052 Buy(1/0) -0.011 -0.031* -0.013 0.033 0.065 0.047 SP500 -0.050 -0.080 0.006 -0.083 0.112 0.299 Prior Same Venue -0.070* -0.030 0.011 -0.014 -0.440 -0.025 Electronic copy available at: https://ssrn.com/abstract=4609895 63",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "References",
    "page_number": 64,
    "page_range": "p.64",
    "total_pages": 79,
    "chunk_index": 100,
    "word_count": 273,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.64)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "Return 0.058 0.042 -0.045 0.159 -0.209 0.078 Abs(Return) 0.057 0.043 -0.046 0.157 -0.219 0.079 Spread -0.073 0.038 -0.036 0.065 -0.287 -0.052 Buy(1/0) -0.011 -0.031* -0.013 0.033 0.065 0.047 SP500 -0.050 -0.080 0.006 -0.083 0.112 0.299 Prior Same Venue -0.070* -0.030 0.011 -0.014 -0.440 -0.025 Electronic copy available at: https://ssrn.com/abstract=4609895 63 Panel B: Fidelity Citadel Virtu G1X Jane Two UBS Street Sigma Venue Excess E/Q (t-1) 0.084 -0.019 -0.141 0.114 Venue % (t-1) -0.031 0.058 0.277 0.400 Log(Price) -0.010 0.057 0.002 0.029 Log(Volume) 0.003 0.011 0.013 -0.065** Return -0.069 0.053 -0.117 0.174 Abs(Return) -0.069 0.054 -0.118 0.164 Spread -0.003 -0.054 0.065 -0.223 Buy(1/0) -0.018 -0.009 -0.002 0.032 SP500 0.053 -0.109 0.100 0.032 Prior Same Venue 0.121* 0.023 0.017 0.050 Panel C: IBKR Lite Citadel Virtu G1X Jane Two UBS Street Sigma Venue Excess E/Q (t-1) -0.822** -0.724** -0.523** Venue % (t-1) 1.039** 2.224** 1.490** Log(Price) -0.047 -0.294** 0.170** Log(Volume) 0.110** 0.078** -0.148** Return -0.138 -0.063 0.155 Abs(Return) -0.142 -0.062 0.155 Spread -0.388* -0.284 -0.002 Buy(1/0) -0.130** 0.504** -0.092** SP500 0.192* 0.132 -0.185* Prior Same Venue -0.131* -0.109 -0.130** Electronic copy available at: https://ssrn.com/abstract=4609895 64",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "References",
    "page_number": 65,
    "page_range": "p.65-66",
    "total_pages": 79,
    "chunk_index": 101,
    "word_count": 183,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.65-66)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "(t-1) -0.822** -0.724** -0.523** Venue % (t-1) 1.039** 2.224** 1.490** Log(Price) -0.047 -0.294** 0.170** Log(Volume) 0.110** 0.078** -0.148** Return -0.138 -0.063 0.155 Abs(Return) -0.142 -0.062 0.155 Spread -0.388* -0.284 -0.002 Buy(1/0) -0.130** 0.504** -0.092** SP500 0.192* 0.132 -0.185* Prior Same Venue -0.131* -0.109 -0.130** Electronic copy available at: https://ssrn.com/abstract=4609895 64 Panel D: Robinhood Citadel Virtu G1X Jane Two UBS Street Sigma Venue Excess E/Q (t-1) -0.410** -0.341** -0.755** -0.260** -0.271** Venue % (t-1) 2.423** 1.680** 3.638** 1.853** 2.355** Log(Price) -0.002 0.026* 0.070** -0.070** 0.017 Log(Volume) 0.031** -0.054** 0.047** -0.009 -0.041** Return -0.063 0.220** 0.001 -0.275** 0.187* Abs(Return) -0.062 0.221** 0.004 -0.279** 0.189* Spread -0.099* -0.065 -0.012 0.180** -0.116 Buy(1/0) -0.038** -0.029* 0.017 0.013 0.014 SP500 -0.105* 0.070 0.147* -0.093 -0.228** Prior Same Venue 0.072* 0.054* 0.029 0.085* 0.141** Panel E: Schwab Citadel Virtu G1X Jane Two UBS Street Sigma Venue Excess E/Q (t-1) 0.050 0.117 0.036 -0.041 -0.024 -0.241 Venue % (t-1) -0.318 0.023 0.075 -0.281 1.131 -0.474 Log(Price) -0.015 0.053* -0.017 0.027* -0.017 -0.064 Log(Volume) 0.012 -0.012 0.028 -0.019 -0.010 -0.047 Return 0.127 -0.065 0.068 -0.094 0.595 0.199 Abs(Return) 0.130 -0.064 0.063 -0.093 -0.751 0.049 Spread 0.007 -0.244* 0.105 0.113 -0.412 -0.320 Buy(1/0) 0.007 0.005 0.020 -0.044** -0.024 -0.067 SP500 -0.086 -0.014 -0.045 0.012 0.065 0.522 Prior Same Venue 0.108 0.115 -0.005 0.089 0.763** 1.336** Electronic copy available at: https://ssrn.com/abstract=4609895 65 Panel F: TD Ameritrade Citadel Virtu G1X Jane Two UBS Street Sigma Venue Excess E/Q (t-1) -0.009 0.117* 0.004 0.041 Venue % (t-1) -0.040 0.182 0.054 0.845** Log(Price) -0.005 0.007 0.002 -0.018 Log(Volume) -0.008 0.013* 0.030** 0.023** Return -0.047 -0.058 0.067 -0.027 Abs(Return) -0.047 -0.060 0.067 -0.027 Spread 0.011 0.018 0.031 0.100* Buy(1/0) 0.008 0.006 -0.019 -0.007 SP500 0.079 -0.039 -0.097* -0.102 Prior Same Venue -0.012 -0.096* -0.127** -0.284** Electronic copy available at: https://ssrn.com/abstract=4609895 66",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "References",
    "page_number": 66,
    "page_range": "p.66-67",
    "total_pages": 79,
    "chunk_index": 102,
    "word_count": 297,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.66-67)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "0.054 0.845** Log(Price) -0.005 0.007 0.002 -0.018 Log(Volume) -0.008 0.013* 0.030** 0.023** Return -0.047 -0.058 0.067 -0.027 Abs(Return) -0.047 -0.060 0.067 -0.027 Spread 0.011 0.018 0.031 0.100* Buy(1/0) 0.008 0.006 -0.019 -0.007 SP500 0.079 -0.039 -0.097* -0.102 Prior Same Venue -0.012 -0.096* -0.127** -0.284** Electronic copy available at: https://ssrn.com/abstract=4609895 66 Table 3: Drivers of Routing Decisions for IBKR Pro This table examines how IBKR routes orders for its Pro account. For its own ATS, exchange-routed trades, and wholesalers, we run a logistic regression where the dependent variable is one if the trade is routed to that venue and zero otherwise. Regressors are as defined in Table 2. Models include day fixed effects. **,* represents significance at the 1%, 5% levels respectively. IBKR ATS Exchange Wholesaler Model 1 Model 2 Model 1 Model 2 Model 1 Model 2 Venue Excess E/Q (t-1) -0.485** -0.088 -0.800** Venue % (t-1) 2.245** 0.889** 1.510** Log(Price) 0.218** 0.385** -0.292** -0.327** -0.094* -0.182** Log(Volume) 0.014 -0.027 -0.023 -0.011 -0.038 0.030 Return -0.024 -0.152 0.202 0.241 0.118 -0.038 Abs(Return) -0.024 -0.173 0.194 0.249 0.128 -0.024 Spread 1.118** 1.683** -1.402 -1.659** -1.016* -1.562** Buy(1/0) 0.023 0.000 -0.123* -0.067 0.058 0.052 SP500 -0.112 -0.535** -0.020 0.145 0.202 0.475** Prior Same Venue -0.249** -0.141* 0.384** 0.370** -0.322** -0.235** Electronic copy available at: https://ssrn.com/abstract=4609895 67",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "References",
    "page_number": 68,
    "page_range": "p.68-69",
    "total_pages": 79,
    "chunk_index": 103,
    "word_count": 214,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.68-69)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "Return -0.024 -0.152 0.202 0.241 0.118 -0.038 Abs(Return) -0.024 -0.173 0.194 0.249 0.128 -0.024 Spread 1.118** 1.683** -1.402 -1.659** -1.016* -1.562** Buy(1/0) 0.023 0.000 -0.123* -0.067 0.058 0.052 SP500 -0.112 -0.535** -0.020 0.145 0.202 0.475** Prior Same Venue -0.249** -0.141* 0.384** 0.370** -0.322** -0.235** Electronic copy available at: https://ssrn.com/abstract=4609895 67 Table 4: Persistence of Wholesaler Price Improvement This table presents results examining the persistence of overall price improvement (Panels A and B) or stock-level price improve- ment (Panels C and D) by wholesaler. Each period, we compute the broker-adjusted overall (stock-level) price improvement of each wholesaler by subtracting the broker overall (stock-level) average effective over quoted spread (E/Q) from the wholesaler overall (stock-level) average for that broker. We then regress the broker-adjusted price improvements on prior period values, measured over the last one- and three-month averages. t-values are in parentheses (based on standard errors clustered by month.) **,* represents significance at the 1%, 5% levels respectively. (1) (2) (3) (4) (5) (6) (7) (8) (9) All Proportional Brokers Selective Brokers Brokers All E*Trade Fidelity Schwab TD All IBKR Robinhood Lite Panel A: Wholesaler Overall Price Improvement (Prior Month) Dep var: Broker-adjusted E/Q (𝑡) Broker-adjusted E/Q (𝑡−1) 0.735** 0.746** 0.488** 0.627* 0.505** 0.857** 0.687** 0.916** 0.599** (12.31) (13.35) (3.75) (3.04) (6.00) (13.08) (5.83) (11.09) (4.19) R-sq 0.569 0.590 0.245 0.344 0.373 0.765 0.489 0.811 0.384 Panel B: Wholesaler Overall Price Improvement (Prior 3-month Average) Dep var: Broker-adjusted E/Q (𝑡) Broker-adjusted E/Q (𝑡−1, 𝑡−3) 0.834** 0.832** 0.654** 0.924** 0.826** 0.868** 0.819** 0.980** 0.741** (13.04) (12.60) (3.85) (5.36) (16.48) (11.52) (7.21) (10.21) (4.65) R-sq 0.550 0.550 0.272 0.336 0.614 0.667 0.520 0.866 0.400 Panel C: Wholesaler Stock-level Price Improvement (Prior Month) Dep var: Broker-adjusted E/Q (𝑡) Broker-adjusted E/Q (𝑡−1) 0.210** 0.196** 0.187** 0.169** 0.188** 0.219** 0.246** 0.507** 0.190** (11.00) (11.07) (6.98) (5.62) (7.08) (6.95) (7.33) (7.95) (5.01) R-sq 0.043 0.037 0.037 0.024 0.033 0.048 0.058 0.246 0.035 Panel D: Wholesaler Stock-level Price Improvement (Prior 3-month Average) Dep var: Broker-adjusted E/Q (𝑡) Broker-adjusted E/Q (𝑡−1, 𝑡−3) 0.478** 0.480** 0.464** 0.426** 0.495** 0.508** 0.467** 0.712** 0.407** (20.73) (21.15) (15.27) (7.62) (7.73) (13.61) (6.18) (7.33) (4.30) R-sq 0.080 0.084 0.093 0.051 0.082 0.095 0.068 0.237 0.047 Electronic copy available at: https://ssrn.com/abstract=4609895 68",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "References",
    "page_number": 69,
    "page_range": "p.69",
    "total_pages": 79,
    "chunk_index": 104,
    "word_count": 366,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.69)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "Wholesaler Stock-level Price Improvement (Prior 3-month Average) Dep var: Broker-adjusted E/Q (𝑡) Broker-adjusted E/Q (𝑡−1, 𝑡−3) 0.478** 0.480** 0.464** 0.426** 0.495** 0.508** 0.467** 0.712** 0.407** (20.73) (21.15) (15.27) (7.62) (7.73) (13.61) (6.18) (7.33) (4.30) R-sq 0.080 0.084 0.093 0.051 0.082 0.095 0.068 0.237 0.047 Electronic copy available at: https://ssrn.com/abstract=4609895 68",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "References",
    "page_number": 70,
    "page_range": "p.70",
    "total_pages": 79,
    "chunk_index": 105,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.70)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "Table 5: Changes in Routing in Response to Price Improvement This table examines how brokers alter their routing to wholesalers based on their prior overall (Panels A and B) or stock-level (Panels C and D) price improvement. Each period, we compute the broker-adjusted overall (stock-level) price improvement, measured as E/Q, of each wholesaler for each broker by subtracting the broker overall (stock-level) average from the wholesaler overall (stock-level) average for that broker. We then regress the percent change in orders routed next period to that wholesaler against the wholesalers’ excess price improvement based on the prior one- and three-month periods, respectively. t-values are in parentheses (based on standard errors clustered by month.) **,* represents significance at the 1%, 5% levels respectively. (1) (2) (3) (4) (5) (6) (7) (8) (9) All Proportional Brokers Selective Brokers Brokers All E*Trade Fidelity Schwab TD All IBKR Robinhood Lite Panel A: Wholesaler Overall Price Improvement (Prior Month) Dep var: Percent Change in Routed Orders (𝑡) Broker-adjusted E/Q (𝑡−1) -0.029* -0.018 -0.025 -0.043 -0.064 -0.005 -0.083* -0.067 -0.104* (-2.30) (-1.74) (-0.67) (-0.84) (-0.90) (-1.23) (-2.13) (-0.87) (-2.36) R-sq 0.013 0.008 0.009 0.022 0.042 0.002 0.041 0.022 0.076 Panel B: Wholesaler Overall Price Improvement (Prior 3-month Average) Dep var: Percent Change in Routed Orders (𝑡) Broker-adjusted E/Q (𝑡−1, 𝑡−3) -0.015 -0.014 -0.024 -0.046 0.007 -0.011 -0.026 -0.092 0.017 (-0.84) (-0.89) (-0.34) (-0.49) (0.25) (-1.98) (-0.54) (-1.11) (0.29) R-sq 0.003 0.004 0.005 0.015 0.001 0.005 0.004 0.037 0.002 Panel C: Wholesaler Stock-level Price Improvement (Prior Month) Dep var: Percent Change in Routed Orders (𝑡) Broker-adjusted E/Q (𝑡−1) -0.007 0.007 -0.003 0.014 0.015 0.007 -0.046** -0.071 -0.039** (-1.24) (1.45) (-0.44) (0.76) (1.33) (0.75) (-3.51) (-1.30) (-3.45) R-sq 0.000 0.000 0.000 0.000 0.000 0.000 0.003 0.003 0.002 Panel D: Wholesaler Stock-level Price Improvement (Prior 3-month Average) Dep var: Percent Change in Routed Orders (𝑡) Broker-adjusted E/Q (𝑡−1, 𝑡−3) -0.011 0.003 -0.016 -0.009 0.039 0.010 -0.049 -0.047 -0.049 (-0.91) (0.24) (-0.74) (-0.18) (2.95) (0.45) (-1.93) (-0.67) (-1.73) R-sq 0.000 0.000 0.000 0.000 0.002 0.000 0.001 0.001 0.001 Electronic copy available at: https://ssrn.com/abstract=4609895 69",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "References",
    "page_number": 70,
    "page_range": "p.70",
    "total_pages": 79,
    "chunk_index": 106,
    "word_count": 343,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.70)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "Improvement (Prior 3-month Average) Dep var: Percent Change in Routed Orders (𝑡) Broker-adjusted E/Q (𝑡−1, 𝑡−3) -0.011 0.003 -0.016 -0.009 0.039 0.010 -0.049 -0.047 -0.049 (-0.91) (0.24) (-0.74) (-0.18) (2.95) (0.45) (-1.93) (-0.67) (-1.73) R-sq 0.000 0.000 0.000 0.000 0.002 0.000 0.001 0.001 0.001 Electronic copy available at: https://ssrn.com/abstract=4609895 69",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "References",
    "page_number": 71,
    "page_range": "p.71",
    "total_pages": 79,
    "chunk_index": 107,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.71)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "Table 6: Levels of Venue Routing based on Prior Price Execution This table examines how wholesalers’ market shares are related to their prior price improvement. Each month, we compute the price improvement, measured as the effective over quoted spread (E/Q), of all our trades for each wholesaler by broker. We also compute the percentage of our orders routed to each wholesaler. We then regress the percent of orders routed to the wholesaler this month against the price improvement the prior month. Panel A examines the relation using all wholesalers. The second model only examines the “Top 4” wholesalers (Citadel, Virtu, Jane Street, and G1X), which filled 96% of our trades. Regressions are run with broker dummy variables where appropriate. t-values are in parentheses (based on standard errors clustered by month.) **,* represents significance at the 1%, 5% levels respectively. (1) (2) (3) (4) (5) (6) (7) (8) (9) All Proportional Brokers Selective Brokers Brokers All E*Trade Fidelity Schwab TD All IBKR Robinhood Lite Panel A: All Wholesalers Dep var: Percent Change in Routed Orders (𝑡) Broker-adjusted E/Q (𝑡−1) -0.254** -0.153** -0.044 0.056 0.250 -0.293** -0.765** -1.064** -0.670** (-8.46) (-4.52) (-0.40) (0.60) (2.17) (-6.81) (-6.33) (-10.47) (-4.16) R-sq 0.071 0.035 0.002 0.002 0.085 0.184 0.331 0.474 0.513 Panel B: “Big 4” Wholesalers Dep var: Percent Change in Routed Orders (𝑡) Broker-adjusted E/Q (𝑡−1, 𝑡−3) -0.144** 0.306** 0.095 0.463** 0.137 0.661** -0.721** -1.064** -0.653** (-3.14) (6.14) (1.50) (3.27) (1.91) (6.82) (-5.43) (-10.47) (-3.00) R-sq 0.017 0.121 0.014 0.241 0.204 0.270 0.281 0.474 0.426 Electronic copy available at: https://ssrn.com/abstract=4609895 70",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "References",
    "page_number": 71,
    "page_range": "p.71",
    "total_pages": 79,
    "chunk_index": 108,
    "word_count": 257,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.71)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "B: “Big 4” Wholesalers Dep var: Percent Change in Routed Orders (𝑡) Broker-adjusted E/Q (𝑡−1, 𝑡−3) -0.144** 0.306** 0.095 0.463** 0.137 0.661** -0.721** -1.064** -0.653** (-3.14) (6.14) (1.50) (3.27) (1.91) (6.82) (-5.43) (-10.47) (-3.00) R-sq 0.017 0.121 0.014 0.241 0.204 0.270 0.281 0.474 0.426 Electronic copy available at: https://ssrn.com/abstract=4609895 70 Table 7: Average Excess Price Improvement by Wholesaler This table examines wholesaler performance within each broker. Each month, we compute the excess price improvement for each wholesaler within each broker. Excess price improvement is the difference between the wholesaler average effective over quoted spread at that broker and the overall effective over quoted spread of that broker. We then compute the average across our sample period using Fama and MacBeth (1973) while standard errors are computed using Newey and West (1987) with one lag. We also report the broker’s average effective over quoted spread for reference purposes. t-values are in parentheses. **,* represents significance at the 1%, 5% levels respectively. Average E/Q Citadel Virtu Jane G1X Sigma UBS Street E*Trade 0.322 0.093** -0.131** -0.037** 0.048** 0.068* -0.023 (6.1) (-17.1) (-3.0) (3.9) (2.4) (-0.5) Fidelity 0.142 0.100** -0.114** -0.028 -0.059** 0.089 0.010 (6.3) (-9.0) (-1.4) (-4.4) (1.6) (0.4) IBKR Lite 0.527 0.008 0.247** -0.060** (0.4) (9.6) (-4.7) Robinhood 0.421 -0.015 -0.046** -0.045 0.129** 0.130** (-1.0) (-5.5) (-1.7) (6.6) (7.0) Schwab 0.229 0.123** -0.114** -0.049** 0.005 -0.034 -0.043 (11.9) (-5.7) (-3.0) (0.9) (-0.7) (-1.5) TD Ameritrade 0.093 0.041** 0.020 -0.064** -0.066** 0.284** 0.170* (4.1) (1.7) (-3.5) (-9.4) (3.4) (2.5) Electronic copy available at: https://ssrn.com/abstract=4609895 71",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "References",
    "page_number": 72,
    "page_range": "p.72",
    "total_pages": 79,
    "chunk_index": 109,
    "word_count": 253,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.72)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "(0.4) (9.6) (-4.7) Robinhood 0.421 -0.015 -0.046** -0.045 0.129** 0.130** (-1.0) (-5.5) (-1.7) (6.6) (7.0) Schwab 0.229 0.123** -0.114** -0.049** 0.005 -0.034 -0.043 (11.9) (-5.7) (-3.0) (0.9) (-0.7) (-1.5) TD Ameritrade 0.093 0.041** 0.020 -0.064** -0.066** 0.284** 0.170* (4.1) (1.7) (-3.5) (-9.4) (3.4) (2.5) Electronic copy available at: https://ssrn.com/abstract=4609895 71",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "References",
    "page_number": 73,
    "page_range": "p.73",
    "total_pages": 79,
    "chunk_index": 110,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.73)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "Table 8: Hypothetical Price Improvement from Rerouting This table presents results on hypothetical price improvement if our trades were rerouted based on prior execution. For each broker, we compute the average price improvement, measured as the effective over quoted spread, received on each stock from each wholesaler. In Panel A, we compute the overall price improvement we received from each wholesaler across all stocks in the prior month. We then reroute all of this month’s trades to the best wholesaler for the prior month. In Panel B, we compute the average price improvement we received for each stock from each wholesaler the prior month. We then route all of this month’strades for thatstock to thewholesaler thathad the best price improvement the prior month. In each panel, we report the average original price improvement, the hypothetical price improvement, as well as the difference and the change relative to the original price improvement, across all the months in our sample. t-statistics are computed using Fama and MacBeth (1973). **,* represents significance at the 1%, 5% levels respectively. Panel A: PI from Rerouting using Overall Execution Broker Original Updated Change t-value PI Change % Proportional: E*Trade 0.352 0.223 -0.129 -12.61** -36.6% Fidelity 0.192 0.093 -0.099 -4.87** -51.6% Schwab 0.240 0.160 -0.079 -4.80** -33.3% TD Ameritrade 0.118 0.047 -0.071 -8.15** -60.2% Selective: IBKR Free 0.575 0.530 -0.046 -3.77** -7.8% Robinhood 0.402 0.346 -0.056 -5.23** -13.9% Average 0.313 0.233 -0.080 -33.9% Panel B: PI from Rerouting using Stock Level Execution Broker Original Updated Change t-value PI Change % Proportional: E*Trade 0.349 0.311 -0.038 -3.41** -10.9% Fidelity 0.197 0.149 -0.047 -3.08** -24.4% Schwab 0.232 0.190 -0.042 -3.09** -18.1% TD Ameritrade 0.108 0.021 -0.086 -7.64** -80.6% Selective: IBKR Free 0.571 0.590 0.020 1.37 3.3% Robinhood 0.397 0.454 0.057 3.77** 14.4% Average 0.309 0.286 -0.023 -19.4% 72 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "References",
    "page_number": 73,
    "page_range": "p.73",
    "total_pages": 79,
    "chunk_index": 111,
    "word_count": 304,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.73)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "E*Trade 0.349 0.311 -0.038 -3.41** -10.9% Fidelity 0.197 0.149 -0.047 -3.08** -24.4% Schwab 0.232 0.190 -0.042 -3.09** -18.1% TD Ameritrade 0.108 0.021 -0.086 -7.64** -80.6% Selective: IBKR Free 0.571 0.590 0.020 1.37 3.3% Robinhood 0.397 0.454 0.057 3.77** 14.4% Average 0.309 0.286 -0.023 -19.4% 72 Electronic copy available at: https://ssrn.com/abstract=4609895 Table 9: Changes for Robinhood Wholesalers after Jane Street Addition This table shows changes in Robinhood’s wholesaler market after Jane Street became an additional venue. Panel A reports the percentage of our trades routed to each wholesaler before and after. Panel B reports the execution cost measured as the effective over quoted spread (E/Q) again before and after. In both panels, t values use standard errors clustered by stock. The prior period covers the six weeks before to February 24, 2022. The posterior period runs from February 24 to April 15 2022. In both cases, we average across all trades eachdayandthenaverageacrossdays, computingt-valuesusingFamaandMacBeth(1973)). **, * represents significance at the 1%, 5% levels respectively. Panel A: Wholesaler Shares Pre-Jane Street Post-Jane Street Difference t-value % Change Virtu 39.0% 28.6% -10.4% -7.58** -26.7% Citadel 26.6% 21.5% -5.1% -4.13** -19.2% Two-Sigma 18.1% 18.7% 0.6% 0.57 3.2% G1X 13.0% 8.1% -4.9% -4.43** -37.7% Jane Street 2.7% 22.5% 19.8% 19.57** 733.3% Panel B: Execution Cost (E/Q) Pre-Jane Street Post-Jane Street Difference t-value % Change Overall 0.548 0.470 -0.078 -5.66** -14.3% Virtu 0.483 0.448 -0.035 -1.15 -7.2% Citadel 0.536 0.398 -0.138 -5.91** -25.7% Two-Sigma 0.612 0.597 -0.015 -0.42 -2.4% G1X 0.703 0.643 -0.061 -2.53* -8.6% Jane Street 0.238 0.391 0.154 2.00 64.7% 73 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "References",
    "page_number": 74,
    "page_range": "p.74",
    "total_pages": 79,
    "chunk_index": 112,
    "word_count": 261,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.74)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "Street Post-Jane Street Difference t-value % Change Overall 0.548 0.470 -0.078 -5.66** -14.3% Virtu 0.483 0.448 -0.035 -1.15 -7.2% Citadel 0.536 0.398 -0.138 -5.91** -25.7% Two-Sigma 0.612 0.597 -0.015 -0.42 -2.4% G1X 0.703 0.643 -0.061 -2.53* -8.6% Jane Street 0.238 0.391 0.154 2.00 64.7% 73 Electronic copy available at: https://ssrn.com/abstract=4609895 Table 10: Drivers of Changes in Stock Allocation after Jane Street Addition This table analyzes the drivers behind Robinhood’s routing of stocks after Jane Street’s addition to its routing venues. We separate the sample into the six weeks prior to February 24, 2022, and a post period from February 24 to April 15, 2022. For each stock-wholesaler observation, we compute the execution cost, measured as the effective over quoted spread, on that stock relative to the overall venue average (Excess E/Q) over the prior period. We then regress the change in the wholesaler’s share in that stock from the pre- to post- period against Excess E/Q. We also include stock-level controls, i.e., the average spread, log of the stockprice, logofthestockvolume, andtheaveragedailyreturn. t-valuesareinparentheses. **,* represents significance at the 1%, 5% levels respectively. Citadel Virtu G1X Two Sigma Excess E/Q 0.092 0.027 -0.009 -0.064 (1.12) (0.24) (-0.10) (-0.99) Avg. Spread -0.023 -0.054 0.026 0.027 (-0.65) (1.27) (0.74) (0.79) Log(Price) 0.007 0.036** -0.024* -0.016 (0.73) (3.08) (-2.37) (-1.78) Log(Volume) -0.012 -0.022* -0.012 0.020** (-1.58) (-2.56) (-1.59) (2.74) Avg. Daily Return -0.015 -0.003 0.038** -0.035** (-1.19) (-0.16) (2.99) (-2.97) 74 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "References",
    "page_number": 75,
    "page_range": "p.75",
    "total_pages": 79,
    "chunk_index": 113,
    "word_count": 241,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.75)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "-0.064 (1.12) (0.24) (-0.10) (-0.99) Avg. Spread -0.023 -0.054 0.026 0.027 (-0.65) (1.27) (0.74) (0.79) Log(Price) 0.007 0.036** -0.024* -0.016 (0.73) (3.08) (-2.37) (-1.78) Log(Volume) -0.012 -0.022* -0.012 0.020** (-1.58) (-2.56) (-1.59) (2.74) Avg. Daily Return -0.015 -0.003 0.038** -0.035** (-1.19) (-0.16) (2.99) (-2.97) 74 Electronic copy available at: https://ssrn.com/abstract=4609895 A. Proofs Proof of Proposition 1. First, suppose that the broker incurs switching costs (𝑠 > 0). The wholesalers’ marginal costs may or may not be the same (𝑓 ≤ 𝑓 ). The broker optimally chooses Δ that solves: 𝑋 𝑌 𝑠 min (𝜎 +Δ)𝑝 +(1−𝜎 −Δ)𝑝 + Δ2. (10) 𝑋 𝑌 Δ∈[−𝜎,1−𝜎] 2 The F.O.C. implies: ⎧ ⎪ ⎪ ⎪ ⎪ ⎪ 𝑝𝑌− 𝑠 𝑝𝑋 if 𝑝 𝑌 −𝑝 𝑋 ∈ [−𝑠𝜎,𝑠(1−𝜎)], ⎪ ⎪ ⎪ ⎨ Δ = (11) 1−𝜎 if 𝑝 −𝑝 > 𝑠(1−𝜎). 𝑌 𝑋 ⎪ ⎪ ⎪ ⎪ ⎪ ⎪ ⎪ ⎪ ⎩−𝜎 otherwise. Each wholesaler optimally chooses prices to maximize profits. Wholesaler 𝑋 solves max(𝑝 −𝑓 )(𝜎 +Δ) (12) 𝑋 𝑋 𝑝𝑋 75 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "Appendix",
    "page_number": 76,
    "page_range": "p.76-77",
    "total_pages": 79,
    "chunk_index": 114,
    "word_count": 173,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Appendix (p.76-77)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "⎪ ⎪ ⎪ ⎨ Δ = (11) 1−𝜎 if 𝑝 −𝑝 > 𝑠(1−𝜎). 𝑌 𝑋 ⎪ ⎪ ⎪ ⎪ ⎪ ⎪ ⎪ ⎪ ⎩−𝜎 otherwise. Each wholesaler optimally chooses prices to maximize profits. Wholesaler 𝑋 solves max(𝑝 −𝑓 )(𝜎 +Δ) (12) 𝑋 𝑋 𝑝𝑋 75 Electronic copy available at: https://ssrn.com/abstract=4609895 Using Equation (11), the F.O.C. implies ⎧ ⎪ ⎪ ⎪ ⎪ ⎪ 𝑠𝜎+𝑝 2 𝑌+𝑓𝑋 if 𝑝 𝑌 ∈ (𝑓 𝑋 −𝑠𝜎,𝑓 𝑋 +𝑠(2−𝜎)), ⎪ ⎪ ⎪ ⎨ 𝑝 = (13) 𝑋 𝑓 if 𝑝 ≤ 𝑓 −𝑠𝜎, 𝑋 𝑌 𝑋 ⎪ ⎪ ⎪ ⎪ ⎪ ⎪ ⎪ ⎪ ⎩𝑝 𝑌 −𝑠(1−𝜎) otherwise. Similarly, wholesaler 𝑌’s F.O.C. implies ⎧ ⎪ ⎪ ⎪𝑠(1−𝜎)+𝑝𝑋+𝑓𝑌 if 𝑝 ∈ (𝑓 −𝑠(1−𝜎),𝑓 +𝑠(1+𝜎)), ⎪ ⎪ 2 𝑋 𝑌 𝑌 ⎪ ⎪ ⎪ ⎨ 𝑝 = (14) 𝑌 𝑓 if 𝑝 ≤ 𝑓 −𝑠(1−𝜎), 𝑌 𝑋 𝑌 ⎪ ⎪ ⎪ ⎪ ⎪ ⎪ ⎪ ⎪ ⎩𝑝 𝑋 −𝑠𝜎 otherwise. Theoretically, there is a total of nine cases. However, given that 𝑓 ≤ 𝑓 , 𝑝 cannot be 𝑋 𝑌 𝑌 less than 𝑓 . It is also not optimal for wholesaler 𝑋 to charge 𝑝 > 𝑓 +𝑠(1+𝜎) such that 𝑋 𝑋 𝑌 wholesaler 𝑌 receives the entire order flow. Thus, a total of four cases remains. Case 1: 𝑝 ∈ (𝑓 − 𝑠(1 − 𝜎),𝑓 + 𝑠(1 + 𝜎)) and 𝑝 ∈ (𝑓 − 𝑠𝜎,𝑓 + 𝑠(2 − 𝜎)). From 𝑋 𝑌 𝑌 𝑌 𝑋 𝑋 Equations (13) and (14), we have 2𝑓 +𝑓 𝑠(1+𝜎) 𝑓 +2𝑓 𝑠(2−𝜎) 𝑋 𝑌 𝑋 𝑌 𝑝 = + and 𝑝 = + . (15) 𝑋 𝑌 3 3 3 3 Ensuring that these solutions satisfy the conditions for the prices’ ranges, we have 𝑓 −𝑓 𝑌 𝑋 𝑠 > . (16) 2−𝜎 76 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "Appendix",
    "page_number": 77,
    "page_range": "p.77",
    "total_pages": 79,
    "chunk_index": 115,
    "word_count": 300,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Appendix (p.77)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "𝑓 +2𝑓 𝑠(2−𝜎) 𝑋 𝑌 𝑋 𝑌 𝑝 = + and 𝑝 = + . (15) 𝑋 𝑌 3 3 3 3 Ensuring that these solutions satisfy the conditions for the prices’ ranges, we have 𝑓 −𝑓 𝑌 𝑋 𝑠 > . (16) 2−𝜎 76 Electronic copy available at: https://ssrn.com/abstract=4609895 Case 2: 𝑝 ∈ (𝑓 −𝑠(1−𝜎),𝑓 +𝑠(1+𝜎)) and 𝑝 ≥ 𝑓 +𝑠(2−𝜎). Again from Equations 𝑋 𝑌 𝑌 𝑌 𝑋 (13) and (14), we have 𝑝 = 𝑓 −𝑠(1−𝜎) and 𝑝 = 𝑓 . (17) 𝑋 𝑌 𝑌 𝑌 Ensuring that these solutions satisfy the conditions, we have 𝑓 −𝑓 𝑌 𝑋 𝑠 ≤ . (18) 2−𝜎 Case 3: 𝑝 ≤ 𝑓 −𝑠(1−𝜎) and 𝑝 ∈ (𝑓 −𝑠𝜎,𝑓 +𝑠(2−𝜎)). From Equations (13) and 𝑋 𝑌 𝑌 𝑋 𝑋 (14), we have 𝑓 +𝑓 +𝑠𝜎 𝑋 𝑌 𝑝 = and 𝑝 = 𝑓 . (19) 𝑋 𝑌 𝑌 2 Substitutingthesesolutionstotheconditionsyieldscontradictions. 𝑝 = 𝑓 ∈ (𝑓 −𝑠𝜎,𝑓 + 𝑌 𝑌 𝑋 𝑋 𝑠(2−𝜎)) implies: 𝑓 −𝑓 ∈ (𝑓 −𝑠𝜎,𝑓 +𝑠(2−𝜎)), (20) 𝑌 𝑋 𝑋 𝑋 while 𝑝 = 𝑓𝑋+𝑓𝑌+𝑠𝜎 ≤ 𝑓 −𝑠(1−𝜎) implies: 𝑋 2 𝑌 𝑓 −𝑓 ≥ 𝑠(2−𝜎). (21) 𝑌 𝑋 Both conditions cannot be satisfied simultaneously. Case 4: 𝑝 ≤ 𝑓 −𝑠(1−𝜎) and 𝑝 ≥ 𝑓 +𝑠(2−𝜎). In this case, 𝑝 = 𝑓 and wholesaler 𝑋 𝑌 𝑌 𝑋 𝑌 𝑌 𝑋 has no incentive to reduce prices strictly below 𝑓 −𝑠(1−𝜎) since it already receives the 𝑌 77 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "Appendix",
    "page_number": 78,
    "page_range": "p.78-79",
    "total_pages": 79,
    "chunk_index": 116,
    "word_count": 245,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Appendix (p.78-79)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  },
  {
    "text": "satisfied simultaneously. Case 4: 𝑝 ≤ 𝑓 −𝑠(1−𝜎) and 𝑝 ≥ 𝑓 +𝑠(2−𝜎). In this case, 𝑝 = 𝑓 and wholesaler 𝑋 𝑌 𝑌 𝑋 𝑌 𝑌 𝑋 has no incentive to reduce prices strictly below 𝑓 −𝑠(1−𝜎) since it already receives the 𝑌 77 Electronic copy available at: https://ssrn.com/abstract=4609895 entire order flow. Thus, the result is identical to Case 2. Finally, if the broker does not incur switching costs (i.e., 𝑠 = 0), the broker’s optimal strategy is ⎧ ⎪ ⎪ ⎪1−𝜎 if 𝑝 ≤ 𝑝 ⎨ 𝑋 𝑌 Δ = (22) ⎪ ⎪ ⎪ ⎩−𝜎 otherwise. Given this, wholesalers 𝑋 and 𝑌’s optimal strategies are 𝑝 = 𝑝 = 𝑓 . Wholesaler 𝑌 has 𝑋 𝑌 𝑌 no incentive to raise or reduce prices, since any other prices imply zero or negative profits. Wholesaler 𝑋 also has no incentive to raise or reduce prices. Raising prices imply zero market share. Reducing prices only lower profits since it is already receiving the entire order flow. 78 Electronic copy available at: https://ssrn.com/abstract=4609895",
    "title": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution",
    "source_type": "pdf",
    "document_id": "a77f6e14f79d",
    "source_file": "Who Is Minding the Store Order Routing and Competition in Retail Trade Execution.pdf",
    "section": "Appendix",
    "page_number": 79,
    "page_range": "p.79",
    "total_pages": 79,
    "chunk_index": 117,
    "word_count": 172,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Appendix (p.79)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231109153052Z",
    "duration": null
  }
]