[
  {
    "text": "Who Gambles In The Stock Market? ∗ ALOK KUMAR ABSTRACT This paper examines whether socio-economic and psychological factors which are known to influence lottery purchases lead to excess investment in lottery-type stocks. The results in- dicate that, unlike institutional investors, individual investors prefer stocks with lottery-type features. The demand for lottery-type stocks increases during bad economic times and such demand shifts influence the returns of lottery-type stocks. In the cross-section, factors which induce greater expenditure in lotteries also induce greater investment in lottery-type stocks – poor, young men who live in urban, Republican dominated regions and belong to specific mi- nority(African-AmericanandHispanic)andreligious(Catholic)groups investmoreinlottery- type stocks. Additionally, investors who exhibit stronger preference for lottery-type stocks experience greater mean under-performance. Collectively,the evidence indicates that people’s attitudes toward gamblingare reflected in their stock investment choices and stock returns. Hope springs eternal in the human breast. – Alexander Pope, An Essay on Man. The next best thing to a fortune is the chance of a fortune. – Chance, New Statesman and Nation, June 6, 1931. Lottery participation is quite widespread in the United States (e.g., Welte, Barnes, Wiec- zorek, Tidwell, and Parker (2002), Jones (2004)). The extant evidence suggests that lottery participation rates and levels of lottery purchases are strongly influenced by a variety of socio-economic and psychological factors. Poor individuals tend to spend a greater pro- portion of their income on lottery purchases (e.g., Clotfelter and Cook (1989), Clotfelter (2000), Rubinstein and Scafidi (2002)) and their demand for lottery increases with a decline in their income (Blalock, Just, and Simon (2004)). In addition to wealth, age and education ∗Pleaseaddressallcorrespondence to: AlokKumar,239MendozaCollegeofBusiness,UniversityofNotre Dame, Notre Dame, IN 46556;Phone: 574-631-0354; email: akumar@nd.edu. I would like to thank Warren Bailey, Nick Barberis, Robert Battalio, Garrick Blalock, Sudheer Chava, Lauren Cohen, George Korniotis, Paul Schultz, and Jeff Wurgler for helpful discussions and valuable comments. In addition, I would like to thank Itamar Simonson for making the investor data available to me and Terrance Odean for answering numerous questions about the investor database. I am responsible for all remainingerrors and omissions. 1",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 49,
    "chunk_index": 0,
    "word_count": 342,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "George Korniotis, Paul Schultz, and Jeff Wurgler for helpful discussions and valuable comments. In addition, I would like to thank Itamar Simonson for making the investor data available to me and Terrance Odean for answering numerous questions about the investor database. I am responsible for all remainingerrors and omissions. 1",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 49,
    "chunk_index": 1,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "level influence lottery purchases – younger and less educated individuals find lotteries more attractive. Furthermore, relative to women, men are more likely to participate in lotteries while single or divorced individuals are more likely to participate in lotteries than people who are married. Previous studies have also documented that race, ethnicity, religion, and political affil- iation influence attitudes toward lottery-playing and gambling. Lottery participation rates and purchase levels are higher among African-American and Hispanic minority groups (e.g., Herring and Bledsoe (1994), Price and Novak (1999)). Among religious groups, Catholics and Jewsparticipateinlotteriesmorethan Protestants andMormons (e.g.,Grichting(1986), Clotfelter and Cook (1989)). And lastly, there is an effect of geographical location on lottery purchases – urban people are more likely to buy lotteries than people located in rural areas. Taken together, the results from lottery studies indicate that the heaviest lottery players are poor, young, and uneducated single men who live in urban areas and belong to specific minority (African-American and Hispanic) and religious (Catholic) groups. Do individuals with these characteristics also exhibit a strong preference for lottery-type stocks when they invest in the stock market? And why would their preferences for lotteries spillover into the stock market? Because common biological, psychological, religious, and socio-economic factors jointly determine the “make-up” of a gambler (e.g., Walker (1992)), it is quite con- ceivable that individuals with preference for lotteries would adopt a gambling mindset in other domains of their lives. In particular, people’s investmentchoices may be influenced by their attitudes toward lottery-playing and gambling.1 Individuals are likely to find lotteries and lottery-type stocks attractive for several rea- sons. Lotteries are likely to give people, especially those who are poor, a hope for a better life. For a very low cost, they may dream about becoming rich (e.g., Pope (1983), Simon (1998)).2 These people may be fully aware that lotteries have negative expected payoffs, but nonetheless, they may exhibit a preference for lotteries because a remote chance of winning is perceived to be better than no chance of winning at all. Apart from this wishful thinking, there may also be an element of “thrill” involved with lottery purchases. However, Blalock, 1Strictlyspeaking, gambling,lottery-playing,and speculation are related but distinct activities. Specula- tionreferstoanactivitywherearisk-seeking(oralessriskaverse)individualtakesrelativelylargerbetswith large risks and gets rewarded appropriately. Under this definition of speculation, one can define speculative stocks as those which have higher variance and higher expected returns. In contrast, gambling refers to the activitywhere anindividualtakeslargerisksbutthereward isnotcommensuratewiththelevelofrisktaken (i.e., expected payoff or return is negative). Gamblers still undertake such bets because they derive utility from the “thrill” of being in a risky situation. In other words, gamblers are likely to trade lower returns for the utility they derive from the “thrill” of gambling. Lastly, lotteries are distinct from speculative and gamblingactivities. When an individualbuys alottery,she spends a smallamountofmoney andexpects to earn a lownegative return with a high probabilityand a large positive return with a very smallprobability. Lottery players are willingto accept a negative expected return for the possibilityof a large positive payoff (i.e., hitting the jackpot). Under this characterization of lotteries, stocks with lottery-type features would have lower prices, higher volatility,and large positive skewness. 2Theroleofanticipatoryutilitysuchasdream utilityhasbeen recognized inother contexts. See Loewen- stein (1987) and Caplin and Leahy (2001) for a formal treatment and Elster and Loewenstein (1991) for a rich but an informaldiscussion. 2",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 49,
    "chunk_index": 2,
    "word_count": 544,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "the jackpot). Under this characterization of lotteries, stocks with lottery-type features would have lower prices, higher volatility,and large positive skewness. 2Theroleofanticipatoryutilitysuchasdream utilityhasbeen recognized inother contexts. See Loewen- stein (1987) and Caplin and Leahy (2001) for a formal treatment and Elster and Loewenstein (1991) for a rich but an informaldiscussion. 2",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 49,
    "chunk_index": 3,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Just, and Simon (2004) find that entertainment motives do not seem to be the primary determinant of lottery participation decisions among the poor. Consistent with the predic- tions of earlier studies (e.g., Friedman and Savage (1948), Markowitz (1952), Kahneman and Tversky (1979)), they find that the lottery purchases of the poor are influenced by a strong desire to escape poverty and a strong yearning (relative to rich individuals) to rise in the social status. If a desire to escape poverty induces gambling, socio-economic factors which promote lottery purchases are also likely to induce investors to adopt sub-optimal stock investment strategies. Specifically, investors with a large differential between their existing economic conditions and their aspiration levels would tilt their portfolios toward riskier lottery-type stocks. However, these investors may hold riskier stocks not necessarily because they are risk-seeking but rather because they want to have a positive probability, albeit very small, of reaching their aspiration levels. As Markowitz (1952) puts it aptly, some investors may “take large chances of a small loss for a small chance of a large gain.” Higher participation rates and excess expenditures in lotteries and lottery-type stocks may also be induced by individuals’ inability to accurately perceive very small probabili- ties. Because people do not encounter extremely small probabilities such as 10−6 in their regular lives, they may over-weight the reward probabilities (e.g., Tversky and Kahneman (1992)). Furthermore, over-weighting of low probabilities can induce a preference for skew- ness (Polkovnichenko (2005), Barberis and Huang (2005)) and given the positively skewed payoffs of lotteries (and lottery-type stocks), the attractiveness of lotteries (and lottery-type stocks) is likely to increase. Alternatively, people may choose to ignore those small proba- bilities and focus primarily on the size of the reward (e.g., Pope (1983), Forrest, Simmons, and Chesters (2002), Garrett and Sobel (2002)).3 It is well-known that lotteries with larger jackpot sizes are more popular among lottery players, even though the odds of winning are extremely low. The larger the size of the jackpot, the more people are willing to ignore the high probability of losing. The fixation on the size of the jackpot may be further reinforced by the widespread coverage of jackpot winners in the media. Similarly, stocks with extreme returns, especially those which garner attention of the media due to their extreme returns, may be favored by investors who exhibit a preference for lotteries. In addition to stock characteristics, investor characteristics may influence probability distortions, where relativelysophisticated investorsare lesslikelyto distort the probabilities. For instance, educated individuals are more likely to understand the odds of winning while 3Damasio(1994)and Loewenstein, Weber, Hsee, and Welch (2001) suggest that a very small probability of apositive event is sufficient to generate positive anticipatory emotions. Consequently, in risky situations, people may focus exclusively on the possibility rather than on the probability of outcomes. Furthermore, probabilities(evenverysmallones)caninfluencethedecisionframechosenbypeople(ElsterandLoewenstein (1991)). For instance, a gamble with a 100% chance of a moderate loss is obviously perceived as being unfavorable. However, with a small probability(say 0.01)of a large gain,the gamble maybe framed as one where there is a 1% chance of a win (a positive frame) rather than a gamble where there is a 99% chance of a loss (a negative frame). The choice of a positive frame is likely to exacerbate the positive anticipatory emotions. 3",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 49,
    "chunk_index": 4,
    "word_count": 545,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "large gain,the gamble maybe framed as one where there is a 1% chance of a win (a positive frame) rather than a gamble where there is a 99% chance of a loss (a negative frame). The choice of a positive frame is likely to exacerbate the positive anticipatory emotions. 3",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 49,
    "chunk_index": 5,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "relativelylesseducatedindividualsmaysignificantlydistortthewinningodds. Ifeducationis correlated with income and wealth, rich individuals are less likely to participate in lotteries. Even when they participate, they are likely to spend a relatively lower proportion of their income on lottery purchases. In a similar vein, wealthy investors may hold large equity portfolios butthey arelikelyto spend a relativelylowerproportion of theirwealthon lottery- type stocks. What types of stocks are likelyto be perceivedas lotteries? Lottery ticketshave verylow pricesrelativeto the highestpotentialpayoff (i.e.,thesizeof thejackpot), theyhavenegative expected returns, their payoffs are very risky (i.e., the prize distribution has extremely high variance), and theyhave an extremelysmall probabilityof a veryhigh reward, i.e.,they have positivelyskewed returns. Mapping these lottery features onto stocks, I identifylottery-type stocks.4 I assume that investors are more likely to perceive lower-priced stocks with very small but positive potential for high returns as lotteries. I further assume that stocks with higher variance (or higher idiosyncratic volatility or large extreme returns) and positively skewed returns are likely to be perceived as high payoff potential stocks.5 Under these assumptions, I conjecture that people who find lotteries attractive are likely to invest disproportionately more in stocks with higher idiosyncratic volatility, higher skew- ness, and lower prices, even if those stocks have lower expected returns. Additionally, to maintain a small positive probability of a large gain, people may continue to follow gam- bling motivated investmentstrategies in spite of their persistent losses. I test this conjecture using the end-of-month portfolio-holdings of a group of individual investors at a large U.S. brokerage house for the period 1991 to 1996. Specifically, I examine whether socio-economic and psychological factors which are known to influence lottery purchases lead to excess in- vestment in lottery-type stocks. My empiricalanalysis focuses on four distinctissues. First, I examine whether individual investors as a group prefer stocks with lottery-type features and compare individual prefer- ences with institutional preferences. Second, I examine whether the demand for lottery-type stocks varies with broad economic conditions and whether such demand shifts influence the 4Lottery-type stocks are similar to penny stocks (stock price < $1), pink sheets, and over-the-counter bulletin board stocks. However, because I define lottery-type stocks using multiple price- and return-based stock attributes, not all penny stocks, pink sheets, and bulletin board stocks would be classified as lottery- type stocks. 5Note that I am not suggesting that investors actively examine the moments of return distributions and formulate their portfolio decisions using these moments. Rather, I use the return moments-based characterization of lottery-type stocks to abstract away from a large number of behavioral mechanisms which are likely to generate a preference for higher order moments. For instance, as mentioned earlier, over-weighting of low probability events (e.g., the probability of winning a lottery jackpot) can induce a preference for skewness (Tversky and Kahneman (1992), Polkovnichenko (2005), Barberis and Huang (2005)). Brunnermeier and Parker (2004) show that anticipatory utility(e.g., dream utility)can generate a preference for skewness in portfolio choices. Alternatively, lottery-type stocks mayhave one or more salient characteristics (basedonreturnsorthefundamentals)whichinvestorsmayusetoselect stocks. Forinstance, positively skewed stocks with extreme returns may catch investors’ attention (Barber and Odean 2005) or they may choose stocks based on salient attributes such as dividend-paying versus non-dividend-paying (Baker and Wurgler (2004), Baker and Wurgler (2005)) which may lead to a preference for lottery-type stocks. 4",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 49,
    "chunk_index": 6,
    "word_count": 535,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "characteristics (basedonreturnsorthefundamentals)whichinvestorsmayusetoselect stocks. Forinstance, positively skewed stocks with extreme returns may catch investors’ attention (Barber and Odean 2005) or they may choose stocks based on salient attributes such as dividend-paying versus non-dividend-paying (Baker and Wurgler (2004), Baker and Wurgler (2005)) which may lead to a preference for lottery-type stocks. 4",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 49,
    "chunk_index": 7,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "returns of lottery-type stocks. Third, I investigatethe cross-sectional differences in gambling motivated investment choices of investors across various demographic categories. I focus on the behavior of poor investors but I also examine the role of age, gender, race, ethnicity, religion, political affiliation, and location (i.e., rural versus urban) on investors’ propensity to invest in lottery-type stocks. Finally, I using several performance benchmarks, I examine the relative portfolio performance of investors who invest in lottery-type stocks. The notion that gambling motives may influence investment decisions is not entirely new. Previous studies (e.g., Friedman and Savage (1948), Markowitz (1952), Shefrin and Statman (2000), Shiller (2000, pp. 40-42), Statman (2002)) have emphasized the role of gambling behavior in the context of investment decisions. What is new in my paper is the formalization of the notion of lottery-type stocks and the direct evidence of cross-sectional variation in investors’ preferences for lottery-type stocks. Previous studies have identified skewness preferences of investors as a determinant of portfolio under-diversification (e.g., Goetzmann and Kumar (2004), Mitton and Vorkink (2004)) but they do not examine the link between gambling attitudes and stock investment decisions which is the main focus of my paper.6 My results indicate that individual investors invest disproportionately more in stocks with higher idiosyncraticvolatility,higher skewness, and lower prices evenwhen these stocks have lower mean returns. These preferences are distinct from individual investors’ known preferences (e.g., Barber and Odean (2000), Barber and Odean (2001), Kumar (2003)) for certain firm characteristics(e.g., small-cap stocks, value stocks, etc.). For robustness, I com- pare aggregate individual and institutional preferences and find that institutional investors prefer stocks with higher mean returns, lower idiosyncratic volatility, lower skewness, and higher prices. Individual investors’ demand for lottery-type stocks increases when economic conditions are poor and those demand shifts influence the returns of lottery-type stocks. Examining cross-sectional differences within the individual investor category, I find that socio-economic and psychological factors which induce higher expenditures in lotteries also induce greater investments in lottery-type stocks – poor, young men, who live in urban areas and belong to specific minority groups (African-American and Hispanic) invest more in stocks with lottery-type features. Additionally, investors who live in regions with higher concentration of Catholics (Protestants) have a stronger (weaker) preference for lottery- type stocks. I also find that investors who live in regions which voted strongly Republican (Democratic) in 1992 and 1996 presidential elections have a stronger (weaker) preference for lottery-type stocks.7 6In a recent study, Malloy and Zhu (2004) examine whether investors in deprived neighborhoods (i.e., regions with a greater concentration of African-Americans, people with low income, and relatively less education levels) face sub-optimal investment opportunity sets in their mutual fund choices. They use race/ethnicity asaproxyforinvestor sophisticationwhilemyfocus isonthe relationbetween race/ethnicity and gamblingbehavior. 7The investor database does not contain informationabout the race/ethnicity, religion,and the political affiliation of investors. Using auxiliary data sources, I obtain (noisy) measures of these identities. To 5",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 49,
    "chunk_index": 8,
    "word_count": 479,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "education levels) face sub-optimal investment opportunity sets in their mutual fund choices. They use race/ethnicity asaproxyforinvestor sophisticationwhilemyfocus isonthe relationbetween race/ethnicity and gamblingbehavior. 7The investor database does not contain informationabout the race/ethnicity, religion,and the political affiliation of investors. Using auxiliary data sources, I obtain (noisy) measures of these identities. To 5",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 49,
    "chunk_index": 9,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Examining the portfolio performance of investors who invest in lottery-type stocks, I find that their portfolios exhibit significant under-performance – the mean annual under- performance is roughly 5% of investors’ annual household income, where the range is 2-32%. Investors in the lowest income group (annual income < $15,000) have a mean annual under- performance of $4,725 which is almost 32% of their annual income.8 High-income investors (annual income > $125,000) also have comparable annual under-performance ($4,250) but this under-performance is a lower proportion (1.70%) of their mean annual income. Col- lectively, my results indicate that investors who are pre-disposed to playing lotteries also exhibit strong preferences for lottery-type stocks in their investment choices. More impor- tantly, and sadly, poor investors, who can least afford to under-perform, experiencethe most severe under-performance from their gambling motivated investments.9 Even though the mean annual under-performance estimates are economically significant, one may argue that the gambling motivated investment patterns I document are not very surprising because the brokerage accounts I examine represent investors’ “play money” ac- counts meant primarily for gambling and entertainment purposes. My results are robust to this concern because several pieces of evidence suggest that this is unlikely to be the case. For instance, Goetzmann and Kumar (2004) find that a typical portfolio is about 79% of investor’s annual income and roughly 32% of an investor’s total net-worth. This evidence indicates that, for most investors, the brokerage account is unlikely to be her play money account. Furthermore, if these accounts indeed represent investors’ play money accounts, identify an investor’s race/ethnicity, religion, and political affiliation, I assign her the racial/ethnic profile of her zipcode, the religious profile of her state, and a political profile based on the voting patterns in her county, respectively. So, strictly speaking, the race measure of an investor indicates the dominant race in her zipcode, the religiousaffiliationmeasure refers to the religiousdistributionofher state, andthe political affiliation measure reflects the political tilt of her county. However, I avoid these lengthy and awkward descriptors and use broad racial/ethnic, religious, and political labels such as Hispanic investor, Catholic investor, Republican investor, etc. 8I do not have a precise estimate of investors’ annual income. I only know that the income lies in one of the followingnine categories: 0-15K, 15-20K, 20-30K, 30-40K, 40-50K, 50-75K, 75-100K, 100-125K, and above 125K. I use the upper limit of the income range to obtain the under-performance estimates as a proportion of the income. FollowingIvkovi´c and Weisbenner (2005), I assign an annual income of $250,000 to the highest income category. 9In spite of considerable losses incurred by investors, I am not implying that investors are necessarily being irrational. To determine whether investors are truly acting irrationally,one needs to clearly define an appropriate model of gamblingand lottery-playing but that has not been an easy task. Whether gambling behaviorandpeople’spreferences forlotteriescanbeexplainedwithintherationalexpectedutilityframework has been a matter of considerable debate. For instance, the expected utility framework with a non-concave utilityfunction(e.g.,FriedmanandSavage(1948),HartleyandFarrell(2002))orevenconcaveutilityfunction with indivisible expenditures (Kwang (1965)) or market imperfections (Kim (1973)) can explain gambling behavior within the rationalparadigm. Gamblingbehavior and lottery-playing can also be explained if one allows non-monetary utilities (e.g., anticipatory or dream utility, entertainment utility, etc.) to enter the utility function directly (e.g., Conlisk (1993), Diecidue, Schmidt, and Wakker (2004)) or allow for the act of gamblingto offer direct consumption value (e.g.,Johnson, O’Brien, and Shin (1999)). Additionally,non- expected utilityparadigmssuch asthe rank-dependent utilityframework(Quiggin(1982))orthe cumulative prospect theory (Tversky and Kahneman (1992)) can explain gambling and lottery-playing. Given these alternative explanationsfor gamblingand lottery-playing,the behavior of investors maybe rationalrelative to some benchmarks but irrational relative to others. For instance, if investors’ investments in lottery-type stocks are motivatedbytheir preferences forskewness and anticipatoryemotionssuch as hope, they maybe reasonably happy even if their portfolios under-perform various performance benchmarks. 6",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 49,
    "chunk_index": 10,
    "word_count": 618,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "and lottery-playing. Given these alternative explanationsfor gamblingand lottery-playing,the behavior of investors maybe rationalrelative to some benchmarks but irrational relative to others. For instance, if investors’ investments in lottery-type stocks are motivatedbytheir preferences forskewness and anticipatoryemotionssuch as hope, they maybe reasonably happy even if their portfolios under-perform various performance benchmarks. 6",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 49,
    "chunk_index": 11,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "it is more likely to be the case for investors who are relatively more wealthy. Under this scenario, the portfolios of wealthy investors would be tilted more toward lottery-type stocks. However, my findings are just opposite which indicate that concentration of play money accounts in the sample is unlikely to contaminate my findings. The rest of the paper is organized as follows: in the next section, I compare the aggregate preferences of individual and institutional investors for lottery-type stocks. In Section II, I examinethe cross-sectional differencesin gambling motivated investmentchoicesof investors across various demographic categories. In Section III, I develop a profile of stock market gamblers by rotating the point of view from the cross-section of stocks to the cross-section of investors. I also examine whether the demand for lottery-type stocks varies with broad economic conditions and whether such demand shifts influence the returns of lottery-type stocks. In Section IV, using different benchmarks, I evaluate the portfolio performance of investorswho adopt gamblingmotivatedinvestmentstrategies. Finally,Iconcludein Section V with a summary of the main results and a brief discussion. I. Aggregate Preferences for Lottery-Type Stocks A. Data and Sample Characteristics Thedata for thisstudy consistsof alltradesand end-of-month portfolio positions of investors atamajorU.S.discountbrokeragehouseforthe1991-96 time-period. Thisdatabasehasbeen used in several studies including Odean (1998, 1999) and Barber and Odean (2000, 2001). There are a total of 77,995 households in the database of which 62,387 have traded in stocks. Investors hold and trade a variety of other securitiesincluding mutual funds, options, ADRs, etc. An average investor holds a 4-stock portfolio (median is 3) with an average size of $35,629 (median is $13,869). Fewer than 10% of the investors hold portfolios over $100,000 and fewer than 5% of them hold more than 10 stocks. For a subset of households, demo- graphic information such as age, income, location (zipcode), total net worth (i.e., wealth), occupation, marital status, family size, gender, etc. is available. Further details on the investor database are available in Barber and Odean (2000). I enrich the individual investor database using data from three other auxiliary sources. First,toidentifytheracial/ethnicprofileofinvestorsinthesample,Imeasuretheracial/ethnic composition of each zipcode using data from the 1990 U.S. Census.10 For each zipcode, I compute the proportion of individuals in the following five groups: (i) White, (ii) Black,(iii) Asian, (iv) Hispanic, and (v) Others. Given the zipcode of each investor, I assign her the appropriate zipcode-level racial profile. 10The U.S. Census data are availableat http://www.census.gov/main/www/cen1990.html. 7",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 49,
    "chunk_index": 12,
    "word_count": 396,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "the 1990 U.S. Census.10 For each zipcode, I compute the proportion of individuals in the following five groups: (i) White, (ii) Black,(iii) Asian, (iv) Hispanic, and (v) Others. Given the zipcode of each investor, I assign her the appropriate zipcode-level racial profile. 10The U.S. Census data are availableat http://www.census.gov/main/www/cen1990.html. 7",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 49,
    "chunk_index": 13,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Second, for each state, I identify the relative proportions of different religious denomina- tions using the 2001 American Religious Identification Survey data.11 In the data, Catholics are identified as one group. To identify Protestants, I group the following denominations intoonecategory: Methodist,Lutheran, Presbyterian,Protestant, Pentecostal,Episcopalian, Baptist, and Anglican. Using each investor’s zipcode, I assign the appropriate state-level religious profile to the investor. Lastly, I obtain county-levelvotingdata fromthe 1992 and the 1996 presidentialelections to estimate the political affiliations of investors in my sample.12 For each county, I compute the ratio of the number of votes to the Democratic party and the number of votes to the Republican party during the 1992 and 1996 presidential elections. I assign the average of the appropriate county-level ratios to investors who live in that county. In addition to extensive data on individual investors, I obtain quarterly institutional holdings from Thomson Financial. These data contain the end of quarter stock holdings of allinstitutions that fileform13F with theSecuritiesand ExchangeCommission. Institutions with more than $100 million under management are required to file form 13F, and common stock positions of more than 10,000 shares or more than $200,000 in value must be reported. AdetaileddescriptionoftheinstitutionalownershipdataisavailableinGompersandMetrick (2001). Several other standard datasets are used in this study. I obtain analysts’ quarterly earnings estimates from I/B/E/S summary files. For each stock in the sample, I obtain monthly prices, returns, and market capitalization data from CRSP and quarterly book value of common equity data from COMPUSTAT. I obtain the monthly time-series of the 3 Fama-French factors, the momentum factor, the NYSE size break-points, and the B/M break-points for each month from Ken French’s data library.13 B. Aggregate Preferences for Lottery-Type Stocks: Non-Parametric Tests To set the stage, I examine whether individual investors assign a greater weight to stocks with lottery-type features. First, I divide all stocks in the sample into sixteen categories using independent sorts along mean return, idiosyncratic volatility, skewness, and stock price dimensions. Stocks are assigned to the upper or the lower half along each of these four dimensions, and sixteen stock categories are obtained.14 The return moments are calculated using past 60 months of data and the idiosyncratic volatility measure is the variance of the 11Themainresultsfromthesurveyareavailableathttp://www.gc.cuny.edu/studies/key findings.htm. Ideally,Iwouldliketouseamoredisaggregatedata(e.g.,countyorzipcodeleveldata)onreligiousaffiliation for the 1991-96time-period. Unfortunately, to my knowledge, such a dataset is not publicly available. 12The county-level presidential voting data can be purchased from http://www.uselectionatlas.org/. 13KenFrench’sdatalibraryisavailableathttp://mba.tuck.dartmouth.edu/pages/faculty/ken.french/. 14Admittedly, this is a very coarse categorization but it results in a manageable and easy-to-interpret 16 stockcategoriesinsteadof81(or256)categorieswhenthree(orfour)divisionsareusedalongeachdimension. 8",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 49,
    "chunk_index": 14,
    "word_count": 408,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "the variance of the 11Themainresultsfromthesurveyareavailableathttp://www.gc.cuny.edu/studies/key findings.htm. Ideally,Iwouldliketouseamoredisaggregatedata(e.g.,countyorzipcodeleveldata)onreligiousaffiliation for the 1991-96time-period. Unfortunately, to my knowledge, such a dataset is not publicly available. 12The county-level presidential voting data can be purchased from http://www.uselectionatlas.org/. 13KenFrench’sdatalibraryisavailableathttp://mba.tuck.dartmouth.edu/pages/faculty/ken.french/. 14Admittedly, this is a very coarse categorization but it results in a manageable and easy-to-interpret 16 stockcategoriesinsteadof81(or256)categorieswhenthree(orfour)divisionsareusedalongeachdimension. 8",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 49,
    "chunk_index": 15,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "residual obtained by fitting a four-factor model to the monthly stock returns series over the past 60 months. Next, every month I compute the weight assigned to each of these sixteen stock categories in the aggregate individual investor portfolio. Finally, I obtain the sample-period averages of those stock category weights. The average stock category weights are presented in Table I. The results indicate that individual investors prefer stocks with higher volatility, higher skewness, and lower prices. They assign a weight of 8.33% to stocks which have higher volatility, higher skewness, lower price, and lower mean return. If they had randomly chosen stocks, the weight in this stock category would have been only 0.74%.15 In contrast, individual investors assign a consid- erably lower weight to stocks which have lower volatility, lower skewness, higher price, and highermeanreturn. Theweightintheaggregate individualinvestorportfolio is33.27% when the expected weight (according to the aggregate market portfolio) is 53.94%. The weight allocations in other stock categories are also consistent with individual investors’ revealed preferences for lottery-type stocks. Collectively, the evidence indicates that individual in- vestors have a strong preference for lottery-type stocks (i.e., stocks with lower mean returns, higher volatility, higher skewness, and lower price) and they exhibit an aversion for stocks with non-lottery features. Becauseof thesumming-up constraint, theaggregate institutionalpreferencesforlottery- type stocks should be opposite of individual investor preferences.16 To investigate whether this fundamental constraint holds, I examine the aggregate preferences of institutional in- vestors. Following the procedure described above, I measure the average weights assigned by institutions to the sixteen moment and price based stock categories defined above. These results are also reported in Table I.Two clear patterns emerge. First, the relativedistortions in the aggregate institutional portfolio are lower whichindicatethat institutionalpreferences across various stock categories are moreevenlydistributed. Second, as expected,institutions exhibit a preference (aversion) for stocks which individuals dislike (prefer). For instance, in the stock category which is most favored by individual investors (stocks with higher volatil- ity, higher skewness, lower price, and lower mean return), institutions allocate a lower than expected weight – the aggregate institutional allocation is 0.28% where the expected weight is 0.74%. In contrast, in the stock category which is least favored by individual investors (stocks with lower volatility, lower skewness, higher price, and lower mean returns), insti- tutions allocate a higher than expected weight – the aggregate institutional allocation is 57.79% where the expected weight is 53.94%. Overall, the pattern of institutional allocations indicate that the summing-up constraint holds approximately. This evidence provides a simple robustness check for the basic results 15Theexpected stockcategoryweightbenchmarkreflects theweightofthestockcategoryintheaggregate market portfoliowhere the market portfoliois obtained by combining allCRSP stocks. 16The institutional data represent the shares owned only by institutions in the Thomson Financial insti- tutional dataset which does not include institutional investors who hold less than 10,000 shares and under $200,000in dollarvalue. Additionally,the individualdata is not perfectly representative of the retail stock- holders in the U.S. Consequently, the summing-up constraints are expected to hold only approximately. 9",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 49,
    "chunk_index": 16,
    "word_count": 489,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "by institutions in the Thomson Financial insti- tutional dataset which does not include institutional investors who hold less than 10,000 shares and under $200,000in dollarvalue. Additionally,the individualdata is not perfectly representative of the retail stock- holders in the U.S. Consequently, the summing-up constraints are expected to hold only approximately. 9",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 49,
    "chunk_index": 17,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "on individual preferences. More importantly, the opposite institutional preferences suggest that the individual investor sample I examine is likely to approximate the behavior of retail stock-holders in the U.S. In other words, the reported results may not be specific to the sample of brokerage account investors but may generalize to the wider population of U.S. retail investors. C. Aggregate Preferences for Lottery-Type Stocks: Regression Tests The non-parametric test results provide initial evidence of gambling induced preferences of individual investors but the evidence does not reveal whether individual investors’ moment preferences are distinct from their known preferences (e.g., (Barber and Odean 2000), Ku- mar (2003)) for certain stock characteristics such as size, book-to-market (B/M), etc. To distinguish between investors’ preferences for stock characteristics and moment preferences and to examine their relative strengths, I estimate several cross-sectional regressions. In the regression specification, the excess weight assigned to a stock in the aggregate portfolio is the dependent variable and various stock characteristics and return moments are employed as independent variables. To measure the collective preference of a group of investors for a given stock, first, I combine the portfolios of all investors in the group and construct an aggregate group-level portfolio. Next, I construct the aggregate market portfolio by combiningall CRSP stocks. If investors in the group were to randomly select stocks, the weight of each stock in the group portfolio would be approximately equal to the weight of the stock in the aggregate market portfolio. However, a positive (negative) deviation from the expected weight would indicate that the group has a preference (aversion) for the given stock. I obtain the unexpected (or excess) portfolio weight allocated to stock i in month t using: w −w EW = ipt imt ×100. (1) ipt w imt Here, w is the actual weight assigned to stock i in group portfolio p in month t and w ipt imt is the weight of stock i in the aggregate market portfolio in month t. The EW measure ipt reflects the group-level preference for stock i in month t. In the first regression specification, I use mean return, idiosyncratic volatility, skewness, kurtosis, and stock price as independent variables. As before, these measures are obtained using the monthlystock returns seriesoverthepast 60 months. The estimationis carriedout using a panel regression specification with month fixed effects and the independent variables have been standardized so that the coefficient estimates can be directly compared.17 17Toensurethatmyresultsarerobusttoconcernsaboutmulti-collinearity,Icomputethevarianceinflation factor (VIF) for each of the independent variables. VIF measures the degree to which an explanatory variable can be explained by other explanatory variables in a regression model. For explanatory variable 10",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 49,
    "chunk_index": 18,
    "word_count": 434,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "effects and the independent variables have been standardized so that the coefficient estimates can be directly compared.17 17Toensurethatmyresultsarerobusttoconcernsaboutmulti-collinearity,Icomputethevarianceinflation factor (VIF) for each of the independent variables. VIF measures the degree to which an explanatory variable can be explained by other explanatory variables in a regression model. For explanatory variable 10",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 49,
    "chunk_index": 19,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "The regression estimates are presented in Table II (Column 1). Consistent with the findings from non-parametric tests, I find that individual investors assign a larger weight to stocks which have higher idiosyncratic volatility, higher skewness, and lower prices, even if these stocks have lower mean returns. For instance, a one standard deviation increase in the idiosyncratic volatility of a stock results in a 1.234% increase in its weight in the aggregate individual investor portfolio. Individual investors also exhibit a strong aversion to kurtosis, i.e., they dislikestocks with “fat tails.” This finding, in conjuction with individual investors’ preference for stocks with higher idiosyncratic volatility and positive skewness, suggest that individual investors are able to discriminate between upward and downward idiosyncratic volatility, where they dislike the latter. In the second regression specification, I introduce the following control variables: (i) market beta, which is estimated using past 60 months of data, (ii) firm size, (iii) book-to- market ratio, (iv) short-term momentum (past one-month stock return), (v) longer-term momentum (past twelve-month stock return), and (vi) an S&P500 dummy. The estimation results (see Column 3) indicate that the coefficient estimates of mean return, volatility, skewness, and stock price are significant even in the presence of these control variables. Furthermore, the coefficient estimates of control variables have the expected signs. For instance, the coefficient estimate of Firm Size is strongly negative which indicates that, on average, individual investors exhibit a preference for small-cap stocks. Additionally, a positive coefficient of the S&P500 Dummy indicates that investors exhibit a preference for relatively more visible firms which are part of the S&P500 index. Overall, the regression estimates indicate that individual investors prefer both volatility and skewness while they exhibit an aversion for stocks with higher prices and higher kurtosis.18 As a robustness check, I compare aggregate individual preferences with aggregate in- stitutional preferences. The panel regression estimates (with quarter fixed effects) for the aggregate institutional portfolio are also presented in Table II (Column 4). As expected, I find that the two investor groups exhibit almost diagonally opposite preferences. Unlike in- dividual investors, institutions prefer stocks with higher mean returns, lower variance, lower skewness,and higher stockprices. Additionally,institutionspreferstocks withhighermarket capitalization and higher market beta. Many of these results on institutional preferences are consistent with the findings of Gompers and Metrick(2001) and Friederand Subrahmanyam (2005). However, the evidence on aggregate skewness aversion of institutions is new and has not been documented before. i, VIF i = 1/(1 − R2 i ) where R2 i is the R2 in the regression where explanatory variable i is used as a dependent variable and other explanatory variables are used as independent variables. As a rule of thumb, multi-collinearityis not of concern as long as VIF < 2. See Gujarati (2003, p. 351) for details. I find that the VIF is less than two for allindependent variables,which suggests that multi-collinearityis not a major concern. 18A considerable number of investors (about 27%) are located in California. The strong preference of Californians for technology stocks may bias my results. To guard against this possibility, I re-estimate the cross-sectional regression after excluding investors who reside in California. The sub-sample coefficient estimates (availableupon request) are very similarto the full-sampleresults. 11",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 49,
    "chunk_index": 20,
    "word_count": 530,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "number of investors (about 27%) are located in California. The strong preference of Californians for technology stocks may bias my results. To guard against this possibility, I re-estimate the cross-sectional regression after excluding investors who reside in California. The sub-sample coefficient estimates (availableupon request) are very similarto the full-sampleresults. 11",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 49,
    "chunk_index": 21,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "II. Do Attitudes Toward Gambling Influence Stock Investment Decisions? The panel regression estimates in the previous section reveal that collectively individual investors prefer lottery-type stocks. But how do their preferences vary cross-sectionally? As discussed earlier, lottery studies have documented that the heaviest lottery players are poor, young, and uneducated single men who livein urban, Republican dominated areas and belong to certain specific minority(African-Americanand Hispanic) and religious (Catholic) groups. Do investorswith these characteristicsalso tilt theirportfolios more strongly toward lottery-type stocks? A. Preferences of the Poor and the Wealthy Wealth (and income) has been identifiedas one of the strongest determinants of lottery pur- chases. According to the “desperation” hypothesis of gambling (e.g., Friedman and Savage (1948), Brenner and Brenner (1990), Blalock, Just, and Simon (2004)), people often buy lotteries to cope with financial stress where the proportional lottery expenditure increases as wealth/income decreases. People who are unable to reach their aspiration levels may resort to gambling when hope from other sources has dried out.19 Lotteries provide a glimmer of hope to those people when all other avenues are closed. The following quote from a lottery player in Chicago’s West Side accurately sums up this sentiment (Brodt (1986)): I have dug so many holes for myself over the years that realistically, winning the lottery may be my only ticket out. If lottery purchases are driven by a deep desire to escape poverty, such preferences are likely to spillover to the investment arena. Consequently, poor investors are more likely to tilt their portfolios toward lottery-type stocks. To identify differences in preferences of poor and rich investors for lottery-type stocks, I sort investors according to their wealth levels and construct three group-level portfolios. To construct portfolio 1 (portfolio of thepoor), Icombinethe portfolios of allinvestorsinwealth deciles 1-3. Portfolios 2 and 3 (portfolio of the rich) are constructed in an analogous manner by combining portfolios of investors in wealth deciles 4-7 and 8-10, respectively. Investors in the “poor” category have total net worth of $75,000 or below while investors in the “rich” category have total net worth of $200,000 and above.20 19A similar explanation has been put forth to explain criminal behavior. People who have no option to get out of the poverty trap may feel frustrated and ultimately resort to criminal activities. Crime is also like a gamble which has a small positive probability of a large gain but a moderate to high probability of a significant loss. There is evidence (e.g.,McCorkle (2004))that people who are addicted to gamblingexhibit a greater propensity to engage in criminal activities. 20My results are not sensitive to the cutoffs employed to define “poor” and “rich” wealth categories. In fact, the results are stronger when Iemploystricter wealthcutoffs (e.g.,using wealthdeciles) foridentifying “poor”and “rich”categories. Additionally,even thoughwealth andincome are notperfectly correlated, the results are very similarwhen I consider income sorted investor categories. 12",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 49,
    "chunk_index": 22,
    "word_count": 469,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "criminal activities. 20My results are not sensitive to the cutoffs employed to define “poor” and “rich” wealth categories. In fact, the results are stronger when Iemploystricter wealthcutoffs (e.g.,using wealthdeciles) foridentifying “poor”and “rich”categories. Additionally,even thoughwealth andincome are notperfectly correlated, the results are very similarwhen I consider income sorted investor categories. 12",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 49,
    "chunk_index": 23,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Following the procedure described in Section I.B, I examine whether poor individual investors assign a greater weight (relativeto rich individualinvestors) to stocks with lottery- type features. The results are presented in Table III. Consistent with the desperation hy- pothesis of gambling, I find that poor individual investors exhibit stronger preference for lottery-type stocks. For instance, poor (rich) investors assign a 8.33% (7.69%) weight to stocks which have higher volatility, higher skewness, lower price, and lower mean return. The weight difference of 0.98% is statistically significant (p-value < 0.01). The differences in the preferences of poor and rich individual investors are not as distinct as the preference differentials between individual and institutional investors (see Table I). Nonetheless, these weight comparisons reveal that poor investor portfolios are tilted more toward lottery-type stocks. To better understand the poor-rich preference differentials, I follow the panel regression procedure described in Section I.C and estimatefour cross-sectional regressions, one for each of the three wealth sorted portfolios (poor, others, rich), and a fourth regression for the poor-rich portfolio differential. The differences in the preferences of poor and rich investors are likelyto revealthemselves more clearly in these conditional models where several control variables are employed. Table IV reports the regression estimates. Consistent with the non-parametric test re- sults, I find that poor investors exhibit a significantly stronger preference (relative to rich investors)forstockswhichhavelowermeanreturns,higheridiosyncraticvolatility,andhigher skewness. The preference differential along idiosyncratic volatility dimension appears to be strongest – a one standard deviation increase in a stock’s idiosyncraticvolatilitycorresponds to a 1.275% higher increase in the weight assigned to the stock by poor investors. The dif- ference in preferences along the stock price dimension is also significant but the magnitude of this differential is small. Additionally, I find that the kurtosis preference differential is significant which indicatesthat poor investorsexhibita stronger aversionto kurtosis. Lastly, coefficientestimates of control variables revealthat poor investorsprefer lower capitalization stocks and also stocks which are in the S&P500 index. Collectively,the regression estimates indicate that poor investors invest disproportionately more than rich investors in stocks which have lottery-type features. B. Age and Gambling Motivated Stock Investments Lottery studies havealso shown that attractiveness of gambling decreases with age. Younger and middle-aged people are more likely to participate in lotteries and they are also more likely to spend a greater proportion of their income on lotteries. The relation between age and gambling may reflect the composite effect of risk aversion, wealth, and aspiration levels. Younger people are likely to have lower risk aversion, lower wealth levels, and they are also 13",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 49,
    "chunk_index": 24,
    "word_count": 418,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "they are also more likely to spend a greater proportion of their income on lotteries. The relation between age and gambling may reflect the composite effect of risk aversion, wealth, and aspiration levels. Younger people are likely to have lower risk aversion, lower wealth levels, and they are also 13",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 49,
    "chunk_index": 25,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "likely to have higher aspiration levels.21 In contrast, older people are likely to be more risk averse, theyare likelyto haveaccumulated greater wealth, and they may have adjusted their aspirations to their current levels. Consequently, older investors are less likely to gamble. Does age play a similar role in shaping investors’ preferences for lottery-type stocks? Toexaminewhetherageinfluencesindividualinvestors’preferencesforlottery-typestocks, Ifollowthepanelregressionestimationproceduredescribedearlier(seeSectionsI.CandII.A) and estimate cross-sectional regressions for age and wealth sorted investor groups. In the first set, I consider three age sorted portfolios for younger (age below 40), middle-aged (age between 40 and 65), and older (age above 65) investors, and a fourth regression for the younger-older differential.22 In the second set, I consider age based portfolios within the poor investor category. The regression estimates are reported in Table V, Panel A. For brevity, I only report the coefficient estimates of Mean Return, Idiosyncratic Volatility, Skewness, Kurtosis, and Stock Price variables. Consistent with the results from lottery studies, I find that younger and middle-aged investors exhibit stronger preference for stocks with lottery-type features. The Idiosyncratic Volatility coefficient estimate decreases with age and the Skewness coefficient estimates of younger and middle-aged groups are higher than that of the older investor group. When I examine the preferences across age groups after conditioning on wealth, the preferences of younger and middle-aged investors stand out more distinctly. I find that, within the group of poor investors, middle-aged investors exhibit the strongest preference for lottery-type stocks. Collectively,my findings on the relation between age and investment in lottery-type stocks are similar to the results documented in lottery studies. C. Gender, Marital Status, and Gambling Motivated Stock Investments Lotterystudiesportray singlemenas heavygamblers. Severalfactorsare likelyto exacerbate gambling behavior in men. Men are likely to be less risk averse, they are likely to be more over-confident (e.g., Barber and Odean (2001)), and single men are likely to exhibit these attitudes more strongly. To examine whether gender and marital status influence investors’ investment behavior, I follow the panel regression estimation procedure described earlier (see Sections I.C and II.A) and I estimate cross-sectional regressions corresponding to the aggregate portfolios of men, women, and men-women differential. The regression estimates are reported in Table V, Panel B. Consistent with the findings from lottery studies, I find that men exhibit a stronger preference (relative to women) for lottery-type stocks. Additionally, investors who are single prefer lottery-stocks more than married investors. And single men exhibit a significantly stronger preference for lottery- 21In my sample, wealth increases with age. For instance, investors who are younger than 35 years have a mean net worth of $168,500while investors who are 65 years or older have a mean net worth of $350,000. 22My results are not sensitive to the cutoffs employed to define the three age categories. 14",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 49,
    "chunk_index": 26,
    "word_count": 452,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "wealth increases with age. For instance, investors who are younger than 35 years have a mean net worth of $168,500while investors who are 65 years or older have a mean net worth of $350,000. 22My results are not sensitive to the cutoffs employed to define the three age categories. 14",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 49,
    "chunk_index": 27,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "type stocks than single women. In fact, single women do not exhibit preference for stocks with positively skewed returns. Collectively,again, these findings are similar to the relation between gender, marital status, and gambling attitudes documented in lottery studies and surveys. D. Religion, Race, Ethnicity, Political Affiliation, and Preference for Lottery-Type Stocks Prior evidence from lottery studies indicate that racial, ethnic, religious, and political iden- tities of individuals jointly determine their attitudes toward gambling. For instance, Protes- tants (especially the Baptist denomination) and Mormons are more likely to be opposed to gambling than Catholics and Jews (e.g., Grichting (1986), Clotfelter and Cook (1989)). Among Protestants who attend church regularly, 80% believe gambling is wrong and 95% of Protestant clergy believe gambling is immoral (Clotfelter and Cook (1989)).23 Taken to- gether, theextant evidenceindicatesthat religiousbeliefsinfluencepeople’sattitudes toward gambling. The link between race, ethnicity, and gambling behavior has also been well-established (e.g.,Herringand Bledsoe(1994), Priceand Novak(1999), Clotfelterand Cook (1989, Chap- ter 6)). African-Americans and Hispanics are more likely to gamble and they are also more likely to be compulsive gamblers. Lastly, political affiliation is likely to influence attitudes toward gambling because the political affiliation of a person is likely to influence his or her ideology (i.e., conservative, liberal, or moderate) and the ideological tilt may influence gam- bling behavior.24 Collectively, racial/ethnic, religious, and political identities of an investor are likely to capture elements of her risk aversion, education level, structure of the social network, ideological preferences,beliefs about morality of gambling, and socio-economic sta- tus. In light of these findings, it is quite conceivable that racial, ethnic, religious, and po- litical identities of investors would influence their stock investment decisions, particularly their decisions to invest in lottery-type stocks. To examine the influence of race, ethnicity, religion, and political affiliation on investors’ investment choices, I estimate several cross- sectional regressions following the panel regression estimation procedure described earlier (see Sections I.C and II.A). First, I examine the influence of race and ethnicity. The results are reported in Table V, Panel C. I find that investors who are located in zipcodes with higher concentration of African Americans and Hispanics exhibit stronger preference for lottery-type stocks. Furthermore, when I condition on wealth and examine racial and ethnic 23ThedatesofadoptionofstatelotterieswithintheU.S.seemtohavebeeninfluencedbypeople’sreligious beliefs – states which were early adopters oflotteries had a large Catholic populationwhile states who were opposed to lotteries until 1988 had a disproportionately higher populationof Baptists (Clotfelter and Cook (1989,pp.147-148)). The states whichwere early adopters hada33%average Catholicpopulationandonly 2% Baptists while late adopters, on average, consisted of 11%Catholics and 19% Baptists. 24According to the results from a recent Pew survey (Doherty (2004)), there is a strong relation between politicalaffiliationand liberal versus conservative ideology. 15",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 49,
    "chunk_index": 28,
    "word_count": 442,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "higher populationof Baptists (Clotfelter and Cook (1989,pp.147-148)). The states whichwere early adopters hada33%average Catholicpopulationandonly 2% Baptists while late adopters, on average, consisted of 11%Catholics and 19% Baptists. 24According to the results from a recent Pew survey (Doherty (2004)), there is a strong relation between politicalaffiliationand liberal versus conservative ideology. 15",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 49,
    "chunk_index": 29,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "differenceswithinthe lowestwealth category (i.e.,poor investors),thepreferenceof investors for lottery-type stocks are strongest in African-American dominated regions. Collectively, the evidence indicates that African-Americans are likely to tilt their portfolios most heavily toward lottery-type stocks, followed closely by Hispanics and Whites. Focusing attention on religious differences, I find that investors who live in states with a greater than average proportion of Protestants (e.g., Minnesota) exhibit weaker preference for lottery-typestocks (see Table V,Panel D). In contrast, investorswho livein states with a greaterthanaverageproportion ofCatholics(e.g.,Massachusetts)exhibitstronger preference for lottery-type stocks. Additionally, investors who live in regions with relatively heavier concentration of people without any religiousaffiliation (e.g.,the state of Washington) invest relatively more in stocks with lottery-type features. Overall, the evidence indicates that religion plays a considerable role in shaping investors’ attitudes toward gambling in the stock market. Lastly, I examine whether political affiliation influences gambling behavior in the stock market. When I comparethe preferencesof investorswho resideincounties withDemocratic tilt and those who reside in counties with Republican tilt, the differences are ambiguous 25 (see Table V, Panel E). Republicans exhibit preference for stocks with higher idiosyncratic volatilitywhiletheirskewnesspreferencesarenotsignificantlydifferentfromDemocrats. The preferencedifferences along mean return and stock price dimensions are also only marginally significant. However,when I conditionon wealth,the preferencedifferencesbecome moreev- ident. I find that within the group of poor investors, Republicans exhibitstronger preference (relative to Democrats) for lottery-type stocks. These preference differences are consider- ably weaker within the group of rich investors. Collectively,the evidence indicates that poor investors who reside in regions dominated by Republicans exhibit stronger preference for stocks with lottery-type features. E. Does Location Influence Gambling Attitudes? The location of an individual may influence gambling behavior for several reasons. For instance, a person who lives in an urban area is likely to encounter gambling opportunities more often. Such repeated exposures to gambling opportunities could make her relatively less sensitive to risk (Shiller (2000, pp. 40-42)). Additionally, urban individuals may have higher aspiration levelsdue to more frequentexposures to affluent people. As a result, urban investors may exhibit relatively stronger gambling tendencies. To examine whether investors located in urban areas are likely to tilt their portfolios more strongly toward lottery-type stocks, I identify rural and urban investors. I classify 25If an investor resides in a county which voted Democrat by a margin oftwo to one during the 1992and 1996presidentialelections, Iassume thatthe investorlivesinaregiondominatedbyDemocrats. Republican regions are identified in an analogous manner. 16",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 49,
    "chunk_index": 30,
    "word_count": 390,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "likely to tilt their portfolios more strongly toward lottery-type stocks, I identify rural and urban investors. I classify 25If an investor resides in a county which voted Democrat by a margin oftwo to one during the 1992and 1996presidentialelections, Iassume thatthe investorlivesinaregiondominatedbyDemocrats. Republican regions are identified in an analogous manner. 16",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 49,
    "chunk_index": 31,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "an investor as an urban investor if she resides within 50 miles of one of the largest twenty metropolitan areas in the U.S. Rural investors are those who reside at least 100 miles away from the center of these twenty metropolitan areas. The remaining investors are classified as suburban investors.26 Following the panel regression estimation procedure described ear- lier (see Sections I.C and II.A), I estimate cross-sectional regressions for rural and urban investors. Table V, Panel F reports the panel regression estimates. I find that rural investors exhibitstronger preferencefor idiosyncraticvolatilitywhileurban investorsexhibitrelatively stronger preference for skewness. Furthermore, along the price dimension, rural investors exhibitmarginallystrongerpreferenceforlower-pricedstocks. Overall,intheseunconditional tests, the preference differences between rural and urban investors are unclear. When I examine the differences in preferences of rural and urban investors after conditioning on wealth, a much clearer picture emerges. I find that relative to poor rural investors, poor urban investors exhibit a significantly stronger preference for lottery-type stocks. However, within the group of rich investors, the differences between rural and urban investors are still ambiguous – rich rural investors exhibit stronger preference for idiosyncratic volatility while rich urban investors exhibit relatively stronger preference for skewness. Collectively, these results indicate that poor urban investors exhibit stronger preference for stocks with lottery-type features. Collectively,theresultsfromstock-levelcross-sectionalregressionsindicatethatinvestors’ preference for lottery-type stocks are influenced by approximately the same set of socio- economic and psychological factors which induce greater lottery participation rates and greater lottery purchases. Overall, people’s gambling attitudes revealed in lottery markets appear to spillover into the stock market. III. A Composite Profile of Stock Market Gamblers For greater accuracy, I rotate the point-of-view from the cross-section of securities to the cross-sectionofinvestors. Thisalternativeperspectiveprovidesrobustnesstomymainresults but more importantly, it allows me to examine whether the univariate and bivariate test results survive in multivariate settings. Additionally, a multivariate approach allows me to examine the relative strengths of the determinants of stock market gambling behavior identified in the previous section. 26For robustness, I checked my results with other distance cutoffs (75 miles, 100 miles) for defining rural and urban investors. My results are robust to these alternative definitions of rural and urban regions. 17",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 49,
    "chunk_index": 32,
    "word_count": 352,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "the relative strengths of the determinants of stock market gambling behavior identified in the previous section. 26For robustness, I checked my results with other distance cutoffs (75 miles, 100 miles) for defining rural and urban investors. My results are robust to these alternative definitions of rural and urban regions. 17",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 49,
    "chunk_index": 33,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "A. Measuring Excess Investment in Lottery-Type Stocks To generate a composite profile of stock market gamblers, I explicitly define lottery-type stocks where I consider three stock characteristics: idiosyncratic volatility, skewness, and stock price. Motivated by the findings in Section I.B, I assume that stocks in the lowest kth stock price percentile and the highest kth idiosyncratic volatility and skewness percentiles are likely to be perceived as lottery-type stocks. For robustness, I consider two values of k, k = 33 and k = 50. When k = 33, 1,840 stocks are identified as lottery-type stocks and when k = 50, thereare3,294 lottery-typestocks inthesample.27 During the1991-96 sample- period,atypicallottery-typestockhadamarketcapitalizationof$22 million,apriceof$2.25, a B/M of 0.253, and an institutional ownership of 4.35%.28 Furthermore, lottery-type stocks are concentrated heavily in energy, mining, bio-technology, and technology sectors. I measure the excess weight assigned to lottery-type stocks by investor i in month t as: wact −wexp ewls = it it . (2) it wexp it Here, wact is the actual weight assigned to lottery-type stocks by investor i in month t. wexp it it is the weight of lottery-type stocks in the aggregate market portfolio. The sample-period mean of monthly (i.e., ewls ) provides a measure of an investor’s preference for lottery-type i stocks. B. Multivariate Regression Tests To further investigate the nature of individual investors’ preferences for lottery-type stocks and to estimate the relative strengths of the various determinants of these preferences, I estimate a regression model where the dependent variable is the sample-period mean excess weight of an investor (i.e., ewls ) in lottery-type stocks. Several variables which characterize i household demographics and portfolio characteristicsare employedas independent variables. In particular, Wealth is the total net worth, Income is the total annual household income, and Age is the age of the head of the household. The Retired dummyis set to one if the head of thehousehold isretired,theMale Dummyissetto oneifthehead ofthehousehold ismale, the Married Dummy is set to one if the head of the household is married, and the Urban Dummy is set to one if the household is located in one of the largest twenty metropolitan areas in the U.S. To examine the relation between over-confidence and investment in lottery-type stocks, I consider an Overconfidence Dummy which is set to one for investors who belong to the 27The reported results are for k =33but the results are very similarwhen I choose k=50. These results are availableupon request. 28Themedianvaluesareverysimilartothereported means: themedianmarketcapitalization,stockprice, B/M, and institutional ownership was $20 million,$2.02,0.509,and 3.80%,respectively. 18",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 49,
    "chunk_index": 34,
    "word_count": 412,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "lottery-type stocks, I consider an Overconfidence Dummy which is set to one for investors who belong to the 27The reported results are for k =33but the results are very similarwhen I choose k=50. These results are availableupon request. 28Themedianvaluesareverysimilartothereported means: themedianmarketcapitalization,stockprice, B/M, and institutional ownership was $20 million,$2.02,0.509,and 3.80%,respectively. 18",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 49,
    "chunk_index": 35,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "highest portfolio turnover quintileand the lowest risk-adjusted performance quintile. Casual observationsuggeststhatpeopledonotfindalltypesofgamblingactivitiesequallyattractive. Hunter (1990) finds that games which attract most serious gamblers and those which are most addictive contain a fair mix of chance and skill. Games which contain a small element of skill allow people to modify the final outcome of the gamble. This may give them an illusion of control (Langer (1975)) where they may think they can alter the outcome more than what is actually possible.29 The stock market, with a fair mix of chance and skill, is likely to be perceived as an attractive setting for gambling. Particularly, people who are over-confident may have a stronger belief that they can out-perform the market and they are likely to exhibit stronger preference for lottery-type stocks. To capture investors’ portfolio and trading characteristics, I include the Mutual Fund Holdings variable which measures the proportion of investor’s financial portfolio that is allocated to mutual funds. I also consider an Option Dummy which is set to one if an investor made at least one trade in an option during the sample-period. Additionally, I consider a number of portfolio characteristics as control variables. This includes the factor exposures of the household portfolio, portfolio’s concentration in NASDAQ stocks and 48 Fama-French industries (Fama and French (1997)), portfolio size, and monthly portfolio turnover. For brevity, the coefficient estimates of these control variables are suppressed.30 To examine the influence of race/ethnicity, religion, and political influence, I include the African American-White Ratio(Hispanic-White Ratio)variablewhichistheratio of thepop- ulation of African-Americans (Hispanics) and Whites in an investor’s zipcode. The Catholic Dummy (Protestant Dummy) is set to one if the proportion of Catholics (Protestants) in the state of investor’s residence is greater than the mean state-level proportion of Catholics (Protestants) in the U.S. Lastly, Democratic-Republican Ratio is the mean ratio of the num- ber of Democratic and Republican votes in an investor’s county during the 1992 and 1996 presidential elections. Table VI reports the cross-sectional regression estimates. Consistent with the univariate and bivariate results (see Tables IV and V), I find that younger, poor, and single men invest disproportionately more in lottery-type stocks. Additionally, investors who reside in rural and Republican dominated areas and belong to one of the minority groups (African- American or Hispanic) exhibit stronger preference for lottery-type stocks. I also find that investorswho livein states with greater concentration of Catholics (Protestants) investmore (less) in lottery-typestocks. Finally,I find that investmentsin lottery-type stocks are higher 29Some games do not actually allow people to change the odds of the final payoffs but rather they just provide a false illusionthat the outcome can be modified. For instance, when people actually pick numbers in “pick three” games, they feel that they can exert an influence on the final outcome even though the lottery is purely a game of chance. Additionally,not all numbers are perceived to have an equal chance of winning. For instance, in Maryland’s three-digit daily game, numbers such as 333 and 777 are almost 40 times more popular than numbers such as 092 and 086 (Clotfelter and Cook (1989)). Also, see Thaler and Ziemba (1988). 30These estimated coefficients are availableupon request. 19",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 49,
    "chunk_index": 36,
    "word_count": 522,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "to have an equal chance of winning. For instance, in Maryland’s three-digit daily game, numbers such as 333 and 777 are almost 40 times more popular than numbers such as 092 and 086 (Clotfelter and Cook (1989)). Also, see Thaler and Ziemba (1988). 30These estimated coefficients are availableupon request. 19",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 49,
    "chunk_index": 37,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "for investorswho havetraded options. Overall,the univariateand bivariateresults presented earlier survive in a multivariate setting. The cross-sectional regression estimates also provide two new results. First, I find that investors who hold larger mutual fund portfolios invest more in lottery-type stocks. This suggests that investors hold a layered portfolio where the lottery-type investments represent the “upside-potential” layer while the relatively less risky mutual fund portfolio represents the “security” layer. These results are consistent with the theoretical predictions of Fried- man and Savage (1948) and the behavioral portfolio theory of Shefrin and Statman (2000). Second, I find that investors who are more over-confident (according to my measure) invest disproportionately more in lottery-type stocks.31 This evidence indicates that behavioral biases are likely to exacerbate investors’ preferences for lottery-type stocks. Comparing the coefficient estimates of the independent variables, I find that investor over-confidence and wealth are the two strongest determinant of investments in lottery- type stocks. 32 An over-confident person invests 23.334% more (relative to the expected investment) in lottery-type stocks. In contrast, an investor whose wealth increases by one standard deviation reduces investments in lottery-type stocks by 22.858%. Age influences gambling behavior in a significant manner too – a one standard deviation increase in age results in 10.361% reduction in investments in lottery-type stocks. Additionally, I find that gender, race/ethnicity, religion, size of mutual fund holdings, and experience with option trading have moderate marginal influence on investors’ holdings in lottery-type stocks. And maritalstatus, politicalaffiliation,and locationvariableshavetheweakestmarginalinfluence on investors’ holdings in lottery-type stocks. C. Macro-Economic Conditions and Trading in Lottery-Type Stocks To further understand why certain subsets of individual investors exhibit preference for lottery-type stocks, I focus on investors’ trading activities. The trading activities are likely to provide additional insights into the motivation of people who invest disproportionately more in lottery-type stocks. Specifically, I examine whether investors exhibit a greater preference for lottery-type stocks during bad economic times. Lottery studies suggest that when economic opportunities are not very bright, people find the tiny probability of a large gain more attractive and consequently, they exhibit stronger preference for lotteries (Mike- sell (1994)). For instance, during the Great Depression of the 1930s, the popularity of 31I also experimented with a few other explanatory variables such as the disposition effect (i.e.,investor’s greater reluctance torealizelosses), professionaloccupationdummywhichisset tooneifaninvestorbelongs toaprofessionaloccupationcategory,marginaccountdummywhichissettooneifaninvestorholdsamargin account, local bias (i.e., investor’s propensity to invest disproportionately more in local stocks), etc. The coefficient estimates forallthese variablesarestatisticallyinsignificantandmoreimportantly,the coefficient estimates for other variables remain virtually unchanged. 32The independent variables have been standardized so that the coefficient estimates can be directly compared. 20",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 49,
    "chunk_index": 38,
    "word_count": 421,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "(i.e.,investor’s greater reluctance torealizelosses), professionaloccupationdummywhichisset tooneifaninvestorbelongs toaprofessionaloccupationcategory,marginaccountdummywhichissettooneifaninvestorholdsamargin account, local bias (i.e., investor’s propensity to invest disproportionately more in local stocks), etc. The coefficient estimates forallthese variablesarestatisticallyinsignificantandmoreimportantly,the coefficient estimates for other variables remain virtually unchanged. 32The independent variables have been standardized so that the coefficient estimates can be directly compared. 20",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 49,
    "chunk_index": 39,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "lottery-playing and gambling increased dramatically (Brenner and Brenner (1990, pp. 83- 89)). Given a close match between the socio-economic and psychological characteristics of regular lottery-players and stock market lottery-players, it is likely that they respond to variations in economic conditions in a similar fashion. My sample-period covers the period from January 1991 to November 1996. Around the beginning of the sample-period, the 1990 depression was coming to an end and the economy was starting to expand.33 During the sample-period, the economy and the stock marketgrew inapersistentmanner. Nevertheless,therewas considerablevariation inmacro- economic conditions during this time period. For instance, the national unemployment rate (or UNEMP) varied in the range of 5.10-7.80%, the monthly risk premium (or RP, measured as the difference between the yields of Moody’s BAA-rated corporate bond and AAA-rated corporate bond) varied between 1.13% and 2.12%, and the term spread (or TS, measured as thedifferencebetweentheyieldofaconstant-maturity10-yearTreasurybondandtheyieldof a 3-month Treasury bill) varied between −0.95% and 4.20%. This suggests that if investors’ propensity to invest in lottery-type stocks is influenced by macro-economic conditions, it is likelytoexhibitadetectablevariationevenduringtherelativelyshortsix-yearsample-period. In addition to their sensitivity to macro-economic variables, investors may also be sensi- tive to changes in the expected future cash-flows of lottery-type stocks.34 I use revisions in analysts’ forecasts of future earnings as proxy for changes in investors’ expectations about future cash-flows. Additionally, given their known sensitivity to past returns (e.g., Odean (1999), Dhar and Kumar (2001), Barber and Odean (2005)), investorsmayrespond to recent marketor stock returns. Withthis motivation, I estimatethe following time-seriesregression model to examine the influence of broad economic condition on investors’ propensity to buy lottery-type stocks: EBSI = b + b UNEMP +b UEI +b MP +b RP +b TS t 0 1 t−1 2 t−1 3 t−1 4 t−1 5 t−1 + b EFC +b EFC 6 t−1 7 t + b MKTRET +b MKTRET +b LOTRET +b LOTRET 8 t−1 9 t 10 t−1 11 t + b EBSI +(cid:1) . (3) 12 t−1 t In the regression specification, I use the EBSI variable to measure the excess (relative to non-lottery stocks) change in the sentiment of investors in a given month (i.e., differential sentiment shift). EBSI is defined as, EBSI = LBSI − OBSI , where LBSI is the t t t t buy-sell imbalance (BSI) of lottery stocks in month t and OBSI is the buy-sell imbalance t of other remaining stocks in month t.35 Additionally, UEI is the unexpected inflation in t 33According to the NBER, the 1990 recession spanned from July 1990 to March 1991. 34If trading in lottery-type stocks is motivated by gambling tendencies, investors may not pay much attention to the fundamentals. Nevertheless, to choose a subset of stocks from the larger set of lottery-type stocks, they may consider the fundamentals. (cid:1) 35The BSI for portfolio p in month t is defined as, BSI pt = N 10 p 0 t N i= p 1 tBSI it where the BSI for stock i 21",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 49,
    "chunk_index": 40,
    "word_count": 489,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "choose a subset of stocks from the larger set of lottery-type stocks, they may consider the fundamentals. (cid:1) 35The BSI for portfolio p in month t is defined as, BSI pt = N 10 p 0 t N i= p 1 tBSI it where the BSI for stock i 21",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 49,
    "chunk_index": 41,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "month t where the average of twelvemost recentinflation realizations is used to estimate the expected levelof inflation, MP is the monthly growth in industrial production, EFC is the t t mean change in analysts’ earnings forecasts of lottery-type stocks in month t, MKTRET t is the monthly market return, and LOTRET is the mean monthly return on lottery-type t stocks.36 Lastly, the one-month lagged EBSI variable is used as an explanatory variable which controls for potential auto-correlation in sentiment shifts. TheestimationresultsarepresentedinTableVII.37Ifindthathigherunemploymentrates are associated with positive shifts in differential investor sentiment for lottery-type stocks (coefficient estimate = 1.841, t-stat = 2.008). Put differently, investors buy relatively more (or sell relatively less) lottery-type stocks when macro-economic conditions, as measured by the unemployment rate, are perceived to be poor. This evidence indicates that investors’ propensity to buy lottery-type stocks increases during bad economic times. Consistent with this interpretation, I find that differential sentiment shifts are higher when the equity risk premium is higher to compensate for the poor state of the economy (coefficient estimate = 1.139, t-stat = 3.478). The other macro-economic variables I consider are not significantly associated with investors’ differential sentiment shifts. Two additional conclusionscan be drawn fromthe time-seriesregression estimates. First, the EFC variable which proxies for investors’changing expectations about future cash-flows has insignificant coefficient estimates. This indicates that trading in lottery-type stocks are less likely to be driven by expectations about stock fundamentals. Secondly, I find that differential sentiment shifts are positively associated with contemporaneous returns on lottery-type stocks (coefficient estimate = 3.766, t-stat = 4.043). This suggests that either investors engage in very short-term return-chasing activities or their differential sentiment shifts influence the returns of lottery-type stocks. I examine the sentiment-return relation further in the next section. Collectively, the time-series regression results indicate that investorsexhibitsimilartendenciesin their lotterypurchasing and lottery-typestock trading activities– both propensities increasewhen economic conditions are relativelyless favorable. D. Differential Sentiment Shifts and Stock Returns Ifthetrading behaviorof investorswho exhibita preferencefor lottery-typestocks contains a systematic component (i.e.,if their trades aggregate and do not cancelout), it may influence (cid:1) (cid:1) in month t is defined as BSI it = [ D j= t 1 (VB ijt −VS ijt]/[( D j= t 1 (VB ijt+VS ijt)]. Here, D t is the number of days in month t, VB ijt is the buy volume (measured in dollars) for stock i on day j in month t, VS ijt is the sell volume (measured in dollars) for stock i on day j in month t, and N pt is the number of stocks in portfoliop formed in month t. See Kumar and Lee (2004) for further details. 36My choice of macro-economic variables follows Chen, Roll, and Ross (1986) and Ferson and Schadt (1996). 37Ialsoexperimented withotherregression specifications withcontemporaneousvaluesofmacro-economic variables, lagged unemployment rates measured over a quarter, and innovations in unemployment rates. These results (availableupon request) are qualitativelysimilarto those reported in the paper. 22",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 49,
    "chunk_index": 42,
    "word_count": 479,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Lee (2004) for further details. 36My choice of macro-economic variables follows Chen, Roll, and Ross (1986) and Ferson and Schadt (1996). 37Ialsoexperimented withotherregression specifications withcontemporaneousvaluesofmacro-economic variables, lagged unemployment rates measured over a quarter, and innovations in unemployment rates. These results (availableupon request) are qualitativelysimilarto those reported in the paper. 22",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 49,
    "chunk_index": 43,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "stock returns, especially if arbitrage costs are high. Higher idiosyncratic volatility is one of the defining characteristics of lottery-type stocks and because idiosyncratic volatility has been used as an arbitrage cost proxy for (e.g., Wurgler and Zhuravskaya (2002)), arbitrage costs are likelyto be high for lottery-type stocks. Consequently, differential sentiment shifts (EBSI) may influence the returns of lottery-type stocks.38 To examine the incremental explanatory power of EBSI for returns on lottery-type stocks, I employ a six-factor time-series model which contains the three standard Fama- French factors (Fama and French (1993)), the momentum factor (Jegadeesh and Titman (1993), Carhart (1997)), the liquidity factor (Pa´stor and Stambaugh (2003)), and the dif- ferential sentiment shift (EBSI) as explanatory variables. The following multi-factor time- series model is estimated: LOTRET −R = α+β RMRF +β SMB t ft 1 t 2 t + β HML +β UMD +β LIQ +β EBSI +ε 3 t 4 t 5 t 6 t t t = 1,2,...,T. (4) Here, LOTRET is the rate of return on the lottery-type stock portfolio, R is the riskfree t ft rate of return, RMRF is the market return in excess of the riskfree rate, SMB is the t t difference between the value-weighted return of a portfolio of small stocks and the value- weighted return of a portfolio of large stocks, HML is the difference between the value- t weightedreturnof aportfolio of highB/Mstocksand thevalue-weightedreturnof aportfolio of low B/M stocks, UMD is the difference between the value-weighted return of a portfolio t of stocks with high returns during months t−12 to t−2 and the value-weighted return of a portfolio of stocks with low returns during months t−12 to t−2, LIQ is the innovation t in aggregate liquidity in month t, EBSI is the differential sentiment shift in month t, and t ε is the residual return on the lottery-type stock portfolio. t The estimation results are presented in Table VIII. I find that the EBSI loading is positive(0.104)andstatisticallysignificant(t-stat= 2.557). Interestingly,theEBSI variable alone can explain 13.53% of the variation in lottery-type stock returns. The results indicate that EBSI has incremental explanatory power over commonly used risk-factors for lottery- type stock returns. This evidenceis consistent with Bakerand Wurgler (2005) who find that the subset of stocks which share most attributes with lottery-type stocks are most sensitive to investor sentiment. For robustness, I estimate the EBSI beta using alternative specifications of the multi- factor model with additional control variables. First, I control for industry exposures, where I follow the Pa´stor and Stambaugh (2002) methodology and define three industry factors 38Becausethedifferentialsentimentshiftisdefinedasthedifferencebetweentheretailsentimentforlottery- type stocks and non-lottery stocks, the market-wide sentiment of retail investors (e.g., Barber, Odean, and Zhu (2003), Kumar and Lee (2004)) cancels out. The measure is similar to the demand-shift differential measureemployedinKumar(2003)formeasuringinvestors’styleshiftsacrossextremestyle-basedportfolios. 23",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 49,
    "chunk_index": 44,
    "word_count": 457,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "industry exposures, where I follow the Pa´stor and Stambaugh (2002) methodology and define three industry factors 38Becausethedifferentialsentimentshiftisdefinedasthedifferencebetweentheretailsentimentforlottery- type stocks and non-lottery stocks, the market-wide sentiment of retail investors (e.g., Barber, Odean, and Zhu (2003), Kumar and Lee (2004)) cancels out. The measure is similar to the demand-shift differential measureemployedinKumar(2003)formeasuringinvestors’styleshiftsacrossextremestyle-basedportfolios. 23",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 49,
    "chunk_index": 45,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "which represent the three principal components of the four-factor residuals of the 48 Fama- French industry portfolios. The three industry factors are used as additional controls in a multi-factor model specification. I find that the EBSI beta estimate with industry controls is very similar to the estimate without industry controls (EBSI beta = 0.101 with a t-stat of 2.505). Second, I control for the potential effects of diversification choices of individual investors on lottery-type stock returns. Kumar (2004) finds that a diversification factor which repre- sents returns of a zero-cost portfolio which takes a long (short) position in stocks with the least (most) diversified individual investor clientelehas incrementalexplanatory power (over common risk factors) for a considerable subset of stocks. Furthermore, the sensitivity to the factor is stronger among stocks with lower institutional ownership and higher arbitrage costs. A considerable number of lottery-type stocks have these attributes, so I re-estimate the EBSI beta with controls for industry exposures and under-diversification. Again, I find that the EBSI beta estimate with these controls is very similar to the estimate from the baseline specification without any control variables (EBSI beta = 0.081 with a t-stat of 2.250). Finally, for additional robustness, I use a bivariate vector auto-regression (VAR) frame- worktoexaminethenatureofthelead-lagrelationbetweenthereturnsonlottery-typestocks (i.e., LOTRET) and differential sentiment shifts (i.e., EBSI). In particular, I test the null hypothesis that the positive association between EBSI and LOTRET identified previously (see Table VII) indicates that investors engage in short-term trend-chasing and their trading behavior does not influence returns. Stated differently, the null hypothesis posits that the EBSI variable has no ability to predict stock returns. To test this hypothesis, I estimate the following VAR time-series model: (cid:2) (cid:3) (cid:2) (cid:3) (cid:2) (cid:3)(cid:2) (cid:3) (cid:2) (cid:3) EBSI b b b EBSI ε t 10 11 12 t−1 1t = + + (5) LOTRET b b b LOTRET ε t 20 21 22 t−1 2t TableIXpresentstheVARestimatesand theGranger causalityprobabilities. Theresults indicate that there is persistence in EBSI (i.e., b > 0) and also, the one-month lagged 11 returnspredictthecurrentEBSI (i.e.,b > 0). Moreimportantly,Ifindthattheone-month 12 lagged EBSI has the ability to predict LOTRET (i.e., b > 0). The coefficient b = 0.235 21 21 with a t-value of 1.897 and thecorresponding Granger probabilityis 0.062. Overall,theVAR estimates indicate that the null of pure short-term return-chasing can be rejected (p-value < 0.10) – investor trades are influenced by recent returns but their systematic trading also influences the returns of lottery-type stocks. 24",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 49,
    "chunk_index": 46,
    "word_count": 406,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "= 0.235 21 21 with a t-value of 1.897 and thecorresponding Granger probabilityis 0.062. Overall,theVAR estimates indicate that the null of pure short-term return-chasing can be rejected (p-value < 0.10) – investor trades are influenced by recent returns but their systematic trading also influences the returns of lottery-type stocks. 24",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 49,
    "chunk_index": 47,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "My results so far provide robust evidence of gambling motivated investments by individual investors in the stock market and I also show that systematic trading behavior of investors influences the returns of lottery-type stocks. In this section, I examine whether gambling motivated investment choices influence investors’ portfolio performance. It is possible that like the regressive nature of lotteries (e.g., Clotfelter (1979), Clotfelter and Cook (1987), Scott and Garen (1994), Hansen (1995)), the stock market imposes relativelyhigher costs on under-privilegedinvestorswhomaybetryingtoescapepovertyusingtheirstockinvestments. Specifically, I examine whether investor portfolios under-perform the typical benchmarks and whether portfolio under-performance varies cross-sectionally across different investor groups.39 A. Univariate Tests: Gambling Intensity and Portfolio Performance To examine the impact of investors’ gambling tendencies on portfolio performance, first, I compare the mean performance levels of investors who invest in lottery-type stocks (i.e., “gamblers”) with those who do not hold lottery-type stocks even once during the sample- period (i.e., “non-gamblers”). Lottery-type stocks are identified following the description of lottery-stocks outlined in Section III.A. I examine both raw and risk-adjusted performance differentials between the two broad investor categories. The performance results are reported in Table X, Panel A. I find that the mean raw annual performance differential betweenthe two groups is economicallysmall (only 0.468%). However, the mean four-factor alpha of gamblers is considerably higher than the mean four- factor alpha of non-gamblers (−0.637 for gamblers versus −0.148 for non-gamblers). The difference is statistically significant (p-value < 0.01) and translates into an economically sig- nificant annual risk-adjusted performance differential of 5.868%. The mean factor exposures providesomeinsightsintothedeterminantsof theseperformancedifferentials–theportfolios of gamblers are tilted heavily toward small-cap and value stocks. Next, to estimate the impact of gambling intensity on portfolio performance, I sort the portfolios of gamblersintotengroups based on theweightstheyassign to lottery-typestocks. These results are also presented in Table X (see Panel B). The results indicate that both raw and risk-adjusted performance measures paint a consistent picture – the performance declines in an almost monotonic fashion as the weight assigned to lottery-type stocks in- creases. For “mild gamblers” (decile 1), the mean monthly return is 1.432% while the mean four-factor alpha is −0.176. In contrast, for “heavy gamblers” (decile10), the mean monthly 39As discussed in detail in footnote 9, investors who invest in lottery-type stocks may not necessarily be acting in an irrational manner even when their portfolios under-perform the typical passive performance benchmarks. Without an accurate specification of their preference structure, inferences about rationality cannot be drawnunambiguously. Such an analysiswouldbe quiteinteresting but itis beyond the focus and the scope of my paper. 25",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "IV. Lottery-Type Investments and Portfolio Performance",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 49,
    "chunk_index": 48,
    "word_count": 419,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "IV. Lottery-Type Investments and Portfolio Performance (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "stocks may not necessarily be acting in an irrational manner even when their portfolios under-perform the typical passive performance benchmarks. Without an accurate specification of their preference structure, inferences about rationality cannot be drawnunambiguously. Such an analysiswouldbe quiteinteresting but itis beyond the focus and the scope of my paper. 25",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "IV. Lottery-Type Investments and Portfolio Performance",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 49,
    "chunk_index": 49,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "IV. Lottery-Type Investments and Portfolio Performance (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "return is 0.684% whilethe meanfour-factor alpha is −1.273. This translates intoan econom- icallysignificantannualraw performancedifferentialof −8.976%and an annual risk-adjusted performance differential of −13.164%. Overall, the performance estimates reveal that stock marketgamblersarepayingsignificantcosts fortheirgamblingmotivatedinvestmentchoices. B. Bivariate Tests: Portfolio Under-Performance Estimates within Income Categories To better interpret the portfolio under-performance, I compare the portfolio performance of gamblers and non-gamblers within each of the nine income categories. The results are pre- sentedinTableXI.Ifindthatwithinthegroup ofgamblers(PanelA)as wellas non-gamblers (Panel B), the mean four-factor alpha increases with income (but still stays negative) while the variation along the mean return measure is more uneven. I also find that the propor- tion of investors who are gamblers within a given income group decreases with income. For instance, 23.62% of investors who earn less than $15,000 annually gamble (i.e., invest in lottery-type stocks), while in the high-income category (annual income > $125,000), 18.38% of investors gamble. Consistent with the results reported previously, this evidence indicates that gambling tendency decreases with income. More importantly,I find that, withineach incomecategory, gamblers under-perform non- gamblers. For instance, the mean four-factor alpha for gamblers in the highest income group is −0.779 but the corresponding measure for non-gamblers is considerably lower (−0.190). This monthly difference translates into an economically significant annual risk-adjusted per- formance differential of 7.068%. The gambler-non-gambler performance differential is most severe in the lowest income category (annual income < $15,000). Within this income group, the mean four-factor alpha for gamblers is −1.104, the mean four-factor alpha for non- gamblers is −0.337, and this monthly difference translates into an economically significant annual risk-adjusted performance differential of 9.204%. I also examine portfolio under-performance in dollar terms. I find that among gam- blers (Panel A), the mean under-performance is high for the extreme income categories and it varies unevenly with income. Importantly, these under-performance measures are significant proportions of investors’ annual income. For instance, the annual risk-adjusted under-performance is 5.28% of the annual income of investors whose annual income ranges between $50,000 and $75,000.40 The annual under-performance is almost 32% of annual income for investors who are in the lowest income group (annual income < $15,000). The annual under-performance is a significant proportion of annual income even among investors who do not investin lottery-typestocks (see Panel B) but those proportions are significantly lower than the mean under-performance proportions for gamblers. To examine the portfolio under-performance within the group of gamblers as gambling 40I use the upper limitof the income range to obtain these relative under-performance measures. So, the estimates represent a lower bound on under-performance. 26",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "IV. Lottery-Type Investments and Portfolio Performance",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 49,
    "chunk_index": 50,
    "word_count": 418,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "IV. Lottery-Type Investments and Portfolio Performance (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "B) but those proportions are significantly lower than the mean under-performance proportions for gamblers. To examine the portfolio under-performance within the group of gamblers as gambling 40I use the upper limitof the income range to obtain these relative under-performance measures. So, the estimates represent a lower bound on under-performance. 26",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "IV. Lottery-Type Investments and Portfolio Performance",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 49,
    "chunk_index": 51,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "IV. Lottery-Type Investments and Portfolio Performance (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "intensity varies, I divide gamblers into three categories based on their portfolio weight in lottery-type stocks. Investors whose portfolio weights are in deciles 1-3, 4-7, and 8-10 are identified as low, medium, and high intensity gamblers, respectively. I compute the annual risk-adjusted under-performance as a proportion of annual income for each of these three groups of investors within each income category. The results are presented in Figure 1. As expected, I find that, within most income groups, the portfolio under-performance is greater for high intensity gamblers. For instance, within the lowest income category, the annual relative under-performance for high and low intensity gamblers are −34.72% and −8.65%, respectively. Overall, these results indicate that investors with gambling mindset under-perform the typical performance benchmarks, where the degree of under-performance is greater among high intensity gamblers. C. Isolating the Effects of Gambling Intensity on Portfolio Performance Investors who exhibit preference for lottery-type stocks may also have other characteristics which may reduce their portfolio performance. For instance, those investors may exhibit stronger behavioral biases such as the disposition effect (e.g., Shefrin and Statman (1985), Odean (1998)) or the familiarity bias (e.g., Huberman (2001), Grinblatt and Keloharju (2001), Zhu (2002), Ivkovi´c and Weisbenner (2005)). To isolate the impact of investors’ preferences for lottery-type stocks on portfolio performance, I examine the relation between the residual risk-adjusted portfolio performance and weight assigned to lottery-type stocks. The residual performance measure is the residual from a cross-sectional regression where the risk-adjusted portfolio performance is the dependent variable and the set of explanatory variables includes investor’s age, income, wealth, portfolio size, portfolio monthly turnover, portfolio diversification, familiarity (or local) bias measure, and the adjusted disposition effect measure.41 Usingtheresidualperformancemeasure,Ifindthatthemeanfour-factoralphadifferential between “mild gamblers” and “heavy gamblers” is still high (= −0.805). This translates into an annual risk-adjusted performance differential of −9.660%. Additionally, I find that a one standard deviation shift in the weight assigned to lottery-type stocks corresponds to an additional annual risk-adjusted under-performance of 3.276%. Collectively,the results indicatethat portfolios of investorswho investdisproportionately moreinlottery-typestocks 41The portfoliodiversification is measured as the negative of the normalized portfoliovariance (see Goet- zmann and Kumar (2004)). The local bias of an investor is defined as, LB = D act −D mkt, where D act is the distance between an investor’s location and her stock portfolio and D mkt is the distance between an investor’s location and the market portfolio. See Coval and Moskowitz (2001) and Zhu (2002) for details of the local bias measure. Note that the results are qualitativelysimilar when I use other related measures of local bias (e.g., the proportion of portfolio that is invested in firms located within a 100 or 250 mile radius from an investor’s location). The adjusted disposition effect measure for an investor is defined as the difference between an investor’s actual propensity to realize gains and the expected propensity to realize gains, relative to her portfolio size and trading frequency matched peer group. See Kumar and Lim (2004) for details of the adjusted disposition effect measure. 27",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "IV. Lottery-Type Investments and Portfolio Performance",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 49,
    "chunk_index": 52,
    "word_count": 497,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "IV. Lottery-Type Investments and Portfolio Performance (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "effect measure for an investor is defined as the difference between an investor’s actual propensity to realize gains and the expected propensity to realize gains, relative to her portfolio size and trading frequency matched peer group. See Kumar and Lim (2004) for details of the adjusted disposition effect measure. 27",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "IV. Lottery-Type Investments and Portfolio Performance",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 49,
    "chunk_index": 53,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "IV. Lottery-Type Investments and Portfolio Performance (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "exhibit significant under-performance, even when I control for the effects of other known determinants of portfolio performance. D. Robustness Checks I do not have income information for 20,951 (about 38%) investors. To assure that a sam- ple selection bias is not contaminating my results, I obtain the performance measures for investors without income data and compare the under-performance of gamblers and non- gamblers. For investors with missing income data, I find that gamblers have a mean four- factor alpha of −0.807 while non-gamblers have a mean four-factor alpha of −0.230. In contrast, for investors with income data, lottery-players have a mean four-factor alpha of −0.805 while non-lottery-players have a mean four-factor alpha of −0.255. The correspond- ing performance differences are statistically insignificant. This evidence indicates that the mean under-performance of investors with missing income data is very similar to the mean under-performance of investors with income data. Overall, these comparisons indicate that my under-performance estimates are robust to concerns about a potential sample selection bias due to missing income data. Insum,theperformancecomparisonsindicatethatthestockmarketandlotteriesmarkets are equally unsympathetic to under-privileged people. Those people pay relatively greater proportions of theirincomeas indirecttaxes when theypurchase lotteryticketsand theylose relatively greater proportions of their income in the stock market.42 While under-privileged individualsmight viewlotteriesand stock investmentsas their only means to escape poverty, in reality, they are probably digging deeper holes for themselves. V. Summary and Conclusion This paper examines whether socio-economic and psychological factors which are known toinfluencelotterypurchasesleadto excessinvestmentinlottery-typestocks. Usingmonthly portfolio holdings and trading data from a large U.S. brokerage house, I find that, individual investors invest disproportionately more in stocks with higher idiosyncratic volatility,higher skewness, and lower prices even though these stocks have lower mean returns. These prefer- encesaredistinctfrom individualinvestors’knownpreferencesfor certainfirmcharacteristics such as small-cap stocks, value stocks, etc. In contrast, institutional investors prefer stocks 42My paper is certainly not the first one to provide strong evidence of under-performance in individual investor portfolios. Several previous studies have investigated the performance of individual investors con- sidered in this paper. Barber and Odean (2000) show that there is rich cross-sectional variation in the performance of individual investors. Other related studies (e.g., Coval, Hirshleifer, and Shumway (2001), Ivkovi´c,Poterba, and Weisbenner (2004),Ivkovi´c,Sialm,and Weisbenner (2004)) have identified the profile of investors in the right tail of the performance distribution. My results provide an additional glimpse into the profile of investors who lie in the left tailof the performance distribution. 28",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "IV. Lottery-Type Investments and Portfolio Performance",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 49,
    "chunk_index": 54,
    "word_count": 395,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "IV. Lottery-Type Investments and Portfolio Performance (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Other related studies (e.g., Coval, Hirshleifer, and Shumway (2001), Ivkovi´c,Poterba, and Weisbenner (2004),Ivkovi´c,Sialm,and Weisbenner (2004)) have identified the profile of investors in the right tail of the performance distribution. My results provide an additional glimpse into the profile of investors who lie in the left tailof the performance distribution. 28",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "IV. Lottery-Type Investments and Portfolio Performance",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 49,
    "chunk_index": 55,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "IV. Lottery-Type Investments and Portfolio Performance (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "with higher mean returns, lower idiosyncratic volatility, lower skewness, and higher prices. Furthermore, individual investors’ demand for lottery-type stocks increases when economic conditions are poor and those demand shifts influence the returns of lottery-type stocks. Examining cross-sectional differences within the individual investor category, I find that socio-economic and psychological factors which induce higher expenditures in lotteries also induce greater investment in lottery-type stocks – poor, young men who live in urban, Re- publicandominatedregions andbelong tospecificminority(African-Americanand Hispanic) and religious(Catholic) groups investmore in stocks with lottery-typefeatures. Collectively, these results indicate that people’s attitudes toward gambling are reflected in their stock in- vestment decisions. The finding that race, religion, and political ideology influence portfolio choices of investors is not surprising, but so far, this idea has not been imported in the portfolio choice literature. Examining the portfolio performance of investors who investin lottery-typestocks, I find that the annual under-performance is roughly 5% of investors’ annual household income, where the range is 2-32%. Investors in the lowest income group (annual income < $15,000) haveameanannualunder-performanceof$4,725 whichisalmost32%oftheirannualincome. High-income investors also have comparable mean annual under-performance ($4,250) but it is only 1.70% of their annual income. Taken together, my results indicate that investors who are pre-disposed to playing lotteries also exhibit strong preferences for lottery-type stocks in their investment choices. More importantly, and sadly, poor investors, who can least afford to under-perform, incur the largest costs for their gambling motivated investments. Collectively,the evidence in the paper indicates that people’s attitudes toward gambling are reflected in their stock investment choices and stock returns. And broadly speaking, my results suggest that due to our fundamental desire to gamble, the link between socio- economic dynamics and the stock market behavior may be stronger than currently believed. Of course, this should not come as a surprise as psychological, social, economic, religious, and political identities of an individual supersede her identity as an investor. 29",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "IV. Lottery-Type Investments and Portfolio Performance",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 49,
    "chunk_index": 56,
    "word_count": 313,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "IV. Lottery-Type Investments and Portfolio Performance (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "to our fundamental desire to gamble, the link between socio- economic dynamics and the stock market behavior may be stronger than currently believed. Of course, this should not come as a surprise as psychological, social, economic, religious, and political identities of an individual supersede her identity as an investor. 29",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "IV. Lottery-Type Investments and Portfolio Performance",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 49,
    "chunk_index": 57,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "IV. Lottery-Type Investments and Portfolio Performance (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Baker, Malcolm, and Jeffrey Wurgler, 2004, A catering theory of dividends, Journal of Finance 59, 1125–1165. , 2005, Investor sentiment and the cross-section of stock returns, Working Paper, Harvard Business School and NYU Stern School of Business. Barber, Brad M. and Terrance Odean, 2000, Trading is hazardous to your wealth: The common stock investment performance of individual investors, Journal of Finance 55, 773–806. , 2001, Boys will be boys: Gender, overconfidence, and common stock investment, Quarterly Journal of Economics 116, 261–292. , 2005, All that glitters: The effect of attention and news on the buying behavior of individualand institutionalinvestors, Working Paper, Haas School of Business, University of California at Berkeley. , and Ning Zhu, 2003, Systematic noise, Working Paper, Haas School of Business, University of California at Berkeley, April 2003. Barberis, Nicholas, and Ming Huang, 2005, Stocks as lotteries: The implications of proba- bility weighting for security prices, Working Paper, Yale International Center for Finance, March 2005. Blalock, Garrick, David R. Just, and Daniel H. Simon, 2004, Hitting the jackpot or hitting the skids: Entertainment, poverty, and the demand for state lotteries, Working Paper, Department of Applied Economics and Management, Cornell University, December 2004. Brenner, Reuven, and Gabrielle A. Brenner, 1990, Gambling and Speculation (Cambridge University Press, Cambridge, UK). Brodt, Bonita, 1986, Lottery’s down side, Chicago Tribune, May 25, 1986. Brunnermeier, Markus K. and Jonathan A. Parker, 2004, Optimal expectations, Working Paper, Princeton University, August 2004. Caplin, Andrew, and John Leahy, 2001, Psychological expected utility theory and anticipa- tory feelings, Quarterly Journal of Economics 116, 55–79. Carhart, Mark M., 1997, On persistence in mutual fund performance, Journal of Finance 52, 57–82. 30",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 49,
    "chunk_index": 58,
    "word_count": 272,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "K. and Jonathan A. Parker, 2004, Optimal expectations, Working Paper, Princeton University, August 2004. Caplin, Andrew, and John Leahy, 2001, Psychological expected utility theory and anticipa- tory feelings, Quarterly Journal of Economics 116, 55–79. Carhart, Mark M., 1997, On persistence in mutual fund performance, Journal of Finance 52, 57–82. 30",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 49,
    "chunk_index": 59,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Chen, Nai-Fu, Richard Roll, and Stephen A. Ross, 1986, Economic forces and the stock market, Journal of Business 59, 383–403. Clotfelter, Charles T. 1979, On the regressivity of state-operated ‘numbers’ games, National Tax Journal 32, 543–548. , 2000, Do lotteries hurt the poor? Well, yes and no, Working Paper, Terry Sanford Institute of Public Policy, Duke University, April 2000. , and Philip J. Cook, 1987, Implicittaxation in lottery finance, National Tax Journal 40, 533–546. , 1989, Selling Hope: State Lotteries in America (Harvard University Press, Cam- bridge, MA). Conlisk, John, 1993, The utility of gambling, Journal of Risk and Uncertainty 6, 255–275. Coval, Joshua D., David Hirshleifer, and Tyler Shumway, 2001, Can individual investors beat the market?, Working Paper, Harvard Business School, October 2001. Coval, Joshua D., and Tobias J. Moskowitz, 2001, The geography of investment: Informed trading and asset prices, Journal of Political Economy 109, 811–841. Damasio, Antonio R. 1994, Descartes’ Error: Emotion, Reason, and the Human Brain (Penguin Putnam, New York, NY). Dhar, Ravi, and Alok Kumar, 2001, A non-random walk down the main street: Impact of price trends on trading decisions of individual investors, Working Paper, Department of Economics, Cornell University, December 2001. Diecidue, Enrico, Ulrich Schmidt, and Peter P. Wakker, 2004, The utility of gambling re- considered, Journal of Risk and Uncertainty 29, 241–259. Doherty, Carroll, 2004, Democrats gain edge in party identification, Pew Research Center Commentary (http://people-press.org/commentary/), July 26, 2004. Elster, Jon, and George F. Loewenstein, 1991, Utilityfrom memory and anticipation, in Jon Elster and George Loewenstein (editors), Choice over Time (Russell Sage Foundation, New York, NY), 213-234. Fama, Eugene F., and Kenneth R. French, 1993, Common risk factors in returns on stocks and bonds, Journal of Financial Economics 33, 3–56. , 1997, Industry costs of capital, Journal of Financial Economics 43, 153–193. 31",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 49,
    "chunk_index": 60,
    "word_count": 299,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "and George Loewenstein (editors), Choice over Time (Russell Sage Foundation, New York, NY), 213-234. Fama, Eugene F., and Kenneth R. French, 1993, Common risk factors in returns on stocks and bonds, Journal of Financial Economics 33, 3–56. , 1997, Industry costs of capital, Journal of Financial Economics 43, 153–193. 31",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 49,
    "chunk_index": 61,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Ferson, Wayne E., and Rudi W. Schadt, 1996, Measuring fund strategy and performance in changing economic conditions, Journal of Finance 51, 425–461. Forrest, David, Robert Simmons, and Neil Chesters, 2002, Buying a dream: Alternative models of demand for lotto, Economic Inquiry 40, 485–496. Frieder, Laura, and Avanidhar Subrahmanyam, 2005, Brand perceptions and the market for common stock, Journal of Financial and Quantitative Analysis Forthcoming. Friedman, Milton, and Leonard J. Savage, 1948, The utility analysis of choices involving risk, Journal of Political Economy 56, 279–304. Garrett, Thomas A. and Russell S. Sobel, 2002, State lottery revenue: The importance of game characteristics, Working Paper 2002-011A, Fedreal Reserve Bank of St. Louis. Goetzmann, William N. and Alok Kumar, 2004, Why do individual investors hold under- diversifiedportfolios?,WorkingPaper,YaleInternationalCenterofFinanceandUniversity of Notre Dame, November 2004. Gompers, Paul A., and Andrew Metrick, 2001, Institutional investors and equity prices, Quarterly Journal of Economics 116, 229–259. Grichting, W.L., 1986, The impact of religion on gambling in Australia, Australian Journal of Psychology 38, 45–58. Grinblatt, Mark, and Matti Keloharju, 2001, How distance, language, and culture influence stockholdings and trades, Journal of Finance 56, 1053–1073. Gujarati, Damodar N., 2003, Basic Econometrics (McGraw Hill, New York, NY) Fourth Edition. Hansen, Ann,1995, Thetax incidenceof Colorado state instantlotterygame, Public Finance Quarterly 23, 385–398. Hartley,Roger, and Lisa Farrell,2002, Can expectedutilitytheoryexplaingambling?, Amer- ican Economic Review 92, 613–624. Herring,Mary, and TimothyBledsoe, 1994, Amodel of lottery participation: Demographics, context, and attitudes, Policy Studies Journal 22, 245–257. Huberman, Gur, 2001, Familiarity breeds investment, Review of Financial Studies 14, 659– 680. Hunter, Richard, 1990, Problem gambling in a gambling town: The experienceof Las Vegas, Eighth International Conference on Risk and Gambling, London, August 1990. 32",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 49,
    "chunk_index": 62,
    "word_count": 274,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Amodel of lottery participation: Demographics, context, and attitudes, Policy Studies Journal 22, 245–257. Huberman, Gur, 2001, Familiarity breeds investment, Review of Financial Studies 14, 659– 680. Hunter, Richard, 1990, Problem gambling in a gambling town: The experienceof Las Vegas, Eighth International Conference on Risk and Gambling, London, August 1990. 32",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 49,
    "chunk_index": 63,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Ivkovi´c, Zoran, James Poterba, and Scott Weisbenner, 2004, Tax-motivated trading by in- dividual investors, NBER Working Paper # 10275, January 2004. Ivkovi´c,Zoran, Clemens Sialm, and Scott Weisbenner, 2004, Portfolio concentration and the performance of individual investors, NBER Working Paper # 10675, November 2004. Ivkovi´c, Zoran, and Scott Weisbenner, 2005, Local does as local is: Information content of the geography of individual investors common stock investments, Journal of Finance 60, 267–306. Jegadeesh, Narasimhan, and Sheridan Titman, 1993, Returns to buying winners and selling losers: Implications for market efficiency, Journal of Finance 48, 65–91. Johnson, Johnie E. V., Raymond O’Brien, and Hyun Song Shin, 1999, A violation of domi- nance and the consumption value of gambling, Journal of Behavioral Decision Making 12, 19–36. Jones, Jeffrey M. 2004, Gambling a common activity for Americans, The Gallup Organiza- tion, Annual Gallup Lifestyle Poll, Dec. 11-14, 2003. Kahneman, Daniel,and Amos Tversky,1979, Prospect theory: An analysis of decisionunder risk, Econometrica 47, 263–291. Kim, Young Chin, 1973, Choice in the lottery-insurance situation augmented-income ap- proach, Quarterly Journal of Economics 87, 148–156. Kumar, Alok, 2003, Style switching and stock returns, Working Paper, Mendoza College of Business, University of Notre Dame, November 2003. , 2004, Diversification decisions of individual investors and asset prices, Working Paper, Mendoza College of Business, University of Notre Dame. , and Charles M.C. Lee, 2004, Retail investor sentiment and return comovements, Working Paper, University of Notre Dame and Cornell University, October 2004. Kumar, Alok, and Sonya Seongyeon Lim, 2004, One trade at a time: Narrow framing and stock investment decisions of individual investors, Working Paper, Mendoza College of Business, University of Notre Dame, August 2004. Kwang, Ng Yew, 1965, Why do people buy lottery tickets? Choices involving risk and indivisibility of expenditure, Journal of Political Economy 73, 530–535. Langer, Ellen J., 1975, The illusion of control, Journal of Personality and Social Psychology 32, 311–328. 33",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 49,
    "chunk_index": 64,
    "word_count": 310,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Mendoza College of Business, University of Notre Dame, August 2004. Kwang, Ng Yew, 1965, Why do people buy lottery tickets? Choices involving risk and indivisibility of expenditure, Journal of Political Economy 73, 530–535. Langer, Ellen J., 1975, The illusion of control, Journal of Personality and Social Psychology 32, 311–328. 33",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 49,
    "chunk_index": 65,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Loewenstein, George F. 1987, Anticipation and the valuation of delayed consumption, The Economic Journal 97, 666–684. , Elke U. Weber, Christopher K. Hsee, and Ned Welch, 2001, Risk as feelings, Psy- chological Bulletin 127, 267–286. Malloy,Christopher J. and Ning Zhu, 2004, Mutual fund choicesand investordemographics, Working Paper, London Business School, March 2004. Markowitz, Harry, 1952, The utility of wealth, Journal of Political Economy 60, 151–158. McCorkle, Richard C., 2004, Gambling and crime among arrestees: Exploring the link, ResearchReport #NCJ203197, NationalInstituteofJustice,U.S.Departmentof Justice, Washington, DC. Mikesell, John L. 1994, State lottery sales and economic activity, National Tax Journal 47, 165–171. Mitton,Todd, andKeithVorkink,2004, Equilibriumunder-diversificationand thepreference for skewness,Working Paper, MarriottSchool ofManagement,BrighamYoung University, November 2004. Odean, Terrance, 1998, Are investors reluctant to realize their losses?, Journal of Finance 53, 1775–1798. , 1999, Do investors trade too much?, American Economic Review 89, 1279–1298. P´astor, Lubos, and Robert F. Stambaugh, 2002, Mutual fund performance and seemingly unrelated assets, Journal of Financial Economics 63, 315–349. , 2003, Liquidity risk and expected stock returns, Journal of Political Economy 111, 642–685. Polkovnichenko,Valery,2005, Household portfolio diversification: Acase for rank-dependent preferences, Review of Financial Studies Forthcoming. Pope, Robin E. 1983, The pre-outcome period and the utility of gambling, In Foundations of Utility of Risk Theory with Applications, pp. 137–177 (edited by B.P. Stigum and F. Wenstop), Dodrecht, Netherlands. Price, Donald I. and E. Shawn Novak, 1999, The tax incidenceof three Texas lottery games: Regressivity, race, and education, National Tax Journal 52, 741–751. Quiggin, John, 1982, A theory of anticipated utility, Journal of Economic and Behavioral Organization 3, 323–343. 34",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 49,
    "chunk_index": 66,
    "word_count": 257,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "(edited by B.P. Stigum and F. Wenstop), Dodrecht, Netherlands. Price, Donald I. and E. Shawn Novak, 1999, The tax incidenceof three Texas lottery games: Regressivity, race, and education, National Tax Journal 52, 741–751. Quiggin, John, 1982, A theory of anticipated utility, Journal of Economic and Behavioral Organization 3, 323–343. 34",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 49,
    "chunk_index": 67,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Rubinstein, Ross, and Benjamin Scafidi, 2002, Who pays and who benefits? Examining the distributional consequences of the Georgia lotteryfor education, National Tax Journal 55, 223–238. Scott, Frank A. and John Garen, 1994, Probability of purchase, amount of purchase, and the demographic incidence of the lottery tax, Journal of Public Economics 54, 121–143. Shefrin, Hersh M., and Meir Statman, 1985, The disposition to sell winners too early and ride losers too long, Journal of Finance 40, 777–790. , 2000, Behavioral portfolio theory, Journal of Financial and Quantitative Analysis 35, 127–151. Shiller, Robert J., 2000, Irrational Exuberance (Princeton University Press, Princeton, NJ). Simon,Jonathan, 1998, Dreamsand disillusionment: Adynamicmodelof lotterydemand,In Four Essays and a Note on the Demand for Lottery Tickets and How Lotto Players Choose Their Numbers, (edited by Jonathan Simon), Florence: European University Institute. Statman, Meir, 2002, Lottery players/Stock traders, Financial Analysts Journal 58, 14–21. Thaler, Richard H., and William T. Ziemba, 1988, Paramutel betting markets: Racetrack and lotteries, Journal of Economic Perspectives 2, 161–174. Tversky, Amos, and Daniel Kahneman, 1992, Advances in prospect theory: Cumulative representation of uncertainty, Journal of Risk and Uncertainty 5, 297–323. Walker, Michael B., 1992, The Psychology of Gambling (Pergamon Press, Oxford, UK.). Welte, John W. Grace M. Barnes, William F. Wieczorek, Marie-Cecile Tidwell, and John Parker, 2002, Gambling participation in the U.S.: Results from a national survey, Journal of Gambling Studies 18, 313–337. Wurgler, Jeffrey, and Ekaterina Zhuravskaya, 2002, Does arbitrage flatten demand curves for stocks?, Journal of Business 75, 583–608. Zhu, Ning, 2002, The local bias of individualinvestors, Working Paper, International Center for Finance, Yale School of Management, October 2002. 35",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 49,
    "chunk_index": 68,
    "word_count": 266,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Results from a national survey, Journal of Gambling Studies 18, 313–337. Wurgler, Jeffrey, and Ekaterina Zhuravskaya, 2002, Does arbitrage flatten demand curves for stocks?, Journal of Business 75, 583–608. Zhu, Ning, 2002, The local bias of individualinvestors, Working Paper, International Center for Finance, Yale School of Management, October 2002. 35",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 49,
    "chunk_index": 69,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Table I Individual versus Institutional Investors: Actual and Expected Weights in Price and Moment-Based Stock Categories This table reports the actual and expected weights assigned to sixteen stock categories in the aggregate individualand institutionalinvestorportfolios. Idivideallstocks inthe sampleintosixteen categories using independent sorts along mean return, idiosyncratic volatility,skewness, and stock price dimensions. Stocks are assigned to the upper or the lower halfalongeach of these fourdimensions, and sixteen stock categories are obtained. The return moments are calculated using past 60 monthsof data and the stock price measure is the average price during the sample-period. The idiosyncratic volatility measure is the variance of the residual obtainedby fittinga four-factormodelto the monthlystock returns series over the past 60 months. The expected weights in stock categories reflect the weight of the stock category in the aggregate market portfolio where the market portfolio is obtained by combining all CRSP stocks. The averages of the 71 monthlyactualandexpected weightsare reported inthetable. Theindividualinvestordataarefromalarge U.S. discount brokerage house for the 1991-96 time-period. *, **, and *** denote significance at the 10%, 5%, and 1% levels, respectively. IndividualInvestors Institutional Investors Stock Category Actual Expected Diff Diff (%) Actual Expected Diff Diff (%) High Volatility, High Skew Low Price, Low Ret 8.33 0.74 7.59∗∗∗ 1030.88 0.28 0.74 −0.46∗∗∗ −61.64 High Price, Low Ret 0.60 0.23 0.37∗∗∗ 165.68 0.19 0.23 −0.04∗ −17.62 Low Price, High Ret 9.09 1.05 8.04∗∗∗ 768.90 0.36 1.05 −0.69∗∗∗ −65.25 High Price, High Ret 5.65 2.48 3.17∗∗∗ 127.45 2.53 2.48 0.05 2.00 High Volatility, Low Skew Low Price, Low Ret 2.50 0.38 2.12∗∗∗ 557.95 0.25 0.38 −0.13∗ −35.06 High Price, Low Ret 0.99 0.34 0.65∗∗∗ 195.65 0.35 0.34 0.01 3.81 Low Price, High Ret 1.32 0.21 1.11∗∗∗ 520.17 0.14 0.21 −0.07∗∗ −36.07 High Price, High Ret 6.82 3.50 3.32∗∗∗ 94.81 4.75 3.50 1.25∗∗∗ 35.71 Low Volatility, High Skew Low Price, Low Ret 1.37 0.46 0.91∗∗∗ 196.88 0.24 0.46 −0.22∗∗∗ −48.46 High Price, Low Ret 2.52 2.91 −0.39∗∗∗ −13.30 2.27 2.91 −0.64∗∗∗ −22.03 Low Price, High Ret 0.36 0.12 0.24∗∗∗ 198.88 0.05 0.12 −0.07∗∗∗ −59.25 High Price, High Ret 5.04 8.29 −3.25∗∗∗ −39.12 8.40 8.29 0.11∗ 1.38 Low Volatility, Low Skew Low Price, Low Ret 1.66 1.57 0.09∗ 5.84 0.31 1.57 −1.26∗∗∗ −79.96 High Price, Low Ret 20.21 23.61 −3.40∗∗∗ −14.42 22.02 23.61 −1.59∗∗∗ −6.74 Low Price, High Ret 0.24 0.16 0.08∗∗ 46.67 0.06 0.16 −0.10∗∗∗ −63.68 High Price, High Ret 33.27 53.94 −20.67∗∗∗ −38.33 57.79 53.94 3.85∗∗∗ 7.14 36",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 49,
    "chunk_index": 70,
    "word_count": 398,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Skew Low Price, Low Ret 1.66 1.57 0.09∗ 5.84 0.31 1.57 −1.26∗∗∗ −79.96 High Price, Low Ret 20.21 23.61 −3.40∗∗∗ −14.42 22.02 23.61 −1.59∗∗∗ −6.74 Low Price, High Ret 0.24 0.16 0.08∗∗ 46.67 0.06 0.16 −0.10∗∗∗ −63.68 High Price, High Ret 33.27 53.94 −20.67∗∗∗ −38.33 57.79 53.94 3.85∗∗∗ 7.14 36",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 49,
    "chunk_index": 71,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Table II Panel Regression Estimates for Aggregate Individual and Institutional Portfolios This table reports the panel regression estimates for cross-sectional regressions where the excess weight assigned to a stock in the aggregate individual or institutional portfolio is the dependent variable. The e is xc t e h s e s a p c o t r u t a fo l l w io ei w g e h i t gh a t ss a ig ll n o e c d at t e o d s t t o oc s k to i ck in i g in ro m up on p t o h rt t fo is lio gi p ve i n n b m y o : n E th W t ip a t n = d w w i i m p w t t − im w is t im t t he × w 1 e 0 i 0 g , ht wh o e f r s e t , o w ck ipt i in the aggregate market portfolio in month t. The mean return, idiosyncratic volatility,skewness, kurtosis, and the price of the stock is used as independent variables. Additionally,the followingcontrol variables are employed: (i) market beta, which is estimated using past 60 months of data, (ii) firm size, (iii) book-to- market ratio, (iv) short-term momentum (past one-month stock return), (v) longer-term momentum (past twelve-month stock return), and (vi) an S&P500 dummy which is set to one if the stock belongs to the S&P500index. Thet-statistic forthe coefficient estimate isreported inparenthesis belowthe estimate. The individual investor data are from a large U.S. discount brokerage house for the 1991-96 time-period while the institutional holdings data are from Thomson Financial. Dependent variable: Excess portfolioweight (in percent) in stock i in the aggregate portfolio. Individuals Institutions Variable (1) (2) (3) (4) Mean Return −1.305 −0.955 1.360 (−42.856) (−24.429) (40.455) Idiosyncratic Volatility 1.234 0.905 −0.258 (47.011) (33.141) (−19.931) Skewness 0.581 0.408 −0.106 (43.153) (29.866) (−7.635) Kurtosis −0.676 −0.580 −0.047 (−39.018) (−33.081) (−3.928) Stock Price −0.437 −0.201 0.290 (−32.089) (−23.694) (21.837) Market Beta 0.055 0.055 0.382 (1.126) (0.647) (32.212) Log(Firm Size) −0.969 −0.683 0.270 (−41.153) (−35.416) (21.025) Book-To-Market Ratio −0.275 −0.285 −0.048 (−21.525) (−19.611) (−8.845) Past 1-month Stock Return 0.016 0.038 −0.047 (1.834) (2.548) (−5.608) Past 12-month Stock Return −0.050 −0.023 0.007 (−4.833) (−1.163) (0.570) S&P 500 Dummy 0.076 0.060 −0.047 (21.068) (13.775) (−8.728) Month/Quarter Fixed Effects Yes Yes Yes Yes Number of Observations 155,725 206,977 141,043 59,238 Adjusted R2 10.58% 7.52% 13.64% 21.03% 37",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 49,
    "chunk_index": 72,
    "word_count": 424,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Past 1-month Stock Return 0.016 0.038 −0.047 (1.834) (2.548) (−5.608) Past 12-month Stock Return −0.050 −0.023 0.007 (−4.833) (−1.163) (0.570) S&P 500 Dummy 0.076 0.060 −0.047 (21.068) (13.775) (−8.728) Month/Quarter Fixed Effects Yes Yes Yes Yes Number of Observations 155,725 206,977 141,043 59,238 Adjusted R2 10.58% 7.52% 13.64% 21.03% 37",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 49,
    "chunk_index": 73,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Table III Wealth-Sorted Investor Groups: Actual and Expected Weights in Price and Moment-Based Stock Categories This table reports the actual and expected weights assigned to sixteen stock categories in the aggregate portfolios of poor (wealth deciles 1-3), moderately wealthy (wealth deciles 4-7), and rich (wealth deciles 8-10). Investorsinthe“poor”categoryhavetotalnetworthof$75,000orbelowwhileinvestorsinthe“rich” category havetotalnet worthof$200,000andabove. Idivideallstocks inthe sampleintosixteen categories using independent sorts along mean return, idiosycratic volatility, skewness, and stock price dimensions. Stocks are assigned to the upper or the lower half along each of these four dimensions, and sixteen stock categories are obtained. The return moments are calculated using past 60 months of data and the stock price measure is the average price during the sample-period. The idiosyncratic volatility measure is the variance of the residual obtained by fitting a four-factor model to the monthly stock returns series over the past 60months. The averages of the 71monthlyactual andexpected weightsare reported inthe table. The individual investor data are from a large U.S. discount brokerage house for the 1991-96 time-period. *, **, and *** denote significance at the 10%, 5%,and 1% levels, respectively. Stock Category Poor D4-D7 Rich Poor−Rich Diff (%) High Volatility, High Skew Low Price, Low Ret 8.67 8.64 7.69 0.98 ∗∗∗ 12.81 High Price, Low Ret 0.66 0.60 0.56 0.10 ∗∗∗ 17.55 Low Price, High Ret 9.67 9.31 8.29 1.38 ∗∗∗ 16.64 High Price, High Ret 5.69 5.76 5.50 0.19 ∗∗ 3.42 High Volatility, Low Skew Low Price, Low Ret 2.56 2.53 2.42 0.14 ∗∗ 6.12 High Price, Low Ret 1.20 0.92 0.86 0.34 ∗∗∗ 40.10 Low Price, High Ret 1.52 1.22 1.21 0.31 ∗∗∗ 25.43 High Price, High Ret 7.03 6.82 6.62 0.41 ∗∗ 6.25 Low Volatility, High Skew Low Price, Low Ret 1.31 1.39 1.42 −0.11 ∗∗ −7.44 High Price, Low Ret 2.47 2.41 2.70 −0.23 ∗∗ −8.55 Low Price, High Ret 0.36 0.33 0.38 −0.02 −5.96 High Price, High Ret 4.98 4.89 5.26 −0.28 ∗∗ −5.31 Low Volatility, Low Skew Low Price, Low Ret 1.64 1.70 1.65 −0.01 −0.41 High Price, Low Ret 19.68 19.90 21.05 −1.37 ∗∗ −6.52 Low Price, High Ret 0.21 0.26 0.26 −0.05 ∗ −20.67 High Price, High Ret 32.35 33.31 34.14 −1.79 ∗∗ −5.25 38",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 49,
    "chunk_index": 74,
    "word_count": 361,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "4.98 4.89 5.26 −0.28 ∗∗ −5.31 Low Volatility, Low Skew Low Price, Low Ret 1.64 1.70 1.65 −0.01 −0.41 High Price, Low Ret 19.68 19.90 21.05 −1.37 ∗∗ −6.52 Low Price, High Ret 0.21 0.26 0.26 −0.05 ∗ −20.67 High Price, High Ret 32.35 33.31 34.14 −1.79 ∗∗ −5.25 38",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 49,
    "chunk_index": 75,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Table IV Panel Regression Estimates for Wealth-Based Group Portfolios This table reports the panel regression estimates for cross-sectional regressions where the excess weight assigned to a stock in the aggregate portfolio is the dependent variable. Three aggregate portfolios are considered: theaggregate portfolioofthe poor(wealthdeciles 1-3),moderatelywealthy(wealthdeciles 4-7), and rich (wealth deciles 8-10). Investors in the “poor” category have total net worth of $75,000 or below while investors in the “rich” category have total net worth of $200,000 and above. The excess portfolio w as e s i i g g h n t ed al t lo o c s a t t o e c d k t i o i s n to g c r k ou i p in p m or o t n fo t l h io t p is in giv m e o n n b t y h : t E a W nd ip w t i = mt w is ip w t t− h im e w t i w m e t i × gh 1 t 0 o 0 f , s w t h o e ck re, i w in ip t t h i e s a th g e gr a e c g t a u t a e l m w a ei r g k h et t portfolioinmontht. The meanreturn, idiosyncraticvolatility,skewness, kurtosis, andthe price ofthe stock isusedasindependent variables. Additionally,the followingcontrolvariablesareemployed: (i)marketbeta, which is estimated using past 60 months of data, (ii) firm size, (iii) book-to-market ratio, (iv) short-term momentum (past one-month stock return), (v) longer-term momentum (past twelve-month stock return), and (vi) an S&P500 dummy which is set to one if the stock belongs to the S&P500 index. The t-statistic for the coefficient estimate is reported in parenthesis below the estimate. The individual investor data are from a large U.S. discount brokerage house for the 1991-96 time-period. Dependent variable: Excess portfolioweight (in percent) in stock i in the group-level portfolio. Wealth Deciles Variable D1-D3 (Poor) D4-D7 D8-D10 (Rich) Poor−Rich Mean Return −1.441 −0.903 −0.479 −0.994 (−21.241) (−12.644) (−19.049) (−14.503) Idiosyncratic Volatility 1.704 0.630 0.422 1.275 (31.131) (18.891) (20.296) (24.048) Skewness 0.477 0.277 0.281 0.200 (21.908) (25.880) (18.766) (8.597) Kurtosis −0.754 −0.562 −0.365 −0.389 (−25.071) (−23.886) (−20.319) (−12.436) Stock Price −0.241 −0.244 −0.168 −0.082 (−13.339) (−10.275) (−24.061) (−5.786) Market Beta 0.083 0.043 0.047 −0.029 (2.160) (1.212) (1.035) (−1.052) Log(Firm Size) −0.761 −0.555 −0.232 −0.511 (−18.365) (−13.955) (−19.846) (−8.079) Book-To-Market Ratio −0.522 −0.145 −0.151 −0.359 (−21.775) (−7.571) (−10.676) (−14.685) Past 1-month Stock Return 0.050 0.044 0.010 0.037 (1.900) (2.173) (0.657) (1.336) Past 12-month Stock Return −0.177 0.006 −0.008 −0.155 (−4.836) (−0.572) (0.215) (−4.068) S&P500 Dummy 0.027 0.077 −0.020 0.044 (3.828) (14.385) (−4.390) (6.182) Month Fixed Effects Yes Yes Yes Yes Number of Obervations 141,043 141,043 141,043 141,043 Adjusted R2 9.43% 7.91% 5.29% 2.56% 39",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 49,
    "chunk_index": 76,
    "word_count": 473,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "0.044 0.010 0.037 (1.900) (2.173) (0.657) (1.336) Past 12-month Stock Return −0.177 0.006 −0.008 −0.155 (−4.836) (−0.572) (0.215) (−4.068) S&P500 Dummy 0.027 0.077 −0.020 0.044 (3.828) (14.385) (−4.390) (6.182) Month Fixed Effects Yes Yes Yes Yes Number of Obervations 141,043 141,043 141,043 141,043 Adjusted R2 9.43% 7.91% 5.29% 2.56% 39",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 49,
    "chunk_index": 77,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Table V Panel Regression Estimates for Portfolios of Individual Investor Demographic Groups This table reports the panel regression estimates for cross-sectional regressions where the excess weight assigned to a stock in the aggregate portfolio is the dependent variable. Several aggregate portfolios are considered. Panels A-F report the results for the following sets of group portfolios: (i) Panel A: age and wealthsortedportfolios,(ii)PanelB:genderandmaritalstatusbasedportfolios,(iii)PanelC:race/ethnicity andwealthsortedportfolios,(iv)PanelD:religiousaffiliationbasedportfolios,(v)PanelE:politicalaffiliation andwealth based portfolios,and (vi)PanelF:locationandwealth sorted portfolios. Investors inthe “poor” category havetotalnet worthof$75,000orbelowwhileinvestors inthe“rich”category havetotalnet worth of $200,000 and above. The three age categories are younger (age below 40), middle-aged (age between 40 and 65), and older (age above 65). The excess portfolio weight allocated to stock i in month t is given by: E an W dw ipt im = ti w s i t p w h t− e im w w t im ei t g × ht 1 o 0 f 0 s , t w oc h k er i e i , n w t i h p e t a is g t g h re e g a a c t t e u m al a w rk e e ig t h p t o a rt s f s o ig li n o e i d n t m o o s n to th ck t. i T in h g e r m ou e p an p r o e r t t u fo r l n i , o i p di i o n sy m n o c n ra th tic t volatility,skewness, kurtosis, and the price of the stock is used as independent variables. Additionally,the followingcontrol variables are employed: (i) market beta, which is estimated using past 60 months of data, (ii) firm size, (iii) book-to-market ratio, (iv) short-term momentum (past one-month stock return), (v) longer-term momentum (past twelve-month stock return), and (vi) an S&P500 dummy which is set to one if the stock belongs to the S&P500 index. The retail investor data are froma large U.S. discount brokerage house for the 1991-96 time-period, the zipcode-level race/ehtnicity data are from the 1990 U.S. Census, the state-level religious denominationdata are from the 2001American ReligiousIdentification Survey, and county-level political affiliation data are from the 1992 and the 1996 presidential elections. *, **, and *** denote significance at the 10%, 5%,and 1% levels, respectively. Panel A: Panel Regression Estimates for Age Based Investor Groups Investor Group Mean Return Volatility Skewness Kurtosis Stock Price Younger −0.938∗∗∗ 1.031∗∗∗ 0.400∗∗∗ −0.468∗∗∗ −0.254∗∗∗ Middle-Aged −1.034∗∗∗ 0.982∗∗∗ 0.445∗∗∗ −0.640∗∗∗ −0.192∗∗∗ Older −0.661∗∗∗ 0.571∗∗∗ 0.161∗∗∗ −0.215∗∗∗ −0.201∗∗∗ Young − Old −0.221∗∗∗ 0.415∗∗∗ 0.240∗∗∗ −0.274∗∗∗ −0.047∗∗∗ Poor and Younger −1.201∗∗∗ 0.968∗∗∗ 0.283∗∗∗ −0.500∗∗∗ −0.357∗∗∗ Poor and Middle-Aged −1.651∗∗∗ 1.358∗∗∗ 0.531∗∗∗ −0.642∗∗∗ −0.270∗∗∗ Poor and Older −0.152∗∗ 0.431∗∗∗ 0.307∗∗∗ −0.222∗∗∗ −0.198∗∗∗ Panel B: Panel Regression Estimates for Gender and Marital Status Based Investor Groups Investor Group Mean Return Volatility Skewness Kurtosis Stock Price Men −0.826∗∗∗ 0.836∗∗∗ 0.467∗∗∗ −0.533∗∗∗ −0.200∗∗∗ Women −0.893∗∗∗ 0.657∗∗∗ 0.153∗∗∗ −0.312∗∗∗ −0.186∗∗∗ Men − Women 0.058∗ 0.183∗∗∗ 0.307∗∗∗ −0.229∗∗∗ −0.020∗∗ Single −1.003∗∗∗ 0.948∗∗∗ 0.536∗∗∗ −0.391∗∗∗ −0.171∗∗∗ Married −0.721∗∗∗ 0.667∗∗∗ 0.373∗∗∗ −0.463∗∗∗ −0.201∗∗∗ Single − Married −0.268∗∗∗ 0.264∗∗∗ 0.133∗∗∗ 0.074∗∗∗ 0.025∗∗ Single Men −0.998∗∗∗ 1.093∗∗∗ 0.574∗∗∗ −0.496∗∗∗ −0.183∗∗∗ Single Women −0.779∗∗∗ 0.573∗∗∗ 0.001 −0.113∗∗∗ −0.153∗∗∗ 40",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 49,
    "chunk_index": 78,
    "word_count": 539,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "−0.200∗∗∗ Women −0.893∗∗∗ 0.657∗∗∗ 0.153∗∗∗ −0.312∗∗∗ −0.186∗∗∗ Men − Women 0.058∗ 0.183∗∗∗ 0.307∗∗∗ −0.229∗∗∗ −0.020∗∗ Single −1.003∗∗∗ 0.948∗∗∗ 0.536∗∗∗ −0.391∗∗∗ −0.171∗∗∗ Married −0.721∗∗∗ 0.667∗∗∗ 0.373∗∗∗ −0.463∗∗∗ −0.201∗∗∗ Single − Married −0.268∗∗∗ 0.264∗∗∗ 0.133∗∗∗ 0.074∗∗∗ 0.025∗∗ Single Men −0.998∗∗∗ 1.093∗∗∗ 0.574∗∗∗ −0.496∗∗∗ −0.183∗∗∗ Single Women −0.779∗∗∗ 0.573∗∗∗ 0.001 −0.113∗∗∗ −0.153∗∗∗ 40",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 49,
    "chunk_index": 79,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Table V(Continued) Panel Regression Estimates for Portfolios of Individual Investor Demographic Groups Panel C: Panel Regression Estimates for Race and Ethnicity Based Investor Groups Investor Group Mean Return Volatility Skewness Kurtosis Stock Price African American −1.110∗∗∗ 1.176∗∗∗ 0.427∗∗∗ −0.619∗∗∗ −0.146∗∗∗ Hispanic −1.128∗∗∗ 1.050∗∗∗ 0.360∗∗∗ −0.537∗∗∗ −0.216∗∗∗ White −0.822∗∗∗ 0.871∗∗∗ 0.218∗∗∗ −0.432∗∗∗ −0.240∗∗∗ Afr Am − White −0.322∗∗∗ 0.324∗∗∗ 0.216∗∗∗ −0.092∗∗ −0.093∗∗∗ Afr Am − Hispanic −0.064∗∗ 0.160∗∗∗ 0.067∗∗∗ −0.073∗∗∗ 0.046∗∗∗ Poor African American −2.025∗∗∗ 1.828∗∗∗ 0.570∗∗∗ −0.580∗∗∗ −0.366∗∗∗ Poor Hispanic −1.567∗∗∗ 1.279∗∗∗ 0.396∗∗∗ −0.563∗∗∗ −0.314∗∗∗ Poor White −0.795∗∗∗ 0.836∗∗∗ 0.410∗∗∗ −0.442∗∗∗ −0.248∗∗∗ Panel D: Panel Regression Estimates for Religion Based Investor Groups Investor Group Mean Return Volatility Skewness Kurtosis Stock Price Catholic −0.949∗∗∗ 0.876∗∗∗ 0.336∗∗∗ −0.450∗∗∗ −0.163∗∗∗ No Religion −0.884∗∗∗ 0.934∗∗∗ 0.313∗∗∗ −0.480∗∗∗ −0.198∗∗∗ Protestant −0.534∗∗∗ 0.306∗∗∗ 0.114∗∗∗ −0.182∗∗∗ −0.178∗∗∗ Catholic − Protestant −0.302∗∗∗ 0.512∗∗∗ 0.187∗∗∗ −0.219∗∗∗ −0.012 Panel E: Panel Regression Estimates for Political Affiliation Based Investor Groups Investor Group Mean Return Volatility Skewness Kurtosis Stock Price Republican −0.715∗∗∗ 1.021∗∗∗ 0.260∗∗∗ −0.531∗∗∗ −0.166∗∗∗ Democrat −0.854∗∗∗ 0.603∗∗∗ 0.284∗∗∗ −0.386∗∗∗ −0.184∗∗∗ Republican − Democrat 0.066∗ 0.443∗∗∗ −0.010 −0.156∗∗∗ 0.022∗ Poor Republican −1.491∗∗∗ 1.216∗∗∗ 0.425∗∗∗ −0.572∗∗∗ −0.341∗∗∗ Poor Democrat −0.589∗∗∗ 0.576∗∗∗ 0.231∗∗∗ −0.441∗∗∗ −0.239∗∗∗ Poor Republican − Poor Democrat −0.973∗∗∗ 0.689∗∗∗ 0.211∗∗ −0.175∗∗ −0.116∗∗∗ Rich Republican −0.338∗∗∗ 0.256∗∗∗ 0.088∗∗∗ −0.156∗∗∗ −0.099∗∗∗ Rich Democrat −0.203∗∗∗ 0.252∗∗∗ −0.030∗∗ −0.043∗∗ −0.065∗∗∗ Rich Republican − Poor Democrat −0.113∗∗ 0.007 0.102∗∗∗ −0.102∗∗∗ −0.023∗ Panel F: Panel Regression Estimates for Location Based Investor Groups Investor Group Mean Return Volatility Skewness Kurtosis Stock Price Urban −0.963∗∗∗ 0.758∗∗∗ 0.392∗∗∗ −0.503∗∗∗ −0.185∗∗∗ Suburban −0.951∗∗∗ 0.873∗∗∗ 0.304∗∗∗ −0.393∗∗∗ −0.212∗∗∗ Rural −0.685∗∗∗ 0.939∗∗∗ 0.227∗∗∗ −0.441∗∗∗ −0.209∗∗∗ Urban − Rural −0.250∗∗∗ −0.184∗∗∗ 0.163∗∗∗ −0.047∗∗ 0.021∗ Poor Urban −1.569∗∗∗ 1.738∗∗∗ 0.402∗∗∗ −0.524∗∗∗ −0.345∗∗∗ Poor Rural −0.985∗∗∗ 0.807∗∗∗ 0.360∗∗∗ −0.440∗∗∗ −0.216∗∗∗ Poor Urban − Poor Rural −0.551∗∗∗ 0.928∗∗∗ 0.043∗∗ −0.066∗∗ −0.127∗∗∗ Rich Urban −0.305∗∗∗ 0.232∗∗∗ 0.175∗∗∗ −0.262∗∗∗ −0.118∗∗∗ Rich Rural −0.453∗∗∗ 0.566∗∗∗ −0.032∗ −0.125∗∗∗ −0.211∗∗∗ Rich Urban − Poor Rural 0.164∗∗∗ −0.349∗∗∗ 0.206∗∗∗ −0.131∗∗∗ 0.094∗∗∗ 41",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 49,
    "chunk_index": 80,
    "word_count": 320,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "0.021∗ Poor Urban −1.569∗∗∗ 1.738∗∗∗ 0.402∗∗∗ −0.524∗∗∗ −0.345∗∗∗ Poor Rural −0.985∗∗∗ 0.807∗∗∗ 0.360∗∗∗ −0.440∗∗∗ −0.216∗∗∗ Poor Urban − Poor Rural −0.551∗∗∗ 0.928∗∗∗ 0.043∗∗ −0.066∗∗ −0.127∗∗∗ Rich Urban −0.305∗∗∗ 0.232∗∗∗ 0.175∗∗∗ −0.262∗∗∗ −0.118∗∗∗ Rich Rural −0.453∗∗∗ 0.566∗∗∗ −0.032∗ −0.125∗∗∗ −0.211∗∗∗ Rich Urban − Poor Rural 0.164∗∗∗ −0.349∗∗∗ 0.206∗∗∗ −0.131∗∗∗ 0.094∗∗∗ 41",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 49,
    "chunk_index": 81,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Table VI Investor Characteristics and Excess Investment in Lottery-Type Stocks This table reports the estimates of cross-sectional regressions. The dependent variable is the excess stock holding of an investor in lottery-type stocks. Among the independent variables, Wealth is the total net worth, Income is the total annual household income, and Age is the age of the head of the household. The Retired dummy is set to one if the head of the household is retired, the Male Dummy is set to one if the head ofthe householdismale,the Married Dummy isset to oneifthe headofthe household ismarried,and the Urban Dummy isset toone ifthe household islocated inone ofthe largest twenty metropolitanareas in the U.S.The Overconfidence Dummy is set toone forinvestors whobelong to the highest portfolioturnover quintileandthe lowestrisk-adjusted performance quintile. TheMutual Fund Holdingsvariablemeasures the proportionofinvestor’sfinancialportfoliothatisallocatedtomutualfunds. TheOptionDummyissettoone if an investor made at least one trade in an option during the sample-period. The African American-White Ratio (Hispanic-White Ratio) variable is the ratio of the population of African-Americans (Hispanics) and Whites in investor’s zipcode. The Catholic Dummy (Protestant Dummy) is set to one if the proportion of Catholics (Protestants) in the state of investor’s residence is greater than the mean proportion of Catholics (Protestants) across the U.S. The Democratic-Republican Ratio is the ratio of the number of Democratic and Republican votes in investor’s county during the 1992 and 1996 presidential elections. The t-statistic for the coefficient estimate is reported in parenthesis below the estimate. The retail investor data are from a large U.S. discount brokerage house for the 1991-96time-period, the zipcode-level race/ethnicity data are fromthe1990U.S.Census, thestate-levelreligiousdenominationdataarefromthe2001AmericanReligious Identification Survey, and county-level politicalaffiliationdata are from the 1992 and the 1996 presidential elections. 42",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 49,
    "chunk_index": 82,
    "word_count": 274,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "The t-statistic for the coefficient estimate is reported in parenthesis below the estimate. The retail investor data are from a large U.S. discount brokerage house for the 1991-96time-period, the zipcode-level race/ethnicity data are fromthe1990U.S.Census, thestate-levelreligiousdenominationdataarefromthe2001AmericanReligious Identification Survey, and county-level politicalaffiliationdata are from the 1992 and the 1996 presidential elections. 42 Dependent variable: Excess investment (in percent) of an investor in lottery-type stocks. Variable (1) (2) (3) (4) (5) (6) Constant 24.613 24.409 25.223 25.336 24.571 25.697 (25.141) (18.294) (17.821) (17.844) (14.001) (12.698) Wealth −22.141 −19.726 −21.908 −21.918 −25.036 −22.858 (−11.750) (−7.185) (−8.719) (−8.746) (−6.163) (−6.027) Income −4.813 −8.411 −8.033 −8.146 −6.577 −6.794 (−2.245) (−2.935) (−2.643) (−2.691) (−1.456) (−1.592) Age −7.833 −7.808 −7.591 −10.904 −10.361 (−2.279) (−2.188) (−2.125) (−2.053) (−2.056) Retired Dummy −7.672 −8.156 −8.087 −5.726 −5.132 (−2.338) (−2.405) (−2.381) (−2.155) (−2.093) Male Dummy 10.489 10.631 6.083 7.147 (3.053) (3.089) (3.137) (2.431) Married Dummy −1.073 −1.134 −0.866 −1.345 (−2.311) (−2.328) (−2.137) (−2.056) Urban Dummy 2.911 2.051 2.148 (2.875) (2.457) (3.035) Over-Confidence Dummy 20.823 20.166 23.334 (6.115) (4.396) (5.139) Mutual Fund Holdings 6.940 5.703 (3.485) (3.387) Option Dummy 12.851 12.573 (2.592) (2.488) African American-White Ratio 6.483 (5.139) Hispanic-White Ratio 5.524 (2.513) Catholic Dummy 7.361 (2.698) Protestant Dummy −6.228 (−2.148) Democratic-Republican Ratio −3.380 (−2.805) Number of Observations 15,380 10,653 10,274 10,274 10,274 10,274 Adjusted R2 0.94% 1.30% 1.74% 2.73% 3.35% 4.86% 43",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 43,
    "page_range": "p.43-44",
    "total_pages": 49,
    "chunk_index": 83,
    "word_count": 219,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.43-44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Holdings 6.940 5.703 (3.485) (3.387) Option Dummy 12.851 12.573 (2.592) (2.488) African American-White Ratio 6.483 (5.139) Hispanic-White Ratio 5.524 (2.513) Catholic Dummy 7.361 (2.698) Protestant Dummy −6.228 (−2.148) Democratic-Republican Ratio −3.380 (−2.805) Number of Observations 15,380 10,653 10,274 10,274 10,274 10,274 Adjusted R2 0.94% 1.30% 1.74% 2.73% 3.35% 4.86% 43 Table VII Macro-Economic Conditions and Lottery-Stock Sentiment Shifts This table reports the estimation results for the followingtime-series regression model: EBSI t =b 0 + b 1 UNEMP t−1+b 2 UEI t−1+b 3 MP t−1+b 4∆RP t−1+b 5∆TS t−1 + b 6 EFC t−1+b 7 EFC t + b 8 MKTRET t−1+b 9 MKTRET t+b 10 LOTRET t−1+b 11 LOTRET t + b 12 EBSI t−1+(cid:1) t . The EBSI variable measures the excess change in the sentiment of investors in a given month. EBSI is defined as, EBSI t = LBSI t −OBSI t, where LBSI t is the buy-sell imbalance (BSI) of lottery stocks in month t and OBSI t is the buy-sell imbala (cid:1) nce of other remaining stocks in month t. The BSI for portfolio p in month (cid:1) t is defined as, BSI pt (cid:1) = N 10 p 0 t N i= p 1 tBSI it where the BSI for stock i in month t is defined as BSI it = [ D j= t 1 (VB ijt −VS ijt]/[( D j= t 1 (VB ijt+VS ijt)]. D t is the number of days in month t, VB ijt is the buy volume(measured indollars) for stock i on day j in month t, VS ijt is the sell volume(measured in dollars) for stock i on day j in month t, and N pt is the number of stocks in portfolio p formed in month t. Additionally,UEI t is the unexpected inflationin month t where the average of twelve most recent inflation realizations is used to estimate the expected level of inflation, MP t is the monthly growth in industrial production, EFC t is the mean change in analysts’ earnings forecasts of lottery-type stocks in month t, MKTRET t is the monthly market return, and LOTRET t is the mean monthly return on lottery-type stocks. To allow for direct comparison among the coefficient estimates, variables are standardized so that each variable has a mean of 0 and a standard deviation of 1. The Newey-West adjusted t-values of the coefficient estimates are reported. The retail investor data are from a large U.S. discount brokerage house for the 1991-96time-period. Dependent variable: Aggregate monthly excess buy-sell imbalance(EBSI) for lottery-type stocks. (1) (2) (3) (4) (5) Variable Coeff t-stat Coeff t-stat Coeff t-stat Coeff t-stat Coeff t-stat Intercept 6.012 5.599 6.585 6.424 6.381 6.306 6.585 6.040 6.319 7.503 Lagged UNEMP 3.033 3.112 1.841 2.008 Lagged UEI −1.131 −0.821 −1.157 −1.225 Lagged MP −0.779 −0.674 0.307 0.272 Lagged RP 3.540 2.779 1.139 3.478 Lagged TS 0.675 0.812 0.328 0.155 Lagged EFC 0.396 0.488 0.639 1.048 EFC −0.819 −1.234 −0.255 −0.250 Lagged LOTRET 1.774 2.196 0.789 0.920 LOTRET 3.825 3.912 3.766 4.043 Lagged MKTRET 2.469 1.968 1.061 0.913 MKTRET 0.047 0.042 −0.830 −0.823 Lagged EBSI 2.280 1.891 Number of Obs 71 71 71 71 70 Adjusted R2 8.94% 18.15% 0.86% 16.23% 30.46% 44",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 49,
    "chunk_index": 84,
    "word_count": 531,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "0.488 0.639 1.048 EFC −0.819 −1.234 −0.255 −0.250 Lagged LOTRET 1.774 2.196 0.789 0.920 LOTRET 3.825 3.912 3.766 4.043 Lagged MKTRET 2.469 1.968 1.061 0.913 MKTRET 0.047 0.042 −0.830 −0.823 Lagged EBSI 2.280 1.891 Number of Obs 71 71 71 71 70 Adjusted R2 8.94% 18.15% 0.86% 16.23% 30.46% 44 Table VIII Factor-Model Estimates for Lottery-Type Stock Portfolios Thistablereportsfactormodelestimatesforthelottery-typestockportfolio. Thelottery-typestockportfolio isformedattheendofeachyearandthenheldfixedthroughoutthefollowingyear. Thefollowingmulti-factor time-series model is estimated: LOTRET t −R ft = α+β 1 RMRF t+β 2 SMB t + β 3 HML t+β 4 UMD t+β 5 LIQ t +β 6 EBSI t+ε t t=1,2,...,T. Here, LOTRET t is the rate of return on the lottery-type stock portfolio, R ft is the riskfree rate of return, RMRF tisthemarketreturninexcessoftheriskfreerate,SMB tisthedifferencebetweenthevalue-weighted return ofaportfolioofsmallstocksandthevalue-weightedreturn ofaportfoliooflargestocks,HML t isthe difference between thevalue-weightedreturn ofaportfolioofhighB/Mstocks andthevalue-weightedreturn of a portfolio of low B/M stocks, UMD t is the difference between the value-weighted return of a portfolio of stocks with high returns during months t−12 to t−2 and the value-weighted return of a portfolio of stocks withlowreturns duringmonthst−12tot−2,LIQ isthe innovationinaggregate liquidityinmonth t t, EBSI t is the differential sentiment shift in month t, and ε t is the residual return on the lottery-type stock portfolio. The retail investor data are from a large U.S. discount brokerage house for the 1991-96 time-period. Intercept RMRF SMB HML UMD LIQ EBSI Adj. R2 0.395 0.300 (0.516) (3.000) 13.53% 0.607 1.096 2.376 1.176 −0.439 1.480 (1.124) (7.071) (6.977) (4.155) (−2.697) (0.093) 65.97% −0.080 1.077 2.255 1.085 −0.333 1.298 0.104 (−0.132) (7.023) (6.582) (3.748) (−2.056) (0.084) (2.557) 73.57% 45",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 49,
    "chunk_index": 85,
    "word_count": 255,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "discount brokerage house for the 1991-96 time-period. Intercept RMRF SMB HML UMD LIQ EBSI Adj. R2 0.395 0.300 (0.516) (3.000) 13.53% 0.607 1.096 2.376 1.176 −0.439 1.480 (1.124) (7.071) (6.977) (4.155) (−2.697) (0.093) 65.97% −0.080 1.077 2.255 1.085 −0.333 1.298 0.104 (−0.132) (7.023) (6.582) (3.748) (−2.056) (0.084) (2.557) 73.57% 45",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 49,
    "chunk_index": 86,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Table IX Differential Sentiment Shifts and Stock Returns: Vector Auto-Regression and Granger Causality Test Estimates This table reports the vector auto-regression estimates and Granger causality test probabilities for the followingvector auto-regressive model of order 1 (VAR(1)): (cid:2) (cid:3) (cid:2) (cid:3) (cid:2) (cid:3)(cid:2) (cid:3) (cid:4) (cid:5) EBSI b b b EBSI (cid:1) LOTRE t T t = b 1 2 0 0 + b 1 2 1 1 b 1 2 2 2 LOTRE t T − t 1 −1 + ε1 2 t t EBSI t is the excess change in the sentiment of investors in a given month and LOTRET t is the mean monthly return on lottery-type stocks. EBSI is defined as, EBSI t = LBSI t −OBSI t, where LBSI t is the buy-sell imbalance (BSI) of lottery stocks in month t and OBSI t is the buy-sell imbalan (cid:1) ce of other remaining stocks in month t. The BSI for portfolio p in m (cid:1) onth t is defined as, BS (cid:1) I pt = N 10 p 0 t N i= p 1 tBSI it where the BSI for stock i in montht is defined as BSI it=[ D j= t 1 (VB ijt −VS ijt]/[( D j= t 1 (VB ijt+VS ijt)]. D t is the number of days in month t, VB ijt is the buy volume (measured in dollars) for stock i on day j in month t, VS ijt is the sell volume (measured in dollars) for stock i on day j in month t, and N pt is the number ofstocks inportfoliopformed inmontht. InPanel A,the auto-regression estimates for the 1991-96 period are reported and in Panel B, the probability matrix from Granger causality tests is shown where a matrix element represents the impact of column variable on the row variable. The retail investor data are from a large U.S. discount brokerage house for the 1991-96 time-period. Panel A: Vector Auto-Regressive Model Estimates Variable Const EBSI LOTRET Adj R2 t−1 t−1 EBSI −0.031 0.313 0.209 t (−0.292) (2.622) (1.788) 16.85% LOTRET −0.015 0.235 −0.378 t (−0.134) (1.897) (−3.099) 10.62% Panel B: Granger Causality Probabilities Variable EBSI LOTRET EBSI 0.011 0.078 LOTRET 0.062 0.003 46",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 49,
    "chunk_index": 87,
    "word_count": 363,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "the 1991-96 time-period. Panel A: Vector Auto-Regressive Model Estimates Variable Const EBSI LOTRET Adj R2 t−1 t−1 EBSI −0.031 0.313 0.209 t (−0.292) (2.622) (1.788) 16.85% LOTRET −0.015 0.235 −0.378 t (−0.134) (1.897) (−3.099) 10.62% Panel B: Granger Causality Probabilities Variable EBSI LOTRET EBSI 0.011 0.078 LOTRET 0.062 0.003 46",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 49,
    "chunk_index": 88,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Table X Gambling Intensity, Style Preferences, and Portfolio Performance This table reports the raw and risk-adjusted performance measures of investor groups formed by sorting on gamblingintensity. The meanfactorexposures oftheirportfoliosarealsoreported. PanelAcompares mean performancelevelsofinvestorswhoinvestinlottery-typestocks(i.e.,“gamblers”)withthosewhodonothold lottery-type stocks even once during the sample-period (i.e., “non-gamblers”). The four-factor alpha and the factor exposures are obtained by fitting a four-factor time-series model to the monthlyportfolioreturns series ofeachinvestoroverthe periodtheinvestorisactive. PanelBreports themeanperformance measures and the mean factor exposures for investor groups formed by sorting on the mean weight in lottery-type stocks. The retail investor data are from a large U.S.discount brokerage house for the 1991-96time-period. *, **, and *** denote significance at the 10%, 5%,and 1% levels, respectively. Panel A: Performance of Gamblers versus Non-Gamblers Lottery Stocks Performance Measures Factor Exposures Weight Decile 4F Alpha Mon Ret Std Dev Sharpe RMRF SMB HML UMD Non-Gambler −0.148 1.227% 7.386% 0.117 1.143 0.442 0.043 −0.237 Gambler −0.637 1.189% 9.762% 0.087 1.236 1.270 0.370 −0.407 G−NG −0.489∗∗∗ −0.039∗∗ 2.376∗∗∗ −0.031∗∗∗ 0.093∗∗∗ 0.828∗∗∗ 0.327∗∗∗ −0.170∗∗∗ Panel B: Performance of Heavy versus Mild Gamblers Lottery Stocks Performance Measures Factor Exposures Weight Decile 4F Alpha Mon Ret Std Dev Sharpe RMRF SMB HML UMD Mild Gambler −0.176 1.432% 7.352% 0.144 1.233 0.650 0.103 −0.232 D2 −0.287 1.376% 8.259% 0.124 1.241 0.896 0.161 −0.313 D3 −0.400 1.322% 8.796% 0.107 1.252 1.023 0.214 −0.349 D4 −0.586 1.300% 9.477% 0.096 1.271 1.225 0.359 −0.379 D5 −0.560 1.285% 9.762% 0.092 1.262 1.298 0.360 −0.408 D6 −0.714 1.150% 10.072% 0.076 1.233 1.327 0.396 −0.404 D7 −0.714 1.199% 10.460% 0.078 1.257 1.476 0.461 −0.480 D8 −0.966 1.004% 11.027% 0.054 1.239 1.561 0.509 −0.475 D9 −0.968 0.931% 11.506% 0.045 1.210 1.695 0.582 −0.558 Heavy Gambler −1.273 0.684% 11.962% 0.023 1.127 1.808 0.696 −0.548 Heavy−Mild −1.097∗∗∗ −0.748∗∗∗ 4.610∗∗∗ −0.121∗∗∗ −0.106∗∗∗ 1.159∗∗∗ 0.593∗∗∗ −0.316∗∗∗ 47",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 49,
    "chunk_index": 89,
    "word_count": 292,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "1.327 0.396 −0.404 D7 −0.714 1.199% 10.460% 0.078 1.257 1.476 0.461 −0.480 D8 −0.966 1.004% 11.027% 0.054 1.239 1.561 0.509 −0.475 D9 −0.968 0.931% 11.506% 0.045 1.210 1.695 0.582 −0.558 Heavy Gambler −1.273 0.684% 11.962% 0.023 1.127 1.808 0.696 −0.548 Heavy−Mild −1.097∗∗∗ −0.748∗∗∗ 4.610∗∗∗ −0.121∗∗∗ −0.106∗∗∗ 1.159∗∗∗ 0.593∗∗∗ −0.316∗∗∗ 47",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 48,
    "page_range": "p.48",
    "total_pages": 49,
    "chunk_index": 90,
    "word_count": 50,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "Table XI Portfolio Under-performance Estimates Across Income Categories This table reports the raw and risk-adjusted performance measures of investor groups formed by sorting on incomeandgamblingbehavior. PanelAreports themeanperformancelevelsofgamblers(i.e.,investorswho invest in lottery-type stocks) within different income groups. Panel B reports the mean performance levels of non-gamblers (i.e., investors who do not hold lottery-type stocks even once during the sample-period) within different income groups. The four-factor alpha is obtained by fitting a four-factor time-series model to the monthly portfolio returns series of each investor over the period the investor is active. Portfolio size is the mean of the mean portfolio sizes of investors within an income group. The annual portfolio under- performance isobtainedbymultiplyingthe four-factoralphawiththeportfoliosize. Theretailinvestordata are from a large U.S. discount brokerage house for the 1991-96time-period. Panel A: Performance Measures for Investors who Invest in Lottery-Type Stocks Annual Income <15K 15-20K 20-30K 30-40K 40-50K 50-75K 75-100K 100-125K >125K Four-Factor Alpha −1.104 −0.908 −0.670 −0.646 −0.788 −0.846 −0.866 −0.747 −0.779 Mean Mon Return 0.85% 0.90% 1.10% 1.15% 1.06% 1.00% 1.02% 1.06% 1.06% Standard Deviation 10.25% 9.87% 9.72% 10.20% 9.72% 9.98% 10.13% 9.99% 9.79% Sharpe Ratio 0.053 0.057 0.079 0.080 0.077 0.066 0.069 0.075 0.077 Portfolio Size $35,676 $23,910 $27,312 $30,532 $38,113 $39,052 $34,376 $41,598 $45,463 Annual Under-Perf $4,725 $2,604 $2,194 $2,365 $3,606 $3,963 $3,572 $3,729 $4,250 UPerf (% of Income) 31.50% 13.02% 7.31% 5.91% 7.21% 5.28% 3.57% 2.98% 1.70% Num of Investors 198 129 325 517 543 1,320 1,274 809 607 % of Inc Group 23.62% 22.18% 22.59% 21.22% 20.71% 20.25% 19.42% 17.78% 18.38% Panel B: Performance Measures for Investors who do not Invest in Lottery-Type Stocks Annual Income <15K 15-20K 20-30K 30-40K 40-50K 50-75K 75-100K 100-125K >125K Four-Factor Alpha −0.337 −0.346 −0.352 −0.312 −0.210 −0.263 −0.239 −0.250 −0.190 Mean Mon Return 1.17% 1.27% 1.19% 1.21% 1.22% 1.22% 1.31% 1.23% 1.27% Standard Deviation 7.94% 8.05% 7.75% 8.03% 7.81% 8.07% 8.30% 8.16% 8.17% Sharpe Ratio 0.100 0.115 0.110 0.105 0.112 0.108 0.114 0.109 0.112 Portfolio Size $33,752 $28,952 $33,297 $30,765 $28,647 $26,264 $30,861 $32,257 $34,646 Annual Under-Perf $1,364 $1,201 $1,407 $1,153 $721 $827 $886 $969 $788 UPerf (% of Income) 9.09% 6.00% 4.69% 2.88% 1.44% 1.10% 0.89% 0.77% 0.31% 48",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 48,
    "page_range": "p.48",
    "total_pages": 49,
    "chunk_index": 91,
    "word_count": 355,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  },
  {
    "text": "8.30% 8.16% 8.17% Sharpe Ratio 0.100 0.115 0.110 0.105 0.112 0.108 0.114 0.109 0.112 Portfolio Size $33,752 $28,952 $33,297 $30,765 $28,647 $26,264 $30,861 $32,257 $34,646 Annual Under-Perf $1,364 $1,201 $1,407 $1,153 $721 $827 $886 $969 $788 UPerf (% of Income) 9.09% 6.00% 4.69% 2.88% 1.44% 1.10% 0.89% 0.77% 0.31% 48 40 35 30 25 20 15 10 5 0 0−15K 15−20K 20−30K 30−40K 40−50K 50−75K 75−100K 100−125K >125K emocnI launnA fo egatnecreP sa ecnamrofreP−rednU launnA T T T T T T High Gambling Intensity Medium Gambling Intensity Low Gambling Intensity I MD Income Categories Figure 1. Gambling intensity and annual risk-adjusted under-performance across income cat- egories. This figure shows the annual risk-adjusted under-performance as a percentage of income for low, medium, and high intensity gamblers within each income category. Gamblers (i.e., investors who invest in lottery-type stocks) are divided into three categories based on their portfolio weight in lottery type stocks. Investors whose portfolio weights are in deciles 1-3, 4-7, and 8-10 are identified as low, medium, and high intensitygamblers,respectively. The individualinvestordataarefromalargeU.S.discountbrokeragehouse for the 1991-96time-period. 49",
    "title": "lottPoorInvestors2.DVI",
    "source_type": "pdf",
    "document_id": "8b9306d11f97",
    "source_file": "Who Gambles in the Stock Market - Alok Kumar.pdf",
    "section": "References",
    "page_number": 49,
    "page_range": "p.49",
    "total_pages": 49,
    "chunk_index": 92,
    "word_count": 176,
    "author": "akumar",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20050403105630-05'00'",
    "duration": null
  }
]