[
  {
    "text": "Who Profits From Trading Options?* Jianfeng Hu, Antonia Kirilova, Seongkyu “Gilbert” Park, and Doojin Ryu June 2021 Abstract We use account-level transaction data to examine trading styles and profitability in a leading derivatives market. We find that retail investors in particular favor a consistent trading strategy: approximately 70% of retail investors predominantly hold simple one-sided positions in only one class of options, while institutional investors are more likely to use multiple strategies with a range of complexity. Accordingly, we use trading style complexity as an ex ante measure of trading skills to demonstrate its significant effect on investment performance. We find that retail investors using simple strategies are losing to the rest of the market. For both retail and institutional investors, volatility trading earns the highest return, and risk neutral strategies deliver the highest Sharpe ratio. We conclude that these style effects are persistent and cannot be explained by systematic risk exposure or known behavioral biases. Keywords: Options, institutional investors, retail investors, trading styles, volatility *Hu is at the Singapore Management University (jianfenghu@smu.edu.sg); Kirilova is at the Singapore Management University (akkirilova.2016@pbs.smu.edu.sg); Park is at the Hong Kong Polytechnic University (gilbert.park@polyu.edu.hk); and Ryu is at the Sungkyunkwan University (doojin.ryu@gmail.com). We are grateful to Brad Barber, Byeong-Je An, Steve Figlewski, Mark Grinblatt, Bing Han, Kris Jacobs, Juhani Linnainmaa, Neil Pearson, John Wei, Xiaoyan Zhang, and participants at the 2nd Sun Yat-Sen University Finance International Conference, Singapore Management University Summer Research Camp, 2019 Asian Finance Association Conference, 2019 FMA Annual Meeting, 2020 AFA Annual Meeting Ph.D. Student Poster Session, 2020 Virtual Derivatives Workshop, HSBC Business School (Peking University), Korea Advanced Institute of Science and Technology, and National University of Singapore Brown Bag Seminar for helpful comments. Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 51,
    "chunk_index": 0,
    "word_count": 288,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "Camp, 2019 Asian Finance Association Conference, 2019 FMA Annual Meeting, 2020 AFA Annual Meeting Ph.D. Student Poster Session, 2020 Virtual Derivatives Workshop, HSBC Business School (Peking University), Korea Advanced Institute of Science and Technology, and National University of Singapore Brown Bag Seminar for helpful comments. Electronic copy available at: https://ssrn.com/abstract=3867129 Who Profits From Trading Options? June 2021 Abstract We use account-level transaction data to examine trading styles and profitability in a leading derivatives market. We find that retail investors in particular favor a consistent trading strategy: approximately 70% of retail investors predominantly hold simple one-sided positions in only one class of options, while institutional investors are more likely to use multiple strategies with a range of complexity. Accordingly, we use trading style complexity as an ex ante measure of trading skills to demonstrate its significant effect on investment performance. We find that retail investors using simple strategies are losing to the rest of the market. For both retail and institutional investors, volatility trading earns the highest return, and risk neutral strategies deliver the highest Sharpe ratio. We conclude that these style effects are persistent and cannot be explained by systematic risk exposure or known behavioral biases. Keywords: Options, institutional investors, retail investors, trading styles, volatility Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 51,
    "chunk_index": 1,
    "word_count": 210,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "investors, volatility trading earns the highest return, and risk neutral strategies deliver the highest Sharpe ratio. We conclude that these style effects are persistent and cannot be explained by systematic risk exposure or known behavioral biases. Keywords: Options, institutional investors, retail investors, trading styles, volatility Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 51,
    "chunk_index": 2,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "The exchange-traded options market has been one of the fastest-growing public financial markets in recent years. According to data from the Options Clearing Corporation (OCC), the total options trading volume in the U.S. reached 7.47 billion contracts in 2020 with a value of USD$4.59 trillion, which represents a growth factor of 25 times the size of the public options market in 1996. A unique feature of the options market is the multitude of trading opportunities it allows. While stock investors earn only linear payoffs and may also be constrained in short-selling, options traders can construct various payoff structures to gain specific risk exposure to both the underlying stock price and to volatility. Conventional wisdom claims that derivatives trading requires comprehensive financial knowledge and is better suited for sophisticated investors such as institutions; however, retail participation in exchange-traded options markets is surprisingly high. For example, Goldman Sachs estimates that odd lot trades, as a measure of retail trading, account for approximately 10% of total options volume in 2019, as compared to about 1.5% in the U.S. equity market.1 Active and well- coordinated retail options-trading also drew attention in the remarkable short squeeze of GameStop stocks in January 2021, which led short-sellers to lose billions of dollars at hedge funds like Melvin Capital.2 Two questions arise: Overall, how do retail investors perform as compared to institutions in the booming options market? And what factors affect the disparate performance of different investors? In this study, we aim to answer these broadly unaddressed questions that are relevant to both researchers and policymakers. We conjecture that the complexity of options strategies used by different investors reflects the given investors’ financial knowledge, trading skills, and level of sophistication, which in turn affects their investment performance. Our results confirm this hypothesis. We show that the trading style, defined as the dominant strategy used by a given investor, significantly affects the average return and Sharpe ratio, in addition to the effect of investor class, i.e., retail or institution. Further, these style effects cannot be explained by either risk premiums or known behavioral biases. We examine one of the world’s leading derivatives markets, namely the South Korean options market. Our analysis takes advantage of a complete administrative data set of options transactions, with anonymous account identities, executed on the Korea Exchange (KRX) between January 1, 2010 and June 30, 2014. The underlying asset is the Korea Composite Stock Price Index (KOSPI 200), which is similar to the S&P 500 index. During our sample period, the KOSPI options market traded more than 7.7 million option contracts per day and was the most liquid public derivatives market according to the Futures Industry Association (FIA). The KOSPI options market is also a global market available to both 1 See Bloomberg article “Bored Day Traders Locked at Home Are Now Obsessed With Options” (https://www.bloomberg.com/news/articles/2020-05-22/options-are-now-all-the-rage-for-bored-day-traders- locked-inside). 2 See Financial Times article “‘Weaponised’ Options Trading Turbocharges GameStop’s Dizzying Rally” (https://www.ft.com/content/ae1ecff4-9019-4a2a-97ea-55a3cd15c36a). 1 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 51,
    "chunk_index": 3,
    "word_count": 491,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "Association (FIA). The KOSPI options market is also a global market available to both 1 See Bloomberg article “Bored Day Traders Locked at Home Are Now Obsessed With Options” (https://www.bloomberg.com/news/articles/2020-05-22/options-are-now-all-the-rage-for-bored-day-traders- locked-inside). 2 See Financial Times article “‘Weaponised’ Options Trading Turbocharges GameStop’s Dizzying Rally” (https://www.ft.com/content/ae1ecff4-9019-4a2a-97ea-55a3cd15c36a). 1 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 51,
    "chunk_index": 4,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "institutional and retail foreign investors. In fact, foreign investors contribute around 35% of the aggregate trading volume in this market, thereby indicating that the relevance of our findings is likely to extend beyond the Korean market. In addition to the options data, we also obtain data of futures on the same underlying index, which are used by some traders to construct combinations with options. These detailed account-level data of the entire market provide a unique opportunity to observe the full transaction and position records for each account—labelled as either institutional or retail investor— and to calculate the account profitability. Given the sparse evidence in extant literature concerning how different investors use options, we start by documenting a number of stylized facts in our sample. We find a considerable degree of variation in the strategies used by investors. More than 80% of the end-of-day positions can be classified as one of the following four classic options strategies: (i) simple (naked) option positions; (ii) the combination of options and underlying; (iii) option spreads; and (iv) volatility trading. We also find that many unclassified positions appear risk-neutral having near-zero option Greeks (i.e., price sensitivities to the underlying price and volatility); this finding may reflect the possible activity of market makers and arbitrageurs. Consistent with conventional wisdom, we find a significant difference in the complexity of trading strategies used by institutions and retail investors. Around two-thirds of institutional accounts trade both options and futures, while two-thirds of retail accounts trade only options but not futures. Moreover, more than 50% of retail end-of-day positions represent simple option strategies consisting of one-sided bets in only one option class: only long calls, short calls, long puts, or short puts. These types of simple strategies are also used on occasion by institutions, and represent 18.8% of the institutional account-day positions. However, institutions more commonly apply various complex strategies, e.g., combinations of options and futures. Further, although many retail positions do involve complex strategies, these strategies are more common among their institutional counterparts. For example, volatility strategies account for 16.7% of retail account-day positions, and Greek neutral positions are held by 6.7% of retail account-days. Finally, we also find active day trading by both retail and institutional investors, which accounts for about 10% of total trading volume in the market each day. In summary, we systematically show rich heterogeneity in options trading strategies both across and within investor classes. This finding enables more extensive exploration of the implications of trading styles. To test the conjecture that the complexity of a chosen trading style reflects investors’ trading skills, we first classify the dominant trading strategy of each account. We define day traders as those who invariably open and close option positions on the same day and never hold positions overnight. By examining the overnight positions of the remaining accounts, we can extract their most frequently used strategy; we subsequently categorize them into the most significant trading styles as follows: (i) simple strategy traders; (ii) volatility traders; and (iii) Greek neutral traders. In order to define the dominant strategy of an account, we require their most frequent strategy to be used on at least 60% of the days 2 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 51,
    "chunk_index": 5,
    "word_count": 533,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "most significant trading styles as follows: (i) simple strategy traders; (ii) volatility traders; and (iii) Greek neutral traders. In order to define the dominant strategy of an account, we require their most frequent strategy to be used on at least 60% of the days 2 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 51,
    "chunk_index": 6,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "when the account holds overnight positions. In addition to the investors with an identified dominant strategy, we recognize another group of investors who do not present a dominant strategy or who primarily use less popular strategies such as bull/bear spreads. We label them as “Others” and use this group as a benchmark in the performance analyses. We find that close to 76% of retail investors and 50% of institutional investors have a dominant strategy, indicating that while investors overall tend to favor a particular strategy in trading options, this is more common among retail investors. Consistent with our earlier findings at the account-day level, simple strategies are the most popular among retail investors, with 66% of retail accounts predominantly using these strategies. Surprisingly, we find that close to 19% of institutional accounts also employ simple strategies as their dominant trading style. We find that day trading is dominant in 17% of institutional accounts in contrast to only 2.6% of retail accounts, thereby demonstrating that institutional investors are more likely than retail investors to engage in day trading. We observe a similar pattern for Greek neutral strategies, which are dominant among 9.9% of institutional accounts and 2.4% of retail accounts. Finally, volatility trading is the dominant strategy in 4% of institutional accounts and 5% of retail accounts. We hypothesize that among the different types of investors, volatility traders and Greek neutral traders are more sophisticated, while simple strategy traders are less sophisticated than the benchmark group (“Others”), based on differences in strategy complexity. The prediction regarding day traders is less clear: day trading can appear easy to execute but success depends on different factors including trading speed, risk management, and attention allocation. Individual day traders have been shown to lose on average while institutional day traders make profits (Kuo and Lin, 2013; Barber et al., 2017). To analyze the relation between trading styles and investment performance, we first calculate the profit and loss (P&L) of each account. We find that retail investors lose substantially in the KOPSI options market. The median retail investor loses KRW₩5.5 million (approximately USD$5,000) in our sample, equivalent to approximately 21% of annual household disposable income per capita over the same period.3 Even retail traders in the top 30th percentile of performance ranking are shown to lose money. However, the median institutional P&L is positive. Due to the effect of account size and length of investment period on the dollar P&L ($P&L), we calculate the average daily return and Sharpe ratio for each account over the full sample period to measure account performance. We then use an account- level multiple regression framework to investigate the relation of performance metrics to investor class (institution vs. retail) and trading style (dominant strategy). Our baseline results show that both investor class and trading style affect investment performance. Institutional investors significantly outperform retail investors in terms of both mean return and Sharpe ratio. In addition, trading styles can significantly impact performance: Simple strategy traders have the worst performance among all trading styles; day 3 OECD (2021), \"Household disposable income\" (indicator), https://doi.org/10.1787/dd50eddd-en. 3 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 51,
    "chunk_index": 7,
    "word_count": 516,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "performance. Institutional investors significantly outperform retail investors in terms of both mean return and Sharpe ratio. In addition, trading styles can significantly impact performance: Simple strategy traders have the worst performance among all trading styles; day 3 OECD (2021), \"Household disposable income\" (indicator), https://doi.org/10.1787/dd50eddd-en. 3 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 51,
    "chunk_index": 8,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "traders on average also perform worse than the benchmark group of investors. On the other hand, complex trading styles, namely volatility trading and Greek neutral trading, outperform the benchmark in both average return and Sharpe ratio. Volatility traders earn the highest average returns, and Greek neutral traders have the largest Sharpe ratios. These results support our hypothesis that both investor classes and trading styles measure investor sophistication and trading skills. The evidence also indicates that the style effects can be more robust than the investor class effect. The performance difference between institutional and retail investors narrows significantly when we examine investor class and trading styles in the same model. In contrast, including investor class in the model has only negligible impact on the significance of the trading styles themselves. In addition, the outperformance of institutional investors is related to systematic risk exposure. When we remove the loadings on systematic risk factors from the daily returns, we find that institutional investors on average do not earn higher returns than retail investors, although they still have higher Sharpe ratios. Yet all trading style effects remain the same when we use risk-adjusted returns. Because our sample contains more retail investors, the trading style effects in the full sample results may be driven by the style effects on retail investor performance. To draw a more complete picture, we examine trading style effects separately for institutional and retail investors and unsurprisingly find the same results as our baseline findings in the subgroup of retail investors. When we turn to the subgroup of institutional investors, the trading styles remain significantly related to investment performance with slightly different patterns. While outperformance of complex trading styles (volatility trading and Greek neutral) presents in both retail and institutional groups, the performance of simple strategies and day trading differs considerably across the two groups. Retail investors employing these strategies underperform the benchmark, and institutions employing the same strategies outperform the benchmark. In fact, institutional day traders generate high Sharpe ratios, possibly due to these accounts engaging in high-frequency trading and market making. Institutions using primarily simple strategies generate higher returns than the benchmark, though without significantly larger Sharpe ratios. These results posit that investor sophistication measured specifically by trading styles may be more relevant to retail investors. Institutional investors who are likely to enjoy other advantages such as advanced information and low trading latency, can generate superior performance with simple options strategies. Further analysis shows that the trading style effects are persistent. We perform out-of-sample tests by splitting the sample into two equal periods and identifying the dominant strategy of each account in each period separately. With a probability of at least 67%, the dominant strategy in the first half of the sample continues to be dominant in the second half, with only one exception for retail volatility traders in which the probability is 47%. Using the trading styles identified in the first period as instruments for the styles in the second period, we find similar effects of the styles on trading 4 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 51,
    "chunk_index": 9,
    "word_count": 508,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "the second half, with only one exception for retail volatility traders in which the probability is 47%. Using the trading styles identified in the first period as instruments for the styles in the second period, we find similar effects of the styles on trading 4 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 51,
    "chunk_index": 10,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "performance out-of-sample for both retail and institutional investors. This finding confirms that the style effects are not randomly chosen by each account, and that both the particular style and its impact on performance are persistent. To this point, our analysis has compared performance across accounts to identify the trading style effects. However, given heterogeneity in investor endowment, we query whether the self-selected trading style already reflects the optimal outcome attainable for each account. To answer this question, we examine the account performance attributable to the dominant versus nondominant strategies. Rational Bayesian investors should gradually learn the strategy advantageous for themselves and use it as their dominant strategy. Therefore, in the case of rational investors, we expect the performance from positions employing nondominant strategies to be worse than the performance from positions employing the dominant strategy. We can confirm this for institutional investors, as we find their performance is weaker when they employ their nondominant strategies. The same finding holds for retail volatility traders, thereby suggesting that retail investors in this group behave consistently as Bayesian learners. However, retail investors with predominantly simple strategies tend to show significantly better performance when employing other strategies. Nonetheless, we find that these apparently less sophisticated retail investors fail to change their dominant strategy: despite superior performance with other strategies, they adhere to the losing trading style. These results further confirm the efficacy of using trading styles to measure retail investor sophistication. In the last part of our analysis, we take a deep dive in order to understand what causes retail investors’ preference for simple options strategies and what causes their heavy losses from using these strategies. We start by examining whether the choice of dominant strategy by retail investors corresponds to behavioral patterns. Borrowing from the growing literature on individuals’ behavior in financial markets, we hypothesize that retail traders’ performance in the options market may reflect known biases including lottery preference (Boyer and Vorkink, 2014); overconfidence (Barber and Odean, 2000); disposition effect (Odean, 1998); trend chasing, also known as extrapolation or positive feedback trading (De Long et al., 1990; Li et al., 2021); and self-attribution bias (Gervais and Odean, 2001; Hoffmann and Post, 2014). Underperformance due to these behavioral biases may appear amplified in the options market due to the high leverage and fat tail risk embedded in option contracts. We construct proxies for these biases at the account level following the aforementioned studies. Then, we perform logistic regressions of the dominant strategy dummies on the behavioral bias proxies. We find that the likelihood that simple strategies will be a given retail investor’s dominant trading style is positively and significantly associated with (i) investor overconfidence as measured by the average daily trading volume; (ii) disposition effect as measured by proportion of gains realized minus proportion of losses realized; and (iii) lottery preference as measured by the percentage of positions in long out-of-the-money options. The same investors also strongly prefer to provide rather than to take liquidity. They do not tend to chase trends, and we do not find self-attribution bias to affect retail 5 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 51,
    "chunk_index": 11,
    "word_count": 515,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "(iii) lottery preference as measured by the percentage of positions in long out-of-the-money options. The same investors also strongly prefer to provide rather than to take liquidity. They do not tend to chase trends, and we do not find self-attribution bias to affect retail 5 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 51,
    "chunk_index": 12,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "investors’ choice of strategies. Our results using investor sophistication measured by trading styles are largely consistent with the predictions found in the behavioral finance literature. Finally, we investigate whether the effects of trading style on investment performance can be explained by the behavioral biases: As the literature posits, these biases can have direct channels to affecting performance. For this purpose, we include the bias proxies as control variables in the performance analysis regressions. Although many of the behavioral biases significantly and adversely affect investor performance consistently with findings in current literature, all the previously documented trading style effects remain strongly significant in these tests. This result indicates a separate venue for trading styles to impact performance through investor (un)sophistication rooted in currently unidentified psychological causes. We make several contributions to the finance literature. To the best of our knowledge, ours is the first study to document the use of different options strategies by institutional and retail accounts. The granularity of the investor account-level analysis of the whole market generally complements and expands previous analysis at the investor class level by Lakonishok et al. (2007).4 With cleanly identified risk exposure of options traders’ positions, our evidence sheds important new light on the motivations for trading options. Specifically, we show that sophisticated strategies such as volatility trading and Greek neutral trading are commonly used by institutional investors and certain retail investors, and that most options traders favor a particular class of trading strategies. Although the use of account-level data to examine options trading behavior in Li et al. (2021) is closely related to our work, their focus is investors’ trend chasing and contrarian trading around a specific bubble in the Chinese warrant market rather than a whole spectrum of options strategies. Also related to our study, Han et al. (2009) and Kuo et al. (2015) use account data from the Taiwan index options market to examine how investors use individual option contracts. Unlike those studies, our analysis is at the strategy level which consolidates individual option positions. More importantly, we show how the trading style chosen by each account, as an ex ante measure of investor sophistication and trading skill, affects the investment outcome. Our evidence shows that investor performance in terms of both the average return and Sharpe ratio is positively correlated with complexity of the dominant strategy chosen by the investor. These persistent style effects do not derive from systematic risk exposures or other known factors such as behavioral biases, which consequently suggests a novel channel for investor sophistication to manifest itself in financial markets. 4Other studies examine options trading in international markets (see Bauer et al., 2009; Chaput and Ederington, 2003; Fahlenbrach and Sandås, 2010; Flint et al., 2014). However, these studies are compromised by various data issues including: a limited sample; a lack of account-level transactions and positions data; an inability to compare institutional and retail investors. In contrast, our study uses a comprehensive data set of account-level transactions and positions in Korean index options and futures, which allows us to examine in detail the option trading strategies of different types of investors. 6 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 51,
    "chunk_index": 13,
    "word_count": 521,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "an inability to compare institutional and retail investors. In contrast, our study uses a comprehensive data set of account-level transactions and positions in Korean index options and futures, which allows us to examine in detail the option trading strategies of different types of investors. 6 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 51,
    "chunk_index": 14,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "We also contribute to the debate surrounding retail investor sophistication. The finance literature has traditionally regarded retail traders as uninformed and biased traders who routinely commit mistakes and incur losses in the stock and futures markets (e.g., Odean, 1999; Barber and Odean, 2000; Barber et al., 2009; Kuo et al., 2015). However, several recent studies posit that retail equity traders may be informed, as their aggregate trading predicts future stock returns (see Kaniel et al., 2008; Kaniel et al., 2012; Kelley and Tetlock, 2013, 2017; Boehmer et al., 2021). Unlike the studies on aggregate retail trading, we focus on the variation in trading styles across retail investors in the options market. Our results show that although retail investors as a class underperform, a subset is highly profitable by trading volatilities or by using complex Greek neutral strategies, which are more commonly adopted by institutions. Moreover, we show that the sophisticated retail investors behave like Bayesian learners and choose an optimal strategy. In contrast, retail investors predominantly using simple strategies fail to achieve success as they do not learn from their better performance in other more complex strategies. Our evidence potentially explains why certain retail investors outperform their peers in derivatives trading (Bauer et al., 2009). It also points to the inadequacy of analyzing retail investors as a class due to retail investors’ exhibiting significant differences in sophistication that affect trading outcomes. Our study is also related to the literature on product complexity and investment performance. Evidence is available to show that retail demand for complex structured products is difficult to rationalize and is likely driven by behavioral factors, as these products are designed to be more profitable for the issuers (Henderson and Pearson, 2011; Li et al., 2018; Hens and Rieger, 2011; Célérier and Vallée, 2016). Our study shows that in a market where an investor can freely choose among strategies, the selection of a particular strategy and its level of complexity reflects the investor’s knowledge and ability. Accordingly, investors who self-select into complex strategies perform better than do those using naive simple strategies. Our results indicate that although access to complex financial products may be valuable to certain investors, access to these products should not be granted automatically to all investors in the market. The rest of the paper proceeds as follows. Section 2 provides a description of the KOSPI 200 derivatives markets and our data. Section 3 examines the various trading styles used by option investors. Section 4 analyzes the profitability of the different types of investors. Section 5 presents additional analyses of investor behavior and trading style effects. Section 6 concludes the paper. 2. Background and Data Description We use a unique transaction-level data set from South Korea's main index derivatives markets. The data contains all options and futures trades at the Korea Exchange (KRX) from January 2010 to June 2014 with detailed account information, such as anonymous account identity, investor class 7 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 51,
    "chunk_index": 15,
    "word_count": 491,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "We use a unique transaction-level data set from South Korea's main index derivatives markets. The data contains all options and futures trades at the Korea Exchange (KRX) from January 2010 to June 2014 with detailed account information, such as anonymous account identity, investor class 7 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 51,
    "chunk_index": 16,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "(institution or retail), and country of domicile. The options and futures contracts have the same underlying asset, the Korea Composite Stock Price Index (KOSPI 200), which comprises the 200 largest companies listed on KRX, thus representing Korea’s overall stock market. The options contracts follow a monthly expiration cycle, and the futures follow a quarterly cycle. Figure 1 plots the KOSPI 200 index return as well as the VKOSPI implied volatility index during our sample time period. The sample contains both normal periods and times of market stress with high volatility, and therefore represents different market conditions. The market crash in August 2011 and the subsequent spike in volatility were due to the European debt crisis combined with a credit rating downgrade of the U.S. sovereign debt, which affected global markets including Korean markets. [Figure 1 about here] A unique advantage of our data set is that the KOSPI 200 index was reserved by the KRX to list only futures and options during our sample period. Therefore, the KRX data allow us to observe an investor’s full exposure to the underlying index to determine the strategy adopted by the investor. Nonetheless, other passive exchange-listed products such as ETFs track similar equity indices, and an options investor could use KOSPI 200 options to hedge ETF or cash stock portfolios. We acknowledge that lack of account information about the stock positions will almost certainly lead us to misclassify some investment strategies. However, this measurement error may have only limited impact due to relatively small market size of the ETFs compared to KOSPI 200 futures. According to data from KOSCOM, the total trading volume of all the ETFs related to KOSPI 200 is KRW₩354 billion per day in our sample period, while the futures trading volume reaches almost KRW₩28 trillion per day. Given the liquidity difference, we argue that investors’ linear exposure to broad-market Korean equities is most likely captured by KOSPI 200 futures. In Section 4, we also use a robustness test to directly address the potential bias arising from this measurement error. Both KOSPI 200 options and futures markets are order-driven and do not have designated market makers for the provision of liquidity. Orders submitted by investors are collected in a central electronic limit order book and are executed according to price and time priority rules. The regular continuous trading session runs from 9:00 to 15:05 KST. Two auctions determine the open and close prices: one from 8:00 to 9:00 (open); and the second from 15:05 to 15:15 (close). For every transaction, the data contain a millisecond time stamp, account IDs of both counterparties, and bid and ask order submission times, which together allow us to determine the order flow and each account’s long/short position. In order to accurately describe market activities and investor performance, we focus on both options and futures contracts introduced since 2010, for which our data contain the full history of investors’ positions. Table 1 reports summary statistics of the aggregate activity in the KOSPI 200 options market, including the number of transactions, trading volume (number of contracts traded), and total options 8 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 51,
    "chunk_index": 17,
    "word_count": 520,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "contracts introduced since 2010, for which our data contain the full history of investors’ positions. Table 1 reports summary statistics of the aggregate activity in the KOSPI 200 options market, including the number of transactions, trading volume (number of contracts traded), and total options 8 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 51,
    "chunk_index": 18,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "premium. In Table 1 Panel A, we first calculate these statistics for each day, and then we calculate their time-series mean and median. We can see that the Korean options market is highly active and liquid during our sample period, with a daily mean (median) number of transactions of more than 900,000 (800,000) and trading volume of approximately 7.8 (5.1) million contracts. These correspond to daily mean (median) options premium of KRW₩1,197 (1,100) billion, equivalent to approximately 1 billion USD traded each day. The subsequent panels in Table 1 contain summary statistics for different subsamples of the data. Table 1 Panel B shows that trading activity is about equally split between call and put contracts, with call options having slightly higher trading volume (4.1 million contracts) compared to put options (3.7 million contracts) on an average day. Next, Table 1 Panel C describes average trading activity by option moneyness. Moneyness of a call (put) option is defined by the ratio of the underlying spot price (strike price) to the strike price (underlying spot price). We define an option as out of the money (OTM) / at the money (ATM) / in the money (ITM) if its price ratio is less than 0.95 / between 0.95 and 1.05 / greater than 1.05. As is typically the case in options markets, on an average day, ATM options are the most actively traded (5.5 million contracts), followed by OTM options (2.25 million contracts), while ITM options attract little trading volume (only 13,516 contracts). In addition, we can see in Table 1 Panel D that contracts which are closer to maturity are significantly more liquid, as expected. For options which have 40 or fewer days to maturity, the trading volume reaches more than 8 million contracts on an average day. In contrast, options with more than 40 days to maturity attract little trading activity. Finally, Table 1 Panel E shows that most trading activity takes place during normal trading hours, i.e., the daily continuous trading session from 9:00 to 15:05 KST. [Table 1 about here] Each investor account in our data set has a unique encrypted ID.5 In total, there are 161,010 option trader accounts. Despite the conventional wisdom that derivatives trading requires advanced financial knowledge and is more suitable for sophisticated investors such as institutions, there are no restrictions in the Korean derivatives markets regarding retail investor participation. Moreover, the KOSPI options have low notional values, which make them affordable to retail investors.6 As a result, retail participation in the Korean options market is high. Domestic retail investors hold 153,835 accounts, constituting 95.5% of all the accounts in our sample. Based on the population of South Korea in 2010, this entails about three options traders per every thousand people.7 Domestic institutions and 5 One regulation gray area is the offshore over-the-counter transactions between foreign brokers and their clients. In these cases, the clients may not need to obtain an ID at the KRX, and the broker’s position is an aggregate position of its proprietary trades and clients’ trades. 6 The contract size of each KOSPI 200 option was approximately USD$22,714 compared to E-mini S&P 500 options contract size of approximately USD$71,000 at that time. The KRX increased the KOSPI option contract size five times after June 2012. We verify that the contract change has no impact on our main results. 7 Although a retail investor can open multiple accounts, it is unlikely that all the accounts are actively used given dynamic margin requirements. In our performance analysis, we exclude inactive accounts to address the potential multiple account concern. 9 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 51,
    "chunk_index": 19,
    "word_count": 601,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "no impact on our main results. 7 Although a retail investor can open multiple accounts, it is unlikely that all the accounts are actively used given dynamic margin requirements. In our performance analysis, we exclude inactive accounts to address the potential multiple account concern. 9 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 51,
    "chunk_index": 20,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "foreign institutions hold 5,904 and 667 accounts in the data, respectively. In addition, the data set contains 604 foreign retail accounts. Table 2 provides summary statistics of the options trading activity of the different investor classes. For each account and each day, we calculate the number of transactions, trading volume, and premium. Reported are daily averages for the aggregate trading activity of all accounts in each investor class, as well as the average account activity for that investor class. Given two counterparties to each transaction, we report separate statistics for liquidity takers and liquidity providers. The goal is to measure the amount of activity in each of these groups generated by institutions and the amount generated by retail investors. We compare the bid and ask order submission times and mark the investor who submitted their order first as the liquidity provider and the investor whose order matched the first one as the liquidity taker. The results in Table 2 exclude a small number of transactions—around 0.1% of the full sample—in which the two orders cross at the same time, hence the liquidity taker and liquidity provider cannot be identified. As expected, an average institutional account generates substantially larger trading volumes and premium compared to an average retail account. On an average day, an average retail investor takes (provides) liquidity in around 19 (27) transactions for 109 (157) option contracts. In comparison, an average institution takes (provides) liquidity in around 1,123 (812) transactions for 10,085 (8,230) option contracts on an average day. Table 2 also shows that institutional investors as a class tend to be liquidity takers: They initiate trades in almost six million contracts while providing liquidity in only 4.8 million contracts on an average day. On the other hand, retail investors as a class provide liquidity in almost three million option contracts and initiate trades in 1.9 million contracts, thus they generally provide more liquidity than they take. We find the same patterns when we look at the aggregate number of transactions or the aggregate option premium. [Table 2 about here] 3. How Do Investors Use Options? The multitude of trading opportunities that the options market allows makes it a unique investment arena. Stock traders can only get linear payoffs and are sometimes constrained in short selling. In contrast, options traders can gain specific risk exposure to both the underlying stock price and volatility, by constructing various payoff structures with diverse levels of complexity. For example, unsophisticated investors may view options as leveraged stocks and speculate on price movements using simple positions such as long calls or long puts. Meanwhile, investors with greater skill may use options to construct hedged positions and to limit risk exposure with strategies such as bull/bear spreads, or to trade on volatilities using straddles and strangles. We conjecture that the complexity of options 10 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 51,
    "chunk_index": 21,
    "word_count": 475,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "long calls or long puts. Meanwhile, investors with greater skill may use options to construct hedged positions and to limit risk exposure with strategies such as bull/bear spreads, or to trade on volatilities using straddles and strangles. We conjecture that the complexity of options 10 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 51,
    "chunk_index": 22,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "strategies used by different investors reflects their financial knowledge, trading skills, and level of sophistication. The data indicate that about two-thirds of retail accounts trade only options, and the remaining one-third trade both options and futures. This pattern reverses for institutional accounts: about one-third trade only options, and two-thirds trade both options and futures. In this section, we present detailed evidence of the popularity of different trading strategies used by options traders. 3.1. Strategies in Account-Days First, we separate accounts into day traders and position holders. We define day traders as accounts that only trade intraday and never hold a position overnight throughout our sample. The remaining accounts which hold option contracts overnight are position holders. Then, we use the transactions data to construct the end-of-day positions held by each account and extract the corresponding strategies. Table 3 examines the popularity of different options strategies used by position holders. More than 80% of end-of-day positions can be classified as one of the classic options strategies, which we group into five main categories: (i) combinations of options and futures; (ii) simple strategies; (iii) volatility trading strategies; (iv) option spreads; and (v) other options strategies. We report the number of account-day positions in each strategy as a percentage of all account-days with non-zero end-of-day position in options, as well as the number of option contracts held in each strategy as a percentage of total end-of-day open positions. The table contains results for the whole market as well as for each investor class separately. Because of overwhelming variation in options strategies, in this table we only report results for those broad classes of options strategies that may relate to investor sophistication. For more granular strategies, we refer interested readers to our Table I in the appendix.8 [Table 3 about here] A classic motivation for using options is to hedge the underlying asset risk in strategies such as covered calls and protective puts. We first examine this class of strategies consisting of combinations of options and futures. We label an account-day as using the combination strategy if the end-of-day position has both futures and options. Table 3 shows that combinations of options and futures are held in 6.24% of all account-days and 37.6% of all open positions. They are more prevalent among institutional investors as they constitute 34.4% (55.4%) of all institutional account-days (open positions). In comparison, only 5.42% (10.5%) of retail account-days (open positions) hold combinations. In Table I of the appendix, we take a closer look at the applied strategies and observe 8 The supplementary Table I in the appendix provides additional details about the breakdown of strategies within each of the five main categories. For example, within the combinations of options and futures category, we report long covered calls, short covered calls, long protective puts, short protective puts, Greek neutral positions, and other combinations. 11 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 51,
    "chunk_index": 23,
    "word_count": 479,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "additional details about the breakdown of strategies within each of the five main categories. For example, within the combinations of options and futures category, we report long covered calls, short covered calls, long protective puts, short protective puts, Greek neutral positions, and other combinations. 11 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 51,
    "chunk_index": 24,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "that well-known hedging strategies such as covered calls and protective puts are rarely used: These constitute fewer than 16% of all options-and-futures combinations.9 The rest are complex combinations which we explore later. Next, we turn to a class of simple strategies consisting of positions in only one type of option contract: only long calls, short calls, long puts, or short puts. These options positions provide directional exposure to the underlying and are often regarded as naked options by practitioners. Table 3 shows that a surprisingly large percentage of account-days hold positions in simple strategies. Simple strategies account for 55.7% of the account-days in the data. We observe a clear disparity in the popularity of these strategies among retail and institutional investors. Simple strategies account for 56.8% of retail account-days but only 18.8% of institutional account-days. Because the prevalence of simple strategies is rooted in retail interest, these account-days are comparatively small, amounting to only 7.14% of the open positions. Table I in the appendix shows that long calls and long puts compose the majority of retail positions in simple strategies, while institutions tend to hold comparatively more short calls. Our third class of options strategies is volatility trading strategies, in which multiple options are used to achieve neutral exposure to the underlying price movement but retain value sensitivity to the underlying volatility dynamics. These strategies include straddles, strangles, and butterflies. We are able to identify all straddles/strangles created with two different option contracts, as well as some combinations of straddles/strangles created with more than two different contracts. For example, if a position consists only of long calls and long puts, we can classify it as a combination of long straddles/strangles regardless of the specific number of different contracts used. We similarly extract butterflies created with three different option contracts. We verify that these positions are indeed motivated by volatility exposures because the long (short) volatility strategies have an average delta of 0.01 (−0.02) and an average vega of 0.11 (−0.16). However, our classification will understate the popularity of volatility trading because we are unable to capture more complex strategies and combinations of strategies. Table 3 shows that at least 16.5% of all account-days engage in volatility trading, and their positions make up 7.24% of all the open positions in the market. Overall, options appear to be more widely used for volatility trading than Lakonishok et al. (2007) suggest. Therefore, options are an important instrument for trading on or hedging underlying volatility and they are not used solely for speculating on underlying price changes. Interestingly, volatility trading is more popular among retail investors than institutions. Volatility strategies constitute 16.7% (13.9%) of retail account- days (open positions), compared to 9.4% (2.9%) of institutional account-days (open positions). According to Table I in the appendix, strangles as well as combinations of strangles and/or straddles are the most commonly used volatility strategies, while butterflies are used only rarely. 9 We only examine aggregate exposures from each class of assets to determine the exact combination strategy. For example, if an account-day position has long futures and short calls, we classify that as long covered calls regardless of how many different futures and call option contracts are used. 12 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 51,
    "chunk_index": 25,
    "word_count": 537,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "aggregate exposures from each class of assets to determine the exact combination strategy. For example, if an account-day position has long futures and short calls, we classify that as long covered calls regardless of how many different futures and call option contracts are used. 12 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 51,
    "chunk_index": 26,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "The fourth class of strategies consists of option spreads that primarily deliver truncated payoffs using multiple options, e.g., bull spreads, bear spreads, and calendar spreads. Option spreads such as synthetic stocks can also be used as leveraged bets. In our sample, spreads do not seem to be widely used by option investors. Only 3.7% of account-days hold spreads, and their positions account for less than 3% of all open positions. The spreads seem to be slightly more popular among institutions rather than among retail investors, with 9.5% of institutional account-days holding spreads, as compared to 3.5% of retail account-days, but they account for only 2.65% of all institutional open positions. Table I in the appendix shows that 75.5% of all spreads in the data are bull/bear spreads. However, due to the relative unpopularity of spreads, we do not examine this class of strategies in greater detail. Finally, the remaining group of other options strategies consists of complex combinations of option contracts which do not fall into any of the categories of classic strategies discussed above. These unclassified positions make up almost 18% of all account-days and 45% of all open positions in the market. Because no designated market makers are present in the KOSPI 200 derivatives markets, large positions in complex combinations of multiple different contracts can reflect the possible activity of market makers as well as arbitrageurs. We would expect these types of traders to have almost risk- neutral end-of-day positions. Well-hedged positions such as these may also involve futures. Indeed, we find that the majority of options and futures combinations do not fit in any classic strategy. To identify such Greek neutral positions, we start by collecting the account-days without an assigned strategy. We examine their Greeks exposure by focusing on delta, which measures the exposure of an option position to changes in the underlying price, and vega, which measures the sensitivity to changes in the underlying volatility. We scale end-of-day delta and vega exposure by the number of lots held by the account on that day. Next we categorize as Greek neutral those positions below the median in terms of both absolute scaled delta exposure and absolute scaled vega exposure.10 In total, Greek neutral strategies are used by about 7% of all account-days and comprise 40.6% of all open positions in the market (refer to Table I in the appendix). Because these strategies are complex and require both skill and capital to execute, they are more popular among institutions. Around 21.2% of institutional account-days use Greek neutral strategies; these represent 44.3% of institutional open positions. In contrast, only 6.7% of retail account- days are Greek neutral, but these retail accounts are likely to be larger than their peers, holding almost 35% of all retail open positions. Overall, we observe rich variation in options trading strategies in our data, and a significant difference in the complexity of strategies used by institutions and retail investors. A large portion of retail positions are in simple option strategies, while institutional positions occur in a variety of more involved strategies. Nevertheless, we do observe retail positions in sophisticated strategies such as 10 The median appears to be an appropriate cutoff for defining the Greek neutral positions since they have an average absolute delta of 0.01 and an average absolute vega of 0.01. In comparison, the rest of the positions which are above the medians have an average absolute delta of 0.14 and an average absolute vega of 0.09. 13 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 51,
    "chunk_index": 27,
    "word_count": 582,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "neutral positions since they have an average absolute delta of 0.01 and an average absolute vega of 0.01. In comparison, the rest of the positions which are above the medians have an average absolute delta of 0.14 and an average absolute vega of 0.09. 13 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 51,
    "chunk_index": 28,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "volatility trading and Greek neutral strategies, as well as observing institutional positions in simple strategies. Therefore, considerable heterogeneity certainly is present in options trading strategies across investor classes as well as within each investor class. 3.2. Dominant Strategy by Account To test the conjecture that the complexity of a chosen trading style reflects investor skill, we need to extract the dominant trading strategy of each account. We first exclude any accounts that are relatively inactive because these accounts tend to have extreme performance. For example, an investor can lose one hundred percent of their capital if their only trade in the sample is a purchased option that expires out of the money. We mark an account as inactive if any of the following five conditions are met: (i) the account appears in the options data for only a month or less; (ii) the account is a day trader who trades options on less than two days per month on average; (iii) the account is a position holder who trades options and holds option positions on less than two days per month on average (in the months when the account appears in the data); (iv) an account’s total trading volume throughout the sample period is in the bottom fifth percentile (≤ 22 lots traded); or (v) an account’s total number of active days in the options market is in the bottom fifth percentile (≤ 2 active days). Almost 24% of accounts are inactive, and we subsequently exclude these from all further analyses. Most (16.5%) are excluded because they appear in the options data for less than a month, and the rest (7.4%) are excluded due to infrequent activity. We are left with a total of 122,620 active option trader accounts. We define the trading style of each account by extracting the account’s dominant strategy. We group investors into the following five main trading styles: day traders, simple strategy traders, volatility traders, Greek neutral traders, and others. We identify the dominant strategy as the most frequently used strategy observed in at least 60% of an account’s end-of-day positions. For example, if at least 60% of an account’s positions are in simple strategies, then we define that account as a simple strategy trader. We use the same definition to mark volatility traders and Greek neutral traders.11 In addition to investors with an identified dominant strategy, we recognize another group of investors who either switch frequently between strategies—thereby showing no dominant strategy—or who primarily use less popular strategies such as option spreads. We label this remaining category as “Others” and use it as the benchmark in the subsequent performance analyses. Table 4 reports the number of accounts and their average trading volume according to trading style and investor class. [Table 4 about here] About 76% of retail investors and 50% of institutional investors have a dominant strategy, indicating that adhering to one strategy in trading options is common for investors, especially retail 11 Our inferences are robust to alternative cutoff points such as 70% or 80%. 14 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 51,
    "chunk_index": 29,
    "word_count": 508,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "here] About 76% of retail investors and 50% of institutional investors have a dominant strategy, indicating that adhering to one strategy in trading options is common for investors, especially retail 11 Our inferences are robust to alternative cutoff points such as 70% or 80%. 14 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 51,
    "chunk_index": 30,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "investors. Day traders (3,747 accounts) compose 17% of institutional accounts and 2.6% of retail accounts. The average day trader generates significantly large mean daily volumes, and day trading activity accounts for about 10% of total trading volume in the market each day. Simple strategy traders are the largest group in terms of number of investors (79,037 accounts) since 66% of retail investors use this strategy predominantly, as well as 19% of institutions. Due to the large number of accounts in this group, simple strategy traders lead in terms of aggregate volumes, generating around 37% of total trading volume in the market. However, an average simple strategy trader generates the lowest mean daily trading volume among all traders, which is likely due to small capacity of retail accounts in this category. Volatility traders (6,106 accounts) represent 4% of institutions and 5% of retail investors. These traders also generate relatively low volumes on average, perhaps because their strategies consist of holding positions for longer periods of time rather than trading frequently. Only 2.6% of investors (3,249 accounts) are identified as Greek neutral traders; this is not surprising given the complex skills and trading capacity required to use such strategies. We again observe that Greek neutral strategies are more popular among institutional investors, as almost 10% of institutions are shown to be Greek neutral traders. At the same time, 2.4% of retail accounts are also skilled at constructing these well-hedged positions. These retail investors are likely to be exceptionally sophisticated and trade similarly to institutional investors. An average Greek neutral trader account generates the largest mean daily trading volume of all types of traders, especially if it is an institutional account. This is consistent with our conjecture that these Greek neutral traders are likely acting as market makers or arbitrageurs. Finally, the remaining investors in the category “Others” constitute about 25% of all investors (30,481 accounts), which corresponds to 50% of institutions and 24% of retail traders. Although as a large group their aggregate volumes are also large, an average trader in this category tends to generate a low mean daily volume. 4. Who Profits From Trading Options? After describing the most commonly used options trading styles, we proceed to analyze account performance. We hypothesize that, comparing traders along a spectrum of strategy complexity, volatility traders and Greek neutral traders will fall above the benchmark group (“Others”) and simple strategy traders will fall below the benchmark group (“Others”) in terms of sophistication. The prediction regarding day traders is less clear because day trading can appear easy to execute but success depends on different factors including risk management and attention allocation. 4.1. Performance Measures To analyze the relation between trading styles and investment performance, we need profitability measures. We begin with total account profitability in dollar terms. For each investor 15 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 51,
    "chunk_index": 31,
    "word_count": 472,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "easy to execute but success depends on different factors including risk management and attention allocation. 4.1. Performance Measures To analyze the relation between trading styles and investment performance, we need profitability measures. We begin with total account profitability in dollar terms. For each investor 15 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 51,
    "chunk_index": 32,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "account, we use the transactions records to calculate the total cumulative dollar profit and loss ($P&L) generated over the sample period. However, in addition to skills, profitability in dollar terms is also affected by account size, capital constraints, and length of investment period. In order to remove these effects, we calculate for our main performance measure a standardized return measure that is equal to profitability per dollar of capital invested. Because derivatives trading utilizes margins, our return measure can differ from the commonly used returns based on the logarithmic price differences. Options buyers always pay the full premium of purchased contracts, and the capital requirement is the same as the option price. Therefore, for long option positions, our return is the same as the traditional return. However, options sellers do not receive the sale proceeds and instead are required to deposit a margin.12 Moreover, the margin requirements vary with the position value, which is marked to market every day. For these short positions, our return differs from the traditional return because the dynamic capital requirement is not equal to the initial trade price. Our options return reflects the unique feature of margins in derivatives trading and accurately depicts the profit and loss per dollar of investment. Therefore, our return is a more fitting measure of investment skills than is the traditional return. However, we acknowledge that returns to option positions are unable to capture an important aspect of investor capability, which is position sizing. Based on capital requirement, our option returns would reflect the embedded leverage in option contracts and consequently exhibit extreme values. One example of extreme leverage is far out-of-the-money penny options. Given the low option price, a small change can lead to an elevated rate of return. Another example is option expiration. In general, any contract that expires out of the money would be reflected as a loss of one hundred percent. In reality, options traders usually do not invest the full amount of their capital all the time. A holistic measure of investment skill would be the return to the whole portfolio including non-margin cash positions. Unfortunately, the exchange data we obtained do not include information on cash positions in each account. Therefore, in our analysis of investor skills, we focus on the skill of choosing option portfolios and we do not address the position-sizing skill. Formally, we start by separating all transactions into intraday transactions and transactions that create positions held overnight because intraday trading carries different capital requirements from positions held over longer periods. Round-trip trades which open and close a position on the same day are marked as intraday transactions. Trades which open a new position that is held at the end of the day, and trades which close an existing position from the previous day, are both marked as transactions which create end-of-day positions. Opening and closing transactions are matched consistently based on the “first-in, first-out” method, whereby inventory assets acquired first are sold first. For each account and each trading day, we separately calculate $P&L from end-of-day positions and $P&L from intraday trades. Margin settlement is daily, and end-of-day capital requirements are based on the value of end- 12 Margin requirements are set by the Korea Exchange (KRX). The margin rate for short trades ranges between 10.5% and 15% of the contract value throughout our sample period. 16 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 51,
    "chunk_index": 33,
    "word_count": 562,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "Margin settlement is daily, and end-of-day capital requirements are based on the value of end- 12 Margin requirements are set by the Korea Exchange (KRX). The margin rate for short trades ranges between 10.5% and 15% of the contract value throughout our sample period. 16 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 51,
    "chunk_index": 34,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "of-day position holdings.13 In addition, investors who trade intraday are subject to intraday capital requirements. We take the maximum daily amount used by an account for intraday trading as their intraday capital requirement for that day. Finally, we sum each account’s daily $P&L from positions plus $P&L from intraday trades, and scale it by the sum of capital requirement at the end of the previous day and intraday capital requirement. The scaled P&L is therefore a rate of return to each dollar of capital invested in KOSPI derivatives. The formula below summarizes our method for calculating daily returns for each account: Daily return (cid:3404) Total daily $P&L / Total daily capital requirement (cid:4666) $P&L from end-of-day positions (cid:3397) $P&L from intraday trades (cid:4667) (cid:3404) . (cid:4666) Lag of end-of-day capital requirement (cid:3397) Intraday capital requirement (cid:4667) To investigate performance differences across accounts, we take the mean of daily returns of the same account during the whole sample period.14 Moreover, to assess investment efficiency conditioning on the level of risk taken, we calculate the Sharpe ratio of each account as the mean daily return divided by the standard deviation of daily returns. 4.2. Summary Statistics of Investment Performance To provide an initial look at who profits in the options market, we start our analyses by presenting some summary statistics of the performance measures. Table 5 reports the cross-sectional averages and percentiles of total account $P&L in millions of KRW, account mean daily return, and account Sharpe ratio, in each category of investors among the 122,620 active option trader accounts. First, Table 5 Panel A shows statistics by investor class. A clear gap is shown in the performance of institutions and retail investors. Total account $P&L illustrates the magnitude of investors’ gains or losses in dollar terms.15 We can see that the average (median) institutional account gains KRW₩ 518.1 (8.8) million over the whole sample period. In contrast, the average (median) retail investor loses KRW₩25.5 (5.5) million during our sample period. This loss is economically significant, as it represents a substantial portion—approximately 97% (21%)—of Korean annual household disposable income per capita over the same period, according to data from OECD. The underperformance by retail investors is pervasive as even the 70th percentile retail investor incurs a loss of KRW₩ 0.8 million. 13 End-of-day positions are marked to market based on the last daily best bid and offer (BBO) quotes midpoint on non-expiration dates. If a position is held until maturity, the final settlement price is based on the underlying index value. 14 We do not include inactive days when the account has no transactions and no end-of-day positions. 15Given that derivatives trading is a zero-sum game, the total dollar profits generated by all accounts in the data sum to zero (including inactive accounts, accounts that trade only futures but not options, and accounts excluded due to missing information about their investor class). 17 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 51,
    "chunk_index": 35,
    "word_count": 486,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "15Given that derivatives trading is a zero-sum game, the total dollar profits generated by all accounts in the data sum to zero (including inactive accounts, accounts that trade only futures but not options, and accounts excluded due to missing information about their investor class). 17 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 51,
    "chunk_index": 36,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "After adjusting for account size, we see that an average (median) institutional account has mean daily return of 0.04 (0.01), compared with −0.02 (−0.02) for an average (median) retail account. This level of difference in the mean daily return of institutions and retail investors, equal to 6% on average, is highly economically significant and reflects the superior ability of institutional investors in choosing option portfolios. Although the magnitude of the return differential may seem overwhelming, recall that options traders would typically invest only a fraction of their total capital in risky leveraged positions. Our measure reflects only the return to their options portfolio and not the return to their whole portfolio, which likely includes non-margin cash positions. Another reason for the large magnitude of our returns is the fact that we focus on investors’ active days in the calculation of mean daily returns. Inactive days with no transactions and no positions in the market are dropped rather than being marked as zero return. In the sample, inactive days on average represent 50% of the period from an account’s initial market entrance to final market exit. Including those days reduces the magnitude of mean returns but does not materially change our conclusions. After we adjust for the portfolio risk, the performance gap between institutions and retail investors widens even more. An average (median) institutional account has a Sharpe ratio of 0.09 (0.07), equal to 1.43 (1.11) annualized. In comparison, an average (median) retail account has a Sharpe ratio of −0.08 (−0.07), equal to −1.27 (−1.11) annualized. In fact, positive Sharpe ratios are achieved by about 70% of institutions but only 30% of retail investors. Next, in Table 5 Panel B, we turn to investor trading styles as defined by the dominant strategy. On average, all the trading styles have positive $P&L except simple strategy traders. The average (median) simple strategy trader loses a total of KRW₩ 27 (6.4) million over the sample period, and simple strategy traders start to be profitable only at the 90th percentile. At the median, only Greek neutral traders gain a positive $P&L, equal to KRW₩ 1.8 million in total over the sample period. These results indicate that the distribution is right-skewed with a few accounts generating large dollar profits in each trading style. The distribution of mean daily returns, on the other hand, is less skewed, with the means and medians being similar in magnitude and sign. We use the accounts in the “Others” category (those without an identifiable dominant strategy) as a benchmark group for evaluating the performance of the main trading styles. The average (median) benchmark account has mean daily return of 0.02 (0.00). The average (median) day trader has mean daily return equal to 0.01 (0.00), slightly lower than (equal to) that of the benchmark group. Simple strategy traders have the worst performance throughout the distribution and are the only group with negative profitability even at the 70th percentile. An average (median) simple strategy trader has a mean daily return of −0.04 (−0.04). The mean daily return of simple strategy traders is lower than the benchmark group by 6% on average, which is a large and economically significant underperformance. Consistent with our hypothesis that investors who use 18 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 51,
    "chunk_index": 37,
    "word_count": 540,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "strategy trader has a mean daily return of −0.04 (−0.04). The mean daily return of simple strategy traders is lower than the benchmark group by 6% on average, which is a large and economically significant underperformance. Consistent with our hypothesis that investors who use 18 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 51,
    "chunk_index": 38,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "complex strategies are more sophisticated, we find that volatility traders and Greek neutral traders outperform their peers. An average (median) volatility trader generates a mean daily return of 0.09 (0.02).16 Compared with the benchmark group “Others,” volatility traders have a mean daily return higher by 7% on average. Volatility traders have the highest mean daily returns among all accounts at all percentiles above the median. Greek neutral traders also perform well, with an average (median) account having mean daily return of 0.04 (0.02). Focusing on risk-adjusted performance, we see that the Sharpe ratio of an average (median) day trader is close to zero at 0.01 (0.01), which is equal to 0.16 (0.16) annualized. An average (median) simple strategy trader has once again the worst profitability among all the trading styles, with a Sharpe ratio of −0.13 (−0.12), equal to−2.06 (−1.90) annualized. Although volatility traders outperform in terms of mean return, their Sharpe ratios are not as high. The average (median) volatility trader has a Sharpe ratio of 0.04 (0.05), equal to 0.63 (0.79) annualized. The fact that Sharpe ratios are low for volatility traders is due to the large variance of their performance (the average volatility trader has standard deviation of daily returns equal to 1.04, higher than that of all other traders including the benchmark group with 0.58). Volatility strategies are also subject to large downside risk exhibited by the negative skewness of their performance (−0.83, compared to −0.29 for the benchmark group and positive skewness for all other trading styles). In comparison to volatility traders, Greek neutral traders on average generate lower returns, but their strategies are risk neutral. This allows them to outperform everyone else in terms of the Sharpe ratio, which is equal to 0.09 (0.10), or 1.43 (1.59) annualized, for an average (median) Greek neutral trader. In particular, the median Greek neutral trader has a Sharpe ratio twice as large as that of the median volatility trader. [Table 5 about here] 4.3. Multiple Regression Analysis Our univariate analysis so far indicates that both investor class and trading styles may affect investment performance. We then examine their joint effects using multiple regressions. Table 6 presents the results of account-level regressions testing the relation between account profitability and investor type. The dependent variable is the mean daily return in Table 6 Columns 1−3. The first regression tests the effect of investor class on returns. The independent variable is a dummy variable equal to one if the account is an institutional investor, or zero if the account is a retail investor; hence, the intercept represents the retail investors. The coefficient on the institutional dummy is positive and 16 Due to the profits of volatility trading strategies depending on the market conditions during a particular time period, it is significant that our sample can be considered representative, as it contains both periods of low volatility and periods of market stress with spikes in volatility. Refer to Figure 1 for a time series plot of the VKOSPI implied volatility index. 19 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 51,
    "chunk_index": 39,
    "word_count": 506,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "time period, it is significant that our sample can be considered representative, as it contains both periods of low volatility and periods of market stress with spikes in volatility. Refer to Figure 1 for a time series plot of the VKOSPI implied volatility index. 19 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 51,
    "chunk_index": 40,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "highly significant (t-stat = 21.67), thereby confirming the outperformance of institutions over retail investors. The second regression uses as independent variables the trading style dummies for day traders, simple strategy traders, volatility traders, and Greek neutral traders. The intercept represents our benchmark group which consists of the remaining accounts in the category “Others,” those traders without an identifiable dominant strategy. All coefficients are statistically significant and confirm our earlier observations. Day traders show slightly lower performance than the benchmark group with a coefficient estimate of −0.012 on the Day trader dummy (t-stat = −4.17). Simple strategy traders form the category that underperforms the benchmark the most, and the negative coefficient (−0.065) on that group is highly significant (t-stat = −60.52). On the other hand, sophisticated trading styles outperform the benchmark. Specifically, volatility traders outperform most notably in terms of mean return, and that category exhibits a strongly significant positive coefficient (0.064, t-stat = 28.59). The third regression combines the investor class dummy and the trading style dummies. All coefficients keep the same sign and remain statistically significant. However, the performance difference between institutional and retail investors decreases by about 50% (from 0.057 to 0.03) when we examine investor class and trading styles in the same model. In contrast, incorporating investor class into the model has little impact on the significance of the trading styles. Although our results indicate that both investor class and trading styles measure investment skill and are related to performance, evidence points to style effects being stronger than the investor class effect. Regressions 4–6 repeat the same analyses but with Sharpe ratio as the dependent variable. Generally, the results are consistent with our analysis of mean returns in Table 6 Columns 1−3, and statistically significant. The one notable difference in these regressions is the outperformance of Greek neutral traders. In regression 5, for example, they exhibit the largest positive coefficient (0.078) which is highly significant (t-stat = 19.37). While volatility traders are the top performers in terms of raw returns, Greek neutral traders are superior on a risk-adjusted basis due to their well-hedged positions carrying lower risks than volatility strategies. [Table 6 about here] Overall, Table 6 presents our key findings in support of our hypothesis that both investor class and trading style complexity measure investor sophistication and trading skills. The results indicate that trading styles have an important effect on investment performance, in addition to, and even greater than, the effect of investor class. The investors who predominantly use complex strategies such as volatility trading or Greek neutral strategies significantly outperform their peers, while those investors who use simple strategies significantly underperform. 4.4. Robustness Tests 20 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 51,
    "chunk_index": 41,
    "word_count": 445,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "performance, in addition to, and even greater than, the effect of investor class. The investors who predominantly use complex strategies such as volatility trading or Greek neutral strategies significantly outperform their peers, while those investors who use simple strategies significantly underperform. 4.4. Robustness Tests 20 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 51,
    "chunk_index": 42,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "In this section, we test the robustness of our main results using alternative definitions of dominant strategy and different measures of profitability. Table 7 repeats the same account-level regressions used in Table 6 and applies alternative specifications. First, we analyze account performance after adjusting returns for systematic risk exposure. A portion of investors may display superior profits because their portfolios load up on certain risk factors that earn risk premiums over our sample period. Important systematic risk factors in the options market are the underlying index return and volatility. Thus, we measure the risk-adjusted return of each account as the intercept from a time-series regression of the account's daily returns on the KOSPI 200 index returns and implied volatility.17 In addition, our examination of the t-statistic of the intercept from these individual time-series regressions is analogous to our analysis of the Sharpe ratio. Regression 1 shows the relationship of investor class and trading styles with risk-adjusted return, and regression 2 shows their relationship with the t-statistic of risk-adjusted return.18 Most importantly, the regressions show that the trading style effects remain the same after we account for systematic risk. On the other hand, the results indicate that the outperformance of institutional investors is related to systematic risk exposure. When we remove the loadings on systematic risk factors from the daily returns in regression 1, we find that institutional investors on average do not earn higher returns than retail investors (the coefficient on the institutional dummy is zero and insignificant). However, institutions outperform in regression 2 (coefficient on the institutional dummy = 0.158, t-stat = 8.13), which is consistent with earlier evidence that institutions tend to earn a significantly higher Sharpe ratio than that earned by retail investors. Our primary definition of a position holder’s dominant strategy is based on the strategy that is most frequently observed in their end-of-day positions. However, investors who hold positions overnight may also engage in day trading, and we consider their P&L from all trades. To ensure that our results to this point have not been driven by these accounts’ intraday profits, in the subsequent test we focus exclusively on their end-of-day positions. In regressions 3 and 4, the dependent variables are mean daily return and Sharpe ratio calculated after excluding position holders' intraday round-trip transactions and only considering their profits from overnight positions. The results regarding position holders’ performance are consistent with our main analysis in Table 6. Our data allow us to observe investors’ exposure to the underlying index through positions in KOSPI 200 futures. Despite limited activity in other passive exchange-listed products such as ETFs that track similar indices, some investors in our sample may use options to hedge stock portfolios. Due to lack of account information on stock positions, we may have misclassified a small portion of investment 17 The daily implied volatility is calculated as the price-weighted average implied volatility of all ATM options, derived from the last daily transactions executed in the 15 minutes before market close. 18 To prevent the effects of outliers in regressions 1 and 2, we winsorize the dependent variables cross-sectionally at 5% and 95%. 21 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 51,
    "chunk_index": 43,
    "word_count": 525,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "price-weighted average implied volatility of all ATM options, derived from the last daily transactions executed in the 15 minutes before market close. 18 To prevent the effects of outliers in regressions 1 and 2, we winsorize the dependent variables cross-sectionally at 5% and 95%. 21 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 51,
    "chunk_index": 44,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "strategies. Because equity investors are long biased on average, they are most likely to hedge their equity exposure with short call or long put options. Consequently, we address the potential misclassification of a number of simple strategies by excluding any simple positions in short call and long put contracts. After repeating our analyses with this method, we observe patterns in regressions 5 and 6 that are highly consistent with our main results in Table 6. Further, we explore alternative cutoff points in the definition of dominant strategy. Our analyses so far have defined the dominant strategy as the most frequent strategy used on at least 60% of the days when an account holds overnight positions. Instead, in regressions 7–10, we perform tests in which the dominant strategy is defined as the most frequent strategy used at least 70% or 80% of the time. Setting a high threshold when classifying dominant strategies will reduce the number of accounts in each trading style group and push more accounts into the benchmark group, which potentially reduces the power of tests. Nonetheless, our conclusions regarding the performance of all position holders remain consistent with earlier results and are strongly significant. Throughout this study, we have focused on account-level analysis because our goal is to measure investor sophistication and relate it to performance at the individual investor level, rather than in the aggregate. Nevertheless, our final robustness test examines the trading style effects in a pooled OLS regression using account-day observations. The results in regression 11 support our main conclusions from the account-level analyses. [Table 7 about here] Overall, the extensive robustness checks confirm the validity of our main findings in a range of test settings. We show that the effects of trading styles on investment performance are not driven by systematic risk exposure or particular variable specifications. 4.5. Trading Style Effects in Subsamples by Investor Class Our evidence demonstrates that investor class and trading style both measure investor sophistication as well as exhibiting correlation. For example, retail traders are more likely to use simple option strategies. Given our focus on the nominal trading style effect in this study, our next analysis investigates whether trading styles have a similar ability to predict investment performance in the two investor class subsamples. Therefore, in Table 8, we separately examine the trading style effects for institutional and retail investors. Because the sample is populated with more retail investors, the style effects in this group of investors are similar to the average trading style effects in the full sample. The regressions in the retail subsample yield coefficients that are very close in both magnitude and significance to those in Table 6. Notably, we find a subset of retail investors whose sophistication and skill in complex volatility or Greek neutral strategies leads them to significantly outperform the 22 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 51,
    "chunk_index": 45,
    "word_count": 473,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "the retail subsample yield coefficients that are very close in both magnitude and significance to those in Table 6. Notably, we find a subset of retail investors whose sophistication and skill in complex volatility or Greek neutral strategies leads them to significantly outperform the 22 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 51,
    "chunk_index": 46,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "benchmark group. On the other hand, retail investors who are day traders or simple strategy traders significantly underperform the benchmark. The largest losses are concentrated in the most unsophisticated group of retail investors who use simple strategies: these investors lose to the rest of the market. When we turn to the subsample of institutional investors, the trading styles remain significantly related to investment performance, but the patterns are slightly different. All groups of institutions show positive profitability on average regardless of the dominant strategy they adopt, although the more complex strategies continue to provide the best performance. The regression intercepts show that an average institutional account in our benchmark group has a mean daily return of 0.028 (t-stat = 8.65) and a Sharpe ratio of 0.06 or 0.95 annualized (t-stat = 11.2). In terms of mean daily return, we find that institutional day traders, simple strategy traders, and volatility traders all outperform the benchmark group, with positive and significant coefficients of 0.015 (t-stat = 2.33), 0.032 (t-stat = 5.14), and 0.082 (t-stat = 6.8), respectively. Although Greek neutral institutions also show a mean daily return higher than the benchmark, the finding is not statistically significant, which may be due to risk-neutral strategies delivering primarily superior risk-adjusted returns rather than the absolute returns. As expected, significantly superior performance in terms of Sharpe ratio exists for those institutions that are day traders (coefficient = 0.107, t-stat = 10.25), volatility traders (coefficient = 0.074, t-stat = 3.82), or Greek neutral traders (coefficient =0.096, t-stat = 7.4), but not for the institutions that are simple strategy traders, who instead display a negative and insignificant coefficient (−0.008). Institutional day traders have the highest Sharpe ratios among all institutional investors because they may be engaging in high frequency trading and market making. Overall, these results suggest nuanced effects of trading styles for institutional and retail investors. Although complex volatility and Greek neutral strategies consistently outperform the benchmark traders in both investor classes, the effects of simple strategies and day trading are different. Retail investors using these two strategies heavily underperform peers but institutional investors using the same strategies perform well, which may be due to their advanced information and low trading latency. [Table 8 about here] 5. Investor Behavior and Trading Style Effects To this point we have documented significant and robust relations between investment performance and trading styles in terms of the dominant strategy favored by each account. These relations hold for both individual and institutional investors. The evidence supports our main hypothesis that the trading styles reflect heterogeneous investor sophistication. In this section, we perform additional analyses to further clarify the style effects and their distinction from other attributes known to impact performance. 23 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 51,
    "chunk_index": 47,
    "word_count": 455,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "hold for both individual and institutional investors. The evidence supports our main hypothesis that the trading styles reflect heterogeneous investor sophistication. In this section, we perform additional analyses to further clarify the style effects and their distinction from other attributes known to impact performance. 23 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "1. Introduction",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 51,
    "chunk_index": 48,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "We start by examining the persistence of trading styles and their impact on investment performance. We split the sample into two equal subperiods, using the first half (January 1, 2010–March 31, 2012) for in-sample analysis and the second half (April 1, 2012–June 30, 2014) for out-of-sample tests. We then mark the in-sample and out-of-sample trading style of each account as their dominant strategy in the first and second half of the sample, respectively. Table 9 presents transition matrices: for each category of investors using a particular trading style in-sample, the matrices show the percentage of accounts that use each trading style out-of-sample.19 The highlighted diagonal in Table 9 Panel A reflects high persistence in institutional trading styles. For example, there is a 75.8% probability that an institution which uses simple strategies as the dominant trading style in-sample will continue to have the same dominant trading style also out-of-sample. The probability that a volatility trading (Greek neutral) institution in-sample will continue to use the same dominant strategy out-of-sample is 68.4% (68.0%). The highlighted diagonal in Table 9 Panel B shows similarly large percentage values among retail investors, indicating trading style persistence in that subsample as well. A very high probability of 89.3% holds that a retail investor who uses simple strategies as their dominant trading style in-sample will continue to use the same dominant trading style out-of-sample. Retail volatility traders display a slightly lower probability of 47.2%, while the value for Greek neutral retail traders is 67.2%. In general, the evidence points to a notable tendency for investors to adhere to one trading style over time. [Table 9 about here] To support our main argument that the trading styles reflect skills and sophistication, we show that the outperformance of more complex strategies is also persistent and accordingly cannot be attributed to randomness. In Table 10, we test the relation between in-sample trading styles and out-of- sample account performance, which is measured as the mean daily return and Sharpe ratio of each account in the second half of the sample only. When we use the dominant strategies identified in the first half of the sample as instruments for those in the second half, we find the effects of trading style on investment performance to be similar to those in our main results in Tables 6 and 8, for both retail and institutional investors. This out-of-sample test result confirms that the style effects are not random and therefore reinforces our interpretation that trading style both reflects investor sophistication and has a persistent impact on performance. [Table 10 about here] 19 We keep only the accounts that trade in both subperiods for this analysis. 24 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "5.1. Trading Style Persistence",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 51,
    "chunk_index": 49,
    "word_count": 446,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.1. Trading Style Persistence (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "that the style effects are not random and therefore reinforces our interpretation that trading style both reflects investor sophistication and has a persistent impact on performance. [Table 10 about here] 19 We keep only the accounts that trade in both subperiods for this analysis. 24 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "5.1. Trading Style Persistence",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 51,
    "chunk_index": 50,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.1. Trading Style Persistence (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "Rational Bayesian investors should gradually learn the strategy most apt for themselves and use it as their dominant strategy. Although our definition of dominant strategy entails the given investor’s most frequently used strategy, the investor may at times engage in strategies other than their dominant one. If the self-selected trading style already reflects the optimal outcome that each investor can achieve, we would expect the performance from positions in nondominant strategies to be worse than the performance via the dominant strategy. To test this conjecture, we run OLS regressions in the panel data which compare performance attributable to the dominant versus nondominant strategies and report results in Table 11. We regress the daily returns on the dummies for dominant trading style, but since each account may at times use strategies other than their dominant one, we also add nondominant strategy dummies which are equal to one on these days. For example, \"Simple strategy trader using nondominant strategy\" is a dummy variable equal to one on days when a simple strategy trader holds positions in volatility, Greek neutral, or other strategies, and equal to zero on days when the account holds simple positions. Regarding institutional investors, we find that the choice of dominant trading style is generally consistent with Bayesian learning. The first regression shows that the daily returns of institutions are significantly lower on days when they use nondominant strategies. Our benchmark group without a dominant strategy has an average daily return of 0.03 in the pooled sample. Institutional simple strategy traders on average outperform them by 0.055 (t-stat = 13.17) on days when using their dominant strategy. However, on days when using nondominant strategies, they underperform by −0.023 (t-stat = −4.64). Similarly, institutional volatility traders outperform the benchmark by a striking 0.207 (t-stat = 29.49) on days when they stick to their dominant style, but underperform by −0.173 (t-stat = −15.47) when using nondominant strategies. Greek neutral traders seem to perform better when using nondominant strategies, but this result may be misleading. The nature of Greek neutral strategies requires that such strategies may not have high absolute returns; investors primarily using these strategies may focus on risk control instead of absolute returns. These investors are likely to earn higher returns when using other strategies. Therefore, this analysis may not be substantively informative concerning Greek-neutral traders’ learning. In the subsample of retail investors, we find evidence of Bayesian learning only among those who predominantly use complex strategies. The second regression shows that the performance of retail volatility traders is significantly worse on days when they use nondominant strategies. More specifically, retail volatility traders on average outperform the benchmark group by 0.126 (t-stat = 107.9) on days when using their dominant volatility strategies, but significantly underperform by −0.108 (t-stat = −57.83) when using nondominant strategies. This suggests that these sophisticated traders have learned which trading style is most profitable for them and adopted it as their dominant one. On the 25 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "5.2. Trading Styles and Learning",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 51,
    "chunk_index": 51,
    "word_count": 495,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.2. Trading Styles and Learning (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "days when using their dominant volatility strategies, but significantly underperform by −0.108 (t-stat = −57.83) when using nondominant strategies. This suggests that these sophisticated traders have learned which trading style is most profitable for them and adopted it as their dominant one. On the 25 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "5.2. Trading Styles and Learning",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 51,
    "chunk_index": 52,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.2. Trading Styles and Learning (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "other hand, retail investors who predominantly use simple strategies do not appear to learn from their lack of success. When using their dominant simple strategies, they significantly underperform the benchmark by −0.097 (t-stat = −186.3) on average. They generally show higher returns when using other strategies (coefficient = 0.074, t-stat = 133.5), but they fail to change their trading style and instead adhere to the losing style. These results indicate that retail investors using simple strategies are less likely to behave as Bayesian learners, while institutional investors and retail volatility traders exhibit a higher level of sophistication when choosing their dominant trading style. This further confirms the utility of the trading styles in measuring investor sophistication, especially in the case of retail traders. [Table 11 about here] 5.3. Trading Styles and Behavioral Biases One of our primary observations, which appears across all analyses, is that retail investors who use simple strategies lose to the rest of the market. Given the predominance of this trading style among retail investors, we explore in this section possible causes of the underperformance by retail simple strategy traders. We start by examining whether the choice of dominant strategy by retail investors corresponds to known behavioral biases. Underperformance due to biases may be amplified in the options market due to the high leverage and fat tail risk embedded in option contracts. Using each account’s activity and performance measures, we construct account-level proxies for the five behavioral biases that are among the most well-known in the literature. First, Barber and Odean (2000) argue that retail investors’ overconfidence causes them to trade excessively, which is detrimental to their investment performance. To capture excessive trading activity, we calculate the logarithm of the average daily options trading volume of each retail account as a measure of investor overconfidence. Second, Odean (1998) shows a disposition effect in which retail investors will close winning positions early but hold on to losing positions for too long. Following his method, we measure disposition effect as an account’s proportion of gains realized (PGR) minus proportion of losses realized (PLR). On a given day, PGR is the total number of contracts with realized gains (positions closed at a gain) divided by that number plus the total number of contracts with paper gains (open positions which have increased in value from the previous day). PLR is calculated similarly. Then, we sum the daily values over the sample period and take the difference of PGR and PLR.20 20 Disposition effect is equal to zero for day traders as they close all of their positions before the end of the trading day. 26 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "5.2. Trading Styles and Learning",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 51,
    "chunk_index": 53,
    "word_count": 439,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.2. Trading Styles and Learning (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "calculated similarly. Then, we sum the daily values over the sample period and take the difference of PGR and PLR.20 20 Disposition effect is equal to zero for day traders as they close all of their positions before the end of the trading day. 26 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "5.2. Trading Styles and Learning",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 51,
    "chunk_index": 54,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.2. Trading Styles and Learning (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "Third, some investors may exhibit a demand for options with lottery‐like payoffs (see e.g., Boyer and Vorkink, 2014), which have a low probability of being profitable. We measure lottery preference as the out-of-the-money (OTM) option contracts bought by an account. In the case of position holders, this refers to the percentage of positions that are in long OTM contracts; in the case of day traders, it refers to the percentage of opening intraday trades that buy OTM contracts. Fourth, retail investors may be prone to making investment decisions following trends. We capture trend-chasing behavior, also known as extrapolation or positive feedback trading (see e.g., De Long et al., 1990; Li et al., 2021), by calculating the sensitivity of an investor’s delta exposure to KOSPI 200 index returns. This is derived by regressing each account’s end-of-day position delta (for position holders) or the volume-weighted average delta of opening intraday trades (for day traders) on past five- day average index return. Fifth, we measure self-attribution bias (Gervais and Odean, 2001; Hoffmann and Post, 2014) which is defined as investors’ belief that past success is due to skill rather than luck. In other words, profitable investors assume they will continue to be profitable in the future and consequently increase their market activity. We calculate the sensitivity of investor activity to past performance by regressing position size (for position holders) or intraday trading volume (for day traders) on past five-day average return of the investor. In addition to the five bias proxies above, we include two further variables as controls for other factors which may affect investor performance. The first is a proxy for transaction costs and is equal to the percentage of each account’s trading volume that is initiated. The second is a dummy variable equal to one if the account is a foreign investor, as per studies on the outperformance of foreign investors (e.g., Grinblatt and Keloharju, 2000). In Table 12, we perform logistic regressions for the probability of retail investors to use a particular trading style given the behavioral bias proxies. We find that the likelihood of retail investors to use simple strategies as their dominant trading style is positively and significantly associated with the proxies for investor overconfidence (coefficient = 0.034, t-stat = 7.79), disposition effect (coefficient = 0.868, t-stat = 25.8), and lottery preference (coefficient = 2.267, t-stat = 87.14). The same investors strongly prefer to provide rather than take liquidity (coefficient on % of volume initiated = −0.978, t- stat = −33.06) and they do not tend to chase trends. We find contrasting results for retail investors whose dominant trading style consists of complex strategies. In particular, the likelihood of retail investors to use volatility trading strategies as their dominant style is negatively and significantly associated with the proxies for overconfidence (coefficient = −0.124, t-stat = −13.36), disposition effect (coefficient = −0.314, t-stat = −4.48), and lottery preference (coefficient = −3.876, t-stat = −48.85). Similarly, the likelihood of retail investors to use Greek neutral strategies as their dominant style is also significantly negatively associated with the proxies for disposition effect (coefficient = −0.954, t-stat = −10.28), and 27 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "5.2. Trading Styles and Learning",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 51,
    "chunk_index": 55,
    "word_count": 525,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.2. Trading Styles and Learning (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "= −4.48), and lottery preference (coefficient = −3.876, t-stat = −48.85). Similarly, the likelihood of retail investors to use Greek neutral strategies as their dominant style is also significantly negatively associated with the proxies for disposition effect (coefficient = −0.954, t-stat = −10.28), and 27 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "5.2. Trading Styles and Learning",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 51,
    "chunk_index": 56,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.2. Trading Styles and Learning (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "lottery preference (coefficient = −0.416, t-stat = −5.98). One exception is the observed high average daily trading volume of Greek neutral traders, but this observation can be a feature of the strategy itself rather than a sign of overconfidence. We do not find self-attribution bias to affect the strategies chosen by any of the retail investors that we examine. Our analysis also reveals that foreign retail investors are less likely to use simple strategies. Overall, we find that behavioral bias measures for overconfidence, disposition effect, and lottery preference are significantly associated with the level of complexity of an account’s trading style. [Table 12 about here] In our final analysis in Table 13, we investigate whether the behavioral biases drive the previously identified effects of trading style on investor profitability. The literature posits that these biases can have direct channels to affecting performance; therefore, we include their proxies as control variables in the performance analysis regressions. We find that the behavior of the dominant strategy dummies generally conforms to the previous findings. Although the results are consistent with the literature in showing that many of the behavioral biases adversely affect retail investor performance, the trading style effects remain strongly significant and do not appear to be driven by the biases. This suggests a separate venue for trading styles to impact performance through investor (un)sophistication rooted in yet unidentified psychological reasons. [Table 13 about here] 6. Conclusion Despite growing trading volumes in derivatives markets worldwide, little is known about the trading activities of option investors at the account level. In this study, we analyze a comprehensive data set of account-level transactions in KOSPI 200 index options and futures in order to investigate the profitability of option trading strategies employed by different types of investors. Our study contributes to the literature by casting new light on the most popular motivations for trading options and thereby uncovering a measure of investor sophistication, which exceeds the traditional classification by investor class. Specifically, we propose the complexity of an investor’s dominant trading strategy as an ex ante measure of trading skill and show its significant effect on investment outcomes. We start by investigating the application of common option trading strategies. We find that simple option strategies, which provide directional exposure to the underlying asset, are widely used by retail investors. A portion of institutional investors also use simple strategies to take directional bets, but the majority of institutions are skilled at using various complex strategies. We show that both institutional and retail investors apply volatility trading more often than the other classic options 28 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "5.2. Trading Styles and Learning",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 51,
    "chunk_index": 57,
    "word_count": 433,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.2. Trading Styles and Learning (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "investors. A portion of institutional investors also use simple strategies to take directional bets, but the majority of institutions are skilled at using various complex strategies. We show that both institutional and retail investors apply volatility trading more often than the other classic options 28 Electronic copy available at: https://ssrn.com/abstract=3867129 strategies. We also uncover a small number of accounts, both institutional and retail, which generate large trading volumes using sophisticated and well-hedged positions. After uncovering the most popular options strategies used by different investors, we proceed to examine account performance. Although we find that investor class affects profitability and institutions generally outperform retail investors, we ultimately show that trading style complexity has an additional and even stronger effect on performance. Within each of the investor classes, and especially concerning retail investors, the complexity of an account’s dominant strategy is significantly associated with investment performance. Investors using sophisticated strategies such as volatility and Greek neutral strategies outperform their peers. In particular, volatility trading is the most profitable strategy in terms of average returns, and Greek neutral strategies deliver superior risk-return efficiency as measured by the Sharpe ratio. Meanwhile, we find that retail investors who use simple strategies lose to the rest of the market. Finally, we provide evidence that these trading style effects are persistent and cannot be explained by risk premiums or known behavioral biases, thereby positing a novel channel for investor sophistication to manifest in financial markets. These trading style effects may exist in other financial markets and enable investors to explore various trading strategies. Examining the additional style effects in other markets would be a valuable line of research for future studies. 29 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "5.2. Trading Styles and Learning",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 51,
    "chunk_index": 58,
    "word_count": 280,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.2. Trading Styles and Learning (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "for investor sophistication to manifest in financial markets. These trading style effects may exist in other financial markets and enable investors to explore various trading strategies. Examining the additional style effects in other markets would be a valuable line of research for future studies. 29 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "5.2. Trading Styles and Learning",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 51,
    "chunk_index": 59,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.2. Trading Styles and Learning (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "Barber, B. M., Lee, Y., Liu, Y., Odean, T., 2009. Just how much do individual investors lose by trading? Review of Financial Studies 22, 609—632. Barber, B. M., Lee, Y., Liu, Y., Odean, T., Zhang, K., 2017. Do day traders rationally learn about their ability? Working Paper, UC Davis. Barber, B. M., Odean, T., 2000. Trading is hazardous to your wealth: the common stock investment performance of individual investors. Journal of Finance 55, 773—806. Barrot, J., Kaniel, R., Sraer, D., 2016. Are retail traders compensated for providing liquidity? Journal of Financial Economics 120, 146—168. Bauer, R., Cosemans, M., Eichholtz, P., 2009. Option trading and individual investor performance. Journal of Banking and Finance 33, 731—746. Black, F., Scholes, M., 1973. The pricing of options and corporate liabilities. Journal of Political Economy 81, 637—654. Boehmer, E., Jones, C. M., Zhang, X., Zhang, X., 2021. Tracking retail investor activity. Journal of Finance, forthcoming. Bollerslev, T., Tauchen, G., Zhou, H., 2009. Expected stock returns and variance risk premia. Review of Financial Studies 22, 4463—4492. Boyer, B. H., Vorkink, K., 2014. Stock options as lotteries. Journal of Finance 69, 1485—1527. Carr, P., Wu, L., 2009. Variance risk premiums. Review of Financial Studies 22, 1311—1341. Célérier, C., Vallée, B., 2016. Catering to investors through product complexity. Working Paper, University of Toronto. Chaput, J. S., Ederington, L. H., 2003. Option spread and combination trading. Journal of Derivatives 10, 70—88. Fahlenbrach, R., Sandås, P., 2010. Does information drive trading in option strategies? Journal of Banking and Finance 34, 2370—2385. Flint, A., Lepone, A., Yang, J. Y., 2014. Do option strategy traders have a disadvantage? Evidence from the Australian options market. Journal of Futures Markets 34, 838—852. Gervais, S., Odean, T., 2001. Learning to be overconfident. Review of Financial Studies 14, 1—27. Goyal, A., Saretto, A., 2009. Cross-section of option returns and volatility. Journal of Financial Economics 94, 310—326. Grinblatt, M., Keloharju, M., 2000. The investment behavior and performance of various investor types: a study of Finland's unique data set. Journal of Financial Economics 55, 43—67. 30 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "References",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 51,
    "chunk_index": 60,
    "word_count": 343,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "Goyal, A., Saretto, A., 2009. Cross-section of option returns and volatility. Journal of Financial Economics 94, 310—326. Grinblatt, M., Keloharju, M., 2000. The investment behavior and performance of various investor types: a study of Finland's unique data set. Journal of Financial Economics 55, 43—67. 30 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "References",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 51,
    "chunk_index": 61,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "Han, B., Lee, Y., Liu, Y., 2009. Investor trading behavior and performances: Evidence from Taiwan stock index options. Working Paper, University of Toronto. Henderson, B. J., Pearson, N. D., 2011.The dark side of financial innovation: a case study of the pricing of a retail financial product. Journal of Financial Economics 100, 227—247. Hens, T., Rieger, M. O., 2011. Why do investors buy structured products? Working Paper, University of Zurich. Hoffmann, A. O.I., Post, T., 2014. Self-attribution bias in consumer financial decision-making: How investment returns affect individuals’ belief in skill. Journal of Behavioral and Experimental Economics 52, 23—28. Hull, J. C., 2018. Options, futures, and other derivatives, 10th Edition. Pearson. Kaniel, R., Liu, S., Saar, G., Titman, S., 2012. Individual investor trading and return patterns around earnings announcements. Journal of Finance 67, 639—680. Kaniel, R., Saar, G., Titman, S., 2008. Individual investor trading and stock returns. The Journal of Finance 63, 273—310. Kelley, E. K., Tetlock, P. C., 2013. How wise are crowds? Insights from retail orders and stock returns. Journal of Finance 68, 1229—1265. Kelley, E. K., Tetlock, P. C., 2017. Retail short selling and stock prices. Review of Financial Studies 30, 801—834. Kuo, W., Lin, T., 2013. Overconfident individual day traders: evidence from the Taiwan futures market. Journal of Banking & Finance 37, 3548—3561. Kuo, W., Lin, T., Zhao, J., 2015. Cognitive limitation and investment performance: evidence from limit order clustering. Review of Financial Studies 28, 838—875. Lakonishok, J., Lee, I., Pearson, N. D., Poteshman, A. M., 2007. Option market activity. Review of Financial Studies 20, 813—857. Li, X., Subrahmanyam, A., Yang, X., 2018. Can financial innovation succeed by catering to behavioral preferences? Evidence from a callable options market. Journal of Financial Economics 128, 38—65. Li, X., Subrahmanyam, A., Yang, X., 2021. Winners, losers, and regulators in a derivatives market bubble. Review of Financial Studies 34, 313—350. Merton, R., 1973. Theory of rational option pricing. Bell Journal of Economics 4, 141—183. Odean, T., 1998. Are investors reluctant to realize their losses? Journal of Finance 53, 1775—1798. Odean, T., 1999. Do investors trade too much? American Economic Review 89, 1279—1298. Welch, I., 2020. The wisdom of the Robinhood crowd. Working Paper, UCLA. 31 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "References",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 51,
    "chunk_index": 62,
    "word_count": 368,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "of Economics 4, 141—183. Odean, T., 1998. Are investors reluctant to realize their losses? Journal of Finance 53, 1775—1798. Odean, T., 1999. Do investors trade too much? American Economic Review 89, 1279—1298. Welch, I., 2020. The wisdom of the Robinhood crowd. Working Paper, UCLA. 31 Electronic copy available at: https://ssrn.com/abstract=3867129 Figure 1 Korean Market Return and Volatility: 2010-2014 This figure plots monthly KOSPI 200 index returns as well as the VKOSPI implied volatility index during our sample time period, from January 2010 through June 2014. 15% 50 45 10% 40 5% 35 0% 30 25 -5% 20 -10% 15 -15% 10 32 0102-10 0102-20 0102-30 0102-40 0102-50 0102-60 0102-70 0102-80 0102-90 0102-01 0102-11 0102-21 1102-10 1102-20 1102-30 1102-40 1102-50 1102-60 1102-70 1102-80 1102-90 1102-01 1102-11 1102-21 2102-10 2102-20 2102-30 2102-40 2102-50 2102-60 2102-70 2102-80 2102-90 2102-01 2102-11 2102-21 3102-10 3102-20 3102-30 3102-40 3102-50 3102-60 3102-70 3102-80 3102-90 3102-01 3102-11 3102-21 4102-10 4102-20 4102-30 4102-40 4102-50 4102-60 KOSPI 200 index return VKOSPI implied volatility index Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "References",
    "page_number": 34,
    "page_range": "p.34-35",
    "total_pages": 51,
    "chunk_index": 63,
    "word_count": 169,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.34-35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "1102-60 1102-70 1102-80 1102-90 1102-01 1102-11 1102-21 2102-10 2102-20 2102-30 2102-40 2102-50 2102-60 2102-70 2102-80 2102-90 2102-01 2102-11 2102-21 3102-10 3102-20 3102-30 3102-40 3102-50 3102-60 3102-70 3102-80 3102-90 3102-01 3102-11 3102-21 4102-10 4102-20 4102-30 4102-40 4102-50 4102-60 KOSPI 200 index return VKOSPI implied volatility index Electronic copy available at: https://ssrn.com/abstract=3867129 Table 1 Summary Statistics This table reports aggregate summary statistics of the trading activity in KOSPI 200 options contracts that are introduced after January 1, 2010 and expire before June 30, 2014. Panel A reports daily mean and median number of transactions, trading volume (number of contracts traded), and premium in billions of KRW (option premium multiplied by number of contracts traded and multiplier). The subsequent panels contain daily mean statistics for different subsamples. We classify a call option as out of the money (OTM) / at the money (ATM) / in the money (ITM) if its spot-to-strike price ratio is less than 0.95 / between 0.95 and 1.05 / greater than 1.05. We define put options to be ITM, ATM, and OTM in the same spot-to-strike price ratio regions, correspondingly. Normal trading hours refer to the daily continuous trading session from 9:00 to 15:05 KST. Panel A: Aggregate options data N transactions Trading volume Premium (billion KRW) daily mean 905,026 7,783,991 1,197 daily median 804,878 5,054,738 1,100 N transactions Trading volume Premium (billion KRW) daily mean daily mean daily mean Panel B: By option contract type Call 454,010 4,059,280 584 Put 451,016 3,724,711 613 Panel C: By option moneyness OTM 183,092 2,251,366 163 ATM 716,845 5,519,158 1,014 ITM 5,108 13,516 19.3 Panel D: By time to maturity 0–40 days to maturity 918,363 8,001,045 1,213 41–70 days to maturity 18,749 66,504 21.3 >70 days to maturity 2,488 10,665 7.6 Panel E: By trading hours Normal trading hours 897,867 7,717,283 1,187 Outside normal trading hours 7,158 66,708 9.6 33 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "References",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 51,
    "chunk_index": 64,
    "word_count": 313,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "D: By time to maturity 0–40 days to maturity 918,363 8,001,045 1,213 41–70 days to maturity 18,749 66,504 21.3 >70 days to maturity 2,488 10,665 7.6 Panel E: By trading hours Normal trading hours 897,867 7,717,283 1,187 Outside normal trading hours 7,158 66,708 9.6 33 Electronic copy available at: https://ssrn.com/abstract=3867129 Table 2 Average Daily Options Trading Activity of Different Investor Types This table describes options trading activity of different investor types in the KOSPI 200 options market from January 1, 2010 to June 30, 2014. For each account and each day, we calculate the number of transactions, trading volume, and premium. Reported are daily averages for the aggregate trading activity of all accounts in each category of investors, as well as the average account activity for that category of investors. We report statistics for the trading activity of liquidity takers and liquidity providers separately. We compare the bid and ask order submission times and mark the investor who submitted their order first as the liquidity provider and the investor whose order matched the first one as the liquidity taker. N transactions Aggregate Trading volume Aggregate Premium of average Aggregate premium of average account N transactions of average account trading volume account (million KRW) (million KRW) Liquidity takers Institutions 1,123 626,690 10,085 5,915,011 1,688 930,483 Retail investors 18.6 278,203 108.9 1,868,697 18.5 266,045 Liquidity providers Institutions 811.7 451,009 8,230 4,816,273 1,244 682,001 Retail investors 27.0 453,883 157.1 2,967,435 31.9 514,527 34 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "References",
    "page_number": 36,
    "page_range": "p.36-37",
    "total_pages": 51,
    "chunk_index": 65,
    "word_count": 245,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.36-37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "of average account trading volume account (million KRW) (million KRW) Liquidity takers Institutions 1,123 626,690 10,085 5,915,011 1,688 930,483 Retail investors 18.6 278,203 108.9 1,868,697 18.5 266,045 Liquidity providers Institutions 811.7 451,009 8,230 4,816,273 1,244 682,001 Retail investors 27.0 453,883 157.1 2,967,435 31.9 514,527 34 Electronic copy available at: https://ssrn.com/abstract=3867129 Table 3 Strategies of Position Holders This table examines the popularity of different options strategies extracted from end-of-day positions in the KOSPI 200 options market from January 1, 2010 to June 30, 2014. For the whole market, as well as for the two investor classes separately, we report the frequency of account-day positions in each options strategy as a percentage of all account-days with non-zero end-of-day positions. We also report the number of option contracts held in each strategy as a percentage of total end-of-day open positions. All Institutions Retail investors N account-days with a position in options 19,135,324 539,680 18,595,644 N option contracts held in open positions 4,822,669,794 2,916,207,458 1,906,462,336 % of all % of all % of instit. % of instit. % of retail % of retail account-days open positions account-days open positions account-days open positions Combinations of options and futures 6.24% 37.6% 34.4% 55.4% 5.42% 10.5% Simple strategies 55.7% 7.14% 18.8% 1.35% 56.8% 16.0% Volatility trading strategies 16.5% 7.24% 9.43% 2.90% 16.7% 13.9% Spreads 3.68% 2.89% 9.54% 2.65% 3.51% 3.25% Other options strategies 17.9% 45.1% 27.8% 37.7% 17.6% 56.4% 35 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "References",
    "page_number": 37,
    "page_range": "p.37-38",
    "total_pages": 51,
    "chunk_index": 66,
    "word_count": 238,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.37-38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "Combinations of options and futures 6.24% 37.6% 34.4% 55.4% 5.42% 10.5% Simple strategies 55.7% 7.14% 18.8% 1.35% 56.8% 16.0% Volatility trading strategies 16.5% 7.24% 9.43% 2.90% 16.7% 13.9% Spreads 3.68% 2.89% 9.54% 2.65% 3.51% 3.25% Other options strategies 17.9% 45.1% 27.8% 37.7% 17.6% 56.4% 35 Electronic copy available at: https://ssrn.com/abstract=3867129 Table 4 Number of Accounts and Trading Volume by Trading Style and Investor Class In this table, we report the dominant strategy of 122,620 active accounts in the KOSPI 200 options market from January 1, 2010 to June 30, 2014. Day traders are defined as accounts that only trade intraday and never hold positions overnight throughout our sample. For the remaining investors, the dominant strategy of an account is the strategy used in at least 60% of the end-of-day positions held by that account. The trading strategies are the same as defined in Table 3. Accounts with more than 60% of end-of-day positions unidentifiable as any of the strategies, as well as accounts that switch between different strategies without having a dominant one, are labelled as “Others”. We report the number of accounts for each strategy in each investor class category and their percentage of all accounts in the respective category. We also report the cross-sectional averages of mean daily trading volume of different accounts and the percentage of each strategy’s aggregate volume in total volume of the same investor class. All Institutions Retail investors N accounts Mean daily volume N accounts Mean daily volume N accounts Mean daily volume % of all % of all % of instit. % of instit. % of retail % of retail accounts volume accounts volume accounts volume Day traders 3,747 2,352 677 10,828 3,070 483.2 3.1% 10.3% 17.0% 13.8% 2.6% 3.3% Simple strategy traders 79,037 323.8 760 8,115 78,277 248.2 64.5% 37.1% 19.1% 26.2% 66.0% 58.7% Volatility traders 6,106 466.4 158 7,751 5,948 272.9 5.0% 4.3% 4.0% 2.1% 5.0% 8.6% Greek neutral traders 3,249 2,761 392 20,532 2,857 322.8 2.6% 17.9% 9.9% 24.7% 2.4% 4.4% Others 30,481 521.1 1,985 4,944 28,496 213.0 24.9% 30.4% 50.0% 33.2% 24.0% 25.0% 36 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "References",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 51,
    "chunk_index": 67,
    "word_count": 351,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "66.0% 58.7% Volatility traders 6,106 466.4 158 7,751 5,948 272.9 5.0% 4.3% 4.0% 2.1% 5.0% 8.6% Greek neutral traders 3,249 2,761 392 20,532 2,857 322.8 2.6% 17.9% 9.9% 24.7% 2.4% 4.4% Others 30,481 521.1 1,985 4,944 28,496 213.0 24.9% 30.4% 50.0% 33.2% 24.0% 25.0% 36 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "References",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 51,
    "chunk_index": 68,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "Table 5 Summary Statistics of Account Profitability This table reports the cross-sectional means and percentiles of three different profitability measures. We look at 122,620 active accounts that trade options. First, for each account, we use the transactions records to calculate the total cumulative profit and loss ($P&L) over the whole sample period from January 1, 2010 to June 30, 2014. We use the contract multiplier to calculate profits in Korean won (KRW) and we report total account $P&L in millions of KRW. Then, for each account and each trading day, we calculate profitability per dollar as: Daily return (cid:3404) Total daily $P&L / Total daily capital requirement (cid:4666) $P&L from end-of-day positions (cid:3397) $P&L from intraday trades (cid:4667) (cid:3404) . (cid:4666) Lag of end-of-day capital requirement (cid:3397) Intraday capital requirement (cid:4667) Refer to Section 4 for additional details regarding our method for calculating daily returns. This scaled P&L measure is a rate of return to each dollar of capital invested in KOSPI derivatives. To have one single return measure for each account, we take the mean of daily returns of the same account during the whole sample period. We also calculate Sharpe ratio of each account as the mean daily return divided by the standard deviation of daily returns. Panel A shows account profitability of institutions versus retail investors and Panel B shows the profitability by trading style. Panel A: By investor class Profitability measure Mean Percentiles p1 p10 p20 p30 p40 p50 p60 p70 p80 p90 p99 Total account $P&L Institutions 518.1 -13,099 -215.6 -46.7 -10.5 -0.3 8.8 29.8 88.5 290.2 971.5 27,255 (millions of KRW) Retail investors -25.5 -483.3 -74.4 -34.1 -18.9 -10.7 -5.5 -2.4 -0.8 0.2 8.0 219.2 Institutions 0.04 -0.21 -0.04 -0.01 0.00 0.00 0.01 0.02 0.04 0.08 0.16 0.62 Mean daily return Retail investors -0.02 -0.28 -0.11 -0.07 -0.05 -0.03 -0.02 -0.01 0.00 0.02 0.07 0.42 Institutions 0.09 -0.51 -0.14 -0.05 0.00 0.03 0.07 0.10 0.15 0.22 0.34 0.89 Sharpe ratio Retail investors -0.08 -0.67 -0.31 -0.22 -0.16 -0.11 -0.07 -0.03 0.01 0.06 0.14 0.41 37 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "References",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 51,
    "chunk_index": 69,
    "word_count": 346,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "return Retail investors -0.02 -0.28 -0.11 -0.07 -0.05 -0.03 -0.02 -0.01 0.00 0.02 0.07 0.42 Institutions 0.09 -0.51 -0.14 -0.05 0.00 0.03 0.07 0.10 0.15 0.22 0.34 0.89 Sharpe ratio Retail investors -0.08 -0.67 -0.31 -0.22 -0.16 -0.11 -0.07 -0.03 0.01 0.06 0.14 0.41 37 Electronic copy available at: https://ssrn.com/abstract=3867129 Panel B: By trading style Profitability measure Mean Percentiles p1 p10 p20 p30 p40 p50 p60 p70 p80 p90 p99 Day traders 79.5 -181.8 -20.9 -9.3 -4.1 -1.8 -0.7 -0.2 0.1 3.4 40.4 1,461 Simple strategy traders -27.0 -419.4 -73.2 -34.5 -19.7 -11.6 -6.4 -3.3 -1.4 -0.4 0.8 73.9 Total account $P&L Volatility traders 14.5 -490.0 -48.7 -18.4 -8.5 -3.6 -1.0 0.4 3.5 11.8 42.2 769.3 (millions of KRW) Greek-neutral traders 143.1 -952.5 -93.8 -26.5 -7.7 -0.9 1.8 7.6 18.3 43.9 157.7 3,232 Others 10.4 -1,240 -97.3 -41.9 -22.1 -11.7 -5.0 -1.0 2.3 11.2 48.4 1,173 Day traders 0.01 -0.15 -0.05 -0.03 -0.01 0.00 0.00 0.01 0.02 0.03 0.08 0.34 Simple strategy traders -0.04 -0.30 -0.12 -0.09 -0.07 -0.05 -0.04 -0.02 -0.01 0.00 0.03 0.30 Mean daily return Volatility traders 0.09 -0.31 -0.06 -0.03 -0.01 0.00 0.02 0.06 0.11 0.19 0.35 0.88 Greek-neutral traders 0.04 -0.14 -0.01 0.00 0.00 0.01 0.02 0.04 0.05 0.08 0.11 0.27 Others 0.02 -0.22 -0.05 -0.02 -0.01 0.00 0.00 0.01 0.03 0.06 0.13 0.47 Day traders 0.01 -0.85 -0.34 -0.21 -0.13 -0.06 0.01 0.07 0.13 0.22 0.37 1.01 Simple strategy traders -0.13 -0.72 -0.35 -0.26 -0.20 -0.16 -0.12 -0.08 -0.04 0.00 0.08 0.35 Sharpe ratio Volatility traders 0.04 -0.55 -0.21 -0.11 -0.04 0.01 0.05 0.09 0.13 0.19 0.27 0.54 Greek-neutral traders 0.09 -0.33 -0.09 -0.01 0.03 0.06 0.10 0.13 0.16 0.19 0.25 0.51 Others 0.01 -0.45 -0.17 -0.09 -0.05 -0.01 0.02 0.05 0.08 0.12 0.19 0.42 38 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "References",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 51,
    "chunk_index": 70,
    "word_count": 297,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "0.35 Sharpe ratio Volatility traders 0.04 -0.55 -0.21 -0.11 -0.04 0.01 0.05 0.09 0.13 0.19 0.27 0.54 Greek-neutral traders 0.09 -0.33 -0.09 -0.01 0.03 0.06 0.10 0.13 0.16 0.19 0.25 0.51 Others 0.01 -0.45 -0.17 -0.09 -0.05 -0.01 0.02 0.05 0.08 0.12 0.19 0.42 38 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "References",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 51,
    "chunk_index": 71,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "Table 6 Profitability of the Different Investor Accounts: Regression analyses This table presents multivariate regression analyses of the relation between account profitability and investor types. We include the 122,620 active accounts that trade options. We perform six account-level regressions. Regressions 1, 2, 3 use mean daily return as the dependent variable, and regressions 4, 5, 6 use the Sharpe ratio. The independent variable in regressions 1 and 4 is a dummy variable for institutional investors, and the intercept represents retail investors. The independent variables in regressions 2 and 5 are the trading style dummies for day traders, simple strategy traders, volatility traders and Greek neutral traders, and the intercept represents the remaining accounts in the category “Others”. Regressions 3 and 6 use the investor class dummy and the trading style dummies at the same time. The table contains the estimated regression coefficients and below them the corresponding t-statistics in parentheses. ***, **, and * indicate statistical significance at the 1%, 5%, and 10% levels, respectively. The sample time period is from January 1, 2010 to June 30, 2014. Dependent variable: Mean daily return Sharpe ratio 1 2 3 4 5 6 Intercept -0.017*** 0.024*** 0.022*** -0.081*** 0.014*** 0.007*** (-34.83) (26.42) (23.90) (-122.4) (10.77) (5.44) Institution 0.057*** 0.030*** 0.169*** 0.101*** (21.67) (11.24) (45.84) (28.04) Day trader -0.012*** -0.015*** 0.001 -0.011*** (-4.17) (-5.38) (0.28) (-2.79) Simple strategy trader -0.065*** -0.063*** -0.144*** -0.138*** (-60.52) (-58.48) (-97.52) (-93.16) Volatility trader 0.064*** 0.065*** 0.024*** 0.028*** (28.59) (29.09) (7.80) (9.11) Greek neutral trader 0.011*** 0.009*** 0.078*** 0.073*** (3.75) (3.19) (19.37) (18.02) N observations 122,620 122,620 122,620 122,617 122,617 122,617 Adjusted R2 0.0038 0.0533 0.0543 0.0168 0.1036 0.1093 39 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "References",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 51,
    "chunk_index": 72,
    "word_count": 277,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "-0.063*** -0.144*** -0.138*** (-60.52) (-58.48) (-97.52) (-93.16) Volatility trader 0.064*** 0.065*** 0.024*** 0.028*** (28.59) (29.09) (7.80) (9.11) Greek neutral trader 0.011*** 0.009*** 0.078*** 0.073*** (3.75) (3.19) (19.37) (18.02) N observations 122,620 122,620 122,620 122,617 122,617 122,617 Adjusted R2 0.0038 0.0533 0.0543 0.0168 0.1036 0.1093 39 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "References",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 51,
    "chunk_index": 73,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "Table 7 Robustness Checks We repeat the profitability regressions of Table 6 using alternative definitions of dominant strategy and different measures of profitability. The dependent variable in regression 1 is risk-adjusted return, which for a given account is equal to the intercept from a time-series regression of the account's daily returns on the KOSPI 200 index returns and implied volatility. The daily implied volatility is calculated as the price-weighted average implied volatility of all ATM options, derived from the last daily transactions executed in the 15 minutes before market close. We also examine the t-statistic of the intercept and use it as the dependent variable in regression 2, as analogous to our analysis of Sharpe ratio. To prevent the effects of outliers in regressions 1 and 2, we winsorize the dependent variables cross-sectionally at 5% and 95%. The dependent variables in regressions 3 and 4 are mean daily return from positions and Sharpe ratio from positions. Here, we exclude position holders' intraday trading profits when calculating daily returns. For regressions 5 and 6, we define dominant strategies and calculate mean daily returns excluding any simple positions in short call and long put contracts, in order to exclude any possible hedges of unobserved equity positions. Regressions 7–10 show the results when dominant strategies are defined using different cutoff points. Finally, regression 11 reports the results of a pooled OLS regression in the panel using account-day observations instead of account-level. The independent variables in all regressions are the same as in Table 6. The table contains the estimated regression coefficients and below them the corresponding t-statistics in parentheses. ***, **, and * indicate statistical significance at the 1%, 5%, and 10% levels, respectively. The sample time period is from January 1, 2010 to June 30, 2014. 40 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "References",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 51,
    "chunk_index": 74,
    "word_count": 300,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "6. The table contains the estimated regression coefficients and below them the corresponding t-statistics in parentheses. ***, **, and * indicate statistical significance at the 1%, 5%, and 10% levels, respectively. The sample time period is from January 1, 2010 to June 30, 2014. 40 Electronic copy available at: https://ssrn.com/abstract=3867129 Exclude simple Account- Definition of 60% cutoff dummy positions in short call 70% cutoff dummy 80% cutoff dummy day dominant strategy: and long put observations Risk- t-statistic Mean daily Sharpe ratio Mean daily Sharpe Mean daily Sharpe Mean daily Sharpe Dependent variable: adjusted of risk-adj. return from from Return return ratio return ratio return ratio return return positions positions 1 2 3 4 5 6 7 8 9 10 11 Intercept 0.027*** 0.100*** 0.008*** -0.028*** 0.018*** 0.006*** 0.018*** -0.004*** 0.013*** -0.018*** 0.021*** (14.54) (14.66) (3.80) (-6.41) (17.97) (4.57) (22.1) (-3.93) (17.12) (-17.85) (64.78) Institution 0.000 0.158*** 0.034*** 0.095*** 0.027*** 0.096*** 0.031*** 0.107*** 0.034*** 0.115*** 0.024*** (-0.09) (8.13) (5.93) (7.46) (8.26) (23.07) (11.85) (29.59) (13.01) (31.95) (20.68) Day trader -0.033*** -0.172*** -0.001 0.026* -0.010*** -0.009** -0.011*** 0.000 -0.006** 0.012*** 0.000 (-5.85) (-8.41) (-0.21) (1.96) (-3.19) (-2.05) (-4.09) (-0.07) (-2.24) (3.12) (0.17) Simple strategy trader -0.041*** -0.362*** -0.082*** -0.175*** -0.048*** -0.104*** -0.061*** -0.130*** -0.057*** -0.121*** -0.076*** (-18.87) (-45.36) (-34.85) (-34.1) (-38.41) (-64.56) (-60.5) (-94.2) (-59.64) (-91.81) (-164.0) Volatility trader 0.082*** 0.187*** 0.068*** 0.001 0.038*** 0.000 0.082*** 0.052*** 0.100*** 0.078*** 0.054*** (18.26) (11.36) (13.91) (0.09) (17.89) (0.06) (32.0) (14.71) (32.52) (18.43) (79.86) Greek neutral trader 0.017*** 0.356*** 0.023*** 0.092*** 0.013*** 0.075*** 0.014*** 0.091*** 0.019*** 0.110*** 0.036*** (2.94) (16.43) (3.64) (6.60) (3.91) (16.99) (3.84) (18.6) (3.82) (16.33) (37.02) N observations 122,620 122,431 121,873 121,780 118,849 118,817 122,620 122,617 122,620 122,617 25,771,249 Adjusted R2 0.0090 0.0314 0.0190 0.0153 0.0251 0.0576 0.0526 0.1048 0.0474 0.0956 0.0020 41 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "References",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 51,
    "chunk_index": 75,
    "word_count": 296,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "0.013*** 0.075*** 0.014*** 0.091*** 0.019*** 0.110*** 0.036*** (2.94) (16.43) (3.64) (6.60) (3.91) (16.99) (3.84) (18.6) (3.82) (16.33) (37.02) N observations 122,620 122,431 121,873 121,780 118,849 118,817 122,620 122,617 122,620 122,617 25,771,249 Adjusted R2 0.0090 0.0314 0.0190 0.0153 0.0251 0.0576 0.0526 0.1048 0.0474 0.0956 0.0020 41 Electronic copy available at: https://ssrn.com/abstract=3867129 Table 8 Profitability of the Different Investor Accounts: Regression analyses in subsamples This table repeats the profitability regressions of Table 6 in the subsamples of institutions and retail investors separately. All variables are the same as in Table 6. The table contains the estimated regression coefficients and below them the corresponding t-statistics in parentheses. ***, **, and * indicate statistical significance at the 1%, 5%, and 10% levels, respectively. The sample time period is from January 1, 2010 to June 30, 2014. Subsample: Institutions Retail investors Mean daily Sharpe Mean daily Sharpe Dependent variable: return ratio return ratio 1 2 3 4 Intercept 0.028*** 0.059*** 0.024*** 0.010*** (8.65) (11.2) (25.2) (8.04) Day trader 0.015** 0.107*** -0.018*** -0.029*** (2.33) (10.25) (-5.94) (-7.05) Simple strategy trader 0.032*** -0.008 -0.066*** -0.142*** (5.14) (-0.77) (-59.53) (-94.78) Volatility trader 0.082*** 0.074*** 0.064*** 0.025*** (6.8) (3.82) (27.95) (7.92) Greek neutral trader 0.005 0.096*** 0.012*** 0.073*** (0.57) (7.4) (3.72) (17.06) N observations 3,972 3,971 118,648 118,646 Adjusted R2 0.0152 0.0382 0.0533 0.0983 42 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "References",
    "page_number": 44,
    "page_range": "p.44-45",
    "total_pages": 51,
    "chunk_index": 76,
    "word_count": 221,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.44-45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "Simple strategy trader 0.032*** -0.008 -0.066*** -0.142*** (5.14) (-0.77) (-59.53) (-94.78) Volatility trader 0.082*** 0.074*** 0.064*** 0.025*** (6.8) (3.82) (27.95) (7.92) Greek neutral trader 0.005 0.096*** 0.012*** 0.073*** (0.57) (7.4) (3.72) (17.06) N observations 3,972 3,971 118,648 118,646 Adjusted R2 0.0152 0.0382 0.0533 0.0983 42 Electronic copy available at: https://ssrn.com/abstract=3867129 Table 9 Out-of-Sample Trading Style Persistence This table presents transition matrices containing the percentage of accounts by trading style in-sample and out-of-sample. We divide the sample into two equal subperiods and follow the same method as before using 60% cutoffs to extract the dominant strategy of each account in the two subperiods. Therefore, in-sample (out-of-sample) trading style of each account is its dominant strategy in the first (second) half of the sample. We only keep accounts that trade in both subperiods. Panel A shows the transition matrix for the trading styles of institutions, and Panel B for retail investors. The diagonals reflect trading style persistence. The sample time period is from January 1, 2010 to June 30, 2014. Panel A: Institutions Out-of-sample trading style Simple Greek Volatility strategy neutral Other trader trader trader Simple strategy 75.8% 1.3% 0.6% 22.3% trader Volatility 7.9% 68.4% 2.6% 21.1% trader In-sample trading style Greek neutral 1.3% 0.0% 68.0% 30.7% trader Other 5.8% 1.0% 10.5% 82.7% Panel B: Retail investors Out-of-sample trading style Simple Greek Volatility strategy neutral Other trader trader trader Simple strategy 89.3% 1.5% 0.1% 9.2% trader Volatility 14.7% 47.2% 1.0% 37.1% trader In-sample trading style Greek neutral 3.2% 1.1% 67.2% 28.5% trader Other 23.2% 5.2% 4.6% 67.0% 43 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "References",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 51,
    "chunk_index": 77,
    "word_count": 261,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "Panel B: Retail investors Out-of-sample trading style Simple Greek Volatility strategy neutral Other trader trader trader Simple strategy 89.3% 1.5% 0.1% 9.2% trader Volatility 14.7% 47.2% 1.0% 37.1% trader In-sample trading style Greek neutral 3.2% 1.1% 67.2% 28.5% trader Other 23.2% 5.2% 4.6% 67.0% 43 Electronic copy available at: https://ssrn.com/abstract=3867129 Table 10 Out-of-Sample Performance Persistence In the same way as in Table 9, we split our sample into two equal subperiods and define the dominant strategy of each account in the first half of the sample. Accordingly, we mark simple strategy traders, volatility traders, and Greek neutral traders in-sample. For each account, we calculate mean daily return and Sharpe ratio in the second half of the sample. We then test the relation of in-sample trading styles with out-of-sample account performance. We only keep accounts that trade in both subperiods, and we perform separate regressions in the subsamples of institutions and retail investors. The table contains the estimated regression coefficients and below them the corresponding t-statistics in parentheses. ***, **, and * indicate statistical significance at the 1%, 5%, and 10% levels, respectively. The sample time period is from January 1, 2010 to June 30, 2014. Subsample: Institutions Retail investors Mean daily return Sharpe ratio Mean daily return Sharpe ratio Dependent variable: out-of-sample out-of-sample out-of-sample out-of-sample 1 2 3 4 Intercept 0.029*** 0.068*** 0.023*** 0.018** (3.73) (5.88) (14.67) (2.03) Day trader 0.014 0.097*** -0.012*** 0.005 (1.26) (5.81) (-2.62) (0.20) Simple strategy trader in-sample 0.037** -0.011 -0.066*** -0.166*** (2.36) (-0.47) (-33.42) (-15.55) Volatility trader in-sample 0.287*** 0.142*** 0.098*** 0.042** (9.95) (3.27) (26.12) (2.07) Greek neutral trader in-sample 0.007 0.062* 0.018*** 0.060* (0.34) (1.94) (2.87) (1.79) N observations 1,242 1,238 34,406 34,379 Adjusted R2 0.0729 0.0335 0.0759 0.0098 44 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "References",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 51,
    "chunk_index": 78,
    "word_count": 291,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "in-sample 0.037** -0.011 -0.066*** -0.166*** (2.36) (-0.47) (-33.42) (-15.55) Volatility trader in-sample 0.287*** 0.142*** 0.098*** 0.042** (9.95) (3.27) (26.12) (2.07) Greek neutral trader in-sample 0.007 0.062* 0.018*** 0.060* (0.34) (1.94) (2.87) (1.79) N observations 1,242 1,238 34,406 34,379 Adjusted R2 0.0729 0.0335 0.0759 0.0098 44 Electronic copy available at: https://ssrn.com/abstract=3867129 Table 11 Profitability From the Dominant Strategy Versus Nondominant Strategies This table shows the results of OLS regressions in the panel data, using account-day returns of institutions and retail investors as the dependent variable. We regress those on the same dummies for dominant trading style of each account. However, an account may use strategies other than their dominant one on some days. Accordingly, we add nondominant strategy dummies equal to 1 on such days. For example, Simple strategy trader using nondominant strategy is a dummy variable equal to 1 on days when a simple strategy trader holds positions in volatility, Greek neutral, or other strategies, and equal to 0 on days when the account holds simple positions. The table contains the estimated regression coefficients and below them the corresponding t-statistics in parentheses. ***, **, and * indicate statistical significance at the 1%, 5%, and 10% levels, respectively. The sample time period is from January 1, 2010 to June 30, 2014. Subsample: Institutions Retail investors Dependent variable: Return Return 1 2 Intercept 0.027*** 0.034*** (19.48) (88.47) Day trader 0.030*** -0.018*** (8.72) (-7.87) Simple strategy trader 0.055*** -0.097*** (13.17) (-186.3) Simple strategy trader using nondominant strategy -0.023*** 0.074*** (-4.64) (133.5) Volatility trader 0.207*** 0.126*** (29.49) (107.9) Volatility trader using nondominant strategy -0.173*** -0.108*** (-15.47) (-57.83) Greek neutral trader -0.006 0.000 (-1.44) (-0.05) Greek neutral trader using nondominant strategy 0.056*** 0.038*** (7.67) (13.67) N observations 881,443 24,889,806 Adjusted R2 0.0012 0.0025 45 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "References",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 51,
    "chunk_index": 79,
    "word_count": 294,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "-0.023*** 0.074*** (-4.64) (133.5) Volatility trader 0.207*** 0.126*** (29.49) (107.9) Volatility trader using nondominant strategy -0.173*** -0.108*** (-15.47) (-57.83) Greek neutral trader -0.006 0.000 (-1.44) (-0.05) Greek neutral trader using nondominant strategy 0.056*** 0.038*** (7.67) (13.67) N observations 881,443 24,889,806 Adjusted R2 0.0012 0.0025 45 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "References",
    "page_number": 48,
    "page_range": "p.48",
    "total_pages": 51,
    "chunk_index": 80,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "Table 12 Effect of Behavioral Biases on Retail Investors’ Trading Style This table reports logistic regressions for the probability of retail investors using a particular trading style given variables which are proxies for well-known behavioral biases potentially related to retail behavior and profitability. Trading volume refers to the logarithm of average daily options trading volume, which serves as a proxy for overconfidence or excessive trading. Disposition effect is measured as an account’s proportion of gains realized (PGR) minus proportion of losses realized (PLR). On a given day, PGR is the total number of contracts with realized gains (positions closed at a gain) divided by that number plus the total number of contracts with paper gains (open positions which have increased in value from the previous day). PLR is calculated similarly. Then, we sum the daily values over the sample time period, and we take the difference of PGR and PLR. (Disposition effect is 0 for day traders.) OTM contracts bought refers to the percentage of positions in long OTM contracts (for position holders) or the percentage of opening intraday trades buying OTM contracts (for day traders). This is a measure of lottery preference. Sensitivity of delta to KOSPI 200 index return is derived by regressing an account’s end-of-day position delta scaled by position size (for position holders), or the volume- weighted average delta of opening intraday trades (for day traders), on past five-day average index return. This is a proxy for trend chasing (extrapolation) behavior. Sensitivity of investor activity to performance is derived by regressing position size (for position holders) or intraday trading volume (for day traders) on past five-day average return of the investor. This is a proxy for self-attribution bias. The % of volume initiated is a proxy for transaction costs. Finally, we include a dummy equal to 1 if the account is a foreign investor. The table contains the estimated regression coefficients and below them the corresponding t-statistics in parentheses. ***, **, and * indicate statistical significance at the 1%, 5%, and 10% levels, respectively. The sample time period is from January 1, 2010 to June 30, 2014. Subsample: Retail investors Simple strategy Volatility Greek neutral Dependent variable: trader trader trader 1 2 3 Intercept 0.244*** -1.995*** -5.618*** (8.97) (-36.21) (-70.01) Trading volume 0.034*** -0.124*** 0.252*** (7.79) (-13.36) (21.27) Disposition effect 0.868*** -0.314*** -0.954*** (25.8) (-4.48) (-10.28) OTM contracts bought 2.267*** -3.876*** -0.416*** (87.14) (-48.85) (-5.98) Sensitivity of delta to KOSPI 200 index return -1.265* 2.864** 3.869** (-1.72) (2.11) (2.20) Sensitivity of investor activity to performance -2.531* -1.692 -3.439* (-1.88) (-0.57) (-1.78) % of volume initiated -0.978*** 0.778*** 1.937*** (-33.06) (13.43) (26.79) Foreign investor -0.393*** 0.330* 0.844*** (-3.89) (1.77) (4.18) N observations 113,915 113,915 113,915 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "References",
    "page_number": 48,
    "page_range": "p.48",
    "total_pages": 51,
    "chunk_index": 81,
    "word_count": 453,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "KOSPI 200 index return -1.265* 2.864** 3.869** (-1.72) (2.11) (2.20) Sensitivity of investor activity to performance -2.531* -1.692 -3.439* (-1.88) (-0.57) (-1.78) % of volume initiated -0.978*** 0.778*** 1.937*** (-33.06) (13.43) (26.79) Foreign investor -0.393*** 0.330* 0.844*** (-3.89) (1.77) (4.18) N observations 113,915 113,915 113,915 Electronic copy available at: https://ssrn.com/abstract=3867129 Table 13 Do Behavioral Biases Drive the Profitability Results? This table shows regressions of retail investors’ profitability on the trading style dummies with added control variables for each of the behavioral hypotheses. See Table 12 for the definitions of the behavioral proxies. The table contains the estimated regression coefficients and below them the corresponding t-statistics in parentheses. ***, **, and * indicate statistical significance at the 1%, 5%, and 10% levels, respectively. The sample time period is from January 1, 2010 to June 30, 2014. Subsample: Retail investors Mean daily Sharpe Dependent variable: return ratio 1 2 Intercept 0.045*** 0.071*** (21.16) (29.49) Day trader -0.026*** -0.045*** (-8.69) (-13.00) Simple strategy trader -0.057*** -0.128*** (-50.59) (-99.14) Volatility trader 0.057*** 0.014*** (25.09) (5.42) Greek neutral trader 0.015*** 0.081*** (4.85) (23.01) Trading volume -0.002*** -0.005*** (-7.09) (-15.05) Disposition effect -0.011*** -0.045*** (-4.62) (-16.91) OTM contracts bought -0.056*** -0.087*** (-32.47) (-44.51) Sensitivity of delta to KOSPI 200 index return 0.020 0.042 (0.60) (1.09) Sensitivity of investor activity to performance 0.006 0.672*** (0.06) (6.42) % of volume initiated 0.004** -0.030*** (2.07) (-12.33) Foreign investor 0.007 0.024*** (0.94) (2.76) N observations 113,915 113,915 Adjusted R2 0.0646 0.1558 47 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "References",
    "page_number": 49,
    "page_range": "p.49",
    "total_pages": 51,
    "chunk_index": 82,
    "word_count": 247,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "Sensitivity of delta to KOSPI 200 index return 0.020 0.042 (0.60) (1.09) Sensitivity of investor activity to performance 0.006 0.672*** (0.06) (6.42) % of volume initiated 0.004** -0.030*** (2.07) (-12.33) Foreign investor 0.007 0.024*** (0.94) (2.76) N observations 113,915 113,915 Adjusted R2 0.0646 0.1558 47 Electronic copy available at: https://ssrn.com/abstract=3867129 Table I Strategies of Position Holders This table is an extended version of Table 3. It provides a breakdown of the different options strategies in each of the five main categories. All Institutions Retail investors Number of account-days with a position in options 19,135,324 539,680 18,595,644 Number of option contracts held in open positions 4,822,669,794 2,916,207,458 1,906,462,336 % of all % of all % of instit. % of instit. % of retail % of retail account-days open positions account-days open positions account-days open positions Combinations of options and futures 6.24% 37.6% 34.4% 55.4% 5.42% 10.5% ● Long covered calls 0.21% 0.10% 0.44% 0.11% 0.21% 0.08% ● Short covered calls 0.28% 0.14% 1.35% 0.08% 0.25% 0.24% ● Long protective puts 0.24% 0.12% 0.93% 0.14% 0.22% 0.08% ● Short protective puts 0.25% 0.13% 0.86% 0.06% 0.24% 0.25% ● Greek neutral 0.59% 14.8% 7.20% 22.6% 0.40% 2.83% ● Other combinations 4.66% 22.4% 23.6% 32.4% 4.11% 7.02% Simple strategies 55.7% 7.14% 18.8% 1.35% 56.8% 16.0% ● Long call 30.2% 3.68% 3.62% 0.24% 31.0% 8.94% ● Short call 2.04% 0.43% 6.28% 0.36% 1.92% 0.54% ● Long put 21.3% 2.61% 6.05% 0.66% 21.7% 5.58% ● Short put 2.17% 0.42% 2.88% 0.08% 2.15% 0.94% (continued) 48 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "Appendix",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 51,
    "chunk_index": 83,
    "word_count": 254,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Appendix (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "strategies 55.7% 7.14% 18.8% 1.35% 56.8% 16.0% ● Long call 30.2% 3.68% 3.62% 0.24% 31.0% 8.94% ● Short call 2.04% 0.43% 6.28% 0.36% 1.92% 0.54% ● Long put 21.3% 2.61% 6.05% 0.66% 21.7% 5.58% ● Short put 2.17% 0.42% 2.88% 0.08% 2.15% 0.94% (continued) 48 Electronic copy available at: https://ssrn.com/abstract=3867129 Table I (continued) All Institutions Retail investors % of all % of all % of instit. % of instit. % of retail % of retail account-days open positions account-days open positions account-days open positions Volatility trading strategies 16.5% 7.24% 9.43% 2.90% 16.7% 13.9% ● Long volatility 8.32% 1.75% 1.84% 0.94% 8.51% 2.99% ● straddle 0.18% 0.02% 0.04% 0.00% 0.18% 0.04% ● strangle 4.67% 0.49% 0.64% 0.05% 4.78% 1.15% ● butterfly 0.03% 0.01% 0.10% 0.01% 0.03% 0.01% ● combinations 3.44% 1.23% 1.05% 0.88% 3.51% 1.78% ● Short volatility 8.14% 5.49% 7.59% 1.95% 8.16% 10.9% ● straddle 0.20% 0.02% 0.43% 0.01% 0.19% 0.04% ● strangle 2.56% 0.90% 1.52% 0.16% 2.59% 2.01% ● butterfly 0.01% 0.00% 0.01% 0.00% 0.01% 0.00% ● combinations 5.37% 4.57% 5.64% 1.78% 5.37% 8.84% Spreads 3.68% 2.89% 9.54% 2.65% 3.51% 3.25% ● Long synthetic stock 0.46% 0.12% 1.97% 0.07% 0.41% 0.20% ● Short synthetic stock 0.42% 0.19% 1.57% 0.22% 0.39% 0.14% ● Bull / bear spread 2.78% 2.58% 5.98% 2.37% 2.68% 2.90% ● Calendar spread 0.03% 0.00% 0.01% 0.00% 0.03% 0.01% Other options strategies 17.9% 45.1% 27.8% 37.7% 17.6% 56.4% ● Greek neutral 6.49% 25.8% 14.0% 21.8% 6.27% 32.1% ● Others 11.4% 19.3% 13.8% 16.0% 11.4% 24.3% 49 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "Appendix",
    "page_number": 51,
    "page_range": "p.51",
    "total_pages": 51,
    "chunk_index": 84,
    "word_count": 254,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Appendix (p.51)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  },
  {
    "text": "/ bear spread 2.78% 2.58% 5.98% 2.37% 2.68% 2.90% ● Calendar spread 0.03% 0.00% 0.01% 0.00% 0.03% 0.01% Other options strategies 17.9% 45.1% 27.8% 37.7% 17.6% 56.4% ● Greek neutral 6.49% 25.8% 14.0% 21.8% 6.27% 32.1% ● Others 11.4% 19.3% 13.8% 16.0% 11.4% 24.3% 49 Electronic copy available at: https://ssrn.com/abstract=3867129",
    "title": "Who Profits From Trading Options 20210614",
    "source_type": "pdf",
    "document_id": "ae1e850e407a",
    "source_file": "Who Profits From Trading Options.pdf",
    "section": "Appendix",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 51,
    "chunk_index": 85,
    "word_count": 50,
    "author": "jianfenghu",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Appendix (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20210615143132+08'00'",
    "duration": null
  }
]