[
  {
    "text": "Why do firms repurchase stock? Amy K. Dittmar * Indiana University July 1999 Forthcoming in Journal of Business In this paper, I investigate the relation between stock repurchases and distribution, investment, capital structure, corporate control, and compensation policies over the 1977 to 1996 period. I allow the significance of each motive to change over time to account for adjustments in the percentage of firms influenced by each motive. I find that, throughout the sample period, firms repurchase stock to take advantage of potential undervaluation and, in many periods, to distribute excess capital. However, firms also repurchase stock during certain periods to alter their leverage ratio, fend off takeovers, and counter the dilution effects of stock options. 1",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 33,
    "chunk_index": 0,
    "word_count": 117,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "motive. I find that, throughout the sample period, firms repurchase stock to take advantage of potential undervaluation and, in many periods, to distribute excess capital. However, firms also repurchase stock during certain periods to alter their leverage ratio, fend off takeovers, and counter the dilution effects of stock options. 1",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 33,
    "chunk_index": 1,
    "word_count": 50,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "Why do firms repurchase stock? Jensen (1986) states that firms repurchase stock to distribute excess cash flow. Stephens and Weisbach (1998) find a positive relation between repurchases and levels of cash flow, which supports this hypothesis. Stephens and Weisbach also show that repurchase activity is negatively correlated with prior stock returns, indicating that firms repurchase stock when their stock prices are perceived as undervalued. This result agrees with Vermaelen’s (1981) findings that firms repurchase stock to signal undervaluation. Thus, firms repurchase stock when they are undervalued and have the excess cash to distribute. However, these are not the only motives for repurchasing. Bagwell and Shoven (1988) and Opler and Titman (1996) discuss and show the impact repurchasing stock has on leverage. The results of these papers show that firms may repurchase stock to increase their leverage ratio. Bagwell (1991) explains how repurchases are used to fend off unwanted takeover attempts and Jolls (1996) and Fenn and Liang (1997) illustrate that firms use repurchases to counter the dilution effects of employee and management stock options. Clearly, firms may repurchase stock for many reasons. The decision to repurchase stock is therefore impacted by the firm’s distribution, investment, capital structure, corporate control, and compensation policies. Many papers examine how these corporate decisions influence the decision to repurchase. However, most studies focus on one or two motives. By focusing on only a few motives researchers limit the findings by: 1) ignoring other potential motives that may significantly influence the repurchase decision; and 2) ignoring the relation between these hypotheses and allowing for the possibility that firms will only repurchase stock if multiple criteria are met. For instance, many papers focus on firms’ distribution policy and the choice between repurchases and dividends. However, distribution policy is only one of the influences on firms’ decision to repurchase. Other studies consider the relation between repurchasing stock and a few of these corporate policies, but no one study investigates all of these motives to repurchase stock. In this paper, I investigate each of the hypotheses discussed above to understand why firms repurchase stock and how these motives interrelate. 2",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 33,
    "chunk_index": 2,
    "word_count": 351,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "Other studies consider the relation between repurchasing stock and a few of these corporate policies, but no one study investigates all of these motives to repurchase stock. In this paper, I investigate each of the hypotheses discussed above to understand why firms repurchase stock and how these motives interrelate. 2",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 33,
    "chunk_index": 3,
    "word_count": 50,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "I test each of the previously mentioned hypotheses by examining firms’ actual repurchases in individual censored regression models for each year between 1977 and 1996 to allow the coefficients and intercept to vary by year. i If the model is constrained such that the coefficients are constant, then the tests may not detect the significance of time-varying factors, which influence firms’ motives for repurchasing. Many of the potential motives for repurchasing stock may influence a large fraction of firms during one time period but only a small fraction during another period. For instance, the use of management stock options increased in the late 1980s and early 1990s. If firms repurchase stock, in part, to counter the dilution effects of stock options, then we may expect the impact of this motive to increase in this period. Also, the threat of a takeover may be strong for a larger percentage of firms during periods of peak merger activity. Thus, more firms will repurchase stock to fend off takeover attempts during these periods. The fraction of firms influenced by other motives may change for similar reasons. It is therefore imperative to allow motives to move in and out of significance over the sample period. This paper expands our understanding of why firms repurchase stock, by examining a thorough list of the motives to repurchase and by allowing the impact of firms’ motives to change over time. The results show that firms repurchase stock to take advantage of potential undervaluation throughout the sample period. This result is somewhat surprising since large firms are the dominant repurchasers and, according to Vermaelen (1981), are therefore less likely to be misvalued. However, the relation between valuation and repurchasing is consistent with other studies such as Stephens and Weisbach (1998). Firms also repurchase stock in many sample periods to distribute excess capital and alter leverage ratios. However, repurchases are not a replacement for dividends since repurchasing firms do not pay lower dividends. In addition to these three motives, firms also repurchase stock to fend off takeovers and counter the dilution effects of stock options in limited sub-periods. During the mid-1980s, firms are more likely to repurchase stock to fend off takeover attempts. This period coincides with an active takeover market and it is likely that a larger percentage of firms were threatened by unwanted takeover attempts and used antitakeover measures. Firms also repurchase stock to counter the dilution 3",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 33,
    "chunk_index": 4,
    "word_count": 401,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "mid-1980s, firms are more likely to repurchase stock to fend off takeover attempts. This period coincides with an active takeover market and it is likely that a larger percentage of firms were threatened by unwanted takeover attempts and used antitakeover measures. Firms also repurchase stock to counter the dilution 3",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 33,
    "chunk_index": 5,
    "word_count": 50,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "effects of stock options during the late-1980s and early 1990s. During this period, the use of management stock options increased and thus more firms may prefer repurchases to dividends. The remainder of the paper is organized as follows. Section 1 discusses firms’ potential motives for stock repurchases. Section 2 specifies the methods used to test the hypotheses. Section 3 describes the data. Section 4 presents the results. Section 5 concludes the paper. 1 Motives for Stock Repurchases There are several reasons a firm may repurchase stock. It is therefore important to consider all motives when investigating why firms repurchase stock. In the following section, I discuss each of the motives examined in this paper. 1.1. Excess Capital Hypothesis: Repurchases and Distribution policy When a firm’s capital exceeds its investment opportunities, the firm can either retain the excess cash or distribute it to shareholders [Easterbrook (1984) and Jensen (1986)]. Repurchasing stock, like paying dividends, is one method to distribute excess capital to shareholders. A repurchase may be preferred to dividends for two reasons. First, in open market repurchases (the most prevalent type), the firm does not have a commitment to repurchase. Additionally, unlike a dividend, there is no expectation that the distribution will recur on a regular basis. Thus, a repurchase is a more flexible means of distributing capital since a penalty is incurred if dividends are subsequently reduced [Bajaj and Vijh (1990), Kaplan and Reishus (1990), and Denis, Denis and Sarin (1994)]. Firms may therefore choose to repurchase to distribute excess capital. We expect firms with high levels of excess cash or cash flow to repurchase stock.ii Stock repurchases may also be preferred over dividends as a means of distribution due to the personal tax rate advantage of capital gains. This tax advantage of stock repurchases exists because capital gains are often taxed at a lower rate than dividend income, only the portion of the repurchase that is a capital gain is taxed, and investors can defer the capital gains tax until they realize the gain and sell 4",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 33,
    "chunk_index": 6,
    "word_count": 339,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "gains. This tax advantage of stock repurchases exists because capital gains are often taxed at a lower rate than dividend income, only the portion of the repurchase that is a capital gain is taxed, and investors can defer the capital gains tax until they realize the gain and sell 4",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 33,
    "chunk_index": 7,
    "word_count": 50,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "their stock. In 1986, the government increased the capital gains tax rate to phase out the capital gains tax preference. If dividends and repurchases are substitutes, this regulatory change should cause the volume of repurchases to decrease subsequent to the implementation of the change. Additionally, if repurchases and dividends are substitutes, then stock repurchases should be negatively related to a firm’s dividend payout ratio. 1.2 Undervaluation Hypothesis: Repurchases and Investment policy Stock repurchases offer flexibility not only in the choice to distribute excess funds but also when to distribute these funds. This flexibility in timing is beneficial because firms can wait to repurchase until the stock price is undervalued.iii The undervaluation hypothesis is based on the premise that information asymmetry between insiders and shareholders may cause a firm to be misvalued. If insiders believe that the stock is undervalued, the firm may repurchase stock as a signal to the market or to invest in its own stock and acquire mispriced shares. According to this hypothesis, the market interprets the action as an indication that the stock is undervalued. iv The positive stock price reaction at the announcement of a stock repurchase program should correct the misvaluation [Vermaelen (1981), Dann (1981), and Comment and Jarell (1991)]. Ikenberry, Lakonishok and Vermaelen (1995) show that this increase may not be sufficient to correct the price since repurchasing firms, particularly low market to book firms, earn a positive abnormal return during the four years subsequent to the announcement. The amount of information available and the accuracy of the valuation of firms by the market can affect firms’ repurchase decisions. 1.3 Optimal Leverage Ratio Hypothesis: Repurchases and Capital Structure policy In section 1.1, I explain how repurchases can be used to distribute excess funds to shareholders. When the firm distributes this capital, it reduces its equity and increases its leverage ratio. Assuming that an optimal leverage ratio exists, firms may use a stock repurchase to achieve this target ratio [Bagwell 5",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 33,
    "chunk_index": 8,
    "word_count": 326,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "section 1.1, I explain how repurchases can be used to distribute excess funds to shareholders. When the firm distributes this capital, it reduces its equity and increases its leverage ratio. Assuming that an optimal leverage ratio exists, firms may use a stock repurchase to achieve this target ratio [Bagwell 5",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 33,
    "chunk_index": 9,
    "word_count": 50,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "and Shoven (1988) and Opler and Titman (1996)].v A firm is therefore more likely to repurchase stock if its leverage ratio is below its target leverage ratio. Thus, a firm’s capital structure will affect its decision to repurchase. 1.4 Management Incentive Hypothesis: Repurchases and Compensation policy By absorbing equity, a stock repurchase not only alters the firms’ leverage ratio, but it also allows the manager of the firm to distribute cash without diluting the per share value of the stock. Preserving the stock price may be of particular interest when management holds stock options. Thus, stock options encourage managers to substitute repurchases for dividends since repurchases do not dilute the per share value of the firm and the shares provided to managers when they exercise options are often from treasury stock [Jolls (1996), Dunsby (1994), and Fenn and Liang (1997)].vi A firm that compensates its executives with a large number of stock options may find it beneficial to repurchase stock. 1.5 Takeover deterrence hypothesis: Repurchases and corporate control Each of the previously discussed hypotheses relate the decision to repurchase to an internal company decision that impacts the firm and its investors. However, repurchases may also impact the relationship between the firm and outside parties. Bagwell (1992), Brown and Ryngaert (1991) and Hodrick (1996) document the existence of shareholder heterogeneity and the upward slope of the supply curve. In the presence of an upward sloping supply curve for shares, a potential target can increase the cost of an acquisition by repurchasing stock. Stock repurchases increase the acquisition price because shareholders selling in a stock repurchase are those with the lowest reservation values. Thus, a repurchase can be used as a takeover defense because a repurchase can increase the lowest price for which the stock is available [Bagwell (1991)]. According to this hypothesis, firms that are at a higher risk of becoming takeover targets are more likely to repurchase stock. 6",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 33,
    "chunk_index": 10,
    "word_count": 319,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "reservation values. Thus, a repurchase can be used as a takeover defense because a repurchase can increase the lowest price for which the stock is available [Bagwell (1991)]. According to this hypothesis, firms that are at a higher risk of becoming takeover targets are more likely to repurchase stock. 6",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 33,
    "chunk_index": 11,
    "word_count": 50,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "Each of these hypotheses explains one reason why firms repurchase stock. Firms may repurchase for any one of these reasons or they may only repurchase if several criteria are met. To determine which motives influence firms’ decision to repurchase stock, I test each of these hypotheses in a censored regression analysis. 2 Testing Methodologies I test the six hypotheses discussed above with the following tobit model estimated for each sample year using cross-sectional data.vii REP = α + β CASHFLOW + β CASH + β MKBK + it it 1 i t-1 2 i t-1 3 i t-1 β PAYOUT + βlnASST + βRETURN + (1) 4 i t-1 5 i t-1 6 i t-1 βLEVER + β TAKEOVER + β OPTIONS 7 i t-1 8 i t-1 9 i t-1 where i represents the firm, t represents time measured by a firm’s fiscal year end, and REP is the dollar volume of repurchases divided by the prior year end market value of equity.viii I measure the dollar volume of stock repurchases using Compustat data item Purchase of Stock.ix As discussed in Stephens and Weisbach (1998), these data overstate stock repurchases because they include: 1) conversions of class A, class B, and special stock into common stock; 2) conversions of preferred stock into common stock; 3) purchases of treasury stock; 4) retirement or redemption of common stock; 5) retirement of preferred stock; and 6) retirement or redemption of redeemable preferred stock. In this paper, I am only interested in item 3, purchase of treasury stock. I therefore reduce Purchase of Stock for year t by any decrease in preferred stock that occurs between t-1 and t. This removes items 2, 5, and 6. The resulting item may still be overstated by the amount of class A, class B, and special stock converted into common stock and the amount of retired common stock. However, the frequency of these events is much less than 7",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 33,
    "chunk_index": 12,
    "word_count": 323,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "t-1 and t. This removes items 2, 5, and 6. The resulting item may still be overstated by the amount of class A, class B, and special stock converted into common stock and the amount of retired common stock. However, the frequency of these events is much less than 7",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 33,
    "chunk_index": 13,
    "word_count": 50,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "that of stock repurchases. I further screen stock repurchases by setting repurchases equal to zero for any firm that does not repurchase at least 1% of its market value of equity.x It is possible that some methods of repurchasing may be preferred to others depending on the firm’s motives to repurchase. xi I therefore examine all stock repurchases, regardless of the method used. The sample will inevitably be dominated by open market repurchases but by broadening the types of repurchases I examine, I am better able to test why firms repurchase stock. The first hypothesis I examine is the excess capital hypothesis. If firms repurchase stock to distribute excess capital, then stock repurchases are positively related to firms’ cash in excess of investment opportunities. To test this hypothesis, I include CASH and CASHFLOW, the ratio of cash and equivalents to total assets at the end of the year prior to the repurchase and the ratio of net income before taxes plus depreciation and changes in deferred taxes and other deferred charges to total assets at the end of the year prior to the repurchase, respectively. If the need to distribute excess capital significantly affects a firm’s repurchase decision, then CASH and CASHFLOW will be positively related to the decision to repurchase and the level of stock repurchases, holding investment opportunities constant. I control for a firm’s investment opportunities by including MKBK, the market value of equity plus debt to the book value of assets at the end of the year prior to the repurchase. Further, if firms repurchase stock as a substitute for dividends to reduce their investors’ tax burden, then low dividend paying firms are more likely to repurchase stock. I include PAYOUT, the ratio of cash dividends paid to net income in the year prior to the repurchase, in the analysis to determine if repurchasing firms pay lower dividends.xii The undervaluation hypothesis predicts that firms repurchase stock when their stock price is lower than its true value. This hypothesis is based on the premise that managers are better informed than the market about the true value of the firm. Thus, firms that repurchase stock are characterized by a high degree of information asymmetry. According to Vermaelen (1981), information asymmetry may be more prominent in small firms because these firms are less covered by analysts and the popular press. Thus, 8",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 33,
    "chunk_index": 14,
    "word_count": 392,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "the market about the true value of the firm. Thus, firms that repurchase stock are characterized by a high degree of information asymmetry. According to Vermaelen (1981), information asymmetry may be more prominent in small firms because these firms are less covered by analysts and the popular press. Thus, 8",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 33,
    "chunk_index": 15,
    "word_count": 50,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "small firms are more likely to be misvalued and more likely to repurchase stock. I include firm size as a proxy for information asymmetry.xiii I measure firm size by the natural log of total assets at the end of the year prior to the repurchase (lnASST). Information asymmetry is a necessary condition for a firm to be misvalued. However, it is not a sufficient condition. In the case of undervaluation, a firm must also have a stock price less than its true value. It is, of course, impossible to determine with certainty if a firm is undervalued. One indication of undervaluation is a history of low returns. Haugen (1995) reports a graph from an early version of Ikenberry, Lakonishok, and Vermaelen (1995) that shows that the erosion in the stock performance of repurchasing firms is concentrated in the year prior to the repurchase announcement. I therefore include RETURN, the value-weighted, market-adjusted stock return in the calendar year prior to the repurchase to measure misvaluation.xiv Since historical return is a backward looking measure of valuation, it may not detect current misvaluations. Lakonishok, Shleifer, and Vishny (1994) and Ikenberry, Lakonishok, and Vermaelen (1995) show that firms with low market to book ratios earn abnormal returns in subsequent periods. Thus, MKBK may indicate a firm’s potential for undervaluation. This interpretation, of course, assumes that the abnormal performance of value stocks is due to misvaluation rather than miscalculation of expected returns or statistical anomalies. xv A negative coefficient on MKBK may indicate that a firm repurchases stock to take advantage of the misvaluation. The optimal leverage ratio hypothesis predicts that firms repurchase stock when their leverage ratio is less than their target leverage ratio. I estimate a firm’s leverage ratio as the ratio of net debt (debt minus cash and equivalents) to total assets. I use net leverage to control for the relation between excess cash and target leverage ratios. If companies have excess cash, their leverage ratio is most likely above their target. I repeat all tests presented in this paper using total debt to assets and find no qualitative difference in the results. I estimate a firm’s target leverage ratio as the median net debt to asset ratio of all firms with the same two digit SIC code.xvi LEVER, the difference between a firm’s net debt to asset ratio in the year prior to the repurchase and the firm’s target net leverage ratio, is included in the analysis to test if firms repurchase stock when their leverage ratios are less than their target. If the optimal 9",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 33,
    "chunk_index": 16,
    "word_count": 425,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "code.xvi LEVER, the difference between a firm’s net debt to asset ratio in the year prior to the repurchase and the firm’s target net leverage ratio, is included in the analysis to test if firms repurchase stock when their leverage ratios are less than their target. If the optimal 9",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 33,
    "chunk_index": 17,
    "word_count": 50,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "leverage ratio hypothesis significantly affects a firm’s decision to repurchase stock, then LEVER will be lower for repurchasing firms than for non-repurchasing firms and the coefficient on this variable will be negative. Data to test the last two hypotheses is limited; thus, I am only able to test the hypotheses in the later sample years. The takeover deterrence hypothesis predicts that firms use repurchases to fend off potential takeover attempts. I include TAKEOVER, a dummy variable equal to one if the firm is the object of a takeover attempt or if there is a rumor of a potential threat of a takeover attempt in either the year prior to or the year of the repurchase to test this hypothesis. These data are available after 1981. The management incentive hypothesis predicts that firms with more outstanding stock options will repurchase stock. I include OPTIONS, the percentage of shares outstanding held in reserve to cover stock options to test this hypothesis. This variable includes shares reserved for employee (non-manager) stock options and therefore may over state the use of managerial stock options. However, these data are highly correlated with firms’ use of managerial stock options [Fenn and Liang (1997)]. 3 Sample and Data Description The sample consists of all firms listed on Compustat and CRSP in any year between 1977 and 1996. I exclude financial institutions, public utilities, and transportation companies (one digit SIC code of 6 or 4, respectively) since these firms were regulated during the sample period and their motives for repurchasing stock may differ from non-regulated firms’ motives. Stock price, stock returns, and market returns data are from the Center for Research in Security Prices (CRSP) and accounting and shares held in reserve for options data are from Compustat. Takeover attempts and rumors of potential takeovers are from Security Data Corporation’s Merger and Acquisition database. Table 1 and Figure 1 detail the dollar volume and mean dollar volume of stock repurchases and cash dividends paid over the sample period. It is evident from these data that the dollar volume of stock repurchases increased dramatically in the mid-1980s, declined in the early 1990s, and subsequently rose 10",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 33,
    "chunk_index": 18,
    "word_count": 357,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "1 and Figure 1 detail the dollar volume and mean dollar volume of stock repurchases and cash dividends paid over the sample period. It is evident from these data that the dollar volume of stock repurchases increased dramatically in the mid-1980s, declined in the early 1990s, and subsequently rose 10",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 33,
    "chunk_index": 19,
    "word_count": 50,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "in the mid-1990s.xvii However, the volume of dividends paid is less volatile over the sample period and follows a different pattern. Table 1 also details the percentage of firms that repurchase stock each year, which follows a pattern similar to the dollar volume of share repurchases. The trend in the dollar volume of stock repurchases and the number of firms repurchasing stock are similar to those documented in other papers. The dollar volume of repurchases approximately mirrors that detailed in Table 1 of Bagwell and Shoven (1989) for the 1977 to 1987 period and concurs with Dunsby (1994). The dollar volume of repurchases in the later sample years are very similar to Stephens and Weisbach’s (1997) measure of dollars repurchased by firms announcing open market repurchase programs as measured by Compustat in their Table 1. Additionally, the trend in the number of firms repurchasing stock is similar to that in Grullon (1997). Though the number of firms and volume of repurchases vary over time, the ratio of repurchases to market value of equity is relatively stable. These results imply that stock repurchase waves may be driven by an increase in the total number of firms repurchasing stock and an increase in the proportion of large firms repurchasing stock. This change in the composition of repurchasing firms is further illustrated in Figure 2. Figure 2 divides each year of observations into quintiles by firm size and illustrates the breakdown of the percentage of firms repurchasing stock. The quintiles are defined by dividing all firms on Compustat that are not in the financial, utility, or transportation industries into quintiles based on total assets. Each sample firm’s total assets at t-1 is compared to these five groups and placed in the appropriate quintile. It is apparent from this graph that large firms substantially increased their repurchasing activity in the mid-1980s. In contrast, the percentage of small firms repurchasing stock either remained stable or decreased. Additionally, a comparison of Figures 1 and 2 illustrate that the pattern of large firms repurchasing stock is more representative of the pattern of the dollar volume of stock repurchases. Table 2 further documents the increase in the median size of repurchasing firms. This table presents summary statistics of all variables discussed in the previous section, which are used to test the 11",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 33,
    "chunk_index": 20,
    "word_count": 384,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "large firms repurchasing stock is more representative of the pattern of the dollar volume of stock repurchases. Table 2 further documents the increase in the median size of repurchasing firms. This table presents summary statistics of all variables discussed in the previous section, which are used to test the 11",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 33,
    "chunk_index": 21,
    "word_count": 50,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "six hypotheses of why firms repurchase stock. A Wilcoxon Rank-Sum test is used to determine if the two sub-samples, repurchasers and non-repurchasers, are drawn from the same population. The median size of repurchasing firms is significantly lower than that of non-repurchasing firms in 1977. However, after 1982, the median size of repurchasing firms is significantly greater than that of non-repurchasing firms. These statistics indicate that, assuming size is an appropriate proxy for information asymmetry, repurchasing firms are characterized by less information asymmetry after 1982. An alternative way to test the undervaluation hypothesis is to measure potential undervaluation. MKBK indicates the potential for future abnormal returns. Repurchasing firms’ median MKBK is significantly less than non- repurchasing firms’ median MKBK in almost every year, indicating that repurchasing firms are more likely to experience positive abnormal returns in the years following the repurchase and are thus more likely undervalued. Thus, the MKBK summary statistics provide support for the undervaluation hypothesis. However, repurchasing firms’ median RETURN is significantly greater than that of non- repurchasing firms in several sample years, indicating that repurchasing firms outperform rather than underperform relative to non-repurchasing firms. The summary statistics in Table 2 also support the excess capital hypothesis in almost every sample year, but particularly after 1981. Repurchasing firms’ median CASHFLOW is significantly larger than that of non-repurchasing firms in every year after 1981. Repurchasing firms’ median CASH is significantly greater than that of non-repurchasing firms in every year between 1977 and 1982 and between 1984 and 1993, except 1986. Additionally, repurchasing firms’ investment opportunities, as measured by MKBK, are significantly less than those of non-repurchasing firms between 1977 and 1986, between 1988 and 1991, and 1995. The optimal leverage hypothesis is inherently related to the excess capital hypothesis; thus, it is not surprising that it too is supported by the summary statistics. Repurchasing firms’ median LEVER is less than that of non-repurchasing firms in all but three years. Though firms repurchase stock when they have excess cash to distribute, repurchases do not replace dividends. Repurchasing firms’ median PAYOUT is significantly greater than that of non- 12",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 33,
    "chunk_index": 22,
    "word_count": 348,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "is supported by the summary statistics. Repurchasing firms’ median LEVER is less than that of non-repurchasing firms in all but three years. Though firms repurchase stock when they have excess cash to distribute, repurchases do not replace dividends. Repurchasing firms’ median PAYOUT is significantly greater than that of non- 12",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 33,
    "chunk_index": 23,
    "word_count": 50,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "repurchasing firms in several sample years and in no year do repurchasing firms pay lower dividends relative to non-repurchasing firms. This indicates that repurchasing firms pay out more rather than less in dividends than non-repurchasers. An alternative way to examine how dividend clienteles influence a firm’s choice to repurchase stock is to compare changes in the volume of repurchases to the changes in the capital gains tax. If taxes are driving firms’ decisions to repurchase, then the volume of stock repurchases should be highest just before a tax increase or after a decrease is implemented. Evidence of this effect implies that the volume of stock repurchases is inversely related to the relative capital gains tax rate. Prior to 1978, the highest capital gains tax rate was 35%. In 1978, the highest rate became 28% and was further reduced to 20% in 1981. During these time periods, the capital gains tax rate was lower than the income tax rate. However, in 1986, this differential was phased out and the highest capital gains tax rate became 28%. The current capital gains tax of 20% became effective in 1997. If taxes drive a firm’s decision to repurchase stock, stock repurchases should have surged in 1986 prior to the implementation of the tax changes and should have subsequently decreased until 1997. Further, repurchase activity should have peaked in the early 1980s when capital gains tax rates were only 20%. As illustrated in Figure 1 and Table 1, the volume of stock repurchases is low in the early 1980s, surges in 1984 and 1985, and declines in 1986. It remains at a historically high level in the late 1980s and increases in 1995 and 1996. It does not appear that these changes can be explained by the changes in the tax law.xviii Table 2 also details the mean TAKEOVER, which is equivalent to the percentage of sample firms that were subsequently the object of a takeover attempt or of a rumor of a potential takeover attempt. It shows that in four years during the mid-1980s, a significantly higher percentage of repurchasing firms are potential takeover targets than non-repurchasing firms, which indicates that the threat of a takeover may influence firms’ decisions to repurchase stock.xix Finally, the repurchasing firms’ use of stock options, OPTIONS, is not greater than that of non-repurchasers in most years for which data is available. 13",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 33,
    "chunk_index": 24,
    "word_count": 394,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "of repurchasing firms are potential takeover targets than non-repurchasing firms, which indicates that the threat of a takeover may influence firms’ decisions to repurchase stock.xix Finally, the repurchasing firms’ use of stock options, OPTIONS, is not greater than that of non-repurchasers in most years for which data is available. 13",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 33,
    "chunk_index": 25,
    "word_count": 50,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "In summary, the statistics presented in Table 2 indicate that repurchasing firms have greater excess capital and lower leverage than non-repurchasing firms and may be undervalued by investors. They are also more likely to be threatened by takeovers, particularly in the mid-1980s. They do not pay lower dividends, have less information asymmetry, or have lower stock returns in the years prior to the repurchase. Thus, these statistics support the excess capital, the optimal leverage, the undervaluation and the takeover deterrence hypotheses. Since the motives are not mutually exclusive and multiple motives are significant, it is possible that firms repurchase stock for several reasons. For example, a firm may wish to fend off an unwanted takeover attempt; however, it is only willing to repurchase stock if it has the excess capital to fund the repurchase and its leverage ratio is below its target. Alternatively, firms may repurchase to distribute excess capital buy only do so during periods when the company can take advantage of potential stock price undervaluation. Thus, it is not necessary to distinguish between hypotheses but it is more important to understand the set of hypotheses that explain firms’ motives. Because many of the hypotheses are related, it is difficult to discern which hypotheses influence the repurchase decision in a univariate setting. In the next section, I jointly test the hypotheses in multiple variable censored regressions. These results are presented in Section 4. 4 Results The results from estimating Tobit model (1) are presented in Table 3 and support the inferences drawn from the summary statistics. Firms repurchase stock when they are potentially undervalued, as evidenced by the negative and significant coefficient on MKBK. This result is not surprising given the popular press’ attention to this motive for repurchasing and the long run abnormal return experienced by many firms after a stock repurchase [Ikenberry, Lakonishok, and Vermaelen (1995)]. However, the result is unexpected since the coefficient on LNASST is positive and significant after 1984, indicating that large firms are more likely to repurchase stock. If size and information availability are positively correlated, then large firms are less likely to be misvalued. Thus, the conjunction of these two results illustrates that large firms may also be misvalued and use stock repurchases to take advantage of possible 14",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 33,
    "chunk_index": 26,
    "word_count": 377,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "large firms are more likely to repurchase stock. If size and information availability are positively correlated, then large firms are less likely to be misvalued. Thus, the conjunction of these two results illustrates that large firms may also be misvalued and use stock repurchases to take advantage of possible 14",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 33,
    "chunk_index": 27,
    "word_count": 50,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "undervaluation. Conversely, the coefficient on RETURN is seldom negative and significant. This result differs from Stephens and Weisbach (1998) who show that firms repurchase stock after a period of negative stock performance. However, Stephens and Weisbach track repurchases quarterly and look at the return in the quarter prior to the repurchase. The difference in the period used to measure return may explain the lack of significance of the coefficient on RETURN in this paper. Firms also repurchase stock to distribute excess capital, increase their net leverage, fend off takeover attempts, and counter the dilution effects of stock options. The results presented in Table 3 show that firms repurchase stock to distribute excess capital since the coefficients on either CASH or CASHFLOW are positive and significant in many of the sample years, controlling for investment opportunities. However, repurchasing firms do not have lower payout ratios, indicating that repurchases do not replace dividends and that the tax benefit of repurchases does not cause firms to repurchase stock. The relation between repurchasing and excess capital also impacts the firms’ net leverage ratio. I further investigate how leverage impacts the decision to repurchase by including LEVER in the analysis. If a firm’s net leverage ratio is lower than its target, then it may repurchase to increase leverage. The results in Table 3 indicate that firms repurchase to adjust leverage in every year after 1987. Firms also repurchase stock to fend off takeover attempts in many of the years that coincide with peak merger periods. During the mid- to late-1980s, the merger market was very active; thus, more firms were threatened by unwanted takeover attempts. The use of antitakeover measures grew during this time. Based on the results in Table 3, a greater percentage of firms repurchase stock to fend off takeovers during the mid- to late-1980s and some periods in the 1990s. The significance of the takeover motive during the peak merger periods illustrates how outside influences can impact the percentage of firms repurchasing stock. In the late 1980s and early 1990s, firms began using more stock options to compensate management. Perry and Zenner (1998) document a substantial increase in the use of manager stock options over the 1992 to 1997 period.xx The use of stock options may increase the percentage of firms that prefer repurchases to dividends since repurchases do 15",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 33,
    "chunk_index": 28,
    "word_count": 388,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "firms began using more stock options to compensate management. Perry and Zenner (1998) document a substantial increase in the use of manager stock options over the 1992 to 1997 period.xx The use of stock options may increase the percentage of firms that prefer repurchases to dividends since repurchases do 15",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 33,
    "chunk_index": 29,
    "word_count": 50,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "not dilute the per share value of the stock. The positive and significant coefficient on OPTION supports this conjecture.xxi These results show that repurchasing to take advantage of undervaluation is the most consistently significant motive for repurchasing stock over the sample period; however, it is only one of the significant motives for repurchasing. Thus, many factors influence the decision to repurchase stock. A firm may repurchase for only one of these reasons or it may repurchase only when multiple criteria are met. For instance, a firm may repurchase stock for any of the previously stated reasons but will choose to distribute when the stock price is more likely to be undervalued. In this case, the firm considers multiple motives before deciding to repurchases. Similar stories can be told with other hypotheses. The results presented in Table 3 illustrate the importance of examining several motives for repurchasing stock. Table 3 analyzes the statistical significance of these hypotheses. However, the coefficients of a Tobit model do not indicate the marginal effects of each variable and are therefore difficult to interpret. To examine the economic significance of each hypothesis, I transform each coefficient using the following formula: ( ) ∂E REP | X β'X  i i = βφ i  (2) ∂X  σ  i where β is the coefficient of X from model (1), σ is the standard deviation of REP, and φ is the standard normal cumulative density function.xxii These transformed coefficients allow for comparisons across years. The marginal effects are evaluated holding each variable constant at its median and can be interpreted in two ways. First, each variable affects the conditional mean of REP in the positive part of i the distribution, where firms repurchase stock, and second, each affects the probability that the observation will fall in that part of the distribution. The marginal effects of each variable are presented in Table 4. Comparing the marginal effects of each variable and considering the medians presented in 16",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 33,
    "chunk_index": 30,
    "word_count": 330,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "of i the distribution, where firms repurchase stock, and second, each affects the probability that the observation will fall in that part of the distribution. The marginal effects of each variable are presented in Table 4. Comparing the marginal effects of each variable and considering the medians presented in 16",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 33,
    "chunk_index": 31,
    "word_count": 50,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "Table 2, the market to book ratio, cashflow, size and use of options have the greatest economic impact on the decision to repurchase. Thus, changes in firms’ valuation, excess capital and compensation would result in large increases in the probability of a repurchase. The firm’s leverage relative to its target and the probability of a takeover attempt have minor effects on its decision to repurchase stock. So, though these motives influence the decision to repurchase, decreases in a firm’s leverage ratio relative to its target or increases in the probability of a takeover attempt have little effect on the probability of a stock repurchase. 5 Conclusion According to finance theory and previous empirical findings, the decision to repurchase stock may be related to distribution, investment, capital structure, corporate control, or compensation policies. Several papers investigate a subset of these hypotheses; however, no paper simultaneously analyzes all of the motives to repurchase stock. In this paper, I examine how each of these corporate policies impacts the decision to repurchase over the 1977 to 1996 period. I allow the significance of each motive to change over time since many motives may influence a larger percentage of firms in only certain time periods. I find that throughout the sample period firms repurchase stock to take advantage of potential undervaluation and in many periods to distribute excess capital. However, repurchases do not replace dividends. Firms also repurchase stock during certain periods to alter their leverage ratio, fend off takeovers, and counter the dilution effects of stock options. 17",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 33,
    "chunk_index": 32,
    "word_count": 254,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "the sample period firms repurchase stock to take advantage of potential undervaluation and in many periods to distribute excess capital. However, repurchases do not replace dividends. Firms also repurchase stock during certain periods to alter their leverage ratio, fend off takeovers, and counter the dilution effects of stock options. 17",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "Introduction",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 33,
    "chunk_index": 33,
    "word_count": 50,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Introduction (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "Asquith, Paul and Mullins, David. 1986. Signaling with dividends, stock repurchases, and equity issues. Financial Management (Autumn): 27-44. Bagwell, Laurie S. and Shoven, John B. 1988. Share repurchases and acquisitions: An analysis of which firms participate, In Alan J. Auerbach (ed.) Corporate Takeovers: Causes and Consequences. Chicago: University of Chicago Press. Bagwell, Laurie S. and Shoven, John B. 1989. Cash distributions to Shareholders. Journal of Economic Perspectives 3: 129-140 Bagwell, Laurie S. 1991. Share repurchase and takeover deterrence. RAND Journal of Economics 22: 72-88. Bagwell, Laurie S. 1992. Dutch auction repurchases: An analysis of shareholder heterogeneity. Journal of Finance 47: 71-105. Bajaj, Mukesh and Vijh, Anand. 1990. Dividend clienteles and the information content of dividend changes. Journal of Financial Economics 26: 193-219. Berger, Philip G., Ofek, Eli and Yermack, David L. 1996. Managerial entrenchment and capital structure. Journal of Finance 62: 1411-1438. Black, Fischer. 1993. Beta and Return. Journal of Portfolio Management 20: 8-11. Brennan, Michael J. and Thakor, Anjan V. 1990. Shareholder preferences and dividend policy. Journal of Finance 45: 992-1017. Brown, David T. and Ryngaert, Michael D. 1991. The determinants of tendering rates in interfirm and self-tender offers. Journal of Business 65: 529-556. Comment, Robert and Jarrell, Gregg A. 1991. The relative signaling power of dutch-auction and fixed- price self tender offers and open-market share repurchases. Journal of Finance 46: 1243-1271. Dann, Larry. 1981. Common stock repurchases: An analysis of returns to bondholders and stockholders. 19",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "References",
    "page_number": 20,
    "page_range": "p.20-21",
    "total_pages": 33,
    "chunk_index": 34,
    "word_count": 238,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.20-21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "self-tender offers. Journal of Business 65: 529-556. Comment, Robert and Jarrell, Gregg A. 1991. The relative signaling power of dutch-auction and fixed- price self tender offers and open-market share repurchases. Journal of Finance 46: 1243-1271. Dann, Larry. 1981. Common stock repurchases: An analysis of returns to bondholders and stockholders. 19 Journal of Financial Economics 9: 113-138. Dann, Larry, Masulis, Ronald and Mayers, David. 1991. Repurchase tender offers and earnings information. Journal of Accounting and Economics 14: 217-251. Denis, David, Denis, Diane and Sarin, Atulya. 1994. Information content of dividend changes: cash flow, signaling, overinvestment, and dividend clienteles. Journal of Financial and Quantitative Analysis 29: 567-587. Dunsby, Adam. 1994. Share repurchases, dividends, and corporate distribution policy. Wharton School Working Paper. Easterbrook, F. 1984. Two agency-cost explanations of dividends. American Economic Review 74: 650-659. Fama, Eugene F., and French, Kenneth R. 1992. The cross section of expected stock returns. Journal of Finance 47: 427-465. Fama, Eugene F., and French, Kenneth R. 1993. Common risk factors in the returns on stocks and Bonds. Journal of Financial Economics 33: 3-56. Fama, Eugene F., and French, Kenneth R. 1995. Size and book-to-market factors in earnings and Returns. Journal of Finance 50: 131-155. Fama, Eugene F., and French, Kenneth R. 1996. Multifactor explanations of asset pricing anomalies. Journal of Finance 51: 55-84. Fenn, George W. and Liang, Nellie. 1997. Good news and bad news about share repurchases. Board of Governors of the Federal Reserve Working Paper. Greene, William H. 1993. Econometric Analysis, New Jersey: Prentice Hall. Grullon, Gustavo. 1997. Share repurchase programs, signaling, and the agency cost of free cash flows. Cornell University Working Paper. Harris, Milton and Raviv, Artur. 1991. The theory of capital structure. Journal of Finance 46: 297-355. 20",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "References",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 33,
    "chunk_index": 35,
    "word_count": 286,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "Federal Reserve Working Paper. Greene, William H. 1993. Econometric Analysis, New Jersey: Prentice Hall. Grullon, Gustavo. 1997. Share repurchase programs, signaling, and the agency cost of free cash flows. Cornell University Working Paper. Harris, Milton and Raviv, Artur. 1991. The theory of capital structure. Journal of Finance 46: 297-355. 20 Haugen. 1995. The New Finance: The Case Against Efficient Markets, New Jersey: Prentice-Hall. Hertzel, Michael and Jain, Prem. 1991. Earnings and risk changes around stock repurchase tender offers. Journal of Accounting and Economics 14: 253-274. Hodrick, Laurie Simon. 1996. Does price elasticity affect corporate financial decision? Columbia University Working Paper. Ikenberry, David, Lakonishok, Josef and Vermaelen, Theo. 1995, Market underreaction to open market share repurchases. Journal of Financial Economics 39: 181-208. Ikenberry, David and Vermaelen, Theo. 1996. The option to repurchase stock. Financial Management 25: 9-24. Jensen, Michael C. 1986. Agency costs of free cash flow. The American Economic Review 76: 323- 329. Jolls, Christine. 1996. The role of compensation in explaining the stock-repurchase puzzle. Harvard Law School Working Paper. Kaplan, S. and Reishus, D. 1990. Outside directorships and corporate performance. Journal of Financial Economics 27: 389-410. Kothari, S. P., Shanken, Jay and Sloan, Richard. 1995. Another look at the cross section of expected returns. Journal of Finance 50: 185-224. Lakonishok, Josef, Shleifer, Andrei and Vishny, Robert. 1994. Contrarian investing, extrapolation and risk. Journal of Finance 49: 1541-1578. Lee, D. Scott, Mikkelson, Wayne H. and Partch, M. Megan. 1992. Managers’ trading around stock repurchases. Journal of Finance 47: 1947-1961. Lucas, Deborah J. and McDonald, Robert L. 1996. Shareholder heterogeneity, adverse selection, and payout policy. Northwestern University and NBER Working Paper. 21",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "References",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 33,
    "chunk_index": 36,
    "word_count": 271,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "and risk. Journal of Finance 49: 1541-1578. Lee, D. Scott, Mikkelson, Wayne H. and Partch, M. Megan. 1992. Managers’ trading around stock repurchases. Journal of Finance 47: 1947-1961. Lucas, Deborah J. and McDonald, Robert L. 1996. Shareholder heterogeneity, adverse selection, and payout policy. Northwestern University and NBER Working Paper. 21 Netter, Jeffry M. and Mitchell, Mark L. 1989. Stock-repurchase announcements and insider transactions after the October 1987 stock market crash. Financial Management 18: 84-96. Opler, Tim and Titman, Sheridan. 1996. The debt-equity choice: An analysis of issuing firms. Ohio State University Working Paper. Perry, Tod, and Zenner, Marc. 1998. Pay for performance: Government regulation and the structure of compensation contracts. University of North Carolina Working Paper. Stephens, Clifford P. and Weisbach,, Michael J. 1997. Is there still a dividend puzzle? The relative magnitude of open-market repurchases and dividends in the 1985-1996 period. University of Arizona Working Paper. Stephens, Clifford P. and Weisbach, Michael J. 1998. Actual share reacquisitions in open-market repurchase programs. Journal of Finance, forthcoming. Vermaelen, Theo. 1981. Common stock repurchases and market signaling: An empirical study. Journal of Financial Economics 9: 139-183. 22",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "References",
    "page_number": 23,
    "page_range": "p.23-24",
    "total_pages": 33,
    "chunk_index": 37,
    "word_count": 185,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.23-24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "repurchases and dividends in the 1985-1996 period. University of Arizona Working Paper. Stephens, Clifford P. and Weisbach, Michael J. 1998. Actual share reacquisitions in open-market repurchase programs. Journal of Finance, forthcoming. Vermaelen, Theo. 1981. Common stock repurchases and market signaling: An empirical study. Journal of Financial Economics 9: 139-183. 22 Table 1 Descriptive statistics of sample firms’ distributions over the 1977 - 1996 period Table 1 provides summary statistics of firms’ distributions and repurchasing activity for each sample year, t. Repurchases are measured using Compustat data item Purchase of Stock and are adjusted to remove any decreases in preferred stock. Once this adjustment is made, repurchases are truncated at 1% of market value of equity (i.e. a firm repurchasing less than 1% of its market value of equity is considered a non-repurchaser and its repurchases are set equal to zero). The last two columns of the table state summary statistics of the $ repurchased in year t divided by the market value of equity in year t-1 for only those firms that repurchase stock. All dollar amounts are presented in millions of dollars. The dollar amount of repurchases and dividends are CPI adjusted to 1993 dollars, except where used in ratios. % of Firms Total $ Total $ Repurchases / Mean $ Median $ Sample Year Number of Repurchasing Repurchases Dividends Total Repurchase / Repurchase / Firms Stock Distributions Mkt Value Mkt Value 1977 1,869 15% 6,042 50,189 11% 0.1 0.04 1978 1,957 16% 5,461 48,504 10% 0.08 0.03 1979 1,831 16% 5,732 43,622 12% 0.08 0.04 1980 1,964 15% 6,986 45,109 13% 0.07 0.03 1981 1,810 14% 4,415 42,485 9% 0.07 0.04 1982 1,721 16% 7,280 37,570 16% 0.09 0.03 1983 1,764 11% 6,882 35,571 16% 0.1 0.04 1984 1,637 17% 23,686 34,367 41% 0.07 0.04 1985 1,655 18% 27,872 32,852 46% 0.08 0.04 1986 1,631 17% 21,491 47,667 31% 0.08 0.04 1987 1,722 24% 30,089 41,170 42% 0.07 0.04 1988 2,478 23% 37,682 57,745 39% 0.08 0.04 1989 2,694 19% 38,526 57,468 40% 0.07 0.04 1990 2,765 22% 26,055 56,613 32% 0.05 0.03 1991 3,813 15% 14,585 54,620 21% 0.06 0.03 1992 2,843 14% 20,002 54,980 27% 0.05 0.03 1993 2,755 12% 23,827 54,837 30% 0.05 0.03 1994 2,863 14% 24,348 61,113 28% 0.04 0.03 1995 3,601 16% 54,233 81,401 40% 0.06 0.03 1996 3,570 20% 62,552 81,891 43% 0.05 0.03 24",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "References",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 33,
    "chunk_index": 38,
    "word_count": 394,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "0.03 1991 3,813 15% 14,585 54,620 21% 0.06 0.03 1992 2,843 14% 20,002 54,980 27% 0.05 0.03 1993 2,755 12% 23,827 54,837 30% 0.05 0.03 1994 2,863 14% 24,348 61,113 28% 0.04 0.03 1995 3,601 16% 54,233 81,401 40% 0.06 0.03 1996 3,570 20% 62,552 81,891 43% 0.05 0.03 24",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "References",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 33,
    "chunk_index": 39,
    "word_count": 50,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "Table 2 Summary statistics of variables of repurchasing and non-repurchasing firms Table 2 details the medians of lnASST, the log of total assets at t-1 in millions and CPI adjusted to 1993 dollars; CASHFLOW, income before taxes plus depreciation and changes in deferred charges divided by assets at t-1; CASH, cash and securities divided by assets; MKBK, the ratio of the market value of equity plus debt to book value of assets at t-1; RETURN, the one year, value-weighted, market-adjusted stock return from year end t- 2 to year end t-1; PAYOUT, cash dividends paid divided by net income before extraordinary items at t-1; and LEVER, the difference between a firm’s net debt (debt minus cash) to asset ratio and the median net debt to asset ratio of all firms with the same two digit SIC code at t-1 and the means of TAKEOVER, a dummy variable equal to one if a firm is the object of a takeover or a rumor of a takeover in year t-1 or t; OPTIONS, the number of shares reserved for stock options divided by the shares outstanding in year t-1. Panel A: Repurchasing firms Year CASH TAKE- FLOW CASH MKBK lnASST RETURN PAYOUT LEVER OVER OPTIONS 1977 0.10 0.08 *** 0.64 *** 4.51 *** 0.12 0.15 -0.04 1978 0.10 0.07 *** 0.64 *** 4.67 0.16 ** 0.19 -0.06 *** 1979 0.11 * 0.06 *** 0.64 *** 4.81 ** 0.03 0.19 -0.07 *** 1980 0.10 0.06 *** 0.65 *** 4.60 -0.03 0.17 -0.05 ** 1981 0.10 0.06 *** 0.67 *** 4.57 * -0.15 0.24 *** -0.04 ** 1982 0.10 *** 0.05 *** 0.68 *** 4.54 0.01 *** 0.16 *** -0.03 * 0.09 ** 1983 0.09 *** 0.06 0.76 ** 4.60 *** 0.05 *** 0.20 *** -0.03 0.10 *** 1984 0.10 *** 0.09 *** 0.91 *** 5.13 *** 0.06 0.18 *** -0.04 ** 0.07 1985 0.10 *** 0.09 *** 0.84 *** 4.61 *** -0.13 *** 0.13 *** -0.09 *** 0.08 *** 1986 0.09 *** 0.07 0.97 *** 4.83 *** 0.54 *** 0.10 ** -0.07 *** 0.10 *** 1987 0.09 *** 0.09 *** 1.02 5.13 *** -0.04 *** 0.18 *** -0.07 *** 0.07 1988 0.10 *** 0.08 ** 0.84 *** 4.98 *** -0.09 *** 0.00 *** -0.07 *** 0.09 1989 0.11 *** 0.07 * 0.94 * 5.07 *** -0.02 ** 0.08 *** -0.06 *** 0.11 0.08 1990 0.10 *** 0.08 *** 0.94 *** 5.05 *** -0.20 *** 0.09 *** -0.08 *** 0.08 ** 0.09 1991 0.09 *** 0.09 *** 0.77 *** 4.64 *** -0.14 *** 0.00 *** -0.11 *** 0.05 0.09 1992 0.09 *** 0.13 *** 1.00 4.77 *** -0.06 0.00 *** -0.11 *** 0.04 * 0.10 ** 1993 0.09 *** 0.10 *** 1.12 5.17 *** -0.05 0.00 *** -0.08 *** 0.04 0.10 1994 0.10 *** 0.15 1.17 5.53 *** 0.01 * 0.11 *** -0.07 ** 0.03 0.10 1995 0.11 *** 0.07 1.05 *** 5.25 *** -0.02 *** 0.06 *** -0.07 *** 0.05 0.10 1996 0.12 *** 0.07 1.20 5.51 *** -0.17 * 0.05 *** -0.05 *** 0.03 * 0.10 25",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "References",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 33,
    "chunk_index": 40,
    "word_count": 505,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "0.04 0.10 1994 0.10 *** 0.15 1.17 5.53 *** 0.01 * 0.11 *** -0.07 ** 0.03 0.10 1995 0.11 *** 0.07 1.05 *** 5.25 *** -0.02 *** 0.06 *** -0.07 *** 0.05 0.10 1996 0.12 *** 0.07 1.20 5.51 *** -0.17 * 0.05 *** -0.05 *** 0.03 * 0.10 25",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "References",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 33,
    "chunk_index": 41,
    "word_count": 50,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "Table 2 (cont.) Summary statistics of variables of repurchasing and non-repurchasing firms Panel B: Non-repurchasing firms Year CASH TAKE- FLOW CASH MKBK lnASST RETURN PAYOUT LEVER OVER OPTIONS 1977 0.10 0.06 *** 0.73 *** 5.01 *** 0.08 0.16 -0.02 1978 0.10 0.05 *** 0.70 *** 4.71 0.12 ** 0.17 -0.01 *** 1979 0.10 * 0.05 *** 0.71 *** 4.56 ** 0.01 0.15 -0.01 *** 1980 0.10 0.05 *** 0.77 *** 4.49 0.00 0.14 -0.02 ** 1981 0.10 0.05 *** 0.87 *** 4.40 * -0.10 0.12 *** -0.01 ** 1982 0.09 *** 0.05 *** 0.84 *** 4.20 -0.06 *** 0.02 *** -0.01 * 0.06 ** 1983 0.07 *** 0.06 0.93 ** 3.95 *** -0.07 *** 0.00 *** -0.03 0.05 *** 1984 0.07 *** 0.06 *** 1.06 *** 3.91 *** 0.02 0.00 *** -0.01 ** 0.07 1985 0.07 *** 0.05 *** 0.96 *** 3.76 *** -0.24 *** 0.00 *** -0.02 *** 0.04 *** 1986 0.05 *** 0.06 1.05 *** 3.67 *** 0.42 *** 0.00 ** -0.03 *** 0.04 *** 1987 0.04 *** 0.06 *** 1.04 3.59 *** -0.18 *** 0.00 *** -0.02 *** 0.07 1988 0.05 *** 0.07 ** 0.92 *** 3.73 *** -0.19 *** 0.00 *** -0.01 *** 0.08 1989 0.06 *** 0.06 * 0.98 * 3.86 *** -0.05 ** 0.00 *** -0.02 *** 0.11 0.08 1990 0.05 *** 0.06 * 1.00 * 3.80 *** -0.25 ** 0.00 *** 0.00 *** 0.11 ** 0.08 1991 0.06 *** 0.05 *** 0.85 *** 4.08 *** -0.20 *** 0.00 *** 0.00 *** 0.07 0.09 1992 0.05 *** 0.06 *** 0.98 4.09 *** -0.09 0.00 *** 0.00 *** 0.06 * 0.09 ** 1993 0.06 *** 0.07 *** 1.10 4.26 *** -0.01 0.00 *** 0.00 *** 0.05 0.10 1994 0.08 *** 0.08 1.19 4.44 *** -0.01 * 0.00 *** -0.04 ** 0.04 0.10 1995 0.09 *** 0.07 1.12 *** 4.44 *** -0.07 *** 0.00 *** -0.03 *** 0.04 0.11 1996 0.09 *** 0.07 1.19 4.52 *** -0.19 * 0.00 *** -0.03 *** 0.04 * 0.11 ***, **, and * indicate that the repurchasers and non-repurchasers come from significantly different populations at the 1%, 5%, and 10% levels, respectively, using the Wilcoxon Rank-Sum test. 26",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "References",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 33,
    "chunk_index": 42,
    "word_count": 358,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "*** -0.03 *** 0.04 0.11 1996 0.09 *** 0.07 1.19 4.52 *** -0.19 * 0.00 *** -0.03 *** 0.04 * 0.11 ***, **, and * indicate that the repurchasers and non-repurchasers come from significantly different populations at the 1%, 5%, and 10% levels, respectively, using the Wilcoxon Rank-Sum test. 26",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "References",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 33,
    "chunk_index": 43,
    "word_count": 50,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "Table 3 Tobit model results of stock repurchases on variables testing alternative hypotheses Table 3 presents the results of tobit model (1) in which the dollar volume of stock repurchases at time t divided by the firm’s market value of equity at time t-1 is the dependent variable. All variable definitions are provided in the description of Table 1. P-values are in parentheses. Year CASH CASH MKBK PAYOUT lnASST RETURN LEVER TAKE- OPTIONS Intercept # Obs Psuedo R2 FLOW OVER 1977 0.04 0.27 -0.06 0.03 -0.03 0.00 0.04 -0.12 1,868 0.05 (0.77) (0.04) (0.00) (0.12) (0.00) (0.92) (0.56) (0.00) 1978 0.18 0.32 -0.09 -0.02 0.00 0.02 0.02 -0.16 1,955 0.06 (0.08) (0.00) (0.00) (0.26) (0.72) (0.19) (0.69) (0.00) 1979 0.51 0.23 -0.16 -0.06 0.00 -0.01 0.00 -0.14 1,824 0.12 (0.00) (0.02) (0.00) (0.02) (0.54) (0.42) (0.94) (0.00) 1980 0.10 0.32 -0.10 -0.01 0.00 0.01 0.05 -0.12 1,962 0.09 (0.22) (0.00) (0.00) (0.46) (0.28) (0.49) (0.23) (0.00) 1981 0.07 0.04 -0.06 0.00 0.00 0.01 -0.03 -0.11 1,806 0.1 (0.42) (0.62) (0.00) (0.99) (0.47) (0.28) (0.48) (0.00) 1982 0.05 0.16 -0.09 -0.01 0.00 0.06 0.06 0.08 -0.34 1,720 0.03 (0.68) (0.38) (0.00) (0.57) (0.72) (0.06) (0.50) (0.13) (0.00) 1983 0.09 0.07 -0.04 0.00 0.01 0.05 0.00 0.12 -0.36 1,756 0.07 (0.35) (0.58) (0.00) (0.53) (0.02) (0.00) (0.96) (0.00) (0.00) 1984 0.02 0.11 -0.01 0.00 0.02 0.00 0.00 0.01 -0.23 1,631 0.14 (0.66) (0.04) (0.01) (0.70) (0.00) (0.72) (0.94) (0.57) (0.00) 1985 0.09 0.21 -0.04 -0.01 0.02 0.02 0.00 0.10 -0.25 1,653 0.13 (0.07) (0.00) (0.00) (0.36) (0.00) (0.28) (0.97) (0.00) (0.00) 1986 0.01 -0.03 -0.03 0.00 0.02 0.02 -0.06 0.06 -0.30 1,622 0.08 (0.80) (0.74) (0.00) (0.47) (0.00) (0.16) (0.20) (0.10) (0.00) 1987 -0.01 0.06 -0.02 0.00 0.02 0.02 -0.05 0.05 -0.18 1,715 0.27 (0.41) (0.15) (0.00) (0.97) (0.00) (0.13) (0.03) (0.01) (0.00) 1988 0.24 0.08 -0.03 0.00 0.02 -0.01 -0.05 0.02 -0.20 2,467 0.18 (0.00) (0.07) (0.00) (0.57) (0.00) (0.45) (0.06) (0.19) (0.00) 1989 0.20 0.01 -0.03 0.00 0.02 -0.01 -0.08 0.01 0.07 -0.22 2,367 0.2 (0.00) (0.88) (0.00) (0.34) (0.00) (0.44) (0.01) (0.69) (0.03) (0.00) 1990 0.19 0.00 -0.02 0.00 0.01 -0.02 -0.07 0.00 0.07 -0.14 2,429 0.37 (0.00) (0.94) (0.00) (0.10) (0.00) (0.01) (0.00) (0.93) (0.00) (0.00) 1991 0.11 0.03 -0.02 0.00 0.01 -0.02 -0.08 -0.01 0.00 -0.17 2,452 0.12 (0.00) (0.36) (0.00) (0.35) (0.00) (0.11) (0.00) (0.57) (0.68) (0.00) 1992 0.20 0.07 -0.02 0.00 0.01 0.00 -0.05 0.01 0.05 -0.16 2,471 0.22 (0.00) (0.03) (0.00) (0.14) (0.00) (0.51) (0.01) (0.74) (0.01) (0.00) 1993 0.15 0.03 -0.01 0.00 0.01 -0.01 -0.05 0.05 0.08 -0.24 2,377 0.12 (0.00) (0.52) (0.10) (0.61) (0.00) (0.11) (0.03) (0.03) (0.01) (0.00) 1994 0.16 0.00 -0.01 0.00 0.02 0.00 -0.07 0.02 -0.01 -0.22 2,379 0.18 (0.00) (0.96) (0.08) (0.69) (0.00) (0.48) (0.00) (0.33) (0.39) (0.00) 1995 0.26 -0.11 -0.02 0.00 0.02 -0.02 -0.17 0.05 0.00 -0.35 3,016 0.13 (0.00) (0.05) (0.01) (0.42) (0.00) (0.25) (0.00) (0.09) (0.40) (0.00) 1996 0.31 0.05 -0.02 0.00 0.03 -0.02 -0.09 -0.04 0.01 -0.36 2,983 0.16 (0.00) (0.29) (0.00) (0.88) (0.00) (0.04) (0.00) (0.20) (0.29) (0.00) 27",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "References",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 33,
    "chunk_index": 44,
    "word_count": 507,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "(0.33) (0.39) (0.00) 1995 0.26 -0.11 -0.02 0.00 0.02 -0.02 -0.17 0.05 0.00 -0.35 3,016 0.13 (0.00) (0.05) (0.01) (0.42) (0.00) (0.25) (0.00) (0.09) (0.40) (0.00) 1996 0.31 0.05 -0.02 0.00 0.03 -0.02 -0.09 -0.04 0.01 -0.36 2,983 0.16 (0.00) (0.29) (0.00) (0.88) (0.00) (0.04) (0.00) (0.20) (0.29) (0.00) 27 Table 4 Marginal Effects of Tobit Model 1 Table 4 presents the marginal effects of the coefficients presented in Table 3. Coefficients that are statistically significant in Table 3 are presented in bold in this table. Year CASH CASH MKBK PAYOUT lnASST RETURN LEVER TAKE- OPTIONS FLOW OVER 1977 0.02 0.16 -0.02 0.01 0.00 0.00 0.02 1978 0.12 0.20 -0.01 -0.01 0.00 0.01 0.01 1979 0.42 0.13 0.00 -0.03 0.00 -0.01 0.00 1980 0.06 0.20 -0.01 0.00 0.00 0.00 0.03 1981 0.04 0.02 -0.01 0.00 0.00 0.01 -0.01 1982 0.03 0.08 -0.02 0.00 0.00 0.03 0.03 0.04 1983 0.05 0.04 -0.01 0.00 0.01 0.02 0.00 0.06 1984 0.01 0.07 0.00 0.00 0.02 0.00 0.00 0.01 1985 0.05 0.12 -0.01 -0.01 0.02 0.01 0.00 0.05 1986 0.01 -0.01 -0.01 0.00 0.02 0.01 -0.03 0.03 1987 -0.01 0.03 -0.01 0.00 0.02 0.01 -0.03 0.02 1988 0.15 0.04 -0.01 0.00 0.01 0.00 -0.02 0.01 1989 0.12 0.00 -0.01 0.00 0.02 0.00 -0.04 0.00 0.04 1990 0.12 0.00 -0.01 0.00 0.01 -0.01 -0.04 0.00 0.04 1991 0.07 0.02 -0.01 0.00 0.01 -0.01 -0.04 -0.01 0.00 1992 0.12 0.04 -0.01 0.00 0.01 0.00 -0.03 0.00 0.03 1993 0.09 0.01 0.00 0.00 0.01 -0.01 -0.03 0.02 0.04 1994 0.10 0.00 0.00 0.00 0.01 0.00 -0.03 0.01 0.00 1995 0.16 -0.05 -0.01 0.00 0.02 -0.01 -0.09 0.02 0.00 1996 0.18 0.03 -0.01 0.00 0.02 -0.01 -0.05 -0.02 0.00 28",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "References",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 33,
    "chunk_index": 45,
    "word_count": 282,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "0.12 0.04 -0.01 0.00 0.01 0.00 -0.03 0.00 0.03 1993 0.09 0.01 0.00 0.00 0.01 -0.01 -0.03 0.02 0.04 1994 0.10 0.00 0.00 0.00 0.01 0.00 -0.03 0.01 0.00 1995 0.16 -0.05 -0.01 0.00 0.02 -0.01 -0.09 0.02 0.00 1996 0.18 0.03 -0.01 0.00 0.02 -0.01 -0.05 -0.02 0.00 28 Figure 1 Dollar Volume of Distributions Divided by the Number of Sample Firms 35.00 30.00 25.00 20.00 15.00 10.00 5.00 - 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 Year 29 smriF # / $ Repurchases / # firms Dividends / # firms Figure 2 Percentage of Firms Repurchasing Stock in each Size Quintile (as defined by Total Assets) 30 7791 9791 1891 3891 5891 7891 9891 1991 3991 5991 45.00% 40.00% 35.00% 30.00% 25.00% Quintile 1 (smallest) % of Firms 20.00% Quintile 2 15.00% Quintile 3 10.00% Quintile 4 5.00% Quintile 5 (largest) 0.00% Quintile 5 (largest) Quintile 3 Year Quintile 1 (smallest)",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "References",
    "page_number": 29,
    "page_range": "p.29-31",
    "total_pages": 33,
    "chunk_index": 46,
    "word_count": 166,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.29-31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "(as defined by Total Assets) 30 7791 9791 1891 3891 5891 7891 9891 1991 3991 5991 45.00% 40.00% 35.00% 30.00% 25.00% Quintile 1 (smallest) % of Firms 20.00% Quintile 2 15.00% Quintile 3 10.00% Quintile 4 5.00% Quintile 5 (largest) 0.00% Quintile 5 (largest) Quintile 3 Year Quintile 1 (smallest) * This paper was previously entitled Stock Repurchase Waves. I would like to thank David T. Brown, Jennifer Conrad, Douglas Diamond (the editor), Robert Dittmar, Laura Field, Stewart Myers, Tod Perry, Manju Puri, Henri Servaes, Anil Shivdasani, Deon Strickland, Sheridan Titman, Sunil Wahal, Marc Zenner, and anonymous referee, participants at the University of North Carolina at Chapel Hill Finance Seminar, participants at the 1996 Financial Management Association Conference, and participants at the 1998 American Finance Association Conference for helpful comments and suggestions. i I examine actual repurchase activity rather than announcements of repurchase programs since Stephens and Weisbach (1997) document that changes in the announcements of repurchases do not always coincide with changes in actual repurchases. They show that on average firms repurchase between 74% and 82% of the shares announced as repurchase targets in open market repurchases. ii Brennan and Thakor (1990) and Lucas and McDonald (1996) present models in which repurchases are preferred to dividends for larger distributions. iii Ikenberry and Vermaelen (1995) model the option to repurchase and Stephens and Weisbach (1998) show that firms utilize the flexibility of an open-market repurchase program and often do not repurchase all approved shares. iv See Asquith and Mullins (1986), Comment and Jarrell (1991), Dann, Masulis, and Mayers (1991), Hertzel and Jain (1991), and Lee, Mikkelson, and Partch (1992) for evidence of the information content of stock repurchases. v See Harris and Raviv (1991) for a review of capital structure literature. vi Since options do not entitle managers to dividends, managers holding a large number of options may prefer a stock repurchase to a dividend. vii In the 1987 analysis, I also include CRASH, the 1-day, value-weighted market adjusted return on October 19, 1987, to control for firms that repurchase stock in response to the stock market crash. In the six weeks following the crash, more than twice the number of firms that announced stock repurchases between January 1987 and just prior to the crash announced stock repurchases [Netter and Mitchell (1989)]. The coefficient on this variable is insignificant and its inclusion does not qualitatively change the results. viii I examine the correlation of all variables and estimate univariate as well as other multiple variable specifications of the above models. These results are not presented; however, the results in the following section are robust to these alternative specifications. 31",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "References",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 33,
    "chunk_index": 47,
    "word_count": 439,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "and its inclusion does not qualitatively change the results. viii I examine the correlation of all variables and estimate univariate as well as other multiple variable specifications of the above models. These results are not presented; however, the results in the following section are robust to these alternative specifications. 31",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "References",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 33,
    "chunk_index": 48,
    "word_count": 50,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "ix This measure of repurchases is used in Bagwell and Shoven (1989), Dunsby (1994), Berger, Ofek, and Yermack (1996) and Opler and Titman (1996). x Some studies, such as Bagwell and Shoven (1988), use 0.5% of market value as a benchmark. All analyses presented in this paper are robust to reducing the benchmark to this level or to imposing no screen. xi There are four methods a firm may use to repurchase stock. In a fixed-price tender offer or a dutch auction tender offer, firms announce a stock repurchase and buy shares directly from shareholders. In an open market repurchase, the dominant means of repurchasing stock, firms approve a repurchase program, which provides the opportunity to repurchase stock over a specified time and buy shares on the open market. A fourth method used less frequently is to privately negotiate and repurchase stock from one or a few shareholders. This method is most often used during a threat of a takeover to repurchase stock from a possible bidder. I repeat all tests in this paper for the 1985 to 1996 period setting a firm’s repurchases equal to zero if it announces a privately negotiated repurchase in year t. The results presented in this paper are unchanged, which indicate that these unique repurchases are not driving the results. xii I further test this hypothesis by examining changes in dividends paid and ownership by taxable institutions. The inclusion of these variables provides no additional support for this hypothesis. xiii I also examine firms’ information asymmetry with the number of analysts following the stock. I do not include this variable here since the data on number of analysts following a stock is only available for less than one-half of the sample. The results presented in this paper are qualitatively unchanged if the number of analysts is used to proxy information asymmetry. xiv All results are unchanged if the equal-weighted market index is used rather than the value weighted index. xv It is still an open question why low market to book stocks outperform high market to book stocks. Lakonishok, Shleifer, and Vishny (1994) indicate that the abnormal performance may be due to undervaluation. However, Fama and French (1992, 1993, 1995, 1996) indicate that market to book may proxy for a risk factor and therefore the abnormal performance is due to mis-estimation of expected return. Alternatively, Black (1993) explains that market to book appears to affect returns because of chance data snooping. Kothari, Shanken, and Sloan (1995) illustrate that the market to book effect may be due to data selection biases. xvi The results are unchanged if a three digit SIC code is used rather than a two digit code. 32",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "References",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 33,
    "chunk_index": 49,
    "word_count": 446,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "to book appears to affect returns because of chance data snooping. Kothari, Shanken, and Sloan (1995) illustrate that the market to book effect may be due to data selection biases. xvi The results are unchanged if a three digit SIC code is used rather than a two digit code. 32",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "References",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 33,
    "chunk_index": 50,
    "word_count": 50,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "xvii One factor that may increase the use of stock repurchases after 1982 is the adoption of regulation 10b-18. Regulation 10b-18 clarifies the potential legal costs of a stock repurchase by defining guidelines a firm must follow to not violate the anti-manipulative provisions. After the adoption of this regulation, it is possible that firms may increase their stock repurchase activity since the threat of legal liability is reduced. Thus, this regulatory change may cause the increase in the use of repurchases in 1984. However, this regulation cannot explain the decrease in repurchase activity in the early 1990s or the increase in repurchase activity in the mid-1990s. xviii The new capital gains tax rate of 20% became effective as of May 15, 1997. Thus, if firms whose fiscal year ends at the end of May or in June repurchased stock in 1996, then it is possible that these repurchases are motivated by the tax decrease. However, it is unlikely that the few number of firms for which this applies are driving the increase in repurchase volume in 1996. xix Due to the increased merger activity in the 1980s, it is possible that the fluctuation in the number of firms repurchasing stock is driven solely by the increased threat of takeover. To investigate this possibility, I remove all firms from the sample that were the object of a takeover attempt or a rumor of a takeover attempt and re-examine the data presented in Table 2 and Table 3. The results are unchanged. Both the volume of stock repurchases and the percentage of firms repurchasing stock increase in the mid-1980s, decline in the early 1990s, and rise in the mid- 1990s. Additionally, repurchasing firms are still significantly larger than non-repurchasing firms in the later years of the sample. All results presented in this paper hold if these firms are removed from the sample. xx Perry and Zenner (1998) do not examine the periods earlier than 1992 due to data availability. The increased use of incentive compensation in the late-1980 and early-1990s led the SEC to increase disclosure requirements of the details of management compensation in 1992. xxi Stock options may also be related to repurchases because when managers exercise options, the company may receive the exercise money. This may increase the firm’s excess capital and alter the leverage ratio if investment opportunities are limited. Thus, the firm may repurchase to distribute the excess funds and to prevent changes in its leverage ratio. xxii The calculation for this transformation is from Green (1990) pp. 694-696. 33",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "References",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 33,
    "chunk_index": 51,
    "word_count": 422,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  },
  {
    "text": "exercise money. This may increase the firm’s excess capital and alter the leverage ratio if investment opportunities are limited. Thus, the firm may repurchase to distribute the excess funds and to prevent changes in its leverage ratio. xxii The calculation for this transformation is from Green (1990) pp. 694-696. 33",
    "title": "Table 1",
    "source_type": "pdf",
    "document_id": "4aa27f52d334",
    "source_file": "Why do firms repurchase stock .pdf",
    "section": "References",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 33,
    "chunk_index": 52,
    "word_count": 50,
    "author": "Authorized Gateway Customer",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20000503131105",
    "duration": null
  }
]